{"artist":{"name":"Drexel","mbid":"c118502c-e6ce-40a7-b4e1-1a1a5bb3fb19","url":"https://www.last.fm/music/Drexel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/be9309ebc572a2e8f83d4a60fe1bb9dc.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/be9309ebc572a2e8f83d4a60fe1bb9dc.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/be9309ebc572a2e8f83d4a60fe1bb9dc.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/be9309ebc572a2e8f83d4a60fe1bb9dc.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/be9309ebc572a2e8f83d4a60fe1bb9dc.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/be9309ebc572a2e8f83d4a60fe1bb9dc.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"6642","playcount":"53826"},"similar":{"artist":[{"name":"One Cool Guy","url":"https://www.last.fm/music/One+Cool+Guy","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f2e0129e4a8e4b39bda5eff377ef6cf4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f2e0129e4a8e4b39bda5eff377ef6cf4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f2e0129e4a8e4b39bda5eff377ef6cf4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2e0129e4a8e4b39bda5eff377ef6cf4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2e0129e4a8e4b39bda5eff377ef6cf4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2e0129e4a8e4b39bda5eff377ef6cf4.png","size":""}]},{"name":"High School Football Heroes","url":"https://www.last.fm/music/High+School+Football+Heroes","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/df5b0f1c32de4281b6db31be4003d6fd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/df5b0f1c32de4281b6db31be4003d6fd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/df5b0f1c32de4281b6db31be4003d6fd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df5b0f1c32de4281b6db31be4003d6fd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df5b0f1c32de4281b6db31be4003d6fd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df5b0f1c32de4281b6db31be4003d6fd.png","size":""}]},{"name":"The Fad","url":"https://www.last.fm/music/The+Fad","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7447d05a0fdf4fd093679627c8bdbf89.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7447d05a0fdf4fd093679627c8bdbf89.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7447d05a0fdf4fd093679627c8bdbf89.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7447d05a0fdf4fd093679627c8bdbf89.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7447d05a0fdf4fd093679627c8bdbf89.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7447d05a0fdf4fd093679627c8bdbf89.png","size":""}]},{"name":"Infamous Jake & The Pinstripe Mafia","url":"https://www.last.fm/music/Infamous+Jake+&+The+Pinstripe+Mafia","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c241a82942bd40c78cd7cfff6de40ea6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c241a82942bd40c78cd7cfff6de40ea6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c241a82942bd40c78cd7cfff6de40ea6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c241a82942bd40c78cd7cfff6de40ea6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c241a82942bd40c78cd7cfff6de40ea6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c241a82942bd40c78cd7cfff6de40ea6.png","size":""}]},{"name":"I Voted For Kodos","url":"https://www.last.fm/music/I+Voted+For+Kodos","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/29a2ea57b0a946288377479d45192787.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/29a2ea57b0a946288377479d45192787.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/29a2ea57b0a946288377479d45192787.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29a2ea57b0a946288377479d45192787.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29a2ea57b0a946288377479d45192787.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29a2ea57b0a946288377479d45192787.png","size":""}]}]},"tags":{"tag":[{"name":"punk","url":"https://www.last.fm/tag/punk"},{"name":"ska","url":"https://www.last.fm/tag/ska"},{"name":"punk rock","url":"https://www.last.fm/tag/punk+rock"},{"name":"ska-punk","url":"https://www.last.fm/tag/ska-punk"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Drexel/+wiki"}},"published":"29 Dec 2006, 18:00","summary":"DREXEL does consist of members of other bands, however we cannot say which bands. DREXEL formed in the city of BOSTON. It was the winter of 1996. The four friends came together out of boredom: “It was more a joke or a reason to hangout, or rather, to just fuck about”. -Pearson Woodbury It was here that DREXEL wrote their first batch of ten songs. Most of these ten PUNK songs were recorded by their friend, Jon Lammi, in different studios all over BOSTON when he could find the time--usually around 4 or 5 in the morning. <a href=\"https://www.last.fm/music/Drexel\">Read more on Last.fm</a>","content":"DREXEL does consist of members of other bands, however we cannot say which bands. DREXEL formed in the city of BOSTON. It was the winter of 1996. The four friends came together out of boredom: “It was more a joke or a reason to hangout, or rather, to just fuck about”. -Pearson Woodbury It was here that DREXEL wrote their first batch of ten songs. Most of these ten PUNK songs were recorded by their friend, Jon Lammi, in different studios all over BOSTON when he could find the time--usually around 4 or 5 in the morning. The others, however, were recorded by any other person that was bored on a Monday, Tuesday, Wednesday, Thursday… really, whatever night Lammi was busy. Later, the collection of songs were put out on a on a split full-length album called Shot By Lammi on FORK IN HAND records. At the end of he year, the four boys lived, wrote and recorded in a town just a spit outside of BOSTON called ALLSTON. The address of this shit-brown lean-to is 51 Gardner. Jeff Highway was jobless. He mostly spent his time on the porch of 51, drinking beer on his ‘Allston Throne’ (a dirty, bed bug-ridden recliner left there by previous tenants) writing songs for DREXEL’s next record, No On Told Me. CREEK JOHNSON worked at the local package store, loading kegs of beer and dinging up the store’s VAN 3 delivery truck. PEARSON WOODBURY was taking summer classes and painting the house he grew up in for his father. MICHAEL NILE shipped packages of a non-alcoholic nature at a retail store and often visited CREEK at work after his own shift. It was in the roach-infested basement on Gardner Street that DREXEL wrote No One Told Me. This was also released on FORK IN HAND records. The band toured and toured, yet had to come home, get jobs and start the new record, Whatever Whenever. At this point CREEK and MICHAEL had moved into a new place in the Back Bay, JEFF lived in a basement apartment around the corner, and PEARSON about a ten minute walk away. Because the boys were such close friends, the distance between their apartments was filled with rumor and hearsay. One night after a show at The Linwood and a day before tour, PEARSON decided to end the bad energy in the band by throwing fists at CREEK and JEFF. The immature message was made and then left to be handled by the other members. Luckily for him the boys gave him a get-out-of-jail free card. With life demanding more and more hours of work to make more money to survive the increasing price of living, AND with the introductions of different girlfriends, DREXEL began to have their troubles. The problem with the four boys had always been their closeness. Being the best of best friends, it would always hurt when the boys were not able to hangout together on a regular basis, like they had in the past. There was “weird air” between them that would often make for an argument. However, with CREEK’s slow Texas demeanor, he would often calm the fight down, reminding everyone they were all still ‘buddies’. Unfortunately, it could not help MICHAEL. After one show’s argument of CREEK being a “dick”, MICHAEL was through. Was it because the two had gotten so close from living together for so many years, that the “bad air” had been harder for the two of them to swallow? More so than for JEFF and PEARSON? …I think so. New houses, new friends, new record. It was at this time when DREXEL found its sound--loosely named PANIC ROCK--that The Inevitable Is Available was being crafted. Even though the days of hanging out together as brothers were few and far between, the three members of DREXEL managed to stay close. It was the music. The band was all on the “same page”. Each member was proud of and challenged by the new sounds being presented at each rehearsal. It was around this time CREEK and PEARSON’s famous love-hate relationship began, and the band only saw each other at rehearsal or at shows. It was not because of any ill feelings, it was, according to longtime friend and confidant MURPH, “Their friends didn’t hangout with his friends, and his friends didn’t drink where his friends did.” The Inevitable Is Available was recorded and received with a lot of critical acclaim. CREEK, JEFF, PEARSON and a PHANTOM BUDDY on bass produced this new approach to their music. The band played on and continued crafting they’re new PANIC ROCK style. The other bands CREEK and PEARSON were in began to tour more and more. Did CREEK foresee the end of DREXEL? Maybe, but for whatever reason he nonetheless named the new and last DREXEL record, What Went Wrong. The band was at its most distant as friends, but the respect and love of the band’s music was at its highest. SANCHEZ, PEARSON’s roommate and close, close buddy, replaced MICHAEL on bass and brought the band back together again--close friends, once more. Everything was as it had been: DREXEL was four friends making music they loved. Rehearsal would always have a 30 pack ready, and afterwards the boys would go out and talk about the night’s progress on What Went Wrong. The record was finished and properly recorded--for the first time. It was DREXEL’s best. What Went Wrong was well-received. Things were good. BUT, because of the time CREEK and PEARSON’s other bands were demanding, CREEK felt it was time to end the much-maligned DREXEL. SANCHEZ was more then bummed, JEFF dealt, and PEARSON tried to change CREEK’s mind. But CREEK felt DREXEL should bow out nobly, rather than fizzle away. So, DREXEL had they’re last show at T.T. And The Bears - Sept. 25th .\n\nwww.myspace.com/drexel <a href=\"https://www.last.fm/music/Drexel\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
