{"artist":{"name":"Dusminguet","mbid":"783b9eec-e8d2-48b7-b41f-ba1a1d3e155f","url":"https://www.last.fm/music/Dusminguet","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ecaf5caa988240b0b89a2d4d9dccbaf7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ecaf5caa988240b0b89a2d4d9dccbaf7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ecaf5caa988240b0b89a2d4d9dccbaf7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ecaf5caa988240b0b89a2d4d9dccbaf7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ecaf5caa988240b0b89a2d4d9dccbaf7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ecaf5caa988240b0b89a2d4d9dccbaf7.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"59603","playcount":"406967"},"similar":{"artist":[{"name":"La Troba Kung-Fú","url":"https://www.last.fm/music/La+Troba+Kung-F%C3%BA","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c4c6ab97a98747c9b2e2964bf2ed8e32.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c4c6ab97a98747c9b2e2964bf2ed8e32.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c4c6ab97a98747c9b2e2964bf2ed8e32.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4c6ab97a98747c9b2e2964bf2ed8e32.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4c6ab97a98747c9b2e2964bf2ed8e32.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4c6ab97a98747c9b2e2964bf2ed8e32.png","size":""}]},{"name":"Cheb Balowski","url":"https://www.last.fm/music/Cheb+Balowski","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e2ef0336c9604783b88b62e57b6fb7d6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e2ef0336c9604783b88b62e57b6fb7d6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e2ef0336c9604783b88b62e57b6fb7d6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e2ef0336c9604783b88b62e57b6fb7d6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e2ef0336c9604783b88b62e57b6fb7d6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e2ef0336c9604783b88b62e57b6fb7d6.png","size":""}]},{"name":"La Kinky Beat","url":"https://www.last.fm/music/La+Kinky+Beat","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f1c7f37f540d49dfaa331545aff92c29.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f1c7f37f540d49dfaa331545aff92c29.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f1c7f37f540d49dfaa331545aff92c29.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f1c7f37f540d49dfaa331545aff92c29.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f1c7f37f540d49dfaa331545aff92c29.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f1c7f37f540d49dfaa331545aff92c29.png","size":""}]},{"name":"Fermin Muguruza","url":"https://www.last.fm/music/Fermin+Muguruza","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9300613343a0445499bdfebb9826ab96.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9300613343a0445499bdfebb9826ab96.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9300613343a0445499bdfebb9826ab96.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9300613343a0445499bdfebb9826ab96.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9300613343a0445499bdfebb9826ab96.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9300613343a0445499bdfebb9826ab96.png","size":""}]},{"name":"Go Lem System","url":"https://www.last.fm/music/Go+Lem+System","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/947ddcac59504955812db8d21210f01f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/947ddcac59504955812db8d21210f01f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/947ddcac59504955812db8d21210f01f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/947ddcac59504955812db8d21210f01f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/947ddcac59504955812db8d21210f01f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/947ddcac59504955812db8d21210f01f.png","size":""}]}]},"tags":{"tag":[{"name":"patchanka","url":"https://www.last.fm/tag/patchanka"},{"name":"mestizo","url":"https://www.last.fm/tag/mestizo"},{"name":"catalan","url":"https://www.last.fm/tag/catalan"},{"name":"latin","url":"https://www.last.fm/tag/latin"},{"name":"ska","url":"https://www.last.fm/tag/ska"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Dusminguet/+wiki"}},"published":"03 Jun 2006, 19:33","summary":"From Radiochango:\n\nMixing world music and folk tunes, Dusminguet's influences are only limited by their own travels and findings. The introduction to travelling by Mustapha el Hafer in the first song of Postrof with the contribution of two musicians from Rif (Abdul Gandur and Ali Chrsitin) perfectly represents what this band is: an open travelogue. \n\nDusminguet was formed in 1995 in Catalonia in the multiracial pueblo of La Garriga. Joan Garriga (accordion and voice) <a href=\"https://www.last.fm/music/Dusminguet\">Read more on Last.fm</a>","content":"From Radiochango:\n\nMixing world music and folk tunes, Dusminguet's influences are only limited by their own travels and findings. The introduction to travelling by Mustapha el Hafer in the first song of Postrof with the contribution of two musicians from Rif (Abdul Gandur and Ali Chrsitin) perfectly represents what this band is: an open travelogue. \n\nDusminguet was formed in 1995 in Catalonia in the multiracial pueblo of La Garriga. Joan Garriga (accordion and voice), Dani Portabella (guitar and voice) and Marti Vilardebo (drums and voice) began to mix the rhythms and sounds that turned them on : mainly rumba and cumbia, but also reggae, rif, ska, merengue, havaneras, funk...\n\nSince 1995, the band has been emerging little by little, showing a wide repertoire. Initially conceived as a Catalan trio, the band was to take on board contributions and experiments with other musicians as Carlos Rivolta (bass) and Oscar Dominguez (drums, voice) join the group. Tomas, a former Mano Negra keyboard-player, going through a crisis after the breakup of the band in Madrid found in the La Garriga pueblo and in this beginner's band a warm environment and a promising project, which led him to join them at once. For the Spanish public, however, the take-off of this Catalan band was to take place when the Chewaka label (belonging to Virgin records) was interested in the band from La Garriga.\n\nIn 1998 they released their first album, with the mysterious title of Vafalungo, which they presented in the much internationalized MIDEM at Cannes. It is important to highlight the significant role that the Mestizo Promo house and its mentor Javier Zarco played in the band's career. This had always been an energetic center for them, on the professional, musical and personal level. However, as usual, it is on the road and from pueblo to pueblo that they will show their talents.\n\nThe band was to find in the Catalan patchanga, a rhythm closely related to the cumbia and to the rumba the natural vehicle to speak their minds in song. It was the most multifaceted and agile rhythm to play in the pueblo fiestas. Their idea was to form a band capable of playing a little of everything and making people dance. More than 800 concerts demonstrate the stage hunger of the band. They play at as many pueblo fiestas as they possibly can. Very few Spanish bands have been on so many different stages all around the country.\n\nThey go on to play with Macaco in the Méditerranéennes festival at Céret (which had welcomed Sergent Garcia y Zebda the year before), attracting the attention the public and of the critics. In April, 2001 they organize a 17-concert tour to France. Several Latin American tours as well as long trips to Rumania, Greece and Morocco give the band the opportunity to widen the range of musical influences in their work. Now, in the end of 2002, they are on tour around Catalonia realizing a dream they have had for quite a while and awakening from a nightmare that struck them not long ago.\n\nThis tour is also a way to gather strength and trust after the terrible tragedy that happened to them in Guadalajara. Carlos Rivolta, the band's bass player and \"eldest brother\" was electrocuted in April, 2002, during a presentation at the Mexican town. It was a tragic accident that deeply moved the band as well as all their friends and relatives. A tribute to Carlos took place on the September, 11th 2002 with the presence of more than 30 bands and DJ . The 12-hour concert on the Rambla of the Barcelona Raval was a much longed for farewell to \"Rivaldo del Amor\". On that day, many wounds were healed. Dusminguet had the opportunity of meeting the public again and found them eager to hear the band play. I, like everybody else, got gooseflesh as they played \"Qu'est-ce que t'as fait à mon ami? Qu'est-ce que t'as fait, il ne peut pas mourrir\"...\n\nThe friendship ties between Dusminguet and the \"porteños\" from Macaco as well as the brazuca (Catalan Brazilian) Wagner Pa was evident on this day. Nobody wanted to be absent to this musical farewell to the band's galactic bass player. This friendship is stressed by several contributions in particular to Dusminguet's second album Postrof, recorded in Morocco and mixed in New York with Mad Professor. The title Postrof, just like the title of the first album and the band's name, is the product of their lavish imagination and - just like their music - it seems to remind us of something, though it is difficult to pin it down. \n\nJoan told us that the idea for the names originated in a graffiti which he had seen as a young man in La Garriga, and which disappeared with the passing of time. What was left in his memory was \"Vafalungo Postrof, Go\". This story is part of Dusminguet's imaginary world of La Garriga, the cozy, warm and mysterious pueblo where the first three members of the group live. Joan, Marti y Dani, all three from La Garriga, are the heart of the group. They write the lyrics and the music for almost all the songs. The last expected release from this trilogy is Go, which will probably be out by the end of February, 2003. In contrast to the second album, which is very rich in contributions and in which the band tried to express all their musical influences and affinities as well as to all their obsessions (it should have beer a double album, but Virgin refused and they had to leave out 6 songs) this third - and eagerly expected - album is said to be more intimate in conception.\n\nThe members of the band join Amparanoia, Manu Chao, Jarabe de Palo, Peret, Wagner Pa, Macaco to defend immigrants without documents in the La Merced fiesta (Fiesta day in Barcelona) in the Raval's low income neighborhoods or during the secret apperances of Sound System para la Realidad, whose aim is to raise funds for the zapatista march from Chiapas to Mexico. \n\nTheir view of the similarities between their work and that of related artists is the following: \"With people like Manu Chao, Amparanoïa or Macaco, we have done quite a lot of things and we share similar points of view. When it comes to mixing sounds, we take our inspiration from different sources and strive to break barriers, but the works of each one of us are very different.\"\n\nLike Manu Chao and Macaco, the band is finishing their contract with a major label. This album marks the end of a trilogy - the fading of the old graffiti on the pueblo walls. But Dusminguet's sound will be present in the fiestas of several pueblos. They will probably draw their inspiration from other graffiti, maybe record with a different label, but they will still be the same band with the same fiesta spirit, pursuing the dream of living for art. \n\nSomething we forgot to mention, because it did not make sense in the artistic description of the band: as human beings, they are also great!\n <a href=\"https://www.last.fm/music/Dusminguet\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
