{"artist":{"name":"Eazy-E","url":"https://www.last.fm/music/Eazy-E","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/429d3338c6914838ac161bd5cbe33502.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/429d3338c6914838ac161bd5cbe33502.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/429d3338c6914838ac161bd5cbe33502.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/429d3338c6914838ac161bd5cbe33502.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/429d3338c6914838ac161bd5cbe33502.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/429d3338c6914838ac161bd5cbe33502.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"614629","playcount":"4817921"},"similar":{"artist":[{"name":"N.W.A","url":"https://www.last.fm/music/N.W.A","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/73a54c3474614b8ca7a0961ce9e2727b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/73a54c3474614b8ca7a0961ce9e2727b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/73a54c3474614b8ca7a0961ce9e2727b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/73a54c3474614b8ca7a0961ce9e2727b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/73a54c3474614b8ca7a0961ce9e2727b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/73a54c3474614b8ca7a0961ce9e2727b.png","size":""}]},{"name":"MC Ren","url":"https://www.last.fm/music/MC+Ren","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e120bf8e251d40c485ec0cd33015c847.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e120bf8e251d40c485ec0cd33015c847.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e120bf8e251d40c485ec0cd33015c847.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e120bf8e251d40c485ec0cd33015c847.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e120bf8e251d40c485ec0cd33015c847.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e120bf8e251d40c485ec0cd33015c847.png","size":""}]},{"name":"Ice Cube","url":"https://www.last.fm/music/Ice+Cube","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9a4ed90eec0946ca8f8160acad7b481b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9a4ed90eec0946ca8f8160acad7b481b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9a4ed90eec0946ca8f8160acad7b481b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9a4ed90eec0946ca8f8160acad7b481b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9a4ed90eec0946ca8f8160acad7b481b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9a4ed90eec0946ca8f8160acad7b481b.png","size":""}]},{"name":"Mack 10","url":"https://www.last.fm/music/Mack+10","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ba3927334ea94fb5bd79d0771b4f9c8d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ba3927334ea94fb5bd79d0771b4f9c8d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ba3927334ea94fb5bd79d0771b4f9c8d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba3927334ea94fb5bd79d0771b4f9c8d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba3927334ea94fb5bd79d0771b4f9c8d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba3927334ea94fb5bd79d0771b4f9c8d.png","size":""}]},{"name":"Westside Connection","url":"https://www.last.fm/music/Westside+Connection","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7c395ab96d7f494dbc7b44ac33ef9f5c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7c395ab96d7f494dbc7b44ac33ef9f5c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7c395ab96d7f494dbc7b44ac33ef9f5c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c395ab96d7f494dbc7b44ac33ef9f5c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c395ab96d7f494dbc7b44ac33ef9f5c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c395ab96d7f494dbc7b44ac33ef9f5c.png","size":""}]}]},"tags":{"tag":[{"name":"rap","url":"https://www.last.fm/tag/rap"},{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"Gangsta Rap","url":"https://www.last.fm/tag/Gangsta+Rap"},{"name":"west coast","url":"https://www.last.fm/tag/west+coast"},{"name":"hip hop","url":"https://www.last.fm/tag/hip+hop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Eazy-E/+wiki"}},"published":"11 Feb 2006, 14:25","summary":"Eric Lynn Wright (born September 7, 1963; died March 26, 1995), better known by his stage name Eazy-E, was an American rapper, producer, and record executive from Compton, California. He is widely regarded as one of the pioneers of gangsta rap, who initially rose to fame as the founder of the rap group N.W.A. Eazy-E's style was marked by his youthful, high-pitched voice and his lyrics focusing on elements of urban street life, such as: The procurement and use of firearms <a href=\"https://www.last.fm/music/Eazy-E\">Read more on Last.fm</a>","content":"Eric Lynn Wright (born September 7, 1963; died March 26, 1995), better known by his stage name Eazy-E, was an American rapper, producer, and record executive from Compton, California. He is widely regarded as one of the pioneers of gangsta rap, who initially rose to fame as the founder of the rap group N.W.A. Eazy-E's style was marked by his youthful, high-pitched voice and his lyrics focusing on elements of urban street life, such as: The procurement and use of firearms, the distribution, acquirement & ingestion of illegal narcotics, frequent engagements in enthusiastically unconventional sexual acts and the relationship between members of the local police force and inhabitants of his neighborhood. His son, Lil Eazy-E, is also a rapper.\n\nIn 1995, Eazy-E was admitted into Cedars Sinai Medical Center in Los Angeles with what he believed to be bronchitis. Instead he was diagnosed with AIDS, and soon announced his illness publicly. He died shortly after, on March 26, 1995, at approximately 6:35 PM (Pacific time). He was 31 years old when he died. Eazy's death from AIDS was probably due to his history of unprotected sex with female fans. During the week of March 20, Eazy-E drafted his last message to fans. One week after making that announcement, Eazy succumbed to the disease.\n\nEazy-E's last words:\n\t\"I may not seem like a guy you would pick to preach a sermon. But I feel it is now time to testify because I do have folks who care about me hearing all kinds of stuff about what's up.\" \"Yeah, I was a brother on the streets of Compton doing a lot of things most people look down on -- but it did pay off. Then we started rapping about real stuff that shook up the LAPD and the FBI. But we got our message across big time, and everyone in America started paying attention to the boys in the 'hood.\" \"Soon our anger and hope got everyone riled up. There were great rewards for me personally, like fancy cars, gorgeous women and good living. Like real non-stop excitement. I'm not religious, but wrong or right, that's me.\" \"I'm not saying this because I'm looking for a soft cushion wherever I'm heading, I just feel that I've got thousands and thousands of young fans that have to learn about what's real when it comes to AIDS. Like the others before me, I would like to turn my own problem into something good that will reach out to all my homeboys and their kin. Because I want to save their asses before it's too late.\"\n\n\"I'm not looking to blame anyone except myself. I have learned in the last week that this thing is real, and it doesn't discriminate. It affects everyone. My girl Tomika and I have been together for four years and we recently got married. She's good, she's kind and a wonderful mother. We have a little boy who's a year old. Before Tomika I had other women. I have seven children by six different mothers. Maybe success was too good to me. I love all my kids and always took care of them.\" \"Now I'm in the biggest fight of my life, and it ain't easy. But I want to say much love to those who have been down to me. And thanks for your support.\" Just remember : \"It's YOUR real time and YOUR real life\"\n\nSome of his closest friends have stated that these words were not all written by Eazy-E because they were adjusted by his lawyer for the press conference.  This is probably due to the fact that Eazy-E used profanity in his statement.\n\nSome believe that before his death, Eazy had made amends with Ice Cube and Dr. Dre (although others believe that only D.J. Yella saw Eazy while he was in hospital). Dre believes that their history together overshadowed the feud. Four years later, Dr. Dre publicly discussed the death of Eazy in the song \"What's the Difference\" from Chronic 2001 with his lyrics, \"Eazy, I'm still wit' you. Fuck the beef, nigga I miss you. And, that's just bein real with you.\" Ice Cube later paid tribute to him on the song \"Growing Up\", off his comeback album Laugh Now, Cry Later.\n\nWright's body was laid to rest at Rose Hills Memorial Park in Whittier, California.\n\nThe son of Richard and Kathie Wright, dropped out of high school in the tenth grade and supported himself by selling drugs, later receiving a high school equivalency diploma. He used the profits from his drug sales to establish Ruthless Records. When Ruthless signees Dr. Dre and Ice Cube wrote \"Boyz-n-the-Hood\", Ahmed Saaoud and Eazy E formed the group N.W.A with Dr. Dre and Ice Cube. Later, DJ Yella and Arabian Prince were added.\n\nIn this period, Ruthless Records released the compilation N.W.A and the Posse (1987), N.W.A's proper debut Straight Outta Compton (1988), and one month later, Eazy-E's solo album, Eazy-Duz-It. The album sold two million copies, certifying it as a double platinum album, and spawned the hit singles \"We Want Eazy\" and \"Eazy-Er Said Than Dunn\" (a remix of \"Boyz-n-the-Hood\" was also included). The album was produced by Dr. Dre and DJ Yella and largely written by Ice Cube, with contributions from MC Ren and The D.O.C..\n\nOn the final N.W.A album, Niggaz4Life (1991), some of the lyrics provoked outrage from many liberals and conservatives alike. Eazy-E included pistols and shotguns in videos for both \"Alwayz into Somethin'\" and \"Appetite for Destruction\".\n\nDisputes about money caused the group to break up. It was thought that Eazy-E and Jerry Heller were stealing money from the group. Ice Cube is believed to have left N.W.A for this reason, which he later referenced in his diss song, \"No Vaseline\". Subsequently, Eazy-E and Dr. Dre started feuding - a feud that grew to embroil most of Ruthless Records and Dr. Dre's new label, Death Row Records with Merrill. Eazy-E released It's On (Dr. Dre) 187um Killa and a posthumous album Str8 off tha Streetz of Muthaphukkin Compton which both went multi-platinum.\n\n\nTwo posthumous albums were released, Eternal E in 1995, and Str8 off tha Streetz of Muthaphukkin Compton in 1995. Both releases proved to be successful. Following Eazy's death, his record label was taken over by his wife, Tomica Wright. It is currently a division of Epic Records. Ruthless Records has also found considerable success with Above the Law, MC Ren, B.G. Knocc Out & Dresta and Bone Thugs-N-Harmony, among others. The last group has dedicated a few of its songs to Eazy, mainly their 1997 Grammy Award winning single \"Tha Crossroads\" and also their performance at the 1996 MTV Video Music Awards.\n\nEazy's oldest son, Lil Eazy-E, released a documentary about his father entitled The Life and Times of Eric Wright. Another documentary called Impact of a Legend was produced and sold along with the CD of the same name. Lil' Eazy also plans to release his own rap album named 'Prince of Compton' in honor of his father, working with Bone Thugs and some of Eazy-E's old N.W.A. cohorts. He also has a 16 year old son named Jerrick Hardesty who currently resides in Louisiana.\n\nThe track \"Still Cruisin'\" has appeared on several mix tapes including G-Unit Radio Part 8. \"How We Do (Remix)\" is another rare track featuring Eazy, 50 Cent, and Tupac. The Game often mentions Eazy-E in his songs, most notably on his album The Documentary and even has a tattoo of him on his right arm.\n\nIn 2001, post-grunge band Dynamite Hack released \"Boyz-N-The-Hood\", a cover of the 1986 original written by Ice Cube and performed by Eazy-E. Eazy is also mentioned in the songs \"Pass Me By\", \"The Staleness\", and \"Terrible\" by Insane Clown Posse. Rapper South Park Mexican has released a song called \"Boyz On Da Cut\" which is a Houston, TX version of Eazy-E's \"Boyz-N-The-Hood\".\n\nBefore Eazy-E died, he was scheduled to make music with artists such as Guns N' Roses, Tupac Shakur, Scarface, Dirty Red, Brotha Lynch Hung, Kid Frost and Bizzy Bone[citation needed]. The character of Lance \"Ryder\" Wilson in Grand Theft Auto: San Andreas was inspired by Eazy-E, and modeled on him. Two unreleased tracks from Eazy-E will also be featured on Mastermynd's debut album Oraculum. <a href=\"https://www.last.fm/music/Eazy-E\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
