{"artist":{"name":"Eddie Cantor","mbid":"0e04e04c-bdfe-4a0e-a311-a2190bd6d72c","url":"https://www.last.fm/music/Eddie+Cantor","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d3345454b41f4df6be52182a469ee9ad.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d3345454b41f4df6be52182a469ee9ad.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d3345454b41f4df6be52182a469ee9ad.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d3345454b41f4df6be52182a469ee9ad.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d3345454b41f4df6be52182a469ee9ad.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d3345454b41f4df6be52182a469ee9ad.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"32850","playcount":"116306"},"similar":{"artist":[{"name":"Marion Harris","url":"https://www.last.fm/music/Marion+Harris","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/61ea1217b5144b0785642508eea9d98e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/61ea1217b5144b0785642508eea9d98e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/61ea1217b5144b0785642508eea9d98e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/61ea1217b5144b0785642508eea9d98e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/61ea1217b5144b0785642508eea9d98e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/61ea1217b5144b0785642508eea9d98e.png","size":""}]},{"name":"Sophie Tucker","url":"https://www.last.fm/music/Sophie+Tucker","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2094b68681694b30afbef97c21fad5db.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2094b68681694b30afbef97c21fad5db.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2094b68681694b30afbef97c21fad5db.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2094b68681694b30afbef97c21fad5db.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2094b68681694b30afbef97c21fad5db.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2094b68681694b30afbef97c21fad5db.png","size":""}]},{"name":"Helen Kane","url":"https://www.last.fm/music/Helen+Kane","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/227d4adcd0bc4547ac4504aee4eebd7f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/227d4adcd0bc4547ac4504aee4eebd7f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/227d4adcd0bc4547ac4504aee4eebd7f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/227d4adcd0bc4547ac4504aee4eebd7f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/227d4adcd0bc4547ac4504aee4eebd7f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/227d4adcd0bc4547ac4504aee4eebd7f.png","size":""}]},{"name":"Paul Whiteman & His Orchestra","url":"https://www.last.fm/music/Paul+Whiteman+&+His+Orchestra","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ba699f9bafd44047c02348e3be68aec2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ba699f9bafd44047c02348e3be68aec2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ba699f9bafd44047c02348e3be68aec2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba699f9bafd44047c02348e3be68aec2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba699f9bafd44047c02348e3be68aec2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba699f9bafd44047c02348e3be68aec2.png","size":""}]},{"name":"Lee Morse","url":"https://www.last.fm/music/Lee+Morse","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/eee579570ff742969b528c4255ceb8ab.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/eee579570ff742969b528c4255ceb8ab.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/eee579570ff742969b528c4255ceb8ab.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eee579570ff742969b528c4255ceb8ab.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eee579570ff742969b528c4255ceb8ab.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eee579570ff742969b528c4255ceb8ab.png","size":""}]}]},"tags":{"tag":[{"name":"swing","url":"https://www.last.fm/tag/swing"},{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"1920s","url":"https://www.last.fm/tag/1920s"},{"name":"music hall","url":"https://www.last.fm/tag/music+hall"},{"name":"Big Band","url":"https://www.last.fm/tag/Big+Band"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Eddie+Cantor/+wiki"}},"published":"07 May 2007, 05:55","summary":"Eddie Cantor (January 31, 1892 - October 10, 1964) was an American comedian, singer, actor, songwriter. Known to Broadway, radio and early television audiences as Banjo Eyes, this \"Apostle of Pep\" was regarded almost as a family member by millions because his top-rated radio shows revealed intimate stories and amusing antics about his wife Ida and five children.\n\nEarly life\n\nCantor was born as Isidore Itzkowitz[1] in New York City, the son of Russian Jewish immigrants, Meta and Mechel Itzkowitz. <a href=\"https://www.last.fm/music/Eddie+Cantor\">Read more on Last.fm</a>","content":"Eddie Cantor (January 31, 1892 - October 10, 1964) was an American comedian, singer, actor, songwriter. Known to Broadway, radio and early television audiences as Banjo Eyes, this \"Apostle of Pep\" was regarded almost as a family member by millions because his top-rated radio shows revealed intimate stories and amusing antics about his wife Ida and five children.\n\nEarly life\n\nCantor was born as Isidore Itzkowitz[1] in New York City, the son of Russian Jewish immigrants, Meta and Mechel Itzkowitz. His mother died of lung cancer two years after his birth, and he was abandoned by his father, left to be raised by his grandmother, Esther Kantrowitz. A misunderstanding when signing her grandson for school gave him her last name of Kantrowitz (later Americanized to \"Cantor\") instead of Itzkowitz. He adopted the first name Eddie when he met his future wife, Ida Tobias, in 1903, because she liked the idea of having a boyfriend named Eddie. The two married in 1914 and remained together until Ida died in 1962.\n\nBy his early teens. Cantor began winning talent contests at local theaters and started appearing on stage. One of his earliest paying jobs was doubling as a waiter and performer, singing for tips at Carey Walsh's Coney Island saloon where a young Jimmy Durante accompanied him on piano.\n\nIn 1907, Cantor became a billed name in vaudeville. In 1912 he was the only performer over the age of 20 to appear in Gus Edwards' Kid Kabaret, where he created his first blackface character, Jefferson. Critical praise from that show got the attention of Broadway's top producer, Florenz Ziegfeld, who gave Cantor a spot in the Ziegfeld rooftop post-show, Midnight Frolic (1916).\n\nBroadway and recordings\n\nA year later, Cantor made his Broadway debut in the Ziegfeld Follies of 1917. He continued in the Ziegfeld Follies until 1927, a period considered the best years of the long-standing revue. For several years Cantor co-starred in an act with pioneer African-American comedian Bert Williams, both appearing in blackface; Cantor played Williams's son. Other co-stars with Cantor during his time in the Follies included Will Rogers, Marilyn Miller and W.C. Fields. He moved on to stardom in book musicals, starting with Kid Boots (1923), Whoopee! (1928) and Banjo Eyes (1940).\n\nCantor began making phonograph records in 1917, recording both comedy songs and routines and popular songs of the day, first for Victor, then for Aeoleon-Vocalion, Pathé and Emerson. From 1921 through 1925 he had an exclusive contract with Columbia Records, returning to Victor for the remainder of the decade.\n\nCantor was one of the era's most successful entertainers, but the 1929 stock market crash took away his multi-millionaire status and left him deeply in debt. However, Cantor's relentless attention to his own earnings in order to avoid the poverty he knew growing up caused him to search quickly for more work, quickly building a new bank account with his highly popular, bestselling book of humor and cartoons about his experience, Caught Short! A Saga of Wailing Wall Street in \"1929 A.C. (After Crash)\".\n\nFilms\n\nCantor also bounced back in movies and on radio. Cantor had previously appeared in a number of short films and two features (Special Delivery and Kid Boots) in the 1920s, but he became a leading Hollywood star in 1930 with the film version of Whoopee!. Over the next two decades, he continued making films until 1948, including Roman Scandals (1933), Ali Baba Goes to Town (1937) and If You Knew Susie (1948).\n\nRadio\n\nCantor's initial radio appearance was with Rudy Vallee's The Fleischmann's Yeast Hour on February 5, 1931, and it led to a four-week tryout with NBC's The Chase and Sanborn Hour. Replacing Maurice Chevalier, who was returning to Paris, Cantor joined The Chase and Sanborn Hour on September 13, 1931. This hour-long Sunday evening variety series teamed Cantor with announcer Jimmy Wallingford and violinist Dave Rubinoff. The show established Cantor as a leading comedian, and his scriptwriter, David Freedman, as “the Captain of Comedy.” Soon, Cantor became the world's highest paid radio star. His shows began with a crowd chanting, \"We want Cantor - We want Cantor,\" a phrase said to have originated when a vaudeville audience chanted to chase off an opening act on the bill before Cantor. Cantor's theme song was the 1903 pop tune \"Ida, Sweet as Apple Cider,\" dedicated to his wife.\n\nIndicative of his impact on the mass audience, he agreed in November 1934 to introduce a new song by the songwriters J. Fred Coots and Haven Gillespie that other well-known artists had rejected as being \"silly\" and \"childish.\" The song, \"Santa Claus Is Coming to Town\", immediately had orders for 100,000 copies of sheet music the next day. It sold 400,000 copies by Christmas of that year.\n\nIn the 1940s his NBC national radio show was Time To Smile. In addition to film and radio, Cantor recorded for Hit of the Week Records, then again for Columbia, for Banner and Decca and various small labels.\n\nHe was a founder of the March of Dimes, and did much to publicize the battle against polio. Cantor also served as first president of the Screen Actors Guild. His heavy political involvement began early in his career, including his quick rush to strike with Actors Equity in 1919, against the advisement of father figure and producer, Florenz Ziegfeld.\n\nCantor's career declined somewhat in the late 1930s due to his public denunciations of Adolf Hitler and Fascism. Wishing to distance themselves from any political controversy, many sponsors dropped Cantor's shows. However, it soon bounced back with the United States' entry into World War II.\n\nTelevision\n\nIn the 1950s he was one of the alternating hosts of the television show The Colgate Comedy Hour, in which he would introduce variety acts and play comic characters like \"Maxie the Taxi.\" However, the show landed Cantor in an unlikely controversy when a young Sammy Davis, Jr. appeared as a guest performer. Cantor embraced Davis and mopped Davis's brow with his handkerchief after his performance. Worried sponsors led NBC to threaten cancellation of the show; other sources claim that NBC threatened to cancel the show when Davis was booked for two weeks straight. Cantor's response to the controversy was to book Davis for the rest of the season.\n\nBooks\n\nIn addition to Caught Short!, Cantor wrote or co-wrote at least seven other books, including booklets released by the then-fledgling firm of Simon & Schuster, with Cantor’s name on the cover. Some were \"as told to\" or written with David Freedman). Customers paid a dollar and received the booklet with a penny embedded in the hardcover. They sold well, and H. L. Mencken (1880-1956) asserted that these books did more to pull America out of the Great Depression than all government measures combined.\n\nTributes\n\nCantor was profiled on the popular program This Is Your Life, in which an unsuspecting person (usually a celebrity) would be surprised on live television with a half-hour tribute. Cantor was the only subject who was told of the surprise in advance; he was recovering from a heart attack and it was felt that the shock might harm him.\n\nIn 1953 Warner Brothers, in an attempt to duplicate the box-office success of The Jolson Story, filmed a big-budget Technicolor feature film, The Eddie Cantor Story. The film found an audience, but might have done better with someone else in the leading role. Actor Keefe Brasselle played Cantor as a caricature, with high-pressure dialogue and bulging eyes wide open at all times; the fact that Brasselle was considerably taller than Cantor didn't lend realism, either. Eddie and Ida Cantor were seen in a brief prologue and epilogue set in a projection room, where they are watching Brasselle in action; at the end of the film Eddie tells Ida, \"I never looked better in my life\" ... and gives the audience a knowing, incredulous look!\n\nSomething closer to the real Eddie Cantor story is his self-produced 1944 feature Show Business, a valentine to vaudeville and show folks that was RKO's top-grossing film that year. Probably the best summary of Cantor's career is in one of the Colgate Comedy Hour shows. The Colgate hour was a virtual video autobiography, with Cantor recounting his career, singing his familiar hits, and re-creating his singing-waiter days with his old pal Jimmy Durante (Jimmy's wearing a lavish toupee!). This show has been issued on DVD as Eddie Cantor in Person.\n\nFamily\n\nEddie and Ida Cantor had five children: Marilyn, Marjorie, Natalie, Edna and Janet. Cantor's daughter, Janet Gari is a songwriter who has collaborated with Toby Garson, the daughter of composer Harry Ruby, on children's shows and off-Broadway revues. Cantor’s autobiographies, My Life is in Your Hands (with David Freedman) and Take My Life (with Jane Kesner Ardmore) were republished in 2000, thanks to the dedicated efforts of Cantor’s grandson, musician Brian Gari.\n\nOn October 10, 1964 in Beverly Hills, California, Eddie Cantor suffered another heart attack and died. He is buried in Hillside Memorial Park Cemetery. Cantor was awarded an honorary Academy Award the year of his death.\n\nFilmography\n\n    * Widow at the Races (1913)\n    * A Few Moments with Eddie Cantor (1923) (DeForest Phonofilm short with sound)\n    * Kid Boots (1926)\n    * Special Delivery (1927)\n    * A Ziegfeld Midnight Frolic (1929) (short)\n    * Glorifying the American Girl (1929)\n    * That Party in Person (1928) (short)\n    * Insurance (1930) (short)\n    * Getting a Ticket (1930) (short)\n    * Whoopee! (1930)\n    * Palmy Days (1931)\n    * Talking Screen Snapshots (1932) (short)\n    * The Kid from Spain (1932)\n    * Roman Scandals (1933)\n    * The Hollywood Gad-About (1934) (short)\n    * Kid Millions (1934)\n    * Strike Me Pink (1936)\n    * Ali Baba Goes to Town (1937)\n    * The March of Time Volume IV, Issue 5 (1937) (short)\n    * Forty Little Mothers (1940)\n    * Thank Your Lucky Stars (1943)\n    * Show Business (1944) (also producer)\n    * Hollywood Canteen (1944)\n    * Screen Snapshots: Radio Shows (1945) (short)\n    * American Creed (1946) (short)\n    * Meet Mr. Mischief (1947) (short) (appears on poster)\n    * If You Knew Susie (1948)\n    * Screen Snapshots: Hollywood's Happy Homes (1949) (short)\n    * The Story of Will Rogers (1952)\n    * Screen Snapshots: Memorial to Al Jolson (1952) (short)\n    * The Eddie Cantor Story (1953) (Cameo)\n\nBroadway\n\n    * Ziegfeld Follies of 1917 (1917) - revue - performer\n    * Ziegfeld Follies of 1918 (1918) - revue - performer, co-composer and co-lyricist for \"Broadway's Not a Bad Place After All\" with Harry Ruby\n    * Ziegfeld Follies of 1919 (1919) - revue - performer, lyricist for \"(Oh! She's the) Last Rose of Summer\"\n    * Ziegfeld Follies of 1920 (1920) - revue - composer for \"Green River\", composer and lyricist for \"Every Blossom I See Reminds Me of You\" and \"I Found a Baby on My Door Step\"\n    * The Midnight Rounders of 1920 (1920) - revue - performer\n    * Broadway Brevities of 1920 (1920) - revue - performer\n    * Make It Snappy (1922) - revue - performer, co-bookwriter\n    * Ziegfeld Follies of 1923 (1923) - revue - sketch-writer\n    * Kid Boots (1923) - musical - actor in the role of \"Kid Boots\" (the caddie master)\n    * Ziegfeld Follies of 1927 (1927) - revue - performer, co-bookwriter\n    * Whoopee! (1928) - musical - actor in the role of \"Henry Williams\"\n    * Eddie Cantor at the Palace (1931) - solo performance\n    * Banjo Eyes (1941) - musical - actor in the role of \"Erwin Trowbridge\"\n    * Nellie Bly (1946) - musical - co-producer\n\nReference\n\nGoldman, Herbert G. (1997). Banjo Eyes: Eddie Cantor and the Birth of Modern Stardom. New York: Oxford University Press. \n\nListen to\n\n    * The Chase and Sanborn Hour with Eddie Cantor (excerpts)\n    * Free OTR: The Eddie Cantor Show (30 1936-52 episodes)\n    * OTR Network Library: The Eddie Cantor Show (11 1936-52 episodes)\n    * Eddie Cantor on the Radio (four 1937-48 episodes)\n    * A few moments with Eddie Cantor A 6-minute Phonfilm from 1923 featuring Eddie Cantor telling monologues and singing two songs.\n\nQuote\n\n\"Do you know why Henry Ford so dislikes the Jewish people? They can get more for a secondhand Ford than he can for a NEW one!\" (A Ziegfeld Midnight Frolic, 1929)\n\nNotes\n\n   1. ^ http://www.musicals101.com/who2.htm\n\nExternal links\n\nEddie Cantor at the Internet Movie Database:\nhttp://www.imdb.com/name/nm0134662/\nEddie Cantor official site:\nhttp://www.eddiecantor.com/\nJerry Haendiges Vintage Radio Logs: The Eddie Cantor Show:\nhttp://www.otrsite.com/logs/loge1005.htm\nBroadway Cafe Society.com The Entertainers: Eddie Cantor:\nhttp://www.broadwaycafesociety.com/entarc0307.htm\n <a href=\"https://www.last.fm/music/Eddie+Cantor\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
