{"artist":{"name":"Eddy Arnold","mbid":"1c4c789d-06af-42ef-b86c-7d6bf49c652c","url":"https://www.last.fm/music/Eddy+Arnold","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/422343039ca0484c8a3431c48fdb9f63.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/422343039ca0484c8a3431c48fdb9f63.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/422343039ca0484c8a3431c48fdb9f63.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/422343039ca0484c8a3431c48fdb9f63.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/422343039ca0484c8a3431c48fdb9f63.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/422343039ca0484c8a3431c48fdb9f63.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"105047","playcount":"563875"},"similar":{"artist":[{"name":"Carl Smith","url":"https://www.last.fm/music/Carl+Smith","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6906cc6500f44d709db91d9a0527f3e7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6906cc6500f44d709db91d9a0527f3e7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6906cc6500f44d709db91d9a0527f3e7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6906cc6500f44d709db91d9a0527f3e7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6906cc6500f44d709db91d9a0527f3e7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6906cc6500f44d709db91d9a0527f3e7.png","size":""}]},{"name":"Ferlin Husky","url":"https://www.last.fm/music/Ferlin+Husky","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/26b7988e7052411a9001fc1d4d9e271c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/26b7988e7052411a9001fc1d4d9e271c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/26b7988e7052411a9001fc1d4d9e271c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/26b7988e7052411a9001fc1d4d9e271c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/26b7988e7052411a9001fc1d4d9e271c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/26b7988e7052411a9001fc1d4d9e271c.png","size":""}]},{"name":"Marty Robbins","url":"https://www.last.fm/music/Marty+Robbins","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c796892cd423d83ddb89beac3cb7d866.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c796892cd423d83ddb89beac3cb7d866.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c796892cd423d83ddb89beac3cb7d866.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c796892cd423d83ddb89beac3cb7d866.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c796892cd423d83ddb89beac3cb7d866.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c796892cd423d83ddb89beac3cb7d866.png","size":""}]},{"name":"Sonny James","url":"https://www.last.fm/music/Sonny+James","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c9824539aa69445ea0de5638be3954c7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c9824539aa69445ea0de5638be3954c7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c9824539aa69445ea0de5638be3954c7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9824539aa69445ea0de5638be3954c7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9824539aa69445ea0de5638be3954c7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9824539aa69445ea0de5638be3954c7.png","size":""}]},{"name":"Don Gibson","url":"https://www.last.fm/music/Don+Gibson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1da41b384ade4faa8567888d26bd00d6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1da41b384ade4faa8567888d26bd00d6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1da41b384ade4faa8567888d26bd00d6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1da41b384ade4faa8567888d26bd00d6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1da41b384ade4faa8567888d26bd00d6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1da41b384ade4faa8567888d26bd00d6.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"classic country","url":"https://www.last.fm/tag/classic+country"},{"name":"male vocalists","url":"https://www.last.fm/tag/male+vocalists"},{"name":"oldies","url":"https://www.last.fm/tag/oldies"},{"name":"before 1960","url":"https://www.last.fm/tag/before+1960"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Eddy+Arnold/+wiki"}},"published":"12 Oct 2007, 16:40","summary":"Richard Edward \"Eddy\" Arnold (May 15, 1918 – May 8, 2008) was an American country music singer who performed for six decades. He was a so-called Nashville sound (country/popular music) innovator of the late 1950s, and scored 147 songs on the Billboard country music charts, second only to George Jones. He sold more than 85 million records. A member of the Grand Ole Opry (beginning 1943) and the Country Music Hall of Fame (beginning 1966), Arnold ranked 22nd on Country Music Television's 2003 list of \"The 40 Greatest Men of Country Music. <a href=\"https://www.last.fm/music/Eddy+Arnold\">Read more on Last.fm</a>","content":"Richard Edward \"Eddy\" Arnold (May 15, 1918 – May 8, 2008) was an American country music singer who performed for six decades. He was a so-called Nashville sound (country/popular music) innovator of the late 1950s, and scored 147 songs on the Billboard country music charts, second only to George Jones. He sold more than 85 million records. A member of the Grand Ole Opry (beginning 1943) and the Country Music Hall of Fame (beginning 1966), Arnold ranked 22nd on Country Music Television's 2003 list of \"The 40 Greatest Men of Country Music.\" He co-wrote the country and pop standard \"You Don't Know Me\".\n\nArnold was born on May 15, 1918 on a farm near Henderson, Tennessee. His father, a sharecropper, played the fiddle, while his mother played guitar. As a boy Arnold helped on the farm, which later gained him his nickname—the Tennessee Plowboy. Arnold attended Pinson High School in Pinson, Tennessee, where he played guitar for school functions and events. He quit before graduation to help with the farm work, but continued performing, often arriving on a mule with his guitar hung on his back. Arnold also worked part-time as an assistant at a mortuary.\n\nIn 1934, at age 16, Arnold debuted musically on WTJS-AM in Jackson, Tennessee and obtained a job there during 1937. He performed at local nightclubs and was a permanent performer for the station. During 1938, he was hired by WMPS-AM in Memphis, Tennessee, where he was one of its most popular performers. He soon quit for KWK-AM in St. Louis, Missouri, followed by a brief stint at WHAS-AM in Louisville, Kentucky.\nHe performed for WSM-AM on the Grand Ole Opry during 1943 as a solo artist. In 1944, Arnold signed a contract with RCA Victor, with manager Colonel Tom Parker, who later managed Elvis Presley. Arnold's first single was little noticed, but the next, \"Each Minute Seems a Million Years\", scored No. 5 on the country charts during 1945. Its success began a decade of unprecedented chart performance; Arnold's next 57 singles all scored the Top Ten, including 19 number one scoring successes.\nIn 1946, Arnold scored his first major success with \"That's How Much I Love You\". In 1948, he had five successful songs on the charts simultaneously. That year he had nine songs score the top 10; five of these scored No. 1 and scored No. 1 for 40 of the year's 52 weeks. With Parker's management, Arnold continued to dominate, with 13 of the 20 best-scoring country music songs of 1947–1948. He became the host of Mutual Radio's Purina-sponsored segment of the Opry and of Mutual’s Checkerboard Jamboree, a midday program shared with Ernest Tubb that was broadcast from a Nashville theater. Recorded radio programs increased Arnold’s popularity, as did the CBS Radio series Hometown Reunion with the Duke of Paducah. Arnold quit the Opry during 1948, and his Hometown Reunion briefly broadcasted in competition with the Opry on Saturday nights. In 1949 and 1950, he performed in the Columbia movies Feudin’ Rhythm and Hoedown.\nArnold began working for television in the early 1950s, hosting The Eddy Arnold Show. The summer program was broadcast successively by all three television networks, replacing the Perry Como and Dinah Shore programs. He also performed as a guest and a guest host on the ABC-TV show Ozark Jubilee from 1955–60. Arnold featured in the syndicated Eddy Arnold Time from 1955 to 1957. From 1960 to 1961, he hosted NBC-TV's Today on the Farm.\n\nWith the rise of rock and roll in the 1950s, Arnold's record sales declined, though he and fellow RCA Victor recording artist Jim Reeves had a greater audience with popular-sounding string-laced arrangements. Arnold annoyed many people of the country music establishment by recording with the Hugo Winterhalter Orchestra at RCA's studios in New York. The pop-oriented arrangements of \"The Cattle Call\" and \"The Richest Man (in the World)\", however, helped to expand his appeal beyond its country music base. This style, pioneered by Reeves and Arnold, became known as the \"Nashville Sound\". During 1953, Arnold and Tom Parker had a dispute, and Arnold dismissed him. From 1954 to 1963, Arnold's performances were managed by Joe Csida; during 1964 Csida was replaced by Jerry Purcell.\nArnold embarked on a second career that brought his music to a more diverse audience. In the summer of 1965, he had his first Number One country song in ten years, What's He Doing in My World and struck gold again six months later with the song that would become his most well-known Make the World Go Away accompanied by pianist Floyd Cramer on piano and featuring the Anita Kerr Singers. As a result, Arnold's rendition became an international success.\nBill Walker's orchestra arrangements provided the lush background for 16 continuous successes sung by Arnold in the late 1960s. Arnold performed with symphony orchestras in New York City, Las Vegas and Hollywood. He performed in Carnegie Hall for two concerts, and in the Coconut Grove in Las Vegas.[9] During 1966, Arnold was inducted into the Country Music Hall of Fame, the youngest performer to receive the honor. The following year Arnold was voted the first-ever awarded Country Music Association's Entertainer Of The Year. Two years later, Arnold released an autobiography named It's A Long Way From Chester County.\nHaving been with RCA Victor since his debut during 1944, Arnold left the company in 1973 for MGM Records, for which he recorded four albums, which included several top 40 successes. He returned to RCA in 1976.\n\nDuring the 1980s, Arnold declared himself semi-retired; however, he continued recording. In 1984, the Academy of Country Music awarded Arnold its Pioneer Award. His next album, You Don't Miss A Thing wasn't released until 1991. Arnold performed road tours for several more years. By 1992, he had sold nearly 85 million records, and had a total of 145 weeks of No. 1 songs, more than any other singer.\nIn 1996, RCA issued an album of Arnold's main successes since 1944 as part of its 'Essential' series. Arnold, then 76 years old, retired from active singing, though he still performed occasionally. On May 16, 1999, the day after his 81st birthday, he announced his final retirement during a concert at the Hotel Orleans in Las Vegas. That same year, the National Academy of Recording Arts and Sciences inducted the recording of \"Make The World Go Away\" into the Grammy Hall of Fame. In 2000, he was awarded the National Medal of Arts. In 2005, Arnold received a lifetime achievement award from the Recording Academy, and later that year, released a final album for RCA entitled After All These Years.\nEddy Arnold died from natural causes at 5:00 a.m. Central Time on May 8, 2008 in a nursing home in Nashville, exactly one week before his 90th birthday. His wife of 66 years, Sally Gayhart Arnold, had preceded him in death by two months. They were survived by two children (Richard E. Arnold, Jr., and JoAnn Arnold Pollard), two grandchildren (K. Michelle Pollard and R. Shannon Pollard, Jr.), and four great-grandchildren (Katie E. Pollard, Sophie Pollard, Rowan Pollard and Ben Johns).\nOn May 31, 2008, RCA released \"To Life\", as a single from the album After All These Years. It debuted at No. 49 on the Hot Country Songs charts, Arnold's first entry in 25 years and the recording by the oldest person to chart in Billboard magazine. It set the record for the longest span between a first chart single and a last: 62 years and 11 months (\"Each Minute Seems Like a Million Years\" debuted on June 30, 1945), and extended Arnold's career chart history to seven decades.\n <a href=\"https://www.last.fm/music/Eddy+Arnold\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
