{"artist":{"name":"El Gran Combo De Puerto Rico","mbid":"a34ab81e-a7e0-4d0c-b5f8-2438f104733d","url":"https://www.last.fm/music/El+Gran+Combo+De+Puerto+Rico","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9833dbf4dfca4104b8c518ed95ea0d27.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9833dbf4dfca4104b8c518ed95ea0d27.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9833dbf4dfca4104b8c518ed95ea0d27.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9833dbf4dfca4104b8c518ed95ea0d27.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9833dbf4dfca4104b8c518ed95ea0d27.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9833dbf4dfca4104b8c518ed95ea0d27.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"77931","playcount":"502297"},"similar":{"artist":[{"name":"Héctor Lavoe","url":"https://www.last.fm/music/H%C3%A9ctor+Lavoe","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fc4bb6c3a75044a9b12ab8573fb6741a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fc4bb6c3a75044a9b12ab8573fb6741a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fc4bb6c3a75044a9b12ab8573fb6741a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fc4bb6c3a75044a9b12ab8573fb6741a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fc4bb6c3a75044a9b12ab8573fb6741a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fc4bb6c3a75044a9b12ab8573fb6741a.png","size":""}]},{"name":"Andy Montañez","url":"https://www.last.fm/music/Andy+Monta%C3%B1ez","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f6c493a5740244ba8f0bb9ee23d03b2b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f6c493a5740244ba8f0bb9ee23d03b2b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f6c493a5740244ba8f0bb9ee23d03b2b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f6c493a5740244ba8f0bb9ee23d03b2b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f6c493a5740244ba8f0bb9ee23d03b2b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f6c493a5740244ba8f0bb9ee23d03b2b.png","size":""}]},{"name":"Oscar D'León","url":"https://www.last.fm/music/Oscar+D%27Le%C3%B3n","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0035d42c88ee4ac5995978c3a9267b5e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0035d42c88ee4ac5995978c3a9267b5e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0035d42c88ee4ac5995978c3a9267b5e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0035d42c88ee4ac5995978c3a9267b5e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0035d42c88ee4ac5995978c3a9267b5e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0035d42c88ee4ac5995978c3a9267b5e.png","size":""}]},{"name":"Willie Colón","url":"https://www.last.fm/music/Willie+Col%C3%B3n","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fcad892d277644a08e723e6cf9f388f5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fcad892d277644a08e723e6cf9f388f5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fcad892d277644a08e723e6cf9f388f5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fcad892d277644a08e723e6cf9f388f5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fcad892d277644a08e723e6cf9f388f5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fcad892d277644a08e723e6cf9f388f5.png","size":""}]},{"name":"Grupo Niche","url":"https://www.last.fm/music/Grupo+Niche","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ed65503a430c42e3bf6d53626b530058.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ed65503a430c42e3bf6d53626b530058.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ed65503a430c42e3bf6d53626b530058.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed65503a430c42e3bf6d53626b530058.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed65503a430c42e3bf6d53626b530058.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed65503a430c42e3bf6d53626b530058.png","size":""}]}]},"tags":{"tag":[{"name":"salsa","url":"https://www.last.fm/tag/salsa"},{"name":"latin","url":"https://www.last.fm/tag/latin"},{"name":"puerto rico","url":"https://www.last.fm/tag/puerto+rico"},{"name":"el gran combo de puerto rico","url":"https://www.last.fm/tag/el+gran+combo+de+puerto+rico"},{"name":"el gran combo de pueEl Gran Combo de Puerto Ricorto rico","url":"https://www.last.fm/tag/el+gran+combo+de+pueEl+Gran+Combo+de+Puerto+Ricorto+rico"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/El+Gran+Combo+De+Puerto+Rico/+wiki"}},"published":"16 Jan 2008, 07:01","summary":"Salsa orchestra from Puerto Rico. The legendary Puerto Rican band popularly known as El Gran Combo played their first gig in San Juan in 1962 and soon became the island's most popular salsa group. While many bands formed and dissolved during the 1960s and 1970s, El Gran Combo had unusual staying power. Throughout the next several decades, the band's style altered and evolved to fit Latin dance-music trends, from boogaloo and merengue to tango and bomba. <a href=\"https://www.last.fm/music/El+Gran+Combo+De+Puerto+Rico\">Read more on Last.fm</a>","content":"Salsa orchestra from Puerto Rico. The legendary Puerto Rican band popularly known as El Gran Combo played their first gig in San Juan in 1962 and soon became the island's most popular salsa group. While many bands formed and dissolved during the 1960s and 1970s, El Gran Combo had unusual staying power. Throughout the next several decades, the band's style altered and evolved to fit Latin dance-music trends, from boogaloo and merengue to tango and bomba. While an influx of talented young singers and musicians kept the 12- or 13-member band sounding fresh, the steady presence of a few founding members—including the pianist-songwriter Rafael Ithier—gave El Gran Combo their signature style and their venerable reputation as a premier salsa band.\n\nEl Gran Combo originated as an offshoot of the popular Puerto Rican band El Combo de Rafael Cortijo. Invited to start a new group with Joseito Mateo, a singer from the Dominican Republic, Ithier and six fellow musicians dropped out of Cortijo's band to start their new enterprise. The move shocked the Latin music world. \"You were not supposed to leave Puerto Rico's favorite group like that,\" Ithier told Montreal's Gazette, \"but the discipline was not very good anymore…. I did not want to be with a band that was not ready to work.\"\n\nThe new band was not lacking in discipline. Its members—including Rafael Alvarez Guedes (who chose the band's name), Eddie Pérez, Héctor Santos, Roberto Rohena, Rogelio Vélez, Martín Quiñones, and Miguel Cruz —prized teamwork and organization as much as they did musical talent. In 1962 the group recorded its first album, Meneame los Mangos (Shake My Mangos). The album was not a hit and the band was not an overnight sensation, but El Gran Combo were willing to work for their success.\n\nIt was three or four years before El Gran Combo reached that success, which arrived not long after the group recruited a promising young singer named Junior Montañhez (later known as Andy Montañez). With Montañez joining singer Pellin Rodriguez on vocals, the band turned out hit after hit—catchy dance tunes with such names as \"El Menu,\" \"Telefono,\" and \"Goyito Sabater.\" The songwriting talent behind these and other hits was Perin Vazquez, whose lyrics told tales of everyday passions and universal longings. Working closely with Vazquez, Ithier created lively arrangements for piano, bass, trumpets, saxophone, congas, timbales, and bongos.\n\nThe group had released the album Acangana in 1963, just two days before the assassination of U.S. President John F. Kennedy. Although distribution of the album was postponed because of the tragedy, the recording eventually reached gold-record status. In 1970 the band created EGC, an independent record label under which they released a number of albums, beginning with that year's recording, El Momo de Oro.\n\nEl Gran Combo gradually rose to become the first name in salsa within Puerto Rico, winning the island's prestigious Agueybana de Oro prize for the Best Band of 1969. Slowly, word about the band began to spread beyond the island's borders, and from 1971 to 1986 the band's international popularity was at its peak. During this time, El Gran Combo attracted a series of gifted young salsa performers—including singers Charlie Aponte, Johnny Ventura, Celia Cruz, and Jerry Rivas, and musicians Miguel Marrero, Milton Correa, Edwin Cortes, and Martin Quinones. In fact, so many exceptional salsa performers \"graduated\" from El Gran Combo that the band became affectionately known as the University of Salsa.\n\nFor many fans, El Gran Combo is synonymous with salsa—a musical genre that fuses Cuban and Puerto Rican sounds. Headed by three lead singers, El Gran Combo has always drawn dynamic energy from vocals. True to the salsa style, the group balances a vibrant horn section and a rhythmic percussion beat, tempered by the less-prominent bass and piano. One secret to El Gran Combo's long-lived success has been the group's ability to keep its music evolving and to remain open to new, fresh sounds. In 1971 the band added a trombone to its repertoire, played by Epifanio (Fanny) Ceballo. The recording De Punta a Punta, which won best album at Miami's Gold Record Festival, marked the debut of Ceballo, who remained with the band until his death in 1991.\n\nMore changes came for El Gran Combo in the mid-1970s, when Pellin Rodriguez left the band and was eventually replaced by the popular vocalist Charlie Aponte. By 1977 the vocalist Montañez also departed, joining the Venezuelan group La Dimensión Latina. Montañez's departure shocked and saddened fans, but his replacement, Jerry Rivas, soon won over audiences.\n\nIn 1984 El Gran Combo toured Alaska, where they produced Breaking the Ice—El Gran Combo en Alaska, which received a Grammy Award nomination. The band toured internationally throughout the 1980s and celebrated its 25th anniversary in 1987 with a historic concert at New York City's Madison Square Garden.\n\nAlthough many music critics thought El Gran Combo was past its peak by the 1990s, the band held on to its core group of devoted fans. \"When they had singer Andy Montañez, they used to be the music machine of the Caribbean,\" Rudolph Mangual, publisher of the Los Angeles dance-music magazine Latin Beat, told the Los Angeles Times in 1996. \"Obviously, they're way past their prime, but they're so good that they still matter…. [T]heir collective presence has a unique magnetism.\"\n\nAlthough the band is an ensemble, one key figure stands out in El Gran Combo: Ithier, who has either outlasted or outlived the band's other cofounders. Many fans regard him as the group's heart and soul, yet Ithier has always emphasized the band's lack of hierarchy. \"[El Gran Combo] has persevered because of its system,\" Ithier told Billboard magazine. \"We share everything: our successes, our failures, our earnings. Everything is evenly distributed. And this is an incentive for the band. Everything we make, we divide.\" <a href=\"https://www.last.fm/music/El+Gran+Combo+De+Puerto+Rico\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
