{"artist":{"name":"Emery","mbid":"6b22de04-fb48-44aa-bd02-c1427f635477","url":"https://www.last.fm/music/Emery","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1fd831ed394b4508ae92b5505763eedf.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1fd831ed394b4508ae92b5505763eedf.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1fd831ed394b4508ae92b5505763eedf.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1fd831ed394b4508ae92b5505763eedf.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1fd831ed394b4508ae92b5505763eedf.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1fd831ed394b4508ae92b5505763eedf.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"383348","playcount":"14316239"},"similar":{"artist":[{"name":"Dead Poetic","url":"https://www.last.fm/music/Dead+Poetic","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/126fa250fc1b4b6fbd2575dd0a9f567b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/126fa250fc1b4b6fbd2575dd0a9f567b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/126fa250fc1b4b6fbd2575dd0a9f567b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/126fa250fc1b4b6fbd2575dd0a9f567b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/126fa250fc1b4b6fbd2575dd0a9f567b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/126fa250fc1b4b6fbd2575dd0a9f567b.png","size":""}]},{"name":"The Almost","url":"https://www.last.fm/music/The+Almost","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a800e89457304abb8cb8c1bdeec71980.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a800e89457304abb8cb8c1bdeec71980.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a800e89457304abb8cb8c1bdeec71980.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a800e89457304abb8cb8c1bdeec71980.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a800e89457304abb8cb8c1bdeec71980.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a800e89457304abb8cb8c1bdeec71980.png","size":""}]},{"name":"Underoath","url":"https://www.last.fm/music/Underoath","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1ad7951d936f4e23863d289c2079b6bd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1ad7951d936f4e23863d289c2079b6bd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1ad7951d936f4e23863d289c2079b6bd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ad7951d936f4e23863d289c2079b6bd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ad7951d936f4e23863d289c2079b6bd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ad7951d936f4e23863d289c2079b6bd.png","size":""}]},{"name":"The Classic Crime","url":"https://www.last.fm/music/The+Classic+Crime","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/38d874b8c29d4a0b85d83fdb085a990d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/38d874b8c29d4a0b85d83fdb085a990d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/38d874b8c29d4a0b85d83fdb085a990d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/38d874b8c29d4a0b85d83fdb085a990d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/38d874b8c29d4a0b85d83fdb085a990d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/38d874b8c29d4a0b85d83fdb085a990d.png","size":""}]},{"name":"Showbread","url":"https://www.last.fm/music/Showbread","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cdae8609240448ff8a833c71565d7832.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cdae8609240448ff8a833c71565d7832.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cdae8609240448ff8a833c71565d7832.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cdae8609240448ff8a833c71565d7832.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cdae8609240448ff8a833c71565d7832.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cdae8609240448ff8a833c71565d7832.png","size":""}]}]},"tags":{"tag":[{"name":"post-hardcore","url":"https://www.last.fm/tag/post-hardcore"},{"name":"screamo","url":"https://www.last.fm/tag/screamo"},{"name":"emo","url":"https://www.last.fm/tag/emo"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"emocore","url":"https://www.last.fm/tag/emocore"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Emery/+wiki"}},"published":"14 Feb 2006, 01:04","summary":"Emery is an American four-piece alternative rock band from Rock Hill, South Carolina, currently working under their own indie label, Bad Christian Music. Emery moved to Seattle, Washington in order to reach a more music centered scene. The band resists being labeled a \"Christian band\". Before signing with Tooth & Nail, Emery recorded 2 EP's, The Columbus EEP Thee and The Weak's End demo that they used to attract attention from labels. With Tooth & Nail, they have recorded 4 studio albums, and 2 EPs. <a href=\"https://www.last.fm/music/Emery\">Read more on Last.fm</a>","content":"Emery is an American four-piece alternative rock band from Rock Hill, South Carolina, currently working under their own indie label, Bad Christian Music. Emery moved to Seattle, Washington in order to reach a more music centered scene. The band resists being labeled a \"Christian band\". Before signing with Tooth & Nail, Emery recorded 2 EP's, The Columbus EEP Thee and The Weak's End demo that they used to attract attention from labels. With Tooth & Nail, they have recorded 4 studio albums, and 2 EPs. The Weak's End, their debut album, was released in 2004, followed by The Question in 2005 and I'm Only A Man in 2007. The latter fulfilled Emery's contract with Tooth & Nail. However, the band re-signed with the label and released In Shallow Seas We Sail on June 2, 2009. The band's most recent album, We Do What We Want, was released on March 29, 2011.\n\nFormation and Early Years (2000 – 2001)\nEmery formed in 2001 in Rock Hill, South Carolina but moved to Seattle, Washington in search of a better musical environment. The band was named after a first grader that Toby Morrell met while working as an intern for a teacher in college. The four members in the band at the time, Toby Morrell (vocals/guitar), Devin Shelton (drums), Matt Carter (guitar/keyboards), and Joel \"Chopper\" Green (bass) actually left Rock Hill, South Carolina for Seattle on September 11, the day of the terrorist attacks; they found out about the attacks when they stopped at a local diner in South Carolina. Most of the members are from the bands Sachul, Joe 747, Simply Waynes and Oogie Brown. After a little while Seth Studley, who was one of the original members of the band, broke out of a serious relationship and followed them to Seattle and resumed his post as drummer. Since Seth took over drums, Devin went ahead and took the position of guitarist.\n\nThe Weak's End (2002 – 2004)\nAfter making Emerald City their new home in Seattle, Washington, Emery signed a record deal with Tooth & Nail Records, also of Seattle, in 2002. Wasting no time, Emery paired up with producer/engineer Ed Rose and worked on their debut album, The Weak's End. It was produced at the Black Lodge Studio in Eudora, Kansas. The record was released in January 2004 by Tooth & Nail Records. Emery toured extensively to promote their new release.\n\nThe Question (2005 – 2006)\nWhile touring, Seth Studley decided to leave the band in order to get married and Emery had to look for a new drummer. While touring with Haste the Day, Dave Powell was brought out to audition. Powell was officially put in the band on November 2005. Powell originally played in the Indianapolis-based metalcore/hardcore band The Bowels of Judas.\n\nSoon after touring, Emery went back into the studio to record their next record with production done by Aaron Sprinkle this time around. The band took five weeks in recording sessions. The Question was released on August 2, 2005. \"Studying Politics\" was released as the album's first single with a video emerging on June 29, 2005. On November 21, 2006, Emery re-released The Question, adding a DVD, five acoustic versions of previously recorded songs and two new demo tracks, which were produced by Matt Carter. The DVD included a documentary film of Emery, live songs and bonus footage.\n\nAfter the re-release, Joel \"Chopper\" Green decided to leave the band. On September 19, 2006, Emery posted a blog on their website explaining the departure. Devin and Toby since then switched bass parts in concerts and in the studio.\n\nI'm Only A Man (2007 – 2008)\nWhile touring with Underoath in Australia, Emery announced that they were releasing a new album. The album, I'm Only A Man, leaked onto the internet before its official release on October 2, 2007. The album was produced by Ryan Boesch and Matt Carter and recorded at Dark Horse Studio in Tennessee. It received mixed reviews. Emery released a deluxe edition of the album as well, which featured four acoustic songs that were recorded while on the Take Action Tour with The Red Jumpsuit Apparatus and DVD with a live footage and a documentary. The iTunes version of the deluxe edition also added a bonus track called \"Whoa! Man\".\n\nWhile Broken Hearts Prevail and ...In Shallow Seas We Sail (2008 – 2010)\nEmery announced in an interview on TVU that they finished a new 8-track EP entitled While Broken Hearts Prevail, which was released on October 28, 2008. They began premiering some of the new material while on tour opening for The Almost, including a song entitled \"Edge Of The World\".\n\nIn an interview with Toby Morrell, Emery announced that would be releasing a new album called ...In Shallow Seas We Sail. Up until the announcement of Emery resigning to Tooth & Nail Records, it was unsure if the band would seek a new label, since their contract had expired. They re-signed with Tooth & Nail and soon gave out information on their new release.\n\nOn April 7, 2009, Emery released a new song entitled \"Cutthroat Collapse\" on their Myspace, Purevolume, and iTunes. On May 29, 2009, Emery put ...In Shallow Seas We Sail in its entirety up on their Myspace. On June 2, 2009, ...In Shallow Seas We Sail was officially released.\n\nDuring their headlining U.S. tour, Emery had selected dates filmed for a DVD in the works. The release date is unknown at this time. Emery set out on tour supporting Underoath on their fall/winter headlining tour for the rest of the year. In the summer of 2010 they went on the \"Scream it Like You Mean it\" tour with Silverstein, Ivoryline, Dance Gavin Dance, We Came as Romans, Sky Eats Airplane, and I Set My Friends On Fire.\n\nWe Do What We Want (2011- 2012)\nOn January 26, 2011 it was announced that the band's fifth album We Do What We Want is set to be released on March 29, 2011. The band also released a clip of a song titled \"Scissors\". Another song titled \"The Curse of Perfect Days\" has been released to Christian rock radio stations.\n\nOn January 31, 2011, vocalist, rhythm guitarist, and bassist Devin Shelton announced he was taking an \"indefinite hiatus\" from Emery.\n\nOn February 1, 2011 a song titled \"The Cheval Glass\" was released on the band's Facebook, Youtube and Myspace page. On February 17, 2011, the band announced that We Do What We Want would be released through both Tooth & Nail and their hardcore/metal subdivision Solid State Records reflecting the heavier sound of the album.\n\nIn 2012, Toby Morrell and Matt Carter formed a side project duo, simply called Matt & Toby, with a more acoustic/electronic type sound. The duo released a self-titled album in November of that year via Tooth & Nail.\n\nBad Christian Music (2013 - present)\nIn 2013 Emery did not resign with Tooth & Nail records, subsequently leaving the label. Later that year, they founded Bad Christian Music, a blog & podcast website, as well as an indie record label.\n\nIn 2014, the band released two books, Bad Christian, Great Savior, and The M Word.\n\nOn May 19th, 2015 Emery released their sixth full length album, their first album via Bad Christian Music, You Were Never Alone. The album peaked at No. 69 on the Billboard 200, No. 1 on Top Christian Albums, No. 6 on Independent Albums, No. 8 on Alternative Music[ No. 10 on Top Rock Albums and No. 31 on Top Album Sales.\n\nBands such as Abandon Kansas and The Classic Crime have also joined the artist roster of Bad Christian Music.\n\nMembers\nToby Morrell: lead vocals, guitar\nMatt Carter: guitar, aggressive vocals\nJosh Head: keyboard, vocals, aggressive vocals \nDave Powell: drums\n\nFormer Members\nDevin Shelton: guitar, lead vocals (on indefinite hiatus now)\nSeth Studley: drums\nJoel Green: bass\nJoey Svendsen: bass <a href=\"https://www.last.fm/music/Emery\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
