{"artist":{"name":"Enter The Haggis","mbid":"54ce7300-69ad-42ec-9327-53d61ead2a0c","url":"https://www.last.fm/music/Enter+The+Haggis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f9ef8486b26f4696a62a353f06c96ca5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f9ef8486b26f4696a62a353f06c96ca5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f9ef8486b26f4696a62a353f06c96ca5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9ef8486b26f4696a62a353f06c96ca5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9ef8486b26f4696a62a353f06c96ca5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9ef8486b26f4696a62a353f06c96ca5.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"49980","playcount":"666859"},"similar":{"artist":[{"name":"Gaelic Storm","url":"https://www.last.fm/music/Gaelic+Storm","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3fb9d1b5afe747e3a57a9bac18f0ed72.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3fb9d1b5afe747e3a57a9bac18f0ed72.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3fb9d1b5afe747e3a57a9bac18f0ed72.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3fb9d1b5afe747e3a57a9bac18f0ed72.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3fb9d1b5afe747e3a57a9bac18f0ed72.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3fb9d1b5afe747e3a57a9bac18f0ed72.png","size":""}]},{"name":"The Young Dubliners","url":"https://www.last.fm/music/The+Young+Dubliners","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0f58d03a611d49d190f2164bd522a6da.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0f58d03a611d49d190f2164bd522a6da.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0f58d03a611d49d190f2164bd522a6da.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0f58d03a611d49d190f2164bd522a6da.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0f58d03a611d49d190f2164bd522a6da.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0f58d03a611d49d190f2164bd522a6da.png","size":""}]},{"name":"Carbon Leaf","url":"https://www.last.fm/music/Carbon+Leaf","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/333e21944f0f492fb94ad1ac254adf6b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/333e21944f0f492fb94ad1ac254adf6b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/333e21944f0f492fb94ad1ac254adf6b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/333e21944f0f492fb94ad1ac254adf6b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/333e21944f0f492fb94ad1ac254adf6b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/333e21944f0f492fb94ad1ac254adf6b.png","size":""}]},{"name":"Great Big Sea","url":"https://www.last.fm/music/Great+Big+Sea","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/de931ac96f6644108d4e8fb83dc3dfcd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/de931ac96f6644108d4e8fb83dc3dfcd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/de931ac96f6644108d4e8fb83dc3dfcd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/de931ac96f6644108d4e8fb83dc3dfcd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/de931ac96f6644108d4e8fb83dc3dfcd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/de931ac96f6644108d4e8fb83dc3dfcd.png","size":""}]},{"name":"Wolfstone","url":"https://www.last.fm/music/Wolfstone","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/46c79c5da427447cb1670ccb828d881e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/46c79c5da427447cb1670ccb828d881e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/46c79c5da427447cb1670ccb828d881e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/46c79c5da427447cb1670ccb828d881e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/46c79c5da427447cb1670ccb828d881e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/46c79c5da427447cb1670ccb828d881e.png","size":""}]}]},"tags":{"tag":[{"name":"celtic rock","url":"https://www.last.fm/tag/celtic+rock"},{"name":"celtic","url":"https://www.last.fm/tag/celtic"},{"name":"folk rock","url":"https://www.last.fm/tag/folk+rock"},{"name":"folk","url":"https://www.last.fm/tag/folk"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Enter+The+Haggis/+wiki"}},"published":"17 Mar 2006, 18:55","summary":"Over the past three albums and five years, Toronto’s Celtic rock band Enter The Haggis has found itself at the center of a grassroots success story ever teetering on the brink of mainstream success. From playing Celtic festivals to headlining them, and from the festival circuit to selling out multiple nights in rock venues, ETH has blazed a path with heavy and almost constant touring up and down the East Coast, to Canada, the West Coast and back again, winning over success one fan, one town, one region at a time. <a href=\"https://www.last.fm/music/Enter+The+Haggis\">Read more on Last.fm</a>","content":"Over the past three albums and five years, Toronto’s Celtic rock band Enter The Haggis has found itself at the center of a grassroots success story ever teetering on the brink of mainstream success. From playing Celtic festivals to headlining them, and from the festival circuit to selling out multiple nights in rock venues, ETH has blazed a path with heavy and almost constant touring up and down the East Coast, to Canada, the West Coast and back again, winning over success one fan, one town, one region at a time.\n\nThe band has made waves in the genre, landing high Billboard and iTunes World Music chart positions as well as major television appearances on shows like Live With Regis And Kelly, A&E Breakfast With the Arts and PBS’ popular program Out of Ireland, with its multi-influence style of Celtic rock. It’s the kind of overall sound and devotion package that has created not only die-hard fans, but “Haggis Heads” that follow the band from gig to gig.\n\nThe band has been together in its current incarnation since members met in the early 2000s in Toronto, where more than half the band was studying its craft in the city’s colleges and universities. With that kind of classically trained background Enter The Haggis is constantly honing and evolving its sound – blending elements of rock and pop with traditional Celtic fare, an art school eclecticism and a keen sense of arrangement. Past records have seen the band dabble in roots, funk, even adding prog rock elements to the mix, but ETH always manages to bring it home. Alternating between upbeat rock numbers with sing-along choruses and slower, more introspective alt pop songs, the band plays progressive and lyrically driven music that’s strongly rooted in Celtic tradition – from the storytelling to the bagpipes.\n\n“We like to experiment musically, pushing the boundaries of what people think of as Celtic music,” said vocalist and guitarist Trevor Lewington. “Some of our grooves, melodies and lyrics are quite different from other bands that we play with.” \n\nFor instance, “Suburban Plains,” one of the songs on the band’s new album Gutter Anthems, mixes an African-inspired drumbeat in 5/4 time with tin whistle melodies and lyrics in English and French. \"The Death of Johnny Mooring\" combines a fiddle melody with Rage Against the Machine-inspired riff-rock. There’s a fiddle solo in the song in which fiddle player Brian Buchanan uses distortion, wah pedal and whammy pedal on the instrument. Béla Fleck’s done that with a banjo, but fiddle might be a first.\n\nIt’s been a long time coming though, and Enter The Haggis has definitely been reworking its music and building success over the past several years. 2004’s release Casualties of Retail (United For Opportunity), not only stretched the limits of Celtic rock musically, but topically as well with straight-shooting socio-political tracks such as “Gasoline” and “Congress.” 2006’s Soapbox Heroes, produced by four-time Grammy award winner Neil Dorfsman (Sting, Dire Straits, Paul McCartney), hit number two during its July release on the iTunes World Music chart and later marked the band’s Billboard debut when it landed at number eight on the World Chart there. 2007’s Northampton (Live) was recorded over four sold-out shows in one weekend at the Iron Horse Music Hall in Northampton, MA, and was a testament to the band’s focus on touring, fan participation, and its regional stronghold in the Northeast U.S. \n\nNow, the band’s seventh album, Gutter Anthems, is Enter The Haggis’ most cohesive record to date, yet one that makes the band’s eclecticism shine. Recorded in Fall 2008 at The Hive in Toronto and Metalworks Studios in Mississauga, the record will be released this March on new model indie label United For Opportunity. Expect a combination of rousing drinking songs with well-arranged rock and pop tunes. \n\nSongs like opening track “The Litter And The Leaves” with its upbeat tempo and rousing anthemic chorus see the band embracing a jig-punk direction a la The Dropkick Murphys, while tracks like “Real Life” embrace the more traditional feel of tin whistle and fiddle throughout. “Noseworthy and Piercy” and “The Death of Johnny Mooring” find the band embracing its Canadian roots in true tales from the homeland. There’s also a marked “little guy vs. the world” theme, derived from the trials of being an indie band trying to make it in the current music industry climate.\n\nThis year the band plans to focus more than ever on its homeland, and is looking forward to spending a great deal of time in Canadian territory. Gutter Anthems will be released on United for Opportunity on March 24, 2009 amid a March East Coast tour, including a blowout celebration on St. Patrick’s Day at The Mod Club in the band’s native Toronto. “We’ve started feeling nostalgia for our homeland,” said fiddler, keyboardist and vocalist Brian Buchanan. “And this album feels more distinctly and unapologetically Canadian than our previous albums.” This year Canada. Next year the world. <a href=\"https://www.last.fm/music/Enter+The+Haggis\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
