{"artist":{"name":"Evolution","mbid":"f98d1c18-63a2-4f92-8ffd-5fd0d17202d9","url":"https://www.last.fm/music/Evolution","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3a9fb2c917994dba9612e6d6b3765e5b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3a9fb2c917994dba9612e6d6b3765e5b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3a9fb2c917994dba9612e6d6b3765e5b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a9fb2c917994dba9612e6d6b3765e5b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a9fb2c917994dba9612e6d6b3765e5b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a9fb2c917994dba9612e6d6b3765e5b.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"24420","playcount":"118634"},"similar":{"artist":[{"name":"Breeder","url":"https://www.last.fm/music/Breeder","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f4cd86d334b1418182ee6d1c5cc8bf54.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f4cd86d334b1418182ee6d1c5cc8bf54.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f4cd86d334b1418182ee6d1c5cc8bf54.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f4cd86d334b1418182ee6d1c5cc8bf54.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f4cd86d334b1418182ee6d1c5cc8bf54.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f4cd86d334b1418182ee6d1c5cc8bf54.png","size":""}]},{"name":"Solid Sessions","url":"https://www.last.fm/music/Solid+Sessions","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dd9bc943e580497393b6e6685c7af647.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dd9bc943e580497393b6e6685c7af647.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dd9bc943e580497393b6e6685c7af647.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dd9bc943e580497393b6e6685c7af647.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dd9bc943e580497393b6e6685c7af647.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dd9bc943e580497393b6e6685c7af647.png","size":""}]},{"name":"Bedrock","url":"https://www.last.fm/music/Bedrock","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a0e7c01dcb204c7db7efbadc5460bcc2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a0e7c01dcb204c7db7efbadc5460bcc2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a0e7c01dcb204c7db7efbadc5460bcc2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a0e7c01dcb204c7db7efbadc5460bcc2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a0e7c01dcb204c7db7efbadc5460bcc2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a0e7c01dcb204c7db7efbadc5460bcc2.png","size":""}]},{"name":"Transa","url":"https://www.last.fm/music/Transa","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/66be7cff7d08466b9faa87c0958d81d1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/66be7cff7d08466b9faa87c0958d81d1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/66be7cff7d08466b9faa87c0958d81d1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/66be7cff7d08466b9faa87c0958d81d1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/66be7cff7d08466b9faa87c0958d81d1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/66be7cff7d08466b9faa87c0958d81d1.png","size":""}]},{"name":"Saints & Sinners","url":"https://www.last.fm/music/Saints+&+Sinners","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/440976e364c44b89845332e6fdadc03e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/440976e364c44b89845332e6fdadc03e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/440976e364c44b89845332e6fdadc03e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/440976e364c44b89845332e6fdadc03e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/440976e364c44b89845332e6fdadc03e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/440976e364c44b89845332e6fdadc03e.png","size":""}]}]},"tags":{"tag":[{"name":"trance","url":"https://www.last.fm/tag/trance"},{"name":"psychedelic","url":"https://www.last.fm/tag/psychedelic"},{"name":"electronic","url":"https://www.last.fm/tag/electronic"},{"name":"goa","url":"https://www.last.fm/tag/goa"},{"name":"ambient","url":"https://www.last.fm/tag/ambient"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Evolution/+wiki"}},"published":"15 Sep 2007, 23:38","summary":"There are multiple artists with this name:\n1. Alternative rock band from Bulgaria\n2. Electronic Dance Music producer duo Jon Sutton and Barry Jamieson\n3. Spanish band\n\n1. Evolution is an alternative rock band from Bulgaria. The band consists of Adrian Gougov(vocals , guitar and keys), Dimo Mezekliev(bass guitar) and Matt Hristoskov(drums). Though the music of the band is considered mainly alternative rock , the great variety of their style is caused by their wide range of different influences. <a href=\"https://www.last.fm/music/Evolution\">Read more on Last.fm</a>","content":"There are multiple artists with this name:\n1. Alternative rock band from Bulgaria\n2. Electronic Dance Music producer duo Jon Sutton and Barry Jamieson\n3. Spanish band\n\n1. Evolution is an alternative rock band from Bulgaria. The band consists of Adrian Gougov(vocals , guitar and keys), Dimo Mezekliev(bass guitar) and Matt Hristoskov(drums). Though the music of the band is considered mainly alternative rock , the great variety of their style is caused by their wide range of different influences. Originally formed in 2003 with only Adrian and now ex-guitarist Radi Radev it wasn't until 2005 when they first got in a rehearsal room with an absolutely different lineup with Adrian taking vocal duties and rhythm guitar, Dimo on drums , Iakim Kastelov on bass and Harry Borisov on lead guitar. On the 2nd June 2006 Evolution played their first gig at the high school they attended. Only a month later the band was given the opportunity to play two beerfests in Sofia which helped widen their popularity. Sadly Harry left the band to fly and live in Praetoria , Africa. Now as a three-piece the band continued rehearsing with a new golden rule for themselves – to play only their own material. On the 6th of January 2007 they would play a private gig in front of a selected crowd where they would present only copyrighted songs. That very concert was the debut of Evolution as a three-piece with Iakim still on bass and Dimo on drums. They would go on to play only one more gig in that lineup about a month later. That’s when things started going on the downgrade. Iakim became busy with his future education and forthcoming exams , so Dimo and Adrian were left to wonder if there’s a future for the band anymore and what would be the best thing to do to get back on track. Two things then happened that would change the course of the band. Dimo decides to try himself out on the bass and offers jazz drummer Matt Hristoskov to come and jam with him and Adrian as a tryout. Two more “jams” were scheduled for which Matt was asked to learn about 10 Evolution songs in 3 to 4 day period. And so with a new lineup and after only 3 rehearsals Evolution entered a “battle of the bands” competition and won 3rd place thus winning themselves a spot on the annual “Cvete za Gosho” rock festival. They would be received extremely well and would be praised for the professionalism they present at their age. After doing a few club shows shortly after the festival the band would end up taking a rather large hitaus before they reunited in late 2007. In early 2008 they ended up recording a few demo tracks in the well known Stain-Studios. Since then Evolution regulary perform in the legendary Backstage and Swingin' hall clubs as well as making a second appereance on the \"Cvete za Go6o\" festival. The band is currently writing and gathering material for their first album and is expected to do a short tour in the near future.d for the professionalism they present at their age. After doing a few club shows shortly after the festival the band would end up taking a rather large hitaus before they reunited in late 2007. In early 2008 they ended up recording a few demo tracks in the well known Stain-Studios. Since then Evolution regulary perform in the legendary Backstage and Swingin' hall clubs as well as making a second appereance on the \"Cvete za Go6o\" festival. The band is currently writing and gathering material for their first album and is expected to do a short tour in the near future.\n\n2. Evolution is Jon Sutton and Barrie Jamieson who have been producing music for almost 20 years now, playing in bands at first before delving into various ventures, one of which was working with some DJ called Sasha (remember him?), in providing a track for his first remix on their old label Postive Vinyl. From there a brief foray into the world of playing large parties and even getting airplay on MTV soon became tedious and the duo set up Fluid Recordings in 1996, with the label now almost at it's 40th release and having featured some of the best talent in the world, from Jimmy Van M to Taylor and also Andy Ling. However, it was only natural that they wanted to show that they are capable of more than running a label and producing 'dance music', so they set to work on an album, and now the fruits of their labour are now set to be released on this debut longplayer 'Unnatural Selection'\n\nSweeping ambient soundscapes fused with a tight progressive breaks groove introduces us into the minds of Jon and Barry for the next hour or so, as Numb unlocks your senses in preparation for what is to come next, Mexican Dawn keeping with the low tempo vibe and a deep trippy humming noise running in the background, becoming deeper as the track lifts in pace slightly. The transition into the rolling house groove of Better House Music is so subtle you almost miss it, a rolling bassline and, synth arrangements and horns come together as one as a quirky vocal sample adds an extra dimension to the track.\n\nAs the first chords of 'Walking On Fire' featuring the vocals of longtime Evolution collaborator, you know what to expect. This glorious progressive house workout has been dominating the dancefloors and radio waves for several months. Once again this meeting of minds delivers another anthemic masterpiece that will become a classic months from now. as it slowly paves the way into classic Evolution territory as the trippy piano line of Firewyre builds the momentum nicely into the eerie sounds of Crododile Man, the bassline pulsating away like a well oiled machine cranking gears as it's progressing to the next cycle, and this track sure marks a turning point in the album as the break hints at a slightly more downtempo route once more.\n\nThe lush atmospherics of Solina swim through the speakers, like waves washing upon a sandy beach, as we are swept away into a feeling of bliss and left with images of a gorgeous sunset and voyage into the dark of night. That dark of night is soundtracked by the techno influenced groove and tough drum patterns of Blaster, vocodered effects piercing the soundscape and forcing the tempo to climb higher and higher before the bottom drops out systematically and a driving synth arrangement loops over and over and evocative vocal samples filter through the speakers. Phoenix rises from the ashes of the previous track, the loops locking in with a deep bassline and synth arrangement, evolving like a rapidly changing lifeform, before one of the biggest breakdowns you will ever hear comes out of nowhere. This is almost the exclamation point on the album, an energy release of all the tension that has been buit up in the past hour before the journey starts to come to an end.\n\nHowever a surprise is kept for the end as a lounge style groove and catchy melody let Jayn Hanna deliver another track entitled 'Making Sense', slow drum arrangements and deep and meaningful vocals crafting this into a superb piece of music, far exceeding any dance or electronic roots, and a track that wouldn't be out of place on daytime radio during the heat of the summer holiday season. The ambient version of Walking On Fire is in more ways than one a reprise, a secret extra to those wanting more, and Jayn's vocals fit the laid back arrangements as much as they do the house groove showcase earlier on the album. Evidence of why she is one of the hottest vocal talents and evidence that as demonstrated by this album that Evolution are comfortable in any genre they decide to put their hand to.\n\nSo there you have it. The wait is finally over. Evolution, the past, present and future. Don't think of it is the full stop of the Evolution story. Think more of it as Chapter 1. Proof that Evolution are not just about amazing club tracks, but have an untapped talent that will develop right across the world of music in the coming months and years.\n\n3. Evolution is a Spanish band. The late '60s in Spain saw a fascination with soul music -- perhaps the upbeat groove of black America was a suitable reaction to the staid ways of Franco's dictatorship. Evolution  initially arrived in Spain from Germany as beat/soul band Los Vampires, who overtime changed direction, lost members and regrouped at the end of the decade in Barcelona to become the cities hottest soul act. When the psych-prog boom took off influences such as Santana, Spirit, King Crimson, Traffic and Blood, Sweat & Tears also began to play a crucial part in their sound. The band originals combined incredible psych-rock dance floor fillers - notably 'Dr. Vazquez' - which were packed with fuzz guitar, Hammond and Det Ferring's impressive vocals, with more introspective rock. (It comes as no surprise that recently the Mod scene has picked up on Evolution's dazzling interpretation of Spirit's 'Fresh Garbage' {included on this album}). Wah-Wah's splendid digipak re-issue of the 1970 Evolution album is packaged in the peculiar 'carrier bag' styled sleeve of the original 12\" sleeve (including cardboard handgrip). Offering The Listener Loads Of Hammond Grooves And Psychedelic Fuzz Guitar. Their Rare LP From 1970 Is Another One Of The Most Sought-After Records From Spain's Rock Heritage. The Wah Wah Edition Respects The Original Shopping Bag-Type Sleeve And Features Extensive Information On The Band, Plus Curious Photos, Memorabilia And 4 Bonus Tracks From A Couple Of 1971/1972 Singles Not On The Original Album.\n <a href=\"https://www.last.fm/music/Evolution\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
