{"artist":{"name":"Fake Problems","mbid":"bc62fd76-11bd-45ca-bfc4-d8690154a86f","url":"https://www.last.fm/music/Fake+Problems","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cf25acfa4ae54b27988250787f9f1e02.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cf25acfa4ae54b27988250787f9f1e02.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cf25acfa4ae54b27988250787f9f1e02.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf25acfa4ae54b27988250787f9f1e02.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf25acfa4ae54b27988250787f9f1e02.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf25acfa4ae54b27988250787f9f1e02.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"80899","playcount":"1795310"},"similar":{"artist":[{"name":"Dave Hause","url":"https://www.last.fm/music/Dave+Hause","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/514f89dcd8144039ab1fe9642bd789ef.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/514f89dcd8144039ab1fe9642bd789ef.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/514f89dcd8144039ab1fe9642bd789ef.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/514f89dcd8144039ab1fe9642bd789ef.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/514f89dcd8144039ab1fe9642bd789ef.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/514f89dcd8144039ab1fe9642bd789ef.png","size":""}]},{"name":"The Riot Before","url":"https://www.last.fm/music/The+Riot+Before","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/063aa2eebcab4f43ab64955fb572ffce.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/063aa2eebcab4f43ab64955fb572ffce.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/063aa2eebcab4f43ab64955fb572ffce.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/063aa2eebcab4f43ab64955fb572ffce.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/063aa2eebcab4f43ab64955fb572ffce.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/063aa2eebcab4f43ab64955fb572ffce.png","size":""}]},{"name":"Against Me!","url":"https://www.last.fm/music/Against+Me%21","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/472a5f8905d0f52265577107542a21d8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/472a5f8905d0f52265577107542a21d8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/472a5f8905d0f52265577107542a21d8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/472a5f8905d0f52265577107542a21d8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/472a5f8905d0f52265577107542a21d8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/472a5f8905d0f52265577107542a21d8.png","size":""}]},{"name":"Sundowner","url":"https://www.last.fm/music/Sundowner","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1f18e67f8dbd4d599f25447340957cf9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1f18e67f8dbd4d599f25447340957cf9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1f18e67f8dbd4d599f25447340957cf9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1f18e67f8dbd4d599f25447340957cf9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1f18e67f8dbd4d599f25447340957cf9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1f18e67f8dbd4d599f25447340957cf9.png","size":""}]},{"name":"Tom Gabel","url":"https://www.last.fm/music/Tom+Gabel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bf1067bca5ed460990561b8991f5f416.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bf1067bca5ed460990561b8991f5f416.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bf1067bca5ed460990561b8991f5f416.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bf1067bca5ed460990561b8991f5f416.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bf1067bca5ed460990561b8991f5f416.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bf1067bca5ed460990561b8991f5f416.png","size":""}]}]},"tags":{"tag":[{"name":"folk punk","url":"https://www.last.fm/tag/folk+punk"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"punk","url":"https://www.last.fm/tag/punk"},{"name":"indie","url":"https://www.last.fm/tag/indie"},{"name":"folk","url":"https://www.last.fm/tag/folk"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Fake+Problems/+wiki"}},"published":"25 Sep 2006, 03:44","summary":"Evolution is a naturally occurring force in life, however there’s nothing predictable about Fake Problems sonic journey from underground heroes to indie rock trailblazers. Since forming in Naples, Florida in 2005 the group—which includes vocalist/guitarist Chris Farren, bassist Derek Perry, drummer Sean Stevenson, guitarist Brian Blount, and former guitarist Casey Lee—have released two critically acclaimed full-lengths, won over countless fans <a href=\"https://www.last.fm/music/Fake+Problems\">Read more on Last.fm</a>","content":"Evolution is a naturally occurring force in life, however there’s nothing predictable about Fake Problems sonic journey from underground heroes to indie rock trailblazers. Since forming in Naples, Florida in 2005 the group—which includes vocalist/guitarist Chris Farren, bassist Derek Perry, drummer Sean Stevenson, guitarist Brian Blount, and former guitarist Casey Lee—have released two critically acclaimed full-lengths, won over countless fans all over the world and toured and played shows with everyone from The Hold Steady to Frank Turner. However with their sophomore release on Side One Dummy Records, Real Ghosts Caught on Tape, Fake Problems have exceeded even their own lofty expectations by creating a cerebral masterpiece that sees the band fully reconciling all of their seemingly disparate influences and proving it’s finally their time to step into the spotlight.  In 2012  Casey Lee  left the band.  He was replaced by Brian Blount of  Vega Under Fire .\n\nRecorded with Ted Hutt (The Gaslight Anthem, Lucero) in California, the album sees the band stripping down the expansive orchestration of 2009’s It’s Great To Be Alive and discovering what magic lurks at the core of Fake Problems’ collective psyche.  “We wanted the album to be a little more subtle and let it speak for itself,” Farren explains when asked how found the act found the inspiration to craft a unique brand of music that manages to incorporate elements of infectious indie rock  & roll and ‘60s girl groups—the latter of which is aided by crooning vocals courtesy of Fake Problems’ longtime friends/fans Arrested Development’s Mae Whiteman and Alia Shawkat.\n\nFarren also acknowledges that Hutt helped the band realize their Phil Spector-esque wall of sound production style they had in their heads, which allowed them to transcend the DIY punk scene they grew up in without abandoning their roots. “In the past we would jam so many ideas into one song and it would just be too much,” Farren admits. “Ted helped us realize that while that approach is very creative, it’s wasn’t the best way to go about writing this record” he continues. “This album was a good exercise in restraint and filtering the ideas so we could make every good idea really count. “\n\nFrom soul-inspired indie-rock experiments like “5678” and chilling compositions like “Ghost To Coast” to sparkling beach punk-inspired gems like “Complaint Dept,” Real Ghosts Caught On Tape effectively shows how Fake Problems have organically developed into one of rock’s most exciting acts and will undeniably see them attracting a whole new base of music fans who are looking for something in what they listen to that can’t be easily described or marketed. “The song ‘Complaint Dept’ was such a different thing for us to do because all of the guitar parts are so intricate and noodly,” Farren says when asked about some of his favorite moments on the album. “It was just so fun to be able to do that with our band because it’s surprising for a Fake Problems song, but it works for us.”\n\nReal Ghosts Caught On Tape also sees Farren expanding his lyrical palette—and while he’s become well known for his theological imagery, this album sees Farren exploring himself more as opposed to any external deities. “There’s a theme in the lyrics of uncertainty,” he explains. “There’s an emphasis on fear, trying to persevere, not giving up hope and doing the best you can to stay positive,” he continues. “It’s more of a record about being yourself and living your own life than it is about any other person, concept or idea,” he summarizes. Although lines like “When I reach the pearly gates of hell, I’ll send those dimes back up the wishing well with a note tied to each that reads ‘Nobody’s listening.’” (from “Complaint Dept.”) still display Farren’s gift for wordplay and metaphor, “it’s more of a conversation than a sermon.”\n\nThat said, Real Ghosts Caught On Tape isn’t going to make Fake Problems an easy act to categorize—but that’s something that they wouldn’t change for the world. “Creatively we always molded our band from the beginning so that we’d be able to do anything and tour with anyone from Against Me! to William Elliott Whitmore to even the Dillinger Escape Plan,” Farren explains. “I think it’s kind of hard to slap our name on a sticker and recommend us if you like another band, but I think in the long term it’s definitely a blessing that we’re not pinpointed into one thing,” he continues. “We really don’t ever want to be that type of band.”\n\n“Sometimes I dream of getting in my car and driving straight through the night,” vocalist Chris Farren croons on the intricately arranged ballad “Ghost To Coast.” Real Ghosts Caught On Tape is the perfect soundtrack to that journey from darkness to light, showcasing a band who have grown to new artistic heights lying on the other side of the horizon.\n\nFake Problems is an American rock band from Naples, Florida. They released their first album, How Far Our Bodies Go, on Sabot Productions on April 27, 2007. Their second record, It's Great to Be Alive, was released through Side One Dummy Records on February 17, 2009.\n\nGrowing up is never easy, but when you’re in a band it often seems impossible. Make the same record twice and you’re chastised for being repetitive, but if you make too large of a sonic shift your fan base will desert you. Luckily Naples, Florida’s Fake Problems have never had to deal with this dilemma because with each release they’ve not only organically reinvented their sound, they’ve also successfully redefined who they are as musicians and human beings in the process. The culmination of this is the band’s SideOneDummy debut It’s Great To Be Alive, which shows Fake Problems’ unique brand of indie rock finally shaking off the insecurity and soul-searching of adolescence and sees the band embracing a sense of perspective that can only be gained by spending countless months on the road touring, laughing and writing music they believe in.\n\nIn order to capture their creative vision for It’s Great To Be Alive the band packed up their van and headed to the cornfields of Omaha, Nebraska, where they spent two weeks tracking the album at ARC Studios with producer A.J. Mogis (Cursive, Rilo Kiley, The Faint). Although this might seem like an unconventional choice for a band who have toured with decidedly more aggressive peers such as Against Me! and the Riverboat Gamblers, Fake Problems were so prepared going into the studio they didn’t have to worry about getting bogged down with technicalities. “We knew exactly what order we wanted the record to be in and what auxiliary instruments we wanted to use on the songs,” Farren explains adding that Perry arranged the strings, Look Mexico’s Matt Agrella arranged the horns—and at one point the band even enlisted the help of a seven-piece horn section comprised of University of Nebraska students and teachers. \n\nThe result is an album that combines the band’s punk rock roots with elements of folk and indie rock to create a unique amalgam of music that’s as distinctive as Farren’s soulful tenor. “I’m definitely influenced by my musical surroundings, so there was never any decision to make ‘this’ or ‘that’ kind of song,” the band’s frontman explains, listing everyone from alt-country crooners like Ryan Adams to troubadours like Bob Dylan and rock revivalists such as the Hold Steady as influences this time around. “We write songs that we would want to hear from other artists,” he elaborates. “We make music that we want to listen to, so it just wouldn’t make sense to keep doing the same thing over and over again. \n\nFrom the sinister shuffle of “You’re A Serpent, You’re a She-Snake” to orchestral ballads like “Tabernacle Song” and intricately layered anthems like “There Are Times,” It’s Great To Be Alive is less of a traditional album and more of a sonic journey that refuses to be limited by genre constraints.  <a href=\"https://www.last.fm/music/Fake+Problems\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
