{"artist":{"name":"Farlow-Kirch Band","url":"https://www.last.fm/music/Farlow-Kirch+Band","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c1a5356e209f4d6a9c86f2082e0dc677.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c1a5356e209f4d6a9c86f2082e0dc677.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c1a5356e209f4d6a9c86f2082e0dc677.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c1a5356e209f4d6a9c86f2082e0dc677.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c1a5356e209f4d6a9c86f2082e0dc677.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c1a5356e209f4d6a9c86f2082e0dc677.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"47","playcount":"302"},"similar":{"artist":[{"name":"Gary Primich","url":"https://www.last.fm/music/Gary+Primich","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e18348cfcf9d4525b02ded46bd76d8f3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e18348cfcf9d4525b02ded46bd76d8f3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e18348cfcf9d4525b02ded46bd76d8f3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e18348cfcf9d4525b02ded46bd76d8f3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e18348cfcf9d4525b02ded46bd76d8f3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e18348cfcf9d4525b02ded46bd76d8f3.png","size":""}]},{"name":"Lazy Lester","url":"https://www.last.fm/music/Lazy+Lester","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b0e1f1c1a5dce607539ed8c97337a01f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b0e1f1c1a5dce607539ed8c97337a01f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b0e1f1c1a5dce607539ed8c97337a01f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b0e1f1c1a5dce607539ed8c97337a01f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b0e1f1c1a5dce607539ed8c97337a01f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b0e1f1c1a5dce607539ed8c97337a01f.png","size":""}]},{"name":"Slim Harpo","url":"https://www.last.fm/music/Slim+Harpo","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/202ba0b775d5a5183834407d00b41144.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/202ba0b775d5a5183834407d00b41144.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/202ba0b775d5a5183834407d00b41144.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/202ba0b775d5a5183834407d00b41144.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/202ba0b775d5a5183834407d00b41144.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/202ba0b775d5a5183834407d00b41144.png","size":""}]},{"name":"Henry Gray","url":"https://www.last.fm/music/Henry+Gray","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/aa44f005edc24df1b22be10acafed0c6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/aa44f005edc24df1b22be10acafed0c6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/aa44f005edc24df1b22be10acafed0c6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aa44f005edc24df1b22be10acafed0c6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aa44f005edc24df1b22be10acafed0c6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aa44f005edc24df1b22be10acafed0c6.png","size":""}]},{"name":"Lonesome Sundown","url":"https://www.last.fm/music/Lonesome+Sundown","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e8aebdecda8345f390b4202d397d992f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e8aebdecda8345f390b4202d397d992f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e8aebdecda8345f390b4202d397d992f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e8aebdecda8345f390b4202d397d992f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e8aebdecda8345f390b4202d397d992f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e8aebdecda8345f390b4202d397d992f.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"harmonica blues","url":"https://www.last.fm/tag/harmonica+blues"},{"name":"swamp blues","url":"https://www.last.fm/tag/swamp+blues"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Farlow-Kirch+Band/+wiki"}},"published":"03 Oct 2012, 01:21","summary":"Billy C. Farlow - Guitar, harmonica and vocals\nRich Kirch - Guitar \nKeith Crossan -Tenor saxophone\nAustin DeLone - Keyboards and background vocals\nBrent Rampone -Drums\nBill Gibson - Percussion and background vocals\n\nSome will tell you that chance would have it, others that chance does not exist. Coincidence or not, the meeting of these two American bluesmen, Billy C. Farlow and Rich Kirch, will mark the coming years. Their  first album together, \"Alligator Crawl\", is very imposing and powerful.  <a href=\"https://www.last.fm/music/Farlow-Kirch+Band\">Read more on Last.fm</a>","content":"Billy C. Farlow - Guitar, harmonica and vocals\nRich Kirch - Guitar \nKeith Crossan -Tenor saxophone\nAustin DeLone - Keyboards and background vocals\nBrent Rampone -Drums\nBill Gibson - Percussion and background vocals\n\nSome will tell you that chance would have it, others that chance does not exist. Coincidence or not, the meeting of these two American bluesmen, Billy C. Farlow and Rich Kirch, will mark the coming years. Their  first album together, \"Alligator Crawl\", is very imposing and powerful. \n\nHow two musicians who lived away from the continent, and had never met, and how they could produce such an album? How can two such strong personalities that they each have, complement each other? How their talents could merge to produce such a shimmering jewel? It is very simple, some will say. \n\nThis is the chance. Others will tell you that no, there is no chance, and that these two would meet each other one day, to offer one of the best blues albums of the past twelve months. \n\nCoincidence or not, Billy Farlow and Rich Kirch are arguably some of the best at what they do because the Farlow-Kirch Band their is also their great machine. On vocals and harmonica, the former leader of Commander Cody and His Lost Planet Airmen, Billy C. Farlow and six strings, Rich Kirch, guitarist and bandleader of the group who accompanied John Lee Hooker during his 13 years, until the end of the road.\n\nThe encounter between these two figures of Blues takes place during a party organized by Kurt Crowbar Kangus, they discover also be a mutual friend. Rich came with his guitar, Billy with his harmonica, and later in the evening, they embark on a jam with this feeling that something very spirited is happening. Coincidence or not, they also discover that they both, with thirty years apart, crossed paths with the same great Mr. Blues, John Lee Hooker. \n\nThere is a longtime friend of Billy, Scott Bates, who was manager of the CC & HLPA for over ten years, feels that during this evening with Kurt Kangus it goes something great between Billy and Rich, something strong, power of ten, he suggests that they go into the studio and record an album. This will  be \"Alligator Crawl\". Billy dives into his personal life to draw inspiration needed to sign securities deeply hued blues: 'Crack in the Wall', for example, written in memory of his friend Lance Dickerson, drummer for Commander Cody, who had committed suicide two years before.\n\nThat night, they click, and the album \"Alligator Crawl\"  is recorded shortly after in a few days, making Billy reapply for the occasional ex-cronies Commander Cody and His Lost Planet Airmen, including Austin Delone on keyboards and Keith Crossan's excellent sax. \n\nWhat could be more normal too, for these two great bluesmen that by closing this album with  \"I'm in the Mood\", as a tribute to John Lee Hooker, with whom Billy played in the 60s, and in whose shadow Rich assured during the last 13 years of the life of master roles guitarist and bandleader. Coincidence or not, thirty years after Billy, Rich had crossed the road turn JLH, to borrow up to its terminus. \n\n\nBilly C. Farlow: an authentic pure southern bluesman\n\nBilly C. Farlow was immersed in early music, attracted by both the gospel by Elvis Presley, Buddy Holly, Lightning Hopkins, ... and John Lee Hooker. In their family, everyone plays an instrument, except his mother who sings, grandfather played guitar, learnt from his great-grandfather who was a banjo lover, his father played the piano, and his brother played guitar.  At 8 years old Billy started playing the ukulele, and at age 14, he bought his first guitar, and a year later, he played his first harmonica. \n\nThe juke joint was banned for at least 21 years and was the window through which Billy discovers and observes the visiting musicians. At home, he listened to albums by Slim Harpo, Sonny Boy Williamson II, Howlin 'Wolf, and practised on the harmonica and guitar.In the southern States where he grew up, Billy became very immersed in religion, and he naturally started singing gospel, with such strong influence that his voice became so famous both within the Commander Cody and His Lost Planet Airmen, with his own group, the Billy C. Farlow Band.\n\n\nRich Kirch: born from the shadow of the great John Lee Hooker\n\nImmersed from an early age in one of the major centers of the 60s Blues, Chicago, Rich Kirch first dreamed of being a baseball star, before falling for his favorite instrument, the guitar. At age 10, he scratches his first chords, and even pretended  to be sick and not go to school and stay home to play the guitar. Like many young people of the time, he is attracted by the sound of the blues \n\nHis early influences were the Stones, Savoy Brown, Canned Heat, and Fleetwood Mac with Peter Green. \"I was totally immersed in the rock of the 60s, and not at all in the Blues, even if I liked guys like John Lee Hooker, Howlin 'Wolf, Jimmy Reed, Muddy Waters and Otis Rush\".\n\nAt 18, the young Rich spends all his time outdoors, hanging out, sealed the idea of ​​looking for work. And then, one day, when he is looking for the magazine Living Blues, a stranger leads him to Delmark Records, where he will be sure to find the journal. The stranger called Rick Kreher, is an avid blues fan and leads Rich to clubs where the greatest play ... Jimmy Reed, Hound Dog Taylor, and Muddy Waters.\n\nChance of life or not, Rick Kreher played a few years later with Muddy Waters and his band.\nBy playing with different groups and in many Chicago clubs, it was just a matter of time before Rich would cross paths with Jimmy Rodgers, Sam Lay, Charlie Musselwhite and Jimmy Dawkins. \n\nOne winter evening, he went to a club in Chicago West, The Rat Strap.  It was the kind of place where you had eyes that burned you as soon as you set foot there. There was a group playing Blues and Hip Linkchain was the leader. At the break, he came to me and asked me to play with them. We talked and exchanged phone numbers .... and a few weeks later he received a call from Jimmy Dawkins, who was looking for a guitarist because Jimmy Johnson had left the group. \n\nIn 1976, in San Francisco, Rich plays in Jimmy Dawkins Band, where he finds Boineson Sylvester on bass and Tyrone Century on drums. Michael Bloomfield and Nick Gravenites come to them and offer to do some gigs together .They play a good month  in clubs in San Francisco before Jimmy Dawkins takes his band up to Chicago to record his new album.  Coincidence or not, it is then in Chicago where Rich Kirch will meet John Lee Hooker, thus installing him in the San Francisco Bay Area for several years. \n\n\"We were about to record this album with Jimmy Dawkins Band when I learned that John Lee Hooker was also in Chicago, and he played Wise Fools Pub. \"I really wanted to see, because had never seen him play, so, I was very excited for our recording sessions\". Tyrone, our drummer, and I got to the Club as soon as we could. John Lee Hooker was sitting there, ready to play. Someone introduced me, and John told me, \"I have to play now. Well, I'll leave my chair ... \". The first gig I did with John was at the Omni in Oakland, but soon after, I had to go back to Chicago to take care of my grandfather\". \n\nRich meets Jimmy Rodgers, and Jimmy Rodgers joined the Blues Band and played with many great bluesmen like Charlie Musselwhite, but throughout this period, John Lee Hooker maintained contact with Rich. The year was 1988. \"And one day he just said, \"Why do not you come join me here? You could stay with me, and I'd take you in my group\".\n\nThe proposal is even more attractive than Rich sees in the Blues clubs in Chicago, as they close one after the other, including the famous T. Jeresso, reputed to have been one of the best Blues clubs in the world. Rich then decides to leave and join JLH in the Bay Area. \n\nThis is the time when John Lee Hooker found success and recognition after years of struggling. This is the time the album \"The Healer\", brings him a Grammy Award and becomes a worldwide success. John Lee Hooker takes a liking to Rich, who sees that John, is not only a friend but also is his mentor. He held this role as a guitarist and as a band leader for 13 years until his friends death in 2001. \n\nRich also crossed paths with big names of the six strings, such as Carlos Santana. He  also played with Tom Petty and The Heartbreakers for seven consecutive nights in sold out shows at the Fillmore in 1997. \n\n\"I really enjoyed playing with these musicians, but the greatest honor that I had, was to play with John Lee Hooker\". \n\nIn 1999, Rich Kirch recorded his first solo album, \"Augusta Boulevard Blues\", on which there are many friends of Rich: John Lee Hooker, of course, but Big Walter Horton, Sam Lay, Charlie Musselwhite, Freddie Roulette, and Pete Sears Deacon Jones. \n\nOne of the songs, 62 Powder Blues, was co-written by Rich Kirch and Keith Richards (of the Rolling Stones). The story goes that it was at a party hosted by John during the recording 'Crawlin 'Kingsnake', title to which Keith plays guitar with John, Rich offers Keith to play with the Epiphone Zephyr. JLH and he also connects his guitar and these are two friends who jam together. \n\nLater in the evening, Rich shows Keith that he has a guitar, a blue 1962 Stratocaster Powder, which was the Magic Strat. Keith replied laughingly that '62 Blues Power' could be a very good title song. Rich takes the pen and JLH an emptysheet, the first paper that comes into his hands, and began to write ... then he hands the pen to Keith, who wrote the first verse of what will be '62 Powder Blues' before sealing the envelope  and giving it to Rich and telling him \"Happy Birthday Rich!\" ... because it was a party organized by JLH.  \n\n <a href=\"https://www.last.fm/music/Farlow-Kirch+Band\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
