{"artist":{"name":"Finntroll","mbid":"14962b84-c46a-490b-b6a0-ee69c78b2291","url":"https://www.last.fm/music/Finntroll","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/559eb54dbb3d4925a1a0ba0b08a51718.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/559eb54dbb3d4925a1a0ba0b08a51718.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/559eb54dbb3d4925a1a0ba0b08a51718.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/559eb54dbb3d4925a1a0ba0b08a51718.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/559eb54dbb3d4925a1a0ba0b08a51718.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/559eb54dbb3d4925a1a0ba0b08a51718.png","size":""}],"streamable":"0","ontour":"1","stats":{"listeners":"362560","playcount":"21519076"},"similar":{"artist":[{"name":"Korpiklaani","url":"https://www.last.fm/music/Korpiklaani","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4be756dc14d64586a5e77ee1b5170371.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4be756dc14d64586a5e77ee1b5170371.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4be756dc14d64586a5e77ee1b5170371.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4be756dc14d64586a5e77ee1b5170371.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4be756dc14d64586a5e77ee1b5170371.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4be756dc14d64586a5e77ee1b5170371.png","size":""}]},{"name":"Ensiferum","url":"https://www.last.fm/music/Ensiferum","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/40e20a63c0394dde8be682af2da0b9c7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/40e20a63c0394dde8be682af2da0b9c7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/40e20a63c0394dde8be682af2da0b9c7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40e20a63c0394dde8be682af2da0b9c7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40e20a63c0394dde8be682af2da0b9c7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40e20a63c0394dde8be682af2da0b9c7.png","size":""}]},{"name":"Moonsorrow","url":"https://www.last.fm/music/Moonsorrow","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/498ad6931b28435a935236b1b883f4bb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/498ad6931b28435a935236b1b883f4bb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/498ad6931b28435a935236b1b883f4bb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/498ad6931b28435a935236b1b883f4bb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/498ad6931b28435a935236b1b883f4bb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/498ad6931b28435a935236b1b883f4bb.png","size":""}]},{"name":"TrollfesT","url":"https://www.last.fm/music/TrollfesT","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4efe6dc1f0e44c28acdc9c244dfd645f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4efe6dc1f0e44c28acdc9c244dfd645f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4efe6dc1f0e44c28acdc9c244dfd645f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4efe6dc1f0e44c28acdc9c244dfd645f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4efe6dc1f0e44c28acdc9c244dfd645f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4efe6dc1f0e44c28acdc9c244dfd645f.png","size":""}]},{"name":"Turisas","url":"https://www.last.fm/music/Turisas","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2bad620d399b4237adf0a80812d71f84.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2bad620d399b4237adf0a80812d71f84.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2bad620d399b4237adf0a80812d71f84.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2bad620d399b4237adf0a80812d71f84.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2bad620d399b4237adf0a80812d71f84.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2bad620d399b4237adf0a80812d71f84.png","size":""}]}]},"tags":{"tag":[{"name":"folk metal","url":"https://www.last.fm/tag/folk+metal"},{"name":"black metal","url":"https://www.last.fm/tag/black+metal"},{"name":"viking metal","url":"https://www.last.fm/tag/viking+metal"},{"name":"finnish","url":"https://www.last.fm/tag/finnish"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Finntroll/+wiki"}},"published":"11 Feb 2006, 18:30","summary":"Finntroll is a folk metal band from Helsinki, Finland. They combine elements of black metal and folk metal. Finntroll's lyrics are mostly in Swedish, the only exception being the song \"Madon Laulu\" on Visor Om Slutet. Finntroll's first singer Katla decided to use Swedish over Finnish since he was part of a Swedish-speaking minority in Finland and the sound of the language seemed to better suit the band's \"trollish\" outfit. Despite several vocalist changes, this tradition has continued. <a href=\"https://www.last.fm/music/Finntroll\">Read more on Last.fm</a>","content":"Finntroll is a folk metal band from Helsinki, Finland. They combine elements of black metal and folk metal. Finntroll's lyrics are mostly in Swedish, the only exception being the song \"Madon Laulu\" on Visor Om Slutet. Finntroll's first singer Katla decided to use Swedish over Finnish since he was part of a Swedish-speaking minority in Finland and the sound of the language seemed to better suit the band's \"trollish\" outfit. Despite several vocalist changes, this tradition has continued.\n\nAccording to bandmembers Vreth and Skrymer, they took their name from an old Finnish legend where Swedish priests coming to Finland had an encounter with a wild-looking man who killed most of their party. The survivors came back bearing the tale of the Finn-Troll.\n\nFinntroll's lyrics mainly deal with legends and tales revolving around the fictional Troll-King \"Rivfader\" and the trolls fighting against the Christians who entered their lands and spread their beliefs. A recurring theme is the story of two priests named \"Aamund\" and \"Kettil\". The first three full length albums feature a rather short but fierce song about the two men who constantly get themselves into trouble with the trolls, only to get beaten up and mutilated over and over again by the wrathful followers of Rivfader.\n\nTo date, the band's discography includes six full-length albums, a live album and two EPs. Their newest studio album Blodsvept was released on March 22, 2013. In 2014, the band released the live album, Natten Med De Levande Finntroll (\"Night of the Living Finntroll\").\n\nFinntroll was founded in 1997 with a line-up which included guitarist Teemu \"Somnium\" Raimoranta and vocalist/lyricist Jan \"Katla\" Jämsen. A year later they were joined by guitarist Samuli \"Skrymer\" Ponsimaa, drummer Samu \"Beast Dominator\" Ruotsalainen, keyboardist Henri \"Trollhorn\" Sorvali and bassist Sami \"Tundra\" Uusitalo, creating the first stable line-up of the band. The band's first demo, Rivfader, released the same year.\n\nTheir second album, Jaktens Tid, was released in 2001. The following summer, the band had their first time playing festivals in Finland and other countries.\n\nThe year after the release of the album Jaktens Tid proved to be a misfortune for Finntroll: some tours had to be cancelled, and vocalist Jämsen had to retire from the band due to a viral-based tumor in his vocal cords which could not be removed surgically; he retired after the release of the EP Visor Om Slutet.\n\nSaid EP was recorded in early January 2003, in a forest cabin near Helsinki. It was an \"acoustical experiment\", where Jämsen and the new vocalist Tapio Wilska (of Sethian and Lyijykomppania) shared the singing duties among them. Visor Om Slutet was released as a mid-price EP and held rank on the Finnish midprice chart for several weeks.\n\nOn March 16, 2003, shortly before the release of Visor Om Slutet, guitarist Teemu Raimoranta died when he fell off a bridge in Hakaniemi, Helsinki. Although they had lost one of their last remaining founding members in this tragic event, the band did not dissolve, but after some time decided to go on, touring Europe for two weeks, supported by the band Katatonia. Guitarist Mikael Karlbom was hired as a replacement for Raimoranta.\n\nIn 2004, the band released an EP, Trollhammaren (\"The Trollhammer\"), a prequel to the soon to follow album Nattfödd (\"Nightborn\"). Also in 2004, Trollhorn stopped touring with the band, prompting touring musicians to be hired to fill the void left in his absence.\n\nOn January 29, 2006, Tapio Wilska, vocalist of the band since 2002, was fired from the band. In a statement issued on the band's website, Wilska states that he would like to keep the reason for his dismissal private.\n\nFollowing Wilska's parting with the band, they decided to take on Mathias \"Vreth\" Lillmåns of Chtonian and Twilight Moon as a full-time member on vocals.\n\nA new album, titled Ur Jordens Djup (\"From the Depths of the Earth\"), was released March, 2007. This fourth album put more emphasis on epic keyboard riffs with very loud but melodic guitar. Former vocalist Katla was brought in to write the lyrics for this album, and continues in this capacity with the band. The last song contains an acoustic hidden track entitled Trollvisan which can be heard at 11:03 minutes. It is commonly believed to be the installment's \"Aamund och Kettil-Song\", yet there is no mention of the two priests in the lyrics, the song rather refers to \"de kristna\" (\"the Christians\") in general.\n\nThe band has recorded a live performance for its upcoming first live DVD. A release date is yet to be confirmed. They have released their fifth album, titled Nifelvind (\"Underworld's Winds\"), and Katla has again written the lyrics. The progress on the album was recorded by Trollhorn in a studio diary. On January 15, 2010 Finntroll released a music video for the new song \"Solsagan\" on their MySpace page in preparation for the album release. The new album was then released in February 2010.\n\nThe band's sixth studio album Blodsvept was released on March 25th, 2013.\n\nOn May 12th, 2014, the band announced through Facebook that their drummer Samu \"Beast Dominator\" Ruotsalainen was amicably departing the band.\n\nIn June of 2014, the band released it's long-awaited live album, Natten Med De Levande Finntroll (\"Night of the Living Finntroll\"). Thomas Woroniak from RockRevolt Magazine™, stated \"Natten Med De Levande Finntroll is a must-have for any dedicated Finntroll fan. Followers of the group have been waiting a long time for a live recording...the music is unique and vibrant in color and tonality, and the performance is exceptional.\" <a href=\"https://www.last.fm/music/Finntroll\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
