{"artist":{"name":"Fiona","mbid":"aecb7503-0ec7-4ce2-93a0-623094843460","url":"https://www.last.fm/music/Fiona","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c0d124821094445bade6038ecd0957f4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c0d124821094445bade6038ecd0957f4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c0d124821094445bade6038ecd0957f4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c0d124821094445bade6038ecd0957f4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c0d124821094445bade6038ecd0957f4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c0d124821094445bade6038ecd0957f4.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"8881","playcount":"86411"},"similar":{"artist":[{"name":"Romeo's Daughter","url":"https://www.last.fm/music/Romeo%27s+Daughter","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/99d7bb91b1b430f93f83dc23a3df4e90.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/99d7bb91b1b430f93f83dc23a3df4e90.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/99d7bb91b1b430f93f83dc23a3df4e90.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/99d7bb91b1b430f93f83dc23a3df4e90.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/99d7bb91b1b430f93f83dc23a3df4e90.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/99d7bb91b1b430f93f83dc23a3df4e90.png","size":""}]},{"name":"Saraya","url":"https://www.last.fm/music/Saraya","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3e548bf422644fc197f9f80a9a2cf348.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3e548bf422644fc197f9f80a9a2cf348.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3e548bf422644fc197f9f80a9a2cf348.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e548bf422644fc197f9f80a9a2cf348.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e548bf422644fc197f9f80a9a2cf348.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e548bf422644fc197f9f80a9a2cf348.png","size":""}]},{"name":"Deborahe Glasgow","url":"https://www.last.fm/music/Deborahe+Glasgow","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/172a07822c7c464784fe92054ddf0412.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/172a07822c7c464784fe92054ddf0412.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/172a07822c7c464784fe92054ddf0412.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/172a07822c7c464784fe92054ddf0412.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/172a07822c7c464784fe92054ddf0412.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/172a07822c7c464784fe92054ddf0412.png","size":""}]},{"name":"Chrissy Steele","url":"https://www.last.fm/music/Chrissy+Steele","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3934fc7ed25f41e786e80676414ad221.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3934fc7ed25f41e786e80676414ad221.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3934fc7ed25f41e786e80676414ad221.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3934fc7ed25f41e786e80676414ad221.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3934fc7ed25f41e786e80676414ad221.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3934fc7ed25f41e786e80676414ad221.png","size":""}]},{"name":"Mark Free","url":"https://www.last.fm/music/Mark+Free","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a94aa941b66842b1b633e7f61f476da2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a94aa941b66842b1b633e7f61f476da2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a94aa941b66842b1b633e7f61f476da2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a94aa941b66842b1b633e7f61f476da2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a94aa941b66842b1b633e7f61f476da2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a94aa941b66842b1b633e7f61f476da2.png","size":""}]}]},"tags":{"tag":[{"name":"AOR","url":"https://www.last.fm/tag/AOR"},{"name":"hard rock","url":"https://www.last.fm/tag/hard+rock"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"80s","url":"https://www.last.fm/tag/80s"},{"name":"reggae","url":"https://www.last.fm/tag/reggae"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Fiona/+wiki"}},"published":"29 Sep 2007, 23:35","summary":"There are multiple artists with the name Fiona. The first bio is for the 80s Fiona who is the most played artist, the rest are in first come first listed basis. \n\n1. Fiona (born Fiona Flanagan in Phillipsburg, New Jersey, September 13, 1961) is an American rock music singer.\n\nThere are videos for the songs “Talk To Me” from Fiona, “Hopelessly Love You” and “Living In A Boy’s World” from Beyond The Pale, “Everything You Do (You’re Sexing Me)” from Heart Like A Gun <a href=\"https://www.last.fm/music/Fiona\">Read more on Last.fm</a>","content":"There are multiple artists with the name Fiona. The first bio is for the 80s Fiona who is the most played artist, the rest are in first come first listed basis. \n\n1. Fiona (born Fiona Flanagan in Phillipsburg, New Jersey, September 13, 1961) is an American rock music singer.\n\nThere are videos for the songs “Talk To Me” from Fiona, “Hopelessly Love You” and “Living In A Boy’s World” from Beyond The Pale, “Everything You Do (You’re Sexing Me)” from Heart Like A Gun, “Hearts Of Fire” from the Heart Of Fire soundtrack, and “Where the cowboys go” from “Heart like a gun”. The Hearts of Fire (soundtrack) features 4 exclusive otherwise unreleased songs from Fiona.\n\nShe also guested on Warrant’s Cherry Pie album, and acted in the movie Hearts of Fire Winger members Kip Winger, Reb Beach, and Rod Morgenstein have played on Fiona’s albums.\n\nFiona was once married to producer Beau Hill, who produced, played some instruments on, and sang backing vocals on, some of her albums. She was also in a relationship with guitarist Reb Beach of Winger who likewise performed on her album “Beyond The Pale”.\n\nIn 2011, she released a new album, Unbroken.\n\nDiscography:\n\n* Fiona (1985)\n* Beyond the Pale (1986)\n* Heart Like A Gun (1989)\n* Squeeze (1992)\n* Unbroken (2011)\n\n2. Fiona is also a now defunct rock band from Orange County, California\n\n3. Fiona Hoi-Kei Sit (薛凱琪) is a female Cantopop singer and actress from Hong Kong.\n\n4. Born 26 years ago in Jubilee hospital, Kingston, Jamaica on a cold Wednesday morning, Fiona Robinson announced her arrival to the world.\n\nAfter the first five to six years of her life were spent with her grandmother in Tivoli Gardens, Fiona moved to Washington Gardens to be closer to her mother. It was during this time she realized her budding passion for music and singing.\n\nSurrounded by aunts and uncles who were in choirs, a father who is a drummer, another uncle who was a DJ on JBC radio and Power FM and family friends such as Dean Frazier, Fiona’s musical journey was just about to begin.\n\n \nAs an only child, Fiona enjoyed her own company, but also found herself loving the spotlight that went with it; the same spotlight that would soon join her on stage. On many Sundays she would listen to her uncle rotate his DJ selections for his upcoming radio slot. Soon, Fiona knew most of the songs she heard and had committed to memory including the Bob Marley special played by her Father when she was only three years old, and she could sing along with them as confidently as Bob Marley himself.\n\nA student of Mico Practicing All Age School, Fiona remembers prior student Nadine Sutherland visiting the school after she became a household name and watching her fellow students full of excitement. Fiona dreamed of the same success and became even more determined to make it as a singer, telling herself \" I want to be her someday!\"\n\nShe began singing at Raleigh's Key Club while still at school and, as a poetic youngster, she found it easy to write lyrics, putting them to music from an early age. Influenced by some of the great divas of that time, Pam Hall, Marcia Griffiths, Chevelle Franklin, Gladys Knight, Aretha Franklin, Patti Labelle, Brandy and Monica amongst others, Fiona spent her spare time listening to and imitating these remarkable talented women, even now.\n\nDuring her young teens, Fiona participated in a concert program for young talent presented by Jamaica's JBC television station. Her audition piece was a rendition of a popular Regina Belle song, and this performance caught the producer’s attention and earned her a regular spot on the weekly show \"Concert Time .\" From there she was included in many similar productions including the premiere spot at the \" Santa's Enchanted Village\"- a Christmas type grotto, where she sang in several performances over the course of the evening. Fiona sang every song in accapella and wooed the audience evening after evening.\n\nShe was discovered in her later teen years whilst relaxing at home. Answering the phone one afternoon, she was asked to hold the line for a moment, Fiona continued singing to herself without realizing that the person on the other end of the phone was producer Kelvin Simmons who returned to the phone thinking that the radio was playing. As soon as he discovered it was the same young lady who had answered the phone, he did not waste any time!\n\nWithin days Fiona found herself in the studio recording her first single. She describes her first experience in the studio as a totally incredible experience, actually being in a studio where other great artists had probably stood and sang before her! Nevertheless, a natural in the studio, Fiona recorded her first single \"You Mean The World To Me\" previously done by Toni Braxton and, Fiona even sang her own backing vocals, something that the studio crew found quite remarkable for such a new artiste.\n\nNow a second home to her, Fiona found herself in the studio on a regular basis from 17 years of age, juggling a job and studio work. This led to her eventually meeting sound engineer Jason Sterling and producer Lloyd Campbell who were ready to take her to the next level of her career.\n\nFiona's first recording on the Joe Frasier record label was \"For You I Will \" a cover version of a recent Monica song. This was musically her first big project in the studio, as she met with other vocalists who helped her develop her vocal skills. She also developed a deeper knowledge of backing vocals during this time and also a good strong work ethic. What she remembers most was how she felt so good to be surrounded by continuous positive vibes. Now that she was on her way forward, she had people around her who could really project her into the career she had always dreamt of being a part of.\n\nAs Fiona's recording career grew, she found herself meeting and working with some of the best artists, producers, engineers and musicians in the industry. From Pam Hall who she describes as her teacher, and one of her biggest fans, to Richie Stevens, Tanto Metro & Devonte, Patrick Roberts, J.C. Lodge, the late Cynthia Sloss, Glen Washington, Lukie D, Lexus, Singing Melody, Rik Rok, Shaggy, Kashief and Nikeisha Lindo, Willie Lindo, Kirk Davis (Little Kirk) Jon B. and the infamous Beenie Man, whom she had the privilege of being on tour with in Japan. These are a few of the many entertainers she describes as having the pleasure to work with in some shape or form.\n\nOne of her most memorable occasions to date, was her performance at South Florida's Reggae Soca Awards Show earlier in 2001. This is where Fiona won an award for \"Female Vocalist Of The Year,\" her second award in this category and a very special moment for her receiving this award and, she took time to acknowledge her mother who flew in from Jamaica to be with her on this prestigious event, at which time Fiona broke into tears because her Mother plays the most important role in her life; her number one fan. Fiona took center stage and was able to perform a song she loved, in a style that her fans could really appreciate. \"No More Lonely Nights\" was the track she chose and it was received incredibly well by her audience.\n\nSo several years later after Fiona first entered the recording studio, where is Fiona now compared to her peers? \"Well there isn't any competion between us female singers, we all love each other\" says Fiona. As the proud recipient of several music awards, it's obvious where her fans rate her. Whilst it isn't a competition to Fiona, who has worked alongside many of her female counterparts, she enjoys the recognition and the appreciation that goes along with her success. \"The view from the top is good!\"\n\nFiona has recently released a gospel album in the UK, aptly titled \" He Cares\" that boasts a different type of gospel music, not a traditional sound, but ranging from reggae through jazz, Hip Hop and R&B influences. This is only the beginning for Fiona as she expresses a future desire to work with some of the current greats in R&B, including Babyface, who she admires for his musical arrangements, since her teen years, Sean \" Puffy \" Combs, Freddie and Rodney Jerkins, Missy Elliot and Timberland, as well as Mariah Carey and the king of pop and a musical genius, Micheal Jackson.\n\nHer first album released with Joe Frasier Records in 1999 \" Fiona's Moment\" is followed by her latest release \" Wanna Make Love\". An album that promises to take you on a musical journey from it's opening melody to the very last beat. It boasts 18 superb songs on CD ranging from gospel inspired tracks, conscious lyrics, heart warming love songs to uplifting fast moving melodies, guaranteed to lift your mind, body and soul.\n\nThe incredible voice of Fiona has come a long way over the years, something that can only be gained through determination and experience. The artist Fiona has also matured over the years and does not take her success for granted. \"You can't do it alone, no one can\", she says, \" I wouldn't be here today if I didn't have the love and support of my family and friends, and the mercy of GOD\".\n\nStill on the tip of the iceberg, Fiona Robinson has arrived. This is her time now. This is Fiona's Moment!\n\n5. Rock band from Benguela, Angola featuring Fiona's Avril Lavigne style teen pop vocals mixed with death Metal.\n \nVocals: Fiona, Ladino\nGuitar/Bass: Costinha\nDrums: Bodão\n\n <a href=\"https://www.last.fm/music/Fiona\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
