{"artist":{"name":"Fiona Sit","url":"https://www.last.fm/music/+noredirect/Fiona+Sit","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7f7ddea96ef84c81884e4bf2ac7163fa.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7f7ddea96ef84c81884e4bf2ac7163fa.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7f7ddea96ef84c81884e4bf2ac7163fa.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f7ddea96ef84c81884e4bf2ac7163fa.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f7ddea96ef84c81884e4bf2ac7163fa.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f7ddea96ef84c81884e4bf2ac7163fa.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"0","playcount":"0"},"similar":{"artist":[]},"tags":{"tag":[{"name":"chinese","url":"https://www.last.fm/tag/chinese"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"mandarin","url":"https://www.last.fm/tag/mandarin"},{"name":"cpop","url":"https://www.last.fm/tag/cpop"},{"name":"pop","url":"https://www.last.fm/tag/pop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/Fiona+Sit/+wiki"}},"published":"29 Dec 2006, 19:34","summary":"Fiona Hoi-Kei Sit (Traditional Chinese:薛凱琪, born 11 August 1981) is a female Cantopop singer and actress from Hong Kong. She entered the music industry through her uncle's connections with Warner Music Group, Hong Kong. Impressed by her vocal talent and good looks, Warner Music warmly recruited her as a new rising star of year 2004.\n\nFiona Sit released her first album F Debut in 2004. It became a best-seller in Hong Kong, being certified gold for sales in excess of 25,000 copies. <a href=\"https://www.last.fm/music/+noredirect/Fiona+Sit\">Read more on Last.fm</a>","content":"Fiona Hoi-Kei Sit (Traditional Chinese:薛凱琪, born 11 August 1981) is a female Cantopop singer and actress from Hong Kong. She entered the music industry through her uncle's connections with Warner Music Group, Hong Kong. Impressed by her vocal talent and good looks, Warner Music warmly recruited her as a new rising star of year 2004.\n\nFiona Sit released her first album F Debut in 2004. It became a best-seller in Hong Kong, being certified gold for sales in excess of 25,000 copies.[2] The album contained the hit ballad \"XBF\" (short for ex-boyfriend) and another hit \"Keanu Reeves' Reply.\"\n\nOn 7 January 2005, Warner Music released a single of her named 886. It included songs such as \"Pumpkin Wagon\" and \"886\", which is a short term of Byebye in Cantonese ICQ language. The single was a huge success and it was sold out within 3 weeks.\n\nShortly after the release of her 886 single, Fiona went on to film her first TV series \"The Academy\" (學警雄心) as a female police trainee. To match the character's circumstances, Fiona cut her hair short, as shown in the picture. In contrast to her past success, fans responded atrociously towards this change in her image, and were wary of her future career decisions. In addition to this, Fiona was also featured in a weight loss product tv commercial, where she was required to do a hideous dance routine. These two incidents led to numerous mockeries by the Hong Kong media, and dramatically decreased her fanbase.\n\nWarner Music released her second album, Funnygirl, in April 2005. Its success resulted in the release of Funnygirl (2nd Edition), which included a DVD with her music videos, including the #1 single \"A Boy Like You\".\n\nHer third album, Me, was another CD+DVD combination released on 23 December 2005. It included the song \"Love\", which was featured in the film Embrace Your Shadow, which Fiona starred in. The DVD was a live concert footage of her \"903 Fiona 0811\" performance.\n\nShe has won a number of awards, including a gold award for best female newcomer at the Hong Kong Music Awards, as well as a gold award for the song \"Keanu Reeves' Reply.\" [3]\n\nIn 2006, Fiona raised some controversy with her video clip for \"Tong But Lut\" as it hold great resemblance to the video clip of \"ourselves\" by Japanese superstar Ayumi Hamasaki. Her song \"Dear Fiona\" is a cantonese version of the song YUI - Tomorrow's Way.\n\nFiona's official fan club, Club F was established on August 11,2006 which was her 25th birthday. Her 4th album \"Electric Angel\" was released on the same day as well. A fans gathering was held in a Chinese restaurant in Wan Chai. Almost 200 fans attended the gathering. <a href=\"https://www.last.fm/music/+noredirect/Fiona+Sit\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
