{"artist":{"name":"Alkonost","mbid":"ab5cdc1a-c621-4b27-b2ec-36969b6e2b0d","url":"https://www.last.fm/music/Alkonost","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/37057933eb6549f287c78ccb48a0f69f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/37057933eb6549f287c78ccb48a0f69f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/37057933eb6549f287c78ccb48a0f69f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37057933eb6549f287c78ccb48a0f69f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37057933eb6549f287c78ccb48a0f69f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37057933eb6549f287c78ccb48a0f69f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"31564","playcount":"765775"},"similar":{"artist":[{"name":"Грай","url":"https://www.last.fm/music/%D0%93%D1%80%D0%B0%D0%B9","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d923b0f4484f47f8938eb9a7723e8d33.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d923b0f4484f47f8938eb9a7723e8d33.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d923b0f4484f47f8938eb9a7723e8d33.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d923b0f4484f47f8938eb9a7723e8d33.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d923b0f4484f47f8938eb9a7723e8d33.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d923b0f4484f47f8938eb9a7723e8d33.png","size":""}]},{"name":"Аркона","url":"https://www.last.fm/music/%D0%90%D1%80%D0%BA%D0%BE%D0%BD%D0%B0","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7b05f102efea4231ae91c37b229125c9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7b05f102efea4231ae91c37b229125c9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7b05f102efea4231ae91c37b229125c9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b05f102efea4231ae91c37b229125c9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b05f102efea4231ae91c37b229125c9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b05f102efea4231ae91c37b229125c9.png","size":""}]},{"name":"Невидь","url":"https://www.last.fm/music/%D0%9D%D0%B5%D0%B2%D0%B8%D0%B4%D1%8C","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a0612b171cae488d8d95f345c79d72cf.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a0612b171cae488d8d95f345c79d72cf.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a0612b171cae488d8d95f345c79d72cf.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a0612b171cae488d8d95f345c79d72cf.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a0612b171cae488d8d95f345c79d72cf.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a0612b171cae488d8d95f345c79d72cf.png","size":""}]},{"name":"Pagan Reign","url":"https://www.last.fm/music/Pagan+Reign","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e4053c0899364d479d57e17d80892c93.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e4053c0899364d479d57e17d80892c93.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e4053c0899364d479d57e17d80892c93.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e4053c0899364d479d57e17d80892c93.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e4053c0899364d479d57e17d80892c93.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e4053c0899364d479d57e17d80892c93.png","size":""}]},{"name":"Butterfly Temple","url":"https://www.last.fm/music/Butterfly+Temple","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a215b1cea74c4984a0846f4824c26a06.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a215b1cea74c4984a0846f4824c26a06.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a215b1cea74c4984a0846f4824c26a06.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a215b1cea74c4984a0846f4824c26a06.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a215b1cea74c4984a0846f4824c26a06.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a215b1cea74c4984a0846f4824c26a06.png","size":""}]}]},"tags":{"tag":[{"name":"folk metal","url":"https://www.last.fm/tag/folk+metal"},{"name":"pagan metal","url":"https://www.last.fm/tag/pagan+metal"},{"name":"black metal","url":"https://www.last.fm/tag/black+metal"},{"name":"russian","url":"https://www.last.fm/tag/russian"},{"name":"russian metal","url":"https://www.last.fm/tag/russian+metal"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Alkonost/+wiki"}},"published":"02 Nov 2006, 18:49","summary":"Folk Metal band from Naberezhnye Chelny, Tatarstan, Russia.\nAlkonost is the goddess of the land of the dead. She is pictured as a half-woman/half-bird.\n\n\"Waiting\" official video: https://youtu.be/lkzVeiTkbPQ\n\"The Night Before the Battle\" official video: https://youtu.be/ZaCNnlshbtU\n\n\nhttp://alkonost.ru\nhttp://vk.com/club466384\nhttp://www.facebook.com/pages/Alkonost-Official/174337970676\nhttp://www.myspace.com/alkonostrussia\n\nLine-up:\nDmitriy Sokolov - Rhythm guitar <a href=\"https://www.last.fm/music/Alkonost\">Read more on Last.fm</a>","content":"Folk Metal band from Naberezhnye Chelny, Tatarstan, Russia.\nAlkonost is the goddess of the land of the dead. She is pictured as a half-woman/half-bird.\n\n\"Waiting\" official video: https://youtu.be/lkzVeiTkbPQ\n\"The Night Before the Battle\" official video: https://youtu.be/ZaCNnlshbtU\n\n\nhttp://alkonost.ru\nhttp://vk.com/club466384\nhttp://www.facebook.com/pages/Alkonost-Official/174337970676\nhttp://www.myspace.com/alkonostrussia\n\nLine-up:\nDmitriy Sokolov - Rhythm guitar\nAndrey \"Elk\" Losev - Lead guitar\nMaksim Shtanke - Bass/Vocals\nKsenia Pobuzhanskaya - Vocals\n\nDiscography:\nShadows Of Glory - Demo, 1997 \nShadows Of Timeless - Demo, 1997\nSongs Of The Eternal Oak - Full-length, 2000\nSpirit Tending To Revolt - Demo, 2001\nMemoris - Best of/Compilation, 2001\nНеведомые земли - Demo, 2001\nAlkonost - Best of/Compilation, 2002\nBetween The Worlds - Full-length, 2004\nThe Path We've Never Made - Full-length, 2006\nStone Heart Blood - Full-length, 2007\nPesni Vechnogo Dreva - Full-length, 2007\nOn The Wings Of The Call - Full-length, 2010\n\nThe history of Alkonost dates back to the late 1995, when bassist Elk (who was a member of such metal bands such as Molestation, Canonis etc.) decided to start his own metal project. He conceived an idea of music which would be based on European medieval music and Russian folk melodies. These ideas appeared after Elk became acquainted with Belorussian musicians, the future members of metal band Gods Tower. They showed him different recordings of European folk and pagan music as well as their own demos and he found himself deeply impressed.\n\nWithin some time, Elk experimented on the original sound of the proposed band and selected the musicians for it. The young Alex Nightbird was one of his apprentices, who learned to play bass from Elk. In fact, he couldn’t but come under Elk’s influence and was inspired by the magic sounds of various folk music records he had heard from the teacher. So, a year later all these efforts resulted in formation of the band named Alkonost.\n\nThe 1996 line-up included three musicians: Elk – guitars, Alex Nightbird – bass, Kooker – guitars. This line-up lasted until the August 1997 and recorded the Shadows Of Timeless rehearsal tape as well as the Shadows Of Glory demo. Kooker (the author of one of the best songs of early period Shadows Of Dark Days) left the band. As the line-up wasn’t at full strength, the subsequent performances by the band were backed by electronic drums and a session vocalist borrowed from a local band. Elk and Nightbird were not satisfied with such situation, so they decided to give up the gigs for some time in order to concentrate upon work in studio.\n\nIn 1998–2000 Alkonost recorded the album Songs Of The Eternal Oak. The guys spent much time searching for worthy and appropriate male vocalist for the band, but failed. No one could sing and scream, as it was required. Finally, Alex Nightbird contributed the vocals himself. It was his first experience as a singer. At the same time, drummer Vladimir Lushin (VL) entered the band and Alkonost got back to live performances. In December 1998, Alkonost took part in metal fest The End Of Days-2. This gig became significant for the band and made a good start for further live acts. In February 1999 a keyboardist, in the form of the nice girl Almira, was invited to play in Alkonost. In March 1999, Alkonost won The Audience Choice Prize at the Rock Land-2 regional festival, and in September 1999, were voted the most popular group in the Naberezhnye Chelny city.\n\nThe year 2000 was no less successful for the band. The full-length album Songs Of The Eternal Oak presentation took place in January and in May. Two foreign labels released Songs Of The Eternal Oak at once – Latvian label Beverina Productions and German label Ketzer Records. Inspired by these events Alkonost went on with the live performances, although the stage technical equipment as a rule was far from ideal. In November, the video “Years Of Prophecy” was released and in December the band went to the studio for the Spirit Tending To Revolt demo recording. For this demo, Elk wanted to use the female choir. Therefore, the musicians began to look for the singers and finally discovered four girls. To the great surprise of Elk and Nightbird one of them sang with an astoundingly sweet and charming voice! The girl’s name was Alyona. Amazed by her singing Elk and Nightbird decided to invite Alyona into the band and began working with female vocals. This decidedly changed sound and style decisively altered the direction of Alkonost. Nightbird’s roaring was fusing with Alyona’s enchanting voice. The addition of English lyrics to Russian lyrics let Nightbird display the true depths of his poetic gifts.\n\nIn February 2001, VL left the band and the drummer vacancy was filled by Anton from Flaming Hate. During 2001, Alkonost were going on with live performances participating in a variety of festivals, completed the recording of Spirit Tending To Revolt and started work on the Unknown Lands demo – their first demo in Russian. Additionally, their second Alkonost video “My Last Day” was filmed.\n\nIn July 2002, the self-titled Alkonost CD was released on Beverina/Ketzer. It included the Songs Of The Eternal Oak album, Spirit Tending To Revolt demo, and 2 videos. The CD was well reviewed in the West, with the German RockHard magazine giving it 7.5 points out of 10.\n\nAlkonost did not stop for that time and continued to combine the live performances with studio sessions. In September 2002, they began to work on the new full-length album, the album in which female vocals dominated and an quite uneasy destiny would surface. Recorded both in English and in Russian versions, Between The Worlds contributed one more new page in Alkonost history. Moreover, it played a fatal role in the future troubles of the band.\n\nNevertheless, at that time the musicians were full of optimism and hopes for future, they met the 2003. This year also passed in atmosphere of local gigs and festivals. The band came to decision to make their sound heavier and that is why they invited a second guitar player. In September 2003, Dmitry Sokolov (ex-member of Flaming Hate as Anton) officially entered the band. At the end of 2003, the band signed on with Soyuz label (Russia) for the re-release of the 2002 Alkonost CD.\n\nIn 2004, Alkonost continued the extensive touring, performed in Folk Metal Fest-2 (St. Petersburg) and extended the record deal with Soyuz. In December 2004 Soyuz label released the CDs Alkonost, the English version of Between The Worlds and the Russian version titles Mezhmirie (with a little changed vocals) was scheduled. The presentation of Between The Worlds successfully took place in Moscow in December 2004 and in St. Petersburg in February 2005.\n\nDuring the 2005, the band went on tour, participating in a variety of gigs in numerous cities and was awarded as the best band of Naberezhnye Chelny for the second time.\n\nHowever, the most expected release of Mezhmirie (which was recorded even earlier than Between The Worlds) did not take place at Soyuz. Because of this stagnation a radical changes came over the band that led to the break up between the Alkonost and their manager.\n\nIn August 2005, Alkonost went to studio for the recording of the next full-length album named The Path We’ve Never Made. The album was mastered in the famous Moscow studio CDM Records. Finally Mezhmirie and The Path We’ve Never Made were released by Metalism Records in spring 2006. In April 2006, Alkonost started a massive Russian tour in support of The Path We’ve Never Made. The album’s appeal lies in the return of active male’s screaming to the music, though Alyona’s fascinating voice still plays a significant role. The Path We’ve Never Made became kind of a turning point, in which the great success of the tour put the band up to the next level. Each performance of Alkonost is remembered by audience as an emotionally saturated live act largely due to the duet of Alyona (vocals) and Alex Nightbird (bass, vocals). The album was excellently reviewed by the Russian mass media and was warmly accepted by the fan. Alkonost received many invitations for performances from a number of cites all over the Russia. The band had revived! After the tour had finished the band returned to active rehearsals and composing new music. At the same time, Alkonost got back to studio for the re-recording of Songs Of The Eternal Oak (2000) in Russian.\n\nMeanwhile CD The Path We’ve Never Made continued to get good reviews and finally it took the 1st place in one of the most significant Russian metal-charts – Top Metal Album-100, voting held by Dark City magazine. The Path We’ve Never Made was also noticed by western reviewers who had agreed that the release was outstanding.\n\nIn October 2006, work on the “Waiting” video, a long time in the making, was completed.\n\nThe celebration of Alkonost's 10th anniversary took place in the best concert hall of their native city. Besides the famous and beloved hits, the band played their new compositions.\n\nEspecially for this anniversary, the remastered version of Songs Of The Eternal Oak was prepared. The instrumental parts were not changed in order to keep the spirit and the unique atmosphere of early Alkonost. The vocals were completely re-recoreded by Alex and Alyona and one of the compositions, which was previously unreleased, included guest vocals by the frontmen of Svarga and Rarog. The restoration and mastering were done at CDM Records. The studio sessions were supervised by Sergei “Lazar” Atrashkevich (Rossomahaar, Arkona). In addition to the original Songs Of The Eternal Oak material, the CD contains a bonus track – the fully remastered Russian version of the famous hit “My Last Day”.\n\nIn February, Alkonost went on its second big tour, in 14 days they had 11 gigs in towns of the Ukraine, Moscow and St. Petersburg. Vacations after the tour were short, because the musicians went to studio to complete the recording of the second disk of the year Stone Heart Blood, which included re-recorded and re-arranged compositions, created in 1995–1997, when the body existed as a studio project, and also completely new compositions, which hadn’t entered the album The Path We’ve Never Made. Eight vocalists took part in recording of this album for making symphonic and epic sound. In that way all the development of Alkonost during 11 years, beginning from its first songs, was documented.\n\nIn June 2007 the band went on a small tour again, taking part in a concert in Sevastopol as a co-headliner of a concert with Master (Rus), and also played in Minsk as the headliner in folk-metal festival alongside the Byelorussian band Znich.\n\nIn the autumn 2007, the song “Darkness” (The Path We’ve Never Made) of Alkonost was inscribed in the compilation CD Metal Message Vol. IV, released by musical web portal www.metalmessage.de in Germany. \n\nThe first tour abroad happened in October 2007. Alkonost visited East Europe for the first time, appeared in five towns of Czech Republic and Slovakia. Having turned back on the native earth, Alkonost was met by the new release of CD Stone Heart Blood. In honor of this event a concert was organized in the native town with Arkona’s participation. The release of Stone Heart Blood and the headlining appearance at this 2-day rock-festival in Archangelsk (2007) ended the 11-year period of group-history.\n\nWinter and spring 2008 are characterized for their sparse concerts, but one acoustic concert was a success. Alyona accompanied by two acoustic guitars for the first time sang Songs from the band. There were performed such hits like “Nivushka-Niva”, “Waiting”, and “Mother-Anguish” (which was the greatest success for people in the bar).\n\nThis body went on a new tour in April, had concerts in Moscow and St. Petersburg with the famous Swedish Vikings Månegarm, along with colleagues from Arkona, Nomans Land, Kalevala. There were also performances in Ufa, Kazan, Saratov, Uljanovsk. All the concerts were timed to the debut release of DVD Alkonost In Front Of The Arkona Walls. It was shot in October 2005 during the Moscow concert in the club “Relax”. But the sound was mixed in the Moscow Sound record Studio. The DVD includes the best compositions of the body from the albums Mezhmirie and The Path We’ve Never Made, and you can see the lively stage activity of the band and traditional synchronous head-banging “helicopters”, which became the visiting card of the band, alongside the antics of their frontman.\n\nComing back from the tours the band was asked to take part in the CD compilation of the Europe pagan folk metal groups as a Russian representative. The band provided two new compositions, which opened the “new history” of Alkonost.\n\nIn the summer 2008, the band enjoyed its first holidays after 12 years of hard work. The members devoted themselves to their private lives. During the holidays, the composers of the band have written 10 new songs. This is the time for a new album.\n\n(c) 2009, Metalism Records\nhttps://www.facebook.com/Metalism.Records <a href=\"https://www.last.fm/music/Alkonost\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
