{"artist":{"name":"Foghat","mbid":"3cc3942d-bbfc-446d-a8f4-f0e1e238ca86","url":"https://www.last.fm/music/Foghat","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f48b444da69a42d5baf06d2ddb235188.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f48b444da69a42d5baf06d2ddb235188.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f48b444da69a42d5baf06d2ddb235188.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f48b444da69a42d5baf06d2ddb235188.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f48b444da69a42d5baf06d2ddb235188.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f48b444da69a42d5baf06d2ddb235188.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"417079","playcount":"2589166"},"similar":{"artist":[{"name":"Bachman-Turner Overdrive","url":"https://www.last.fm/music/Bachman-Turner+Overdrive","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0edcff0ece864baebbfe26b550cedf22.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0edcff0ece864baebbfe26b550cedf22.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0edcff0ece864baebbfe26b550cedf22.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0edcff0ece864baebbfe26b550cedf22.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0edcff0ece864baebbfe26b550cedf22.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0edcff0ece864baebbfe26b550cedf22.png","size":""}]},{"name":"Ted Nugent","url":"https://www.last.fm/music/Ted+Nugent","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/15e23f0875c74692996c60ca4cf340e9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/15e23f0875c74692996c60ca4cf340e9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/15e23f0875c74692996c60ca4cf340e9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/15e23f0875c74692996c60ca4cf340e9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/15e23f0875c74692996c60ca4cf340e9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/15e23f0875c74692996c60ca4cf340e9.png","size":""}]},{"name":"Molly Hatchet","url":"https://www.last.fm/music/Molly+Hatchet","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a872a03b63d14887b6513291c037ae33.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a872a03b63d14887b6513291c037ae33.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a872a03b63d14887b6513291c037ae33.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a872a03b63d14887b6513291c037ae33.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a872a03b63d14887b6513291c037ae33.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a872a03b63d14887b6513291c037ae33.png","size":""}]},{"name":"The Edgar Winter Group","url":"https://www.last.fm/music/The+Edgar+Winter+Group","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/245253e4653e4940be8eb2c04de1bb19.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/245253e4653e4940be8eb2c04de1bb19.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/245253e4653e4940be8eb2c04de1bb19.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/245253e4653e4940be8eb2c04de1bb19.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/245253e4653e4940be8eb2c04de1bb19.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/245253e4653e4940be8eb2c04de1bb19.png","size":""}]},{"name":"Mountain","url":"https://www.last.fm/music/Mountain","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9c3588415bdb48b5a207f9c4e17125f6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9c3588415bdb48b5a207f9c4e17125f6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9c3588415bdb48b5a207f9c4e17125f6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c3588415bdb48b5a207f9c4e17125f6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c3588415bdb48b5a207f9c4e17125f6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c3588415bdb48b5a207f9c4e17125f6.png","size":""}]}]},"tags":{"tag":[{"name":"classic rock","url":"https://www.last.fm/tag/classic+rock"},{"name":"hard rock","url":"https://www.last.fm/tag/hard+rock"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"70s","url":"https://www.last.fm/tag/70s"},{"name":"Southern Rock","url":"https://www.last.fm/tag/Southern+Rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Foghat/+wiki"}},"published":"20 May 2006, 16:19","summary":"Boogie music-inspired hard rockers Foghat started off as an idea held by musicians Roger Earl and Lonesome Dave Peverett when they first toured America in the late-60s as members of the seminal British band Savoy Brown. The two of them playing alongside guitarist Kim Simmonds, Savoy Brown was on the cutting edge of the massive British blues rock scene, and they influenced countless musicians on both sides of the Atlantic. In 1971, wanting to give a more slick <a href=\"https://www.last.fm/music/Foghat\">Read more on Last.fm</a>","content":"Boogie music-inspired hard rockers Foghat started off as an idea held by musicians Roger Earl and Lonesome Dave Peverett when they first toured America in the late-60s as members of the seminal British band Savoy Brown. The two of them playing alongside guitarist Kim Simmonds, Savoy Brown was on the cutting edge of the massive British blues rock scene, and they influenced countless musicians on both sides of the Atlantic. In 1971, wanting to give a more slick, rock n roll flavor to the boogie music they were playing with said group, Dave and Roger enlisted lead/slide guitarist Rod Price and bassist Tony Stevens to create a new band. According to Songfacts, Foghat got their name from when Peverett played a Scrabble-like game with his brother and just made up a word on the spot to suit his letters. Peverett convinced the band to go with it instead of Brandywine.\n\nSigned by rock impresario Albert Grossman to Bearsville Records in 1971, the band recorded their first LP, titled simply 'Foghat', and began touring relentlessly for the next fourteen years. Becoming one of the biggest hard rock bands of the 70s, their hard work has thus far been rewarded with seven gold records, one platinum record (1975's 'Fool For The City'), and one double-platinum record (1977's 'Foghat Live'). 'Fool For The City' brought the world Foghat’s signature song \"Slow Ride\", an iconic Top 40 hit, and cemented their place as one of the world’s top boogie / blues acts of the era. They continued to hit the charts in the 70s again and again with singles such as \"Fool for the City\", \"Drivin' Wheel\", \"I Just Wanna Make Love to You\", \"I’ll Be Standing By\", \"Stone Blue\", \"Third Time Lucky\" and \"Somebody's Been Sleeping in My Bed\"; many of which are still classic rock radio staples.\n\nFoghat toured and recorded non-stop into the mid-eighties. Tony Stevens had left the band in 1974 to pursue other interests, and was replaced by bassist Craig MacGregor (with a short stint with Nick Jameson in between). Rod Price departed the band in 1980. In 1985 Lonesome Dave returned to England for a well-deserved break from touring, while Roger remained in the US and continued to carry the Foghat flag with non-stop touring with various new musicians and Foghat alumni.\n\nIn 1989 Lonesome Dave resumed touring in the states with future member Bryan Bassett. But it is 1994 that marks the return of Foghat to the world stage, when the original members reunite for the recording of \"Return of the Boogie Men\". Being back on the road, non-stop, once again yielded a new live CD for the band titled \"Road Cases\", released in 1997.\nIn 1998, Lonesome Dave is diagnosed with cancer. He battles it with amazing strength and courage. He decides he would like to tour again in 1999. With Rod Price's decision not to resume touring, Dave calls his old friend Bryan Bassett, who is touring with Molly Hatchet and asks him to join the band. Lonesome Dave, one of the all time great rock 'n rollers, and a consummate professional, performs flawlessly night after night, doing what he loved doing best... while still undergoing chemotherapy. The tour was cut short in the fall of 1999, when Dave returns home. He sadly passes away on February 7, 2000. Family and friends are devastated. One of rock 'n roll’s legendary performers is mourned by thousands of fans.\nAs all who knew and loved Dave tried to adjust to this devastating loss, the band had to decide whether it could, or even wanted to, continue playing. Even Dave's encouragement to keep the band together and to \"Keep on rockin'\" was not enough to convince the band that they should go on. After much soul searching and support from the fans, Roger began to hesitantly review some tapes of singers. None of them seemed to have that blend of blues and rock so important to the band’s sound. Becoming quite discouraged about the prospect of finding a new singer, Roger happened to recall seeing a Humble Pie show with Dave, they wanted to see who was singing their mate Stevie Marriott’s songs. They were both pleasantly surprised and impressed, the singer was former Ted Nugent and Victory vocalist Charlie Huhn.\n\nRoger contacted Charlie and a rehearsal was set up at SIR in New York. After just a few hours of jamming, the chemistry was undeniable and all agreed that this was the person to join the band and take it into the future. Charlie's vocal ability and guitar playing fit the music perfectly and his high-energy stage presence provides what is an essential ingredient to a Foghat show.\nThe band began to tour once again in August of 2000, doing what they love to do and do best, taking their music to the fans. The camaraderie and fun was apparent in their live performances and after two solid years of touring the band entered the studio to write and record a new CD. The result was their latest studio recording \"Family Joules\".  In 2004 they released a live DVD called \"The Official Bootleg DVD, volume 1\" and at the end of that year, veteran Foghat bassist extraordinaire Craig MacGregor rejoined the lineup launching  Foghat's hard rocking tradition into the future.  They are touring non-stop again, and the energy is incredible. \n\nIn 2007 they released a new double live CD entitled \"Foghat Live II\", (recorded in 2005 and 2007)  to celebrate the 30th Anniversary of the original \"Foghat Live\", and to bring the energy and excitement of the current lineup (Roger Earl, Craig MacGregor, Bryan Bassett and Charlie Huhn) to the fans. A new album \"Last Train Home\", Foghat's well polished interpretation of blues standards and two originals is released in June 2010.  This opens a new chapter for Foghat, and promises new and exciting things from one of rock’s most established acts. <a href=\"https://www.last.fm/music/Foghat\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
