{"artist":{"name":"Fountains of Wayne","mbid":"0f82d6b5-12fb-4569-b047-a00194f572a7","url":"https://www.last.fm/music/Fountains+of+Wayne","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/614c4cf58070455883f1b61e68327915.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/614c4cf58070455883f1b61e68327915.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/614c4cf58070455883f1b61e68327915.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/614c4cf58070455883f1b61e68327915.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/614c4cf58070455883f1b61e68327915.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/614c4cf58070455883f1b61e68327915.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"595390","playcount":"8359489"},"similar":{"artist":[{"name":"Guster","url":"https://www.last.fm/music/Guster","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dbc27de9dff04ac984546f63a6b85ece.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dbc27de9dff04ac984546f63a6b85ece.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dbc27de9dff04ac984546f63a6b85ece.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dbc27de9dff04ac984546f63a6b85ece.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dbc27de9dff04ac984546f63a6b85ece.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dbc27de9dff04ac984546f63a6b85ece.png","size":""}]},{"name":"Superdrag","url":"https://www.last.fm/music/Superdrag","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2a70c4bdfbd64e6a93b5e50db97917d8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2a70c4bdfbd64e6a93b5e50db97917d8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2a70c4bdfbd64e6a93b5e50db97917d8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a70c4bdfbd64e6a93b5e50db97917d8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a70c4bdfbd64e6a93b5e50db97917d8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a70c4bdfbd64e6a93b5e50db97917d8.png","size":""}]},{"name":"Matthew Sweet","url":"https://www.last.fm/music/Matthew+Sweet","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cd8879c6c50346c286582802e75ac0ba.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cd8879c6c50346c286582802e75ac0ba.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cd8879c6c50346c286582802e75ac0ba.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cd8879c6c50346c286582802e75ac0ba.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cd8879c6c50346c286582802e75ac0ba.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cd8879c6c50346c286582802e75ac0ba.png","size":""}]},{"name":"The Posies","url":"https://www.last.fm/music/The+Posies","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cb10112c667140298814671690c5f997.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cb10112c667140298814671690c5f997.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cb10112c667140298814671690c5f997.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cb10112c667140298814671690c5f997.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cb10112c667140298814671690c5f997.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cb10112c667140298814671690c5f997.png","size":""}]},{"name":"Brendan Benson","url":"https://www.last.fm/music/Brendan+Benson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/899191c23be34f96b4e260e09ff23103.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/899191c23be34f96b4e260e09ff23103.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/899191c23be34f96b4e260e09ff23103.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/899191c23be34f96b4e260e09ff23103.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/899191c23be34f96b4e260e09ff23103.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/899191c23be34f96b4e260e09ff23103.png","size":""}]}]},"tags":{"tag":[{"name":"power pop","url":"https://www.last.fm/tag/power+pop"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"},{"name":"indie","url":"https://www.last.fm/tag/indie"},{"name":"pop","url":"https://www.last.fm/tag/pop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Fountains+of+Wayne/+wiki"}},"published":"04 Mar 2006, 23:37","summary":"Fountains of Wayne is an American power pop band that formed in 1995. The group (not to be confused with Fountains) helped spearhead the 90s power pop revival and achieved breakout mainstream success with the 2003 Gold-certified album 'Welcome Interstate Managers', which spawned the smash top 10 hit \"Stacy's Mom\". Having achieved critical acclaim throughout their career, the band consists of Adam Schlesinger, Brian Young, Chris Collingwood, and Jody Porter, last releasing 'Sky Full of Holes' in 2011. <a href=\"https://www.last.fm/music/Fountains+of+Wayne\">Read more on Last.fm</a>","content":"Fountains of Wayne is an American power pop band that formed in 1995. The group (not to be confused with Fountains) helped spearhead the 90s power pop revival and achieved breakout mainstream success with the 2003 Gold-certified album 'Welcome Interstate Managers', which spawned the smash top 10 hit \"Stacy's Mom\". Having achieved critical acclaim throughout their career, the band consists of Adam Schlesinger, Brian Young, Chris Collingwood, and Jody Porter, last releasing 'Sky Full of Holes' in 2011.\n\nThe band's name was taken from the name of a lawn-ornament store in Wayne, New Jersey, not far from Montclair, New Jersey. That city is the hometown of the band's bassist and cofounder Adam Schlesinger (the store has since gone out of business). According to  Songfacts, there were prominent fountains there.\n\nThe concept of the band was formed by Schlesinger and Chris Collingwood. The two first met as freshmen at Williams College and began playing music together in various groups. The two eventually went their separate ways with Collingwood forming the Mercy Buckets in Boston and Schlesinger forming Ivy in New York City. The duo initially set out to work together in the early 90s under various band monikers (including ones named \"Pinwheel\" and \"The Wallflowers\"), and recorded a full album's worth of demos in 1993. Although never released, the \"Pinwheel\" demos are widely bootlegged by fans and display a very different (yet still earnest) version of the pair's songwriting, though several songs from this period would be re-tooled and appear on later releases.\n\nAfter failing to get their project off the ground, the two met up once again during the mid-90s and formed Fountains of Wayne. A demo eventually landed the two a deal with Atlantic Records and in 1996 they released their self titled debut. The album spawned the singles Radiation Vibe and Sink To The Bottom which received airplay, but it was Schlesinger's song entitled That Thing You Do! which became a hit being used as the lead track for the Tom Hanks film of the same name. \"That Thing You Do!\" also brought Schlesinger an Oscar nomination and an RIAA gold certification for the hit soundtrack.\n\nAlong with guitarist Jody Porter and drummer Brian Young, the band toured the world extensively behind the album playing alongside bands such as The Smashing Pumpkins and The Lemonheads.\n\nIn 1999, the band returned with their second album, Utopia Parkway, a loosely-based concept album about life in the American suburbs in the late 1990s. Unfortunately, a much-changed radio climate left little room in playlists for Fountains of Wayne's snarky power-pop, and the album, along with its three singles Denise, Red Dragon Tattoo, and Troubled Times, sank without much notice. The following year, the band was mostly quiet, contributing a song each to a soundtrack and a compilation (Too Cool for School to the \"Scary Movie\" soundtrack and California Sex Lawyer to the third installment of the International Pop Overthrow series). They were dropped by Atlantic soon thereafter.\n\nThe band spent much of the early 2000s in seclusion, occasionally rejoining to record or play an occasional gig, but mostly Schlessinger was focusing on work with Ivy and Collingwood founded an alt.country band near his Western Massachusetts home called The Gay Potatoes. In addition, the band wrote and performed the theme song to the popular Comedy Central program \"Crank Yankers,\" and contributed a cover of The Kinks \"Better Days\" to a tribute album. The song was also later featured prominently in a scene of the 2004 remake of \"The Manchurian Candidate.\" During this time, the band's stature only grew in indie pop circles, raising expectations high for the release of their next album.\n\nWelcome Interstate Managers, Fountains of Wayne's third record and first for Virgin, was released in June of 2003. Preceeded by the single and video for the Cars-ish Stacy's Mom, the song became a surprise top 20 hit on the strength of its video--a send-up of 1980s teen comedies like \"Fast Times at Ridgemont High\"--which starred Rachel Hunter as Stacy's Mom. The video went into heavy rotation on MTV, pushing the album to become Fountains of Wayne's most successful with sales exceeding 400,000 units.\n\nLike most bands who have a major hit driven by a clever video, follow-up singles did not fare as well. Despite a similarly-clever video for Mexican Wine, the single failed to take off after MTV banned the video due to a scene where two underage girls lip-synch the words to the chorus, a reference to drinking tequila. Third single Hey Julie initially made only a minor dent on AAA and Hot AC format stations, but it was later featured in \"Scrubs\" and other TV shows and grew in stature over time, becoming something of a sleeper hit. During this time, the band also wrote a series of short, almost They Might Be Giants-styled songs for a short-lived VH1 TV series titled \"Hey Joel!,\" which was written by critic Joel Stein. The show was canceled before it aired in the United States and the songs were never released.\n\nThe song named \"Red Dragon Tattoo\" was also featured in the 2004 series \"Kingdom Hospital\", based on a novel by Stephen King, that aired on BBC. \n\nIn 2005, the band issued the 2-disc Out-of-State Plates, a compilation rounding up the band's various import-only B-sides as well as several new songs. Maureen was released as a single yet received little attention.\n\nThe band's fourth proper album, titled Traffic and Weather, was released April 3, 2007. One abandoned track from these sessions, a novelty throwaway titled Monster House that was written for the movie of the same name but not used, was leaked in advance of the album's release via the band's MySpace page. \"Traffic and Weather\" met with typically strong reviews but fewer sales than its predecessor, although the single and video for Someone to Love made a minor impact.\n\nIn early 2009, the band embarked on a small tour where they began to debut some new songs from an as-yet-untitled fifth album. Progress was slow, however, and other than some scattered shows the band dropped almost entirely out of view for two years. In late 2010, the band announced that they were now without a label but that they had completed their as-yet-untitled fifth album, which they were hoping to release sometime in 2011 once they found a new label. During this time they gave away one new free song via their website. Song of the Passaic was written for an NPR segment using a poem about New Jersey's famed, industrial Passaic River.\n\nIn May 2011, the band has announced that their fifth album, Sky Full of Holes will be released on August 1st, 2011 on Lojinx in Europe, August 2nd, 2011 on  YepRoc in North America and on Warner in Japan. Two singles were released in advance of the album itself: Richie and Ruben in May 2011, followed by Someone's Gonna Break Your Heart the following month. Like their previous releases, the album garnered critical praise from a variety of publications. Jill Menze of 'Billboard' called the release \"excellent\", describing it as \"a new minimal sound with a poppy, folk-leaning flair.\"\n\nAfter a six-month tour in support of the album, the band quietly went defunct in favor of side projects. Although they never officially broke up, the band has been completely inactive since sometime in 2012. <a href=\"https://www.last.fm/music/Fountains+of+Wayne\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
