{"artist":{"name":"Frankie Negron","url":"https://www.last.fm/music/Frankie+Negron","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c8676d72203f4adfaabc8d03d5b5494b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c8676d72203f4adfaabc8d03d5b5494b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c8676d72203f4adfaabc8d03d5b5494b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c8676d72203f4adfaabc8d03d5b5494b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c8676d72203f4adfaabc8d03d5b5494b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c8676d72203f4adfaabc8d03d5b5494b.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"30589","playcount":"103920"},"similar":{"artist":[{"name":"Tony Vega","url":"https://www.last.fm/music/Tony+Vega","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/84a64f43598d45e59aead3c7058b7cf3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/84a64f43598d45e59aead3c7058b7cf3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/84a64f43598d45e59aead3c7058b7cf3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84a64f43598d45e59aead3c7058b7cf3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84a64f43598d45e59aead3c7058b7cf3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84a64f43598d45e59aead3c7058b7cf3.png","size":""}]},{"name":"Johnny Rivera","url":"https://www.last.fm/music/Johnny+Rivera","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d1f338589e86478a9c1702781e135670.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d1f338589e86478a9c1702781e135670.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d1f338589e86478a9c1702781e135670.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d1f338589e86478a9c1702781e135670.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d1f338589e86478a9c1702781e135670.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d1f338589e86478a9c1702781e135670.png","size":""}]},{"name":"Huey Dunbar","url":"https://www.last.fm/music/Huey+Dunbar","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/82bc0e40d8b34fc7b0cb5d5cce8528b4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/82bc0e40d8b34fc7b0cb5d5cce8528b4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/82bc0e40d8b34fc7b0cb5d5cce8528b4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/82bc0e40d8b34fc7b0cb5d5cce8528b4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/82bc0e40d8b34fc7b0cb5d5cce8528b4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/82bc0e40d8b34fc7b0cb5d5cce8528b4.png","size":""}]},{"name":"Nino Segarra","url":"https://www.last.fm/music/Nino+Segarra","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b6e91ae8447a41fdb1ff28e937e8158d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b6e91ae8447a41fdb1ff28e937e8158d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b6e91ae8447a41fdb1ff28e937e8158d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6e91ae8447a41fdb1ff28e937e8158d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6e91ae8447a41fdb1ff28e937e8158d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6e91ae8447a41fdb1ff28e937e8158d.png","size":""}]},{"name":"Pedro Conga","url":"https://www.last.fm/music/Pedro+Conga","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1dde0a4d1c0940baa43e4a89525cc1e2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1dde0a4d1c0940baa43e4a89525cc1e2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1dde0a4d1c0940baa43e4a89525cc1e2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1dde0a4d1c0940baa43e4a89525cc1e2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1dde0a4d1c0940baa43e4a89525cc1e2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1dde0a4d1c0940baa43e4a89525cc1e2.png","size":""}]}]},"tags":{"tag":[{"name":"salsa","url":"https://www.last.fm/tag/salsa"},{"name":"latin","url":"https://www.last.fm/tag/latin"},{"name":"bachata","url":"https://www.last.fm/tag/bachata"},{"name":"frankie negron","url":"https://www.last.fm/tag/frankie+negron"},{"name":"pop","url":"https://www.last.fm/tag/pop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Frankie+Negron/+wiki"}},"published":"29 May 2007, 18:51","summary":"Reclining on his couch in a beautifully appointed living area at his New Jersey home, Frankie Negron strikes you as a pretty relaxed guy. As he recounts his accomplishments, it would be understandable for Negron to now finally sit back on this sunny afternoon and coast a little: child performer and student at the School of Performing Arts, Broadway showman by age 20 and, most famously, salsa superstar, earning him Grammy Award nominations, Billboard <a href=\"https://www.last.fm/music/Frankie+Negron\">Read more on Last.fm</a>","content":"Reclining on his couch in a beautifully appointed living area at his New Jersey home, Frankie Negron strikes you as a pretty relaxed guy. As he recounts his accomplishments, it would be understandable for Negron to now finally sit back on this sunny afternoon and coast a little: child performer and student at the School of Performing Arts, Broadway showman by age 20 and, most famously, salsa superstar, earning him Grammy Award nominations, Billboard Award nods and two Premio Lo Nuestro Awards for Song of the Year (not to mention several Number One singles, one Gold and four Platinum album awards to his credit). \n\n\tHowever, Frankie Negron did not get to be one of the most successful salseros of the 20- something generation by chilling out all day.  With a sly smile and a twinkle in his eye, it is clear that rest and relaxation are not on Frankie’s mind as he speaks of his newest project: his first English language record entitled Independence Day, due out September 22. The album is a composite of Negron’s natural romanticism with a little rock, pop, and a healthy dash of the sounds of salsa. It’s a bold creative move for a young man with a dedicated Latin fan base, known for his romantic ballads and emotionally charged vocal performances. Yet for Frankie recording the forthcoming Independence Day with top producer Jimmy Greco simply feels like the perfect next step for this artist, songwriter and performer.\n\n\t\"For me making this new album has been a natural transition.  Growing up in New Jersey, I listened to great rock bands like Springsteen and Bon Jovi, yet lived in a Puerto Rican household where Salsa was played non-stop.  As strange as it might sound, there was no great divide between the two styles,\" explains Frankie.\n\n\tAs a child, Frankie showed at aptitude for all things theatrical. Growing up in a tough- talking Newark, New Jersey neighborhood, it was not easy to be a young boy with dreams of song and dance. However, music ran through his family, with his father, a talented guitarist and songwriter, encouraging his son’s musical leanings. “As long as I can remember, I felt like I was born to do this,” Frankie emphasized. “There are videos floating around of me singing and dancing, auditioning for commercials and performing on Star Search when I was 8 years old. I was never pushed, it was always something I wanted.” He became a sought-after audio book artist, recording vocals for children’s stories, landing the lead in all the school plays. \n\n\tHis talent led to a spot at the prestigious School of Performing Arts in Newark, New Jersey, where Negron shunned what was typical of his age. His freshman year in high school he joined a doo-wop group (as the only Latin member) and began performing at church functions, all age clubs and regional theatres. It was at one such performance, where Negron belted out Frankie Lymon, Frankie Avalon and the Persuasions, that Frankie caught the eye of someone who knows a thing or two about singing, songwriting and harmonizing – Mr. Paul Simon. The thirteen-year-old Frankie greeted Simon casually, “You’re the guy from the Chevy Chase video!” Simon began to mentor Frankie, choosing him to lay down the lead vocals to a musical he was writing called The Capeman. While the starring role was eventually given to Marc Anthony (Frankie was too young at the time), Simon made sure he had a part in the show, giving him a role without an audition.\n\t\n\tAs The Capeman was getting ready to debut on Broadway, Frankie began attending Seton Hall University on a Pre-Med scholarship. The then-eighteen year old was still passionate about music, recording in studios every now and again to stay sharp. It was during one of these sessions that he found his way to esteemed Latin music producer Sergio George, who took one listen to Frankie’s voice and wanted to work with him – as a salsa singer. While his dad played salsa music around the house, Negron had never actually sung it professionally. He loved the sultry sounds with the Caribbean flavor; and, confounding conventional wisdom once more, Negron recorded with George, delivering Con Amor Se Gana to WEA’s budding Latin label, WEA Caribe. As the inaugural artist for the imprint, all eyes were on Negron. “Being the first artist signed, they put everything behind me,” he explained. “I literally went from being ‘a nobody’ to a household name within the Latin community overnight. I was just in the right place at the right time.”\n\n\tWith Simon’s blessing, Negron left the cast of The Capeman after 4 weeks to support his debut album release.  Sent to Puerto Rico for two months of promotion, Negron’s first single was played on the radio in New York, Miami and all over Latin America. Headlining the 116th Festival in Puerto Rico mere months after his first release, Negron found himself performing to a wild crowd of 10,000 people chanting his name. Young, good-looking, and singing salsa, Negron took the Latin music world by storm.\n\n\tAlways looking to up the ante, the talented Negron took steps to begin working on his first English language CD in mid-2008. Starting to write songs in English, after spending his whole career composing lyrics in Spanish, provided a challenge for Negron, “I had to re-program myself,” he described. “English is so much more rigid than Spanish, and the lyrics have to be more visual, rather than relying on adjectives. It was tricky.” Rising to the occasion, Negron has written some beautiful songs for Independence Day such as “What Can I Say,” “Holding on to Love” and “Stand By Me and Fight” that leaves no question of his intention. “I can rock, but I’m still a romantic guy,” smiles Negron, “You have to have emotion when you sing. If you don’t make me feel, I’m not into it. I like to make people feel.” \n\n\tHaving recorded for major labels throughout his entire career, Frankie has made his home with indie label Airgo Music, partnering with Airgo founder Jimmy Greco. Greco, who produced the pop tracks on Negron’s Grammy-nominated Por tu Placer, has also worked with top tier talent such as Jennifer Lopez, Celine Dion, and Carlos Santana. “I started Airgo Music mostly out of frustration with the major labels,” says Greco, “I wanted to embrace the new digital world of being able to post something online and sell it digitally. If you have a great artist and great songs, and you do the right kind of marketing behind it, there’s no reason why you shouldn’t be heard.” \n\n\tThe last 10 years have proven that Frankie is that great artist with great songs. He is confident his fan base is going to make the transition with him, assuring them that he won’t be going very far. “If you’re an artist, you’re not required to just paint portraits; if you’re a photographer, you don’t have to just take pictures of animals; if you’re an actor, you don’t just star in comedies,” Negron declared. \n\n\t “As a singer, you shouldn’t be pigeonholed. You have to remember singing is an art, and if you’re influenced by certain music, and your passion comes from the heart, why not try something new? I will absolutely go back and do another salsa record, I haven’t left it behind; I just want to do more than one thing. Once people hear this album, there will be no doubt to my audience that this is just another facet of who I am.”\n <a href=\"https://www.last.fm/music/Frankie+Negron\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
