{"artist":{"name":"Frankie Randall","mbid":"51c83962-9698-4fe3-a228-bd5e96fbe3fa","url":"https://www.last.fm/music/Frankie+Randall","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"1097","playcount":"4457"},"similar":{"artist":[{"name":"Sebastian Cabot","url":"https://www.last.fm/music/Sebastian+Cabot","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0df952d5b6ce46d19d623f0cff81f0a8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0df952d5b6ce46d19d623f0cff81f0a8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0df952d5b6ce46d19d623f0cff81f0a8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0df952d5b6ce46d19d623f0cff81f0a8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0df952d5b6ce46d19d623f0cff81f0a8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0df952d5b6ce46d19d623f0cff81f0a8.png","size":""}]},{"name":"Frank D'Rone","url":"https://www.last.fm/music/Frank+D%27Rone","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c4b498e26df848ada3e75f65021f0180.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c4b498e26df848ada3e75f65021f0180.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c4b498e26df848ada3e75f65021f0180.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4b498e26df848ada3e75f65021f0180.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4b498e26df848ada3e75f65021f0180.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4b498e26df848ada3e75f65021f0180.png","size":""}]},{"name":"Jack Webb","url":"https://www.last.fm/music/Jack+Webb","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bf92954e3f4a41e493b77bdb82976f41.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bf92954e3f4a41e493b77bdb82976f41.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bf92954e3f4a41e493b77bdb82976f41.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bf92954e3f4a41e493b77bdb82976f41.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bf92954e3f4a41e493b77bdb82976f41.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bf92954e3f4a41e493b77bdb82976f41.png","size":""}]},{"name":"Charlie Parker with Slim Gaillard & His Orchestra","url":"https://www.last.fm/music/Charlie+Parker+with+Slim+Gaillard+&+His+Orchestra","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Slam Stewart","url":"https://www.last.fm/music/Slam+Stewart","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a1c59736c5a3409698f0c8751e19813c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a1c59736c5a3409698f0c8751e19813c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a1c59736c5a3409698f0c8751e19813c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a1c59736c5a3409698f0c8751e19813c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a1c59736c5a3409698f0c8751e19813c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a1c59736c5a3409698f0c8751e19813c.png","size":""}]}]},"tags":{"tag":[{"name":"outsider","url":"https://www.last.fm/tag/outsider"},{"name":"golden throats","url":"https://www.last.fm/tag/golden+throats"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Frankie+Randall/+wiki"}},"published":"10 Aug 2009, 04:41","summary":"FRANKIE RANDALL was born in Passaic, New Jersey as Frank Joseph Lisbona on January 11, 1938.  He was raised in Clifton, NJ.  At the age of seven he began classical piano lessons and was immediately acclaimed for his extraordinary musical talents.  He continued his classical training until the age of 15 when his interests turned to jazz. It was not long before his outstanding jazz abilities were recognized.  At the age of 18, he recorded his first album on Roulette Records and worked constantly with his jazz trio. <a href=\"https://www.last.fm/music/Frankie+Randall\">Read more on Last.fm</a>","content":"FRANKIE RANDALL was born in Passaic, New Jersey as Frank Joseph Lisbona on January 11, 1938.  He was raised in Clifton, NJ.  At the age of seven he began classical piano lessons and was immediately acclaimed for his extraordinary musical talents.  He continued his classical training until the age of 15 when his interests turned to jazz. It was not long before his outstanding jazz abilities were recognized.  At the age of 18, he recorded his first album on Roulette Records and worked constantly with his jazz trio.  RCA sponsored a trip to Rome, Italy where he recorded with notable Italian artists. \n\nHe graduated Clifton High School after which he earned a music scholarship where he worked his way through Fairleigh Dickinson University in New Jersey, earning a Bachelor of Arts Degree in Psychology and a Minor in Philosophy. \n\nAfter graduating college, Jilly Rizzo asked Frankie to work at Jilly's, the late nitery in New York City made world famous by the outstanding entertainment and celebrities who frequented it.  It was there that he caught Frank Sinatra's ear.  Through Mr. Sinatra's praise, he received more acclaim and a recording contract with RCA Victor Records.  Mr. Sinatra quoted, \"FRANKIE RANDALL IS MY FAVORITE PIANO PLAYER AND A MARVELOUS TALENT WHO SINGS GREAT AND PLAYS MORE PIANO THAN THERE ARE KEYS\".  Frankie's many albums and countless singles were enthusiastically received by disc jockeys and fans alike and for three consecutive years he was voted \"MOST PROMISING SINGER OF THE YEAR\" by the CASHBOX DISC JOCKEY POLL. \n\nHe then began his movie career starring in 20th Century's \"WILD ON THE BEACH\" followed by \"DAY OF THE WOLVES\" and several other notable parts.  He went on to become a regular on several popular television shows, including The Dean Martin Summer TV Show.  Emanating from his newfound television popularity were numerous appearances on every major variety/talk show.  Talents continuing to flourish, Frankie began writing music.  His ability as a composer is confirmed by the overwhelming responses he receives.  One of his original compositions was adopted by the City Of Atlanta and a second by Las Vegas as their official city songs.  He also sang the theme songs to the TV shows \"Flipper” and \"Bewitched\".  For years, singer, Jennie Smith and Frankie were the Spokespersons and the voices for the Chevrolet commercials. \n\nIn the mean time, Frankie continued his nightclub appearances in the top cabarets throughout the world.  In 1982 he was asked to appear at the Golden Nugget Hotel and Casino in Atlantic City, NJ, for a three-week engagement resulting in a contract from Steve Wynn to perform at the property for as long as he wished.  In June, 1983 his obvious musical knowledge and business talents carried him to the position of Entertainment Director where he was an integral part of The Golden Nugget team achieving number one status in Atlantic City.  He later became Vice President of Bally's Grand Hotel and Casino while continuing his musical performances. \n\nIn 1991, Frankie resigned from Bally's to focus, once again, on his musical career.  Shortly thereafter, Steve Allen asked him to record a compilation of Allen originals never recorded before.  The CD was released on USA Records entitled \"FRANKIE RANDALL SINGS STEVE ALLEN\". \n\nRadio station, WRDR, in Atlantic City, asked Frankie to record a CD especially for their listening audience.  \"UNFORGETTABLE\" includes five of Frankie's original compositions and musical offerings from Ivory Blackwood and Al Alberts of the legendary Four Aces. \n\nSince then, Frankie has produced many CD's.  \"THEN & NOW\" is comprised of 24 of the best songs ever written from his RCA albums, \"Frankie Randall Sings and Swings\" and \"Frankie Randall, At It Again\", conducted and arranged for a full orchestra by Marty Paich. \n\n\"HERE AND NOW\", was originally recorded for RCA entitled \"Going the Frankie Randall Way\" arranged and conducted by Billy May. \n\nFrankie’s tribute to Frank Sinatra entitled \"RIGHT NOW\", with the Vincent Falcone Orchestra, is one of his most popular and best selling CD's.  Falcone conducted for Frank Sinatra for many years and continues to perform with Frankie. \n\n\"FROM THE HEART\" includes Frankie’s most requested original songs where he composed both words and music. \n\nFrankie's CD, \"LET’S MAKE CHRISTMAS EVERYDAY\", is packed with favorite Christmas songs and includes a song written by Steve Lawrence.  Mr. Lawrence also wrote the liner notes for the CD.  The title song is also an original composition of both words and music by Frankie.  This CD was arranged and orchestrated by Artie Schroeck, notable song writer, musician, and entertainer.  Artie was co-writer for \"Here's to the Band\", which was recorded by Frank Sinatra.  He has been arranging music for many years and continues to do so for Frankie Valli, Kenny Logins and many others. \n\nFor you jazz lovers, Frankie wanted to pay tribute to his other \"Frankie Friends\" with his CD \"TOTALLY FRANKIE\".  Those Frankie’s are Avalon, Laine, Valli and of course, Randall. \n\nFrankie continues to perform \"A TRIBUTE TO SINATRA\" with a large orchestra utilizing Frank Sinatra's very own original musical orchestrations by such noted arrangers as Don Costa, Nelson Riddle, Billy May, Neal Hefti, Quincy Jones, Billy Byers and Frank Foster.  These arrangements were bestowed to Frankie by Mr. Sinatra in February 1997, two years before Sinatra’s passing. Frankie performed his \"TRIBUTE TO SINATRA\" with the blessings of Frank and Barbara, to sellout crowds and continues to receive overwhelming responses from audiences of all ages. \n\nFrankie performed 150 shows of \"Sinatra My Way\" at the Annenberg Theatre in Palm Springs, California. He was the headliner in the main showroom at the Suncoast Casino in Las Vegas for nine weekends with the Vincent Falcone Orchestra, performed with the Indian Wells Desert Symphony at the McCallum Theatre in Palm Desert, California with 70+ musicians and has headlined at the Superstar Theater at Resorts International in Atlantic City, New Jersey. \n\nIn addition to his personal performances throughout the world, Frankie produces a show entitled \"THAT’S ITALIAN\" which has been widely accepted and acclaimed in casinos and performing art centers from coast to coast.\n\nFrankie's versatility is without limits.  As BILLBOARD MAGAZINE stated:\n\n\"RANDALL IS AN EXPERT COMMUNICATOR OF TODAY'S SONGS. HIS PROFESSIONALISM SHINES THROUGH\" \n\n <a href=\"https://www.last.fm/music/Frankie+Randall\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
