{"artist":{"name":"Freddie King","mbid":"d6ae4b23-965f-485a-b2c2-66c43ffaef20","url":"https://www.last.fm/music/Freddie+King","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/50d8a27310b0465fb9a135005f51caca.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/50d8a27310b0465fb9a135005f51caca.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/50d8a27310b0465fb9a135005f51caca.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50d8a27310b0465fb9a135005f51caca.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50d8a27310b0465fb9a135005f51caca.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50d8a27310b0465fb9a135005f51caca.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"239291","playcount":"1966566"},"similar":{"artist":[{"name":"Albert King","url":"https://www.last.fm/music/Albert+King","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7888953da5e9459d82e41f01a015a8e5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7888953da5e9459d82e41f01a015a8e5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7888953da5e9459d82e41f01a015a8e5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7888953da5e9459d82e41f01a015a8e5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7888953da5e9459d82e41f01a015a8e5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7888953da5e9459d82e41f01a015a8e5.png","size":""}]},{"name":"Buddy Guy","url":"https://www.last.fm/music/Buddy+Guy","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e03c02a2013f4157ab190494caaca0e0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e03c02a2013f4157ab190494caaca0e0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e03c02a2013f4157ab190494caaca0e0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e03c02a2013f4157ab190494caaca0e0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e03c02a2013f4157ab190494caaca0e0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e03c02a2013f4157ab190494caaca0e0.png","size":""}]},{"name":"Duke Robillard","url":"https://www.last.fm/music/Duke+Robillard","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e7bc1750ef0847089c14ca257c8940d7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e7bc1750ef0847089c14ca257c8940d7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e7bc1750ef0847089c14ca257c8940d7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e7bc1750ef0847089c14ca257c8940d7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e7bc1750ef0847089c14ca257c8940d7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e7bc1750ef0847089c14ca257c8940d7.png","size":""}]},{"name":"Luther Allison","url":"https://www.last.fm/music/Luther+Allison","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/69e11bc1770c41a5c16fdad7cf4e2588.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/69e11bc1770c41a5c16fdad7cf4e2588.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/69e11bc1770c41a5c16fdad7cf4e2588.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/69e11bc1770c41a5c16fdad7cf4e2588.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/69e11bc1770c41a5c16fdad7cf4e2588.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/69e11bc1770c41a5c16fdad7cf4e2588.png","size":""}]},{"name":"Albert Collins","url":"https://www.last.fm/music/Albert+Collins","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e7c5c0996c034e3a8555f6233597058e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e7c5c0996c034e3a8555f6233597058e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e7c5c0996c034e3a8555f6233597058e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e7c5c0996c034e3a8555f6233597058e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e7c5c0996c034e3a8555f6233597058e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e7c5c0996c034e3a8555f6233597058e.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"blues rock","url":"https://www.last.fm/tag/blues+rock"},{"name":"electric blues","url":"https://www.last.fm/tag/electric+blues"},{"name":"guitar","url":"https://www.last.fm/tag/guitar"},{"name":"Classic Blues","url":"https://www.last.fm/tag/Classic+Blues"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Freddie+King/+wiki"}},"published":"10 Feb 2006, 20:14","summary":"Freddie King (September 3, 1934 – December 28, 1976), thought to have been born as Frederick Christian in Gilmer, Texas, originally recording as Freddy King, and nicknamed \"the Texas Cannonball\", was an influential African-American blues guitarist and singer. He is often mentioned as one of \"the Three Kings\" of electric blues guitar, along with Albert King and B.B. King (though he was the youngest of the three).\n\nKing's mother, Ella May King, and her brother, who both played the guitar, began teaching him to play at the age of six. <a href=\"https://www.last.fm/music/Freddie+King\">Read more on Last.fm</a>","content":"Freddie King (September 3, 1934 – December 28, 1976), thought to have been born as Frederick Christian in Gilmer, Texas, originally recording as Freddy King, and nicknamed \"the Texas Cannonball\", was an influential African-American blues guitarist and singer. He is often mentioned as one of \"the Three Kings\" of electric blues guitar, along with Albert King and B.B. King (though he was the youngest of the three).\n\nKing's mother, Ella May King, and her brother, who both played the guitar, began teaching him to play at the age of six. He liked and imitated the music of Lightnin' Sam Hopkins and saxophonist Louis Jordan. He moved with his family from Texas to the southside of Chicago in 1950. There, at age 16 he used to sneak in to local clubs, where he heard blues music performed by the likes of Muddy Waters, Howlin' Wolf, T-Bone Walker, Elmore James, and Sonny Boy Williamson. Howlin Wolf took him under his wing (or paw), and Freddie also began jamming with Muddy Waters' sidemen, who included Eddie Taylor, Jimmy Rogers, Robert Lockwood Jr. and Little Walter.\n\nBy 1952 he had started gigged at night and working days in a steel mill (by then he had married a Texas girl, Jessie Burnett). He got occasional work as a sideman on recording sessions. Two bands that he played with during this period were the Sonny Cooper Band, and Early Payton's Blues Cats. He formed the first band of his own, the Every Hour Blues Boys, with guitarist Jimmy Lee Robinson and drummer Sonny Scott.\n\nIn 1953 he made some recordings for Parrot. In 1956 he recorded \"Country Boy\", a duet with Margaret Whitfield, and \"That's What You Think\", an uptempo blues. This was for a local label, El-Bee. Robert Lockwood Jr. appeared as a sideman on guitar.\n\nIn 1959 he met Sonny Thompson, a pianist who worked for the King/Fedreal label. In 1960, he himself signed with that label; while there he often shared songwriting credits, and participated in marathon recording sessions, with Thompson. On August 26, 1960, he recorded \"Have You Ever Loved a Woman\" and \"Hide Away\", which were to become two of his most popular tunes. His debut release for the label was \"You've Got To Love Her with Feeling\". His second release on King/Federal was \"I Love the Woman\". \"Hide Away\" was used as the B side for this disk; that tune, a 12-bar mid-tempo shuffle in E with an infectious theme in the head section, and a memorable stop-time break that featured some robust-sounding work on the bass strings, was destined to become one of his signiature numbers. It was an adaptation of a tune by Hound Dog Taylor. It was named \"Hide Away\" after a popular bar in Chicago. Strictly an instrumental -- guitar with rhythm section -- it delighted everyone by crossing over and reaching #29 on the pop chart. It was later covered by Eric Clapton, Stevie Ray Vaughan, the Canadian guitarist Jeff Healy, and likely a majority of the bar blues bands on Planet Earth. After the success of \"Hide Away\", the label, which was presided over by one Syd Nathan, got Freddie and Sonny Thompson to work on making more instrumentals. This they did, producing over 30 of them during the next five years. The following is a partial list: \"The Stumble,\" \"Low Tide,\" \"Wash Out,\" \"Sidetracked\", \"San-Ho-Zay,\" \"Heads Up,\" \"Onion Rings,\" and \"The Sad Nite Owl\". Freddie became popular with a young white audience, in Britain as well as the United States, and his playing was a major influence on the upcoming breed of rock guitarists. During this period he was touring frequently along with the big R&B acts of the day such as Sam Cooke, Jackie Wilson, James Brown. His band included his brother Benny Turner on bass; and Tyrone Davis, who would later become known in his own right, was the driver and valet.\n\nOn the personal side, Freddie was fond, perhaps overly fond, of the Chicago night life. His official website refers to him \"Gambling til dawn in the backroom of Mike's cleaners.\" His wife, now with six children, decided to move back to Texas. Once there, she called Syd Nathan and demanded that he send her some of the royalty money due to her husband. To his credit, he sent her two thousand dollars, with which she made the down payment on a house. Realising that the family were definitely not coming back to Chicago, Freddie, in the spring of 1963, himself moved back to Texas to rejoin them.\n\nHis contract with King/Federal expired in 1966. That same year, while making a series of appearances on an R&B program called \"The!!!Beat\", he was noticed by Atlantic Records front man King Curtis, and in 1968 he signed with the Atlantic subsidiary, Cotillion Records. He released two records for them (see Recordings), both of which showcased his vocal talents. They were not overwhelming commercial successes; however, his first overseas tour, in 1968, was a resounding triumph, being extended from one month to three. He was \"amazed by his popularity in England.\"1\n\nIn 1969 he hired a young member of the \"counter culture\", Jack Calmes, to be his manager. Calmes got him booked at the 1969 Texas Pop Festival, alongside Led Zeppelin and others; and got him signed to Leon Russell's new label, Shelter Records. Shelter records was based in Oklahoma, and featured blues/rock performers such as Linda Ronstadt and Joe Cocker. The company treated Freddie as an important artist, flying him to Chicago to the former Chess studios for th recording of his first album, and giving him a supporting cast of top-calibre session musicians -- including Russell, a rock pianist.\n\nAs were many of the top bluesmen of his generation, he was now playing what he affectionately called the \"Fillmore circuit\", playing alongside the big rock acts of the day for a young, mainly white, audience. As a result of his touring with Eric Clapton, the two became good friends -- Clapton held him in very high esteem -- and following his term at Shelter Records, Freddie signed with the label Clapton was recording for, RSO. His first album there, Burglar, was produced by Clapton, and had him playing on several tracks.\n\nHe continued to tour heavily. He died in Dallas in 1976 from a heart attack and complications arising from bleeding ulcers and pancreatitis. He was just 42 years of age. <a href=\"https://www.last.fm/music/Freddie+King\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
