{"artist":{"name":"Frost","mbid":"f2796d87-1f6b-4c3f-a8d1-5b6b2e6d04db","url":"https://www.last.fm/music/Frost","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7ccd5ce8ebbbeac1cc6c35010777972b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7ccd5ce8ebbbeac1cc6c35010777972b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7ccd5ce8ebbbeac1cc6c35010777972b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7ccd5ce8ebbbeac1cc6c35010777972b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7ccd5ce8ebbbeac1cc6c35010777972b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7ccd5ce8ebbbeac1cc6c35010777972b.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"57907","playcount":"668498"},"similar":{"artist":[]},"tags":{"tag":[{"name":"black metal","url":"https://www.last.fm/tag/black+metal"},{"name":"Progressive rock","url":"https://www.last.fm/tag/Progressive+rock"},{"name":"electronic","url":"https://www.last.fm/tag/electronic"},{"name":"trip-hop","url":"https://www.last.fm/tag/trip-hop"},{"name":"electronica","url":"https://www.last.fm/tag/electronica"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Frost/+wiki"}},"published":"27 Jul 2006, 10:14","summary":"There are several bands/artists with the name Frost. \n\n1. Frost are  a Norwegian trip-hop act. From their website.\n\nNorwegian trip-hop duo Frost is a collaboration between Aggie Peterson and Per Martinsen. Together they make melodic songs about changing the world backed by tasteful electronic sounds - more often than not touched by the all-embracing hand of disco.\n\nFrost was initially formed in 1997 in Tromsø, Northern Norway, with singer/writer <a href=\"https://www.last.fm/music/Frost\">Read more on Last.fm</a>","content":"There are several bands/artists with the name Frost. \n\n1. Frost are  a Norwegian trip-hop act. From their website.\n\nNorwegian trip-hop duo Frost is a collaboration between Aggie Peterson and Per Martinsen. Together they make melodic songs about changing the world backed by tasteful electronic sounds - more often than not touched by the all-embracing hand of disco.\n\nFrost was initially formed in 1997 in Tromsø, Northern Norway, with singer/writer Miss Aggie Peterson and Norwegian Dub Disco entrepreneur DJ Rune Lindbæk at the core of the project. Together, and with the extended assistance of Mr. Torbjørn Brundtland (now Röyksopp) in addition to a few other hired hands, they produced the album “Bedsit Theories” in 1998. The album did very well in Norway, and the single “Clouds across the moon” – a cover version of the Rah Band classic, received heavy rotation on MTV in the summer of ’98.\n\nIn 1999 Aggie and Rune released the single “Endless Love”, with remixes by Röyksopp and duo Illumination/Chilluminati – of which electrohead and long time Norwegian provider of electric funk, Per Martinsen (also of Mental Overdrive), was one half. This saw the beginning of a collaboration between Aggie and Per, and in 2001 they released the album “Melodica” together. Since then the pair have collaborated as Frost.\n\n“Melodica” consisted of glitchy electropop and downtempo airy songs, and received great reviews worldwide. The song “Amygdala” was released on a double vinyl 12” single with a variation of remixes, and the 7” vinyl single “Pharmacy”/”Half-whole” is still a sought-after gem.\n\nTheir second album, \"Love! Revolution\" was leaning more towards upbeat “space-pop” with catchy songs wrapped in hard-hitting yet dubby production. A third album is being recorded in 2009.\n\n2. Frost was a black metal band, hailing from Birmingham, UK, and featuring Mick Kenney from Anaal Nathrakh, Mistress and Professor Fate . They released two albums, Cursed Again and Talking to God. Both albums got re-released in 2007 by Feto Records as a double album. After an extended period on hold Frost was finally dissolved in 2008.\n\n3. Mistagged UK progressive rock group Frost*.\n\n4. Ben Frost is an Australian/Icelandic producer and musician whose solo work and work under 'School Of Emotional Engineering' is characteristed by a persistant exploration of technology and sound, often expounding on darker, more symphonic textures; those concerning loss, alienation, and sound scapes. His work with experimental artists such as Björk, Scanner, Lawrence English and Ai Yamamoto goes hand in hand with his just as challenging but slightly more accessible work under the moniker 'School Of Emotional Engineering'. \n\nMore recently, following the release of the debut S.O.E.E album in 2004, Frost relocated from Melbourne Australia to Reykjavik Iceland to further pursue his muse. Working primarily within the walls of Greenhouse Studios under the wing of seminal producer/composer Valgeir Sigurðsson. \n\nHis later work is more orchestral in nature, though intention more focused and has gradually moved into areas outside of straight 'music'- often producing works for installation, dance, film and theatre. Frost's most recent release- the 2006 instrumental album 'Theory Of Machines', on Icelandic label 'Bedroom Community' perhaps best encapsulates the majesty, fury and beauty he is capable of unleashing, often within the same song.\n\n5. Frost is also the name of the drummer in the norwegian black metal bands Satyricon and 1349 (real name - Kjetil Haraldstad)\n\n6. Frost is also a Swedish trallpunk band with Magnus Bjuren from Asta Kask. FROST [sweden] @ last.fm\n\n7. Frost is also an Italian electro pop band born from the friendship between Riccardo Schippa and Jacopo Tittarelli. Their first and only album is United Condom.\n\n7. Frost is also a German underground black metal band. http://www.frost666.de/flash5.html\n\n9. Frost  are Hungarian black metal band  formed in 1996 and was soon responsible for Inno A Satana in 1996, Storm Above The Carpathians in 1997 and the 1998 demo Under The Hungarian Blackmoon. Part of the original line-up were Ferenc Mocsnik and guitarist Gabor Dévényi. Frost also found time to record a split-release with Ahriman as a tribute to another Hungarian band, Tormentor. The band soon signed with Stygian Shadows where it released two albums. The first was an EP called Songs Of The Ancient Gods from 1999. The label soon being defunct the act issued the 2004 disc Voices From Beyond The Gates. Zoltan would decamp in 2004 to England in order to form a new band.\nExtreme Loneliness - Fragments was reissued in 2005 by America's Paragon Records complete with bonus song.  \n\n10. Frost is also a Danish grunge/rock band.\n\n11. Kid Frost (born Arturo Molina, Jr. on May 31, 1964 in East Los Angeles, California), now known as Frost, is a popular and the first widely recognized Mexican American rapper.\n\nFrost spent parts of his childhood on military bases in Guam and Germany. He began rapping in 1982. As an MC, he named himself Kid Frost as a tribute to Ice T whom he often battled. He soon joined Uncle Jamm's Army. As a solo artist, his earliest 12\" electro rap records came out on Electrobeat Records and Baja Records.\n\nIn the late 1980s, Kid Frost moved to Virgin Records. Virgin released his biggest hit, \"La Raza\", the first mainstream single from a Chicano rapper which focused on Mexican-American pride. His debut album, \"Hispanic Causing Panic\" was released in 1990, A.L.T. appeared as a guest rapper on the CD. He also established a Latin rap supergroup called Latin Alliance which released their only self-titled album in 1991. His second album, \"East Side Story\" was released in 1992. MC Eiht, A.L.T. and Ganxta Ridd from the Boo-Yaa TRIBE appeared as guest rappers.\n\nIn 1995, Frost dropped the \"Kid\" from his nickname and was signed by Ruthless Records, Eazy E's label (distributed by Relativity). \"Smile Now Die Later\" was released in 1995. Above The Law were featured as guest rappers, alongside A.L.T., O.Genius and Kokane. Rick James appears on Frost's version of \"Mary Jane\". His second album for Ruthless, \"When Hell.A.Freezes Over\", was released in 1997. Ice T, Scoop, O.Genius and Domino appeared as guest rappers.\n\nIn 1999, Frost moved to a small independent label, Celeb-entertainment. His first album for Celeb-entertainment, \"This Was Then This Is Now Vol. I\" was released in 1999. Kurupt, King T, Baby Bash, Jay Tee, Jayo Felony, Xzibit, B-Legit, and Cameosis were featured on the CD. \"That Was Then This Is Now Vol. II\" was released in 2000. Frank V., Clika One, Jay Tee, Baby Bash and other guest rappers were featured on the CD.\n\n2002's \"Still Up In This Shit!\", released by Hit-A-Lick/Koch Records, featured more Latin-tinged raps and G-Funk tracks as well as a hidden bonus rock track, \"Cannabis\". Mellow Man Ace, Daz Dillinger, Baby Bash, A.L.T., Nino Brown, Cisco and other guest rappers appeared, and one track featured the group Tierra. Somethin' 4 The Ridaz was released in 2003 on 40 Ounce Records and featured lots of artist's from Texas.\n\nIn 2005 \"Welcome To Frost Angeles\" was released on Thump Records, which was produced almost entirely by Frost and his son, Scoop De'Ville. Only the Intro is produced by Binky Womack, and Philly Blunt co-produced one track. Guest rappers Cameosis, Genovese, Jay Tee and others also appear. Frost signed to Low Profile Records and released his album \"Till The Wheels Fall Off\" in 2006. It had guest appearances by Baby Bash, Scoop De'Ville, Mr. Sancho, and other artists signed to Low Profile Records. Buntz N Ballerz released in 2007 on Thump Records featured ALT and other artist's.\n\nFrost's earliest tracks are part of the Electro Funk sub-genre of Hip-Hop music, later on he was influenced by Gangsta rap and G-funk, as well as pioneering hip-hop with Latin influences (\"La Raza\", \"Ya Estuvo\").\n\n12. Frost is the name of a Canadian (Québécois) black metal project started in 2007.  http://frostcan.blogspot.com\n\n13. Frost is also the name of an electro-industrial duo from Japan. frostration.com\n <a href=\"https://www.last.fm/music/Frost\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
