{"artist":{"name":"Funeral for a Friend","mbid":"199d0ab3-22c0-4c00-b99d-257f591dda1f","url":"https://www.last.fm/music/Funeral+for+a+Friend","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a518ebbb05dd43888579b943c588690b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a518ebbb05dd43888579b943c588690b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a518ebbb05dd43888579b943c588690b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a518ebbb05dd43888579b943c588690b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a518ebbb05dd43888579b943c588690b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a518ebbb05dd43888579b943c588690b.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"664841","playcount":"24598799"},"similar":{"artist":[{"name":"Finch","url":"https://www.last.fm/music/Finch","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/72cad33575514180a0eed3b858a9b6cd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/72cad33575514180a0eed3b858a9b6cd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/72cad33575514180a0eed3b858a9b6cd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/72cad33575514180a0eed3b858a9b6cd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/72cad33575514180a0eed3b858a9b6cd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/72cad33575514180a0eed3b858a9b6cd.png","size":""}]},{"name":"Fightstar","url":"https://www.last.fm/music/Fightstar","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bdfe73b286e24a6b8625a56921756bcd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bdfe73b286e24a6b8625a56921756bcd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bdfe73b286e24a6b8625a56921756bcd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bdfe73b286e24a6b8625a56921756bcd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bdfe73b286e24a6b8625a56921756bcd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bdfe73b286e24a6b8625a56921756bcd.png","size":""}]},{"name":"The Blackout","url":"https://www.last.fm/music/The+Blackout","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f032832b954f459cb863726b3f2363a4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f032832b954f459cb863726b3f2363a4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f032832b954f459cb863726b3f2363a4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f032832b954f459cb863726b3f2363a4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f032832b954f459cb863726b3f2363a4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f032832b954f459cb863726b3f2363a4.png","size":""}]},{"name":"Silverstein","url":"https://www.last.fm/music/Silverstein","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b83bb40ceb5c439cae33ab9706ed1e68.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b83bb40ceb5c439cae33ab9706ed1e68.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b83bb40ceb5c439cae33ab9706ed1e68.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b83bb40ceb5c439cae33ab9706ed1e68.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b83bb40ceb5c439cae33ab9706ed1e68.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b83bb40ceb5c439cae33ab9706ed1e68.png","size":""}]},{"name":"Senses Fail","url":"https://www.last.fm/music/Senses+Fail","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1ed6207ce38e4461bd9038c0485c596c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1ed6207ce38e4461bd9038c0485c596c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1ed6207ce38e4461bd9038c0485c596c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ed6207ce38e4461bd9038c0485c596c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ed6207ce38e4461bd9038c0485c596c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ed6207ce38e4461bd9038c0485c596c.png","size":""}]}]},"tags":{"tag":[{"name":"emo","url":"https://www.last.fm/tag/emo"},{"name":"post-hardcore","url":"https://www.last.fm/tag/post-hardcore"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"screamo","url":"https://www.last.fm/tag/screamo"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Funeral+for+a+Friend/+wiki"}},"published":"10 Feb 2006, 22:52","summary":"Funeral for a Friend was a post-hardcore band from Wales. They formed in 2001 as a sextet called January Thirst. This did not last long, and in 2002 Funeral for a Friend recorded their debut EP Between Order And Model with their original 6-piece line up. After having been together for just a few months, the band changed their line up and subsequently signed a deal with Warner Brothers records for whom they recorded their second EP Four Ways To Scream Your Name.  <a href=\"https://www.last.fm/music/Funeral+for+a+Friend\">Read more on Last.fm</a>","content":"Funeral for a Friend was a post-hardcore band from Wales. They formed in 2001 as a sextet called January Thirst. This did not last long, and in 2002 Funeral for a Friend recorded their debut EP Between Order And Model with their original 6-piece line up. After having been together for just a few months, the band changed their line up and subsequently signed a deal with Warner Brothers records for whom they recorded their second EP Four Ways To Scream Your Name. \n\nThe band's debut full-length album Casually Dressed and Deep in Conversation was released in October 2003. Various singles were lifted off this, including Bullet Theory, Juneau (Juno on previous EPs), She Drove Me To Daytime TV and Escape Artists Never Die. After a B-side to Escape Artists Never Die was released as a single, this was called You Want Romance? the video was sequal to Bullet Theory\n\nA DVD named Spilling Blood In 8MM was released only a year after, documenting every music video, including the two from the EPs 10:45 Amsterdam Conversations and This Year's Most Open Heartbreak, live footage, and the first album's promotion tour, discography, chronology and an exclusive video for Juneau acoustic\n\nIn the United States, the EP Seven Ways To Scream Your Name was released instead. It featured three of the tracks from Four Ways To Scream Your Name, three from Between Order And Model and a further unreleased track. The debut was released later.\n\nThe second album Hours was released in 2005. Streetcar, Monsters, History and Roses for the Dead have been released as singles.\n\nFuneral For A Friend released the first single, off their 3rd album, Into Oblivion (Reunion) on May 7th 2007 and the album Tales Don't Tell Themselves was released on May 14th 2007. The album caused much controversy with fans of their earlier albums, especially with fans of their EPs and 'Casually Dressed and Deep in Conversation', due to a major change in their sound to a more melodic version of their earlier post-hardcore. The band then released the ninth track on Tales Don't Tell Themselves Walk Away. Then the release of  The Great Wide Open  came in a form of an EP highlighting the bands earlier part of their career containing not only the single The Great Wide Open but live versions of most of their older EP songs.\n\nFFAF released a new album in 2008 via their newly formed label Join Us, after leaving Atlantic. On the 27th August 2008, it was announced that the band had licensed their new record to Victory Records for the U.S. and Canadian releases. The album was released via the label on October 28, 2008. It was also released via Roadrunner Records in the rest of the world, apart from the UK, where it was released through the band's own label, Join Us.\n\nOn September 4, 2008, it was announced via a MySpace blog post that Gareth Davies had left the band, to be replaced by Gavin Burrough (Hondo Maclean, Ghostlines, The Future). \"As some of you may know, Gareth has been living in America for the past couple of years, and recently got married. Ultimately, the strain of travelling between continents has taken it's toll and Gareth made the decision that it would be in the best interests of himself, his family and Funeral to leave the band. We totally respect and understand his choice, wish him all the best in his future and we thank him for being part of our lives for the past 6 years.\"\n\nOn June 24, 2009 it was revealed in Kerrang! magazine that the band were to release a greatest hits album, entitled Your History Is Mine: 2002-2009, on September 28, 2009. The compilation is to also contain four brand new tracks, which will be the first new material released by the band since the arrival of Burrough.\n\nOn April 26, 2010, Funeral for a Friend wrote on their forum about their lineup change, paying homage to the departure of their friend Darran Smith, but also announcing the new member. Gavin Burrough changed instrument from bass to guitar, taking over Darran's place as guitarist, and Richard Boucher became the new bassist of Funeral for a Friend.\n\nOn May 3, 2010 the band announced that they will be releasing a special new EP to fans who \"pledged\" through website pledgemusic.com, the \"pledge\" options include the EP, a signed EP and even an acoustic performance by the band at a fan's residence.[12] On July 1, 2010 the band revealed that the EP will be titled \"The Young and Defenseless\" and also revealed the cover art. The EP was subsequently released for download on September 6, 2010 and physical release was a week later. Towards the end of October 2010 they finished a session of recording for a new album for which a name and date were yet to be announced. On 2 November, they played two new songs, confirmed to be on this album (which was announced as due for release in March 2011), called \"Man Alive\" and \"Front Row Seats to the End of the World\". Another song title was confirmed as \"Spinning Over the Island.\"\n\nOn 10 January 2011, the band released the official video for the album's leading single \"Front Row Seats to the End of the World\" and announced their fifth studio album would be called Welcome Home Armageddon. On 24 January, it was announced that the album was to be released by Good Fight Music, a move that would reconnect the band with the original label team that released Seven Ways to Scream Your Name and Casually Dressed & Deep in Conversation. Welcome Home Armageddon was released 14 March 2011 in Britain through Distiller Records and 15 March in the United States through Good Fight and later on distributed through Roadrunner to the rest of the world.\n\nOn 22 May 2012, Ryan Richards announced that he was leaving the band. He cited his family as the reason, saying: “I’ve always put music first in my life – but the time has come now for my family to take the top spot”. It was the band's initial intention that Richards would not be replaced instantly and that the band would only look for a touring member to play for the band. However, it was announced on that Pat Lundy would be joining the band as Richards' replacement. Lundy is the former drummer of London-based heavy metal band Rise to Remain, having left the band in January 2012. Funeral for a Friend spent all of 2012, bar their brief festival appearances writing and recording for their sixth studio album. Over the year they released several studio updates showing the band members tracking different instruments for the album.\n\nOn 4 October of that year the band confirmed the title and release date of their sixth album Conduit for a 28 January 2013 release in the United Kingdom and on 5 February 2013 through The End Records In the United States.\n\nOn 28 September 2014, Funeral for a Friend debuted the lead single from their forthcoming album Chapter and Verse, titled \"You've Got a Bad Case of the Religions\" on the Rock Show on BBC Radio 1. The band then announced the album's release date of January 19, 2015 as well as a UK/European Tour in support of the album.\n\nOn 14 September 2015, Funeral for a Friend announced their breakup and the 'Last Chance to Dance' final tour across Australia, Germany and the UK, which spanned from February to April 2016; they played two subsequent nights on each stop of the tour, performing Hours and Casually Dressed & Deep in Conversation in their entirety (alongside other songs) on the first and second night respectively.\n\n\nOfficial site\nBrazilian fansite <a href=\"https://www.last.fm/music/Funeral+for+a+Friend\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
