{"artist":{"name":"Future Leaders of the World","mbid":"f6058dd9-1ec9-48df-b0e1-d490b489bfcc","url":"https://www.last.fm/music/Future+Leaders+of+the+World","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ec4c62ea3860434c846c1ec99324ba4c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ec4c62ea3860434c846c1ec99324ba4c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ec4c62ea3860434c846c1ec99324ba4c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec4c62ea3860434c846c1ec99324ba4c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec4c62ea3860434c846c1ec99324ba4c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec4c62ea3860434c846c1ec99324ba4c.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"26642","playcount":"226842"},"similar":{"artist":[{"name":"Socialburn","url":"https://www.last.fm/music/Socialburn","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/440e8363e89c4786b5757ecbe7722634.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/440e8363e89c4786b5757ecbe7722634.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/440e8363e89c4786b5757ecbe7722634.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/440e8363e89c4786b5757ecbe7722634.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/440e8363e89c4786b5757ecbe7722634.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/440e8363e89c4786b5757ecbe7722634.png","size":""}]},{"name":"Tantric","url":"https://www.last.fm/music/Tantric","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d3eee0182d5143cbafdee80a84f65d6b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d3eee0182d5143cbafdee80a84f65d6b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d3eee0182d5143cbafdee80a84f65d6b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d3eee0182d5143cbafdee80a84f65d6b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d3eee0182d5143cbafdee80a84f65d6b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d3eee0182d5143cbafdee80a84f65d6b.png","size":""}]},{"name":"Killradio","url":"https://www.last.fm/music/Killradio","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f9b14786e3c24f03b8f8e9c7b2cb8d62.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f9b14786e3c24f03b8f8e9c7b2cb8d62.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f9b14786e3c24f03b8f8e9c7b2cb8d62.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9b14786e3c24f03b8f8e9c7b2cb8d62.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9b14786e3c24f03b8f8e9c7b2cb8d62.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9b14786e3c24f03b8f8e9c7b2cb8d62.png","size":""}]},{"name":"Fuel","url":"https://www.last.fm/music/Fuel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/325199afb1c24fedcf607fda4ed36d25.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/325199afb1c24fedcf607fda4ed36d25.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/325199afb1c24fedcf607fda4ed36d25.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/325199afb1c24fedcf607fda4ed36d25.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/325199afb1c24fedcf607fda4ed36d25.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/325199afb1c24fedcf607fda4ed36d25.png","size":""}]},{"name":"Pop Evil","url":"https://www.last.fm/music/Pop+Evil","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b9d2acc7c2864b57b0b963718fcacd56.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b9d2acc7c2864b57b0b963718fcacd56.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b9d2acc7c2864b57b0b963718fcacd56.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b9d2acc7c2864b57b0b963718fcacd56.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b9d2acc7c2864b57b0b963718fcacd56.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b9d2acc7c2864b57b0b963718fcacd56.png","size":""}]}]},"tags":{"tag":[{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"Grunge","url":"https://www.last.fm/tag/Grunge"},{"name":"alternative rock","url":"https://www.last.fm/tag/alternative+rock"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"},{"name":"metal","url":"https://www.last.fm/tag/metal"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Future+Leaders+of+the+World/+wiki"}},"published":"31 Dec 2006, 17:32","summary":"Future Leaders of the World (F.L.O.W.) was formed by singer/guitarist Phil Taylor, who formed the group in 2002 out of his home town Buffalo, NY. The band relocated to Los Angeles, CA that same year and shortly thereafter struck a deal with Epic Records on the strength of an EP recorded at Swing House studios in Hollywood, CA. Their debut full-length album, \"LVL IV,\" (P/ Garth Richardson E/ Elvis Baskette, M/ Andy Wallace) was recorded in the summer of 2003 at Armoury Studios in Vancouver, B. <a href=\"https://www.last.fm/music/Future+Leaders+of+the+World\">Read more on Last.fm</a>","content":"Future Leaders of the World (F.L.O.W.) was formed by singer/guitarist Phil Taylor, who formed the group in 2002 out of his home town Buffalo, NY. The band relocated to Los Angeles, CA that same year and shortly thereafter struck a deal with Epic Records on the strength of an EP recorded at Swing House studios in Hollywood, CA. Their debut full-length album, \"LVL IV,\" (P/ Garth Richardson E/ Elvis Baskette, M/ Andy Wallace) was recorded in the summer of 2003 at Armoury Studios in Vancouver, B.C. and released in stores late 2004. The album's post grunge/modern rock sound strongly channeled 90's influences like Nirvana, Alice in Chains, Incubus, Korn and Pear Jam. It steadily climbed the charts through 2005 reaching #27 on the Billboard 2000 on the surge of the US hit singles \"Let Me Out\" (#1 Mainstream Rock, #3 Modern Rock Charts) and \"Everyday\" (#17 Mainstream Rock). During this time, FLOW toured heavily for more than a year with groups such as Shinedown, Seether, Crossfade, Chevelle, Alter Bridge, and Velvet Revolver. \n      With politically charged, socially-conscious lyrics, heavy melodic songs, and high-energy performances, the group quickly achieved a cult-like following throughout the U.S., and much critical acclaim amongst the industry. One of Taylor’s main influences, and former label mate Eddie Vedder of Pearl Jam is a huge fan of the bands work, and has compared Phil Taylor's vocals to, “a modern day Kurdt Cobain.” Despite their virtual “over night,” success and catapult into the mainstream rock arena, the band chose to part ways citing creative and personal differences, as well as disputes between them and their former label Epic/Sony. \n     Winding down the stretch of the 2005 US Jagermeister tour, FLOW finished the support of LVLIV in New Orleans, Louisiana at the Howling Wolf on May 5th 2005. This show marked what could have seemingly been the end for Future Leaders of the World, a short-lived run of a band that made a big impact in a short amount of time, but had not yet reached their fullest potential. But from where this band ended, it was also reborn. \n     During the release of LVLIV, the quickly achieved success proved to be toxic for Taylor's personal life and health. Throughout his tenure with Epic records, Taylor struggled with the influences of the, “party lifestyle,” around him, “I was really young and got slowly lured into the negativity of the environment around me. Going from living hand to mouth, to instantly having access to money and all these different elements around me for the first time in my life at the age of 21 was a bit overwhelming to say the least,” Taylor says. But after having time away from the industry to reflect and grow, Taylor has become a writer with a story to tell, and a message to those who would listen, “After the band broke up and we parted ways with Epic, God came into my life and changed me. I have a real relationship with him, and before I was just..well spiritually and mentally lost. I had no real guidance or truly meaningful direction in my life. Now I have control over my life again and I have a real purpose.\" \n      After working for several years with his other band Machina, Taylor began writing a new material for FLOW the same way he always does, with just an acoustic guitar. With what started as just an acoustic EP, it was apparent that the songs were calling for a much bigger, heavier sound as recording for the full-length record, “Reveal,” began in the summer of 2008 in Seattle, Washington at Brewery Studios. Taylor recruited long-time friend and touring partner  Ian Severson from the Minneapolis, MN band Gingerjake, on guitar during the Seattle sessions and the chemistry in the studio was instant, “I was doing the production, writing, vox, guitar and bass completely myself for a while on the record, and I was reaching my limits. The music was pushing for a bigger sound, and that's when I got Ian in the studio. He really elevated the songs to a whole new level.” About working on the record and becoming a part of the band Ian said, “With the material we were coming up with in the studio, it was obvious to me that he was the lead guitarist for the band,” Taylor says.\n       After completing 10 songs for, “Reveal,” at Brewery Studios, the band relocated to New Orleans, LA in the summer of 2009 as their new home base for FLOW headquarters. “New Orleans is where the band before had fell apart, it just felt like God was calling me to come back and pick up the pieces, to start over. It has always been a place of inspiration for me and we've always had great support for FLOW in the gulf coast region, so it all just tied together, really,” Taylor says. \n       The group toured for the rest of the year throughout the U.S. non-stop and into 2010 in support of the 4 song EP, “Delirium,” It contains 3 new tracks from the forthcoming album, “Reveal,” as well as an orchestral acoustic version of their hit single, “Let Me Out.” FLOW played several radio festivals including 98 Rock in Tampa's, “Guavaween Festival,” 93.1's, “Gobblestock,” in Louisville, KY, and many others during this time, stirring up much buzz about their new record. \n       After touring for over 7 months straight, the band went back into the studio with Nashville producer Jon King (Lava/Universal Republic) in spring 2010 to record a few more single cuts for the album. During this time they solidified their lineup with New Orleans local scene staples Jeremy “13,” on bass(Crowbar, City Below), Justin Amato on rhythm guitar and Russell Bullock on drums. The first single to be released, “Live Again,” was recorded in the Nashville sessions, and is quintessential to the meaning of, “Reveal,” to Taylor, “Live Again is about having your heart broken, losing everything to see yourself for who you really are, learning from your mistakes, growing, and becoming reborn and empowered through God.”\n      “Reveal,” features 14 new songs, 4 bonus tracks, and mixes by studio legends Toby Wright (3 Doors Down, KORN, Alice in Chains, Tantric, Metallica, and Kiss) and Sterling Winfield (Pantera, Damage Plan, Hell Yeah). The becoming a part of FLOW has been a great experience for guitarist Ian Severson, \"Looking back at our progress, the Seattle sessions from '08, having toured DIY style for 6 months in 2009, cutting more high energy singles in Nashville this past April '10, and securing a solid lineup with Jeremy and Russell on the rhythm section, there's no doubt in my mind that “Reveal,” is going to have a big impact to our fans, and new ones as well.\" Bassist Jeremy, \"13\" also has this to add about joining the group, “Being the Bassist for FLOW has opened up a new door full of emotional, raw and truth driven material that I am proud to be a part of.”\n      FLOW will release their longley awaited second full-length album in April of 2011 via EMI and the first single,” Live Again,\" is set to hit radio in fall 2010. They begin tour this fall as well and are psyched to get their music out to the masses again, “It’s been amazing to be back and have so much love from our fans, peers, and radio stations. We just can’t wait to get back out there,” says Phil Taylor from FLOW headquarters Revolver studios in New Orleans, LA. It's been an uphill battle for Taylor and the band to get back to the point where they could release a full-length album and have their music heard again. He is a changed man, and the record, “Reveal,” is glimpse into the transformations that have happened within Taylor's life over the past 4 years, and also the message of the album, “that God has a plan for everyone no matter where you’re at, and he will reveal it to you if you let him into your life and heart. The band breaking up in '05 was really the best thing that could have happened to me back then, and I only have God to thank now for the all opportunities with the new band, label, mgmt and record.”\n <a href=\"https://www.last.fm/music/Future+Leaders+of+the+World\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
