{"artist":{"name":"Gene Clark","mbid":"2b6f3780-6fb6-42c2-95bb-5e080772e38c","url":"https://www.last.fm/music/Gene+Clark","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6b151330d3fa4de0be86ec803f889cc3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6b151330d3fa4de0be86ec803f889cc3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6b151330d3fa4de0be86ec803f889cc3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6b151330d3fa4de0be86ec803f889cc3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6b151330d3fa4de0be86ec803f889cc3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6b151330d3fa4de0be86ec803f889cc3.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"110184","playcount":"1157467"},"similar":{"artist":[{"name":"Dillard & Clark","url":"https://www.last.fm/music/Dillard+&+Clark","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bd46dad1344a47218c0fb508e859098e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bd46dad1344a47218c0fb508e859098e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bd46dad1344a47218c0fb508e859098e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bd46dad1344a47218c0fb508e859098e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bd46dad1344a47218c0fb508e859098e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bd46dad1344a47218c0fb508e859098e.png","size":""}]},{"name":"The Flying Burrito Brothers","url":"https://www.last.fm/music/The+Flying+Burrito+Brothers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/26aaaad380cb45c09d21856685a4aa5b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/26aaaad380cb45c09d21856685a4aa5b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/26aaaad380cb45c09d21856685a4aa5b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/26aaaad380cb45c09d21856685a4aa5b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/26aaaad380cb45c09d21856685a4aa5b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/26aaaad380cb45c09d21856685a4aa5b.png","size":""}]},{"name":"Gram Parsons","url":"https://www.last.fm/music/Gram+Parsons","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c512299e8d6844469bee9b3b85656436.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c512299e8d6844469bee9b3b85656436.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c512299e8d6844469bee9b3b85656436.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c512299e8d6844469bee9b3b85656436.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c512299e8d6844469bee9b3b85656436.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c512299e8d6844469bee9b3b85656436.png","size":""}]},{"name":"The Byrds","url":"https://www.last.fm/music/The+Byrds","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b1f3175947804a50a018852fc5489526.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b1f3175947804a50a018852fc5489526.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b1f3175947804a50a018852fc5489526.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b1f3175947804a50a018852fc5489526.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b1f3175947804a50a018852fc5489526.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b1f3175947804a50a018852fc5489526.png","size":""}]},{"name":"Lee Hazlewood","url":"https://www.last.fm/music/Lee+Hazlewood","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fe02e7275ccb4235a84a44497be71673.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fe02e7275ccb4235a84a44497be71673.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fe02e7275ccb4235a84a44497be71673.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe02e7275ccb4235a84a44497be71673.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe02e7275ccb4235a84a44497be71673.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe02e7275ccb4235a84a44497be71673.png","size":""}]}]},"tags":{"tag":[{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"folk","url":"https://www.last.fm/tag/folk"},{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"americana","url":"https://www.last.fm/tag/americana"},{"name":"Alt-country","url":"https://www.last.fm/tag/Alt-country"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Gene+Clark/+wiki"}},"published":"01 Sep 2006, 23:07","summary":"Gene Clark, born Harold Eugene Clark (born Tipton, Missouri, November 17, 1944[1] - May 24, 1991) was an American singer-songwriter, and one of the founding members of the folk-rock group The Byrds.\n\nGene Clark is best remembered for being The Byrds main songwriter between 1964 and 1966. He created a large catalogue of music in several genres but failed to achieve solo commercial success. Clark was one of the earliest exponents of psychedelic rock, baroque pop, newgrass, country rock and alternative country. <a href=\"https://www.last.fm/music/Gene+Clark\">Read more on Last.fm</a>","content":"Gene Clark, born Harold Eugene Clark (born Tipton, Missouri, November 17, 1944[1] - May 24, 1991) was an American singer-songwriter, and one of the founding members of the folk-rock group The Byrds.\n\nGene Clark is best remembered for being The Byrds main songwriter between 1964 and 1966. He created a large catalogue of music in several genres but failed to achieve solo commercial success. Clark was one of the earliest exponents of psychedelic rock, baroque pop, newgrass, country rock and alternative country.\n\nBiography\n\nEarly life\n\nBorn in Tipton, Missouri, the third of thirteen children, Clark began learning the guitar from his father at age nine and was soon picking out Hank Williams tunes as well as material by early rockers such as Elvis Presley and the Everly Brothers. Before long he was writing his own songs and, at 13, joined a local Rock & Roll combo, Joe Meyers and the Sharks. Like many of his generation, Clark developed an interest in folk music because of the popularity of the Kingston Trio. Clark graduated from Bonner Springs High School in Bonner Springs, Kansas in 1962.\n\nFormation of The Byrds\n\nHe began performing with several folk groups working out of Kansas City at the Castaways Lounge, owned by Hal Harbaum, where he was discovered by the New Christy Minstrels, in August 1963, who hired him for their ensemble and with whom he remained for six months. After hearing the Beatles, Clark quit the Christys and moved to Los Angeles where he met fellow folkie/Beatles convert Jim (later Roger) McGuinn at the Troubadour Club and in early 1964 they began to assemble a band that would become The Byrds.\n\nGene Clark wrote many of The Byrds' best-known originals, including: \"I'll Feel a Whole Lot Better\", \"Set You Free This Time\", \"Here Without You\", \"If You're Gone\", \"The World Turns All Around Her\", \"She Don't Care About Time\" and \"Eight Miles High\". He played harmonica for the band, too (notably on \"Set You Free This Time\"). Bassist Chris Hillman noted years later in various interviews remembering Gene: \"People don't give enough credit to Gene Clark. He came up with the most incredible lyrics. I don't think I appreciated Gene Clark as a songwriter until the last two years. He was awesome! He was heads above us! Roger wrote some great songs then, but Gene was coming up with lyrics that were way beyond what he was. He wasn't a well-read man in that sense, but he would come up with these beautiful phrases. A very poetic man--very, very productive. He would write two or three great songs a week\". \"He was the songwriter. He had the \"gift\" that none of the rest of us had developed yet.... What deep inner part of his soul conjured up songs like \"Set You Free,\" \"Feel A Whole Lot Better,\" \"I'm Feelin' Higher,\" \"Eight Miles High\"? So many great songs! We learned a lot of songwriting from him and in the process learned a little bit about ourselves. At one time, he was the power in the Byrds, not McGuinn, not Crosby -- it was Gene who would burst through the stage curtain banging on a tambourine, coming on like a young Prince Valiant. A hero, our savior. Few in the audience could take their eyes off this presence.\"\n\nA management decision delivered the lead vocal duties to McGuinn for their major singles and Dylan covers. This disappointment, combined with Clark's dislike of traveling (including a chronic fear of flying) and resentment by other band members about the extra income he derived from his songwriting, led to internal squabbling and he left the group in early 1966. He briefly returned to Kansas City before moving back to Los Angeles to form Gene Clark & the Group with Chip Douglas, Joel Larson, and Bill Rhinehart.\n\nSolo career and rejoining The Byrds\n\nColumbia Records, (the Byrds' record label), signed Clark as a solo artist and, in 1967, he released his first solo LP, Gene Clark with the Gosdin Brothers, a mixture of pop, country rock and baroque-psychedelic tracks. The record received favourable reviews but unfortunately for Clark, it was released almost simultaneously with the Byrds' Younger Than Yesterday, also on Columbia, and (partly due to his 18 month-long public absence) was a commercial failure. With the future of his solo career in doubt, Clark briefly rejoined the Byrds in 1967 as a replacement for the recently-departed David Crosby but left after only 3 weeks following a panic attack in Minneapolis.\n\nIn 1968, Clark signed with the artist-friendly A&M Records and began a collaboration with Laramy Smith recording a number of songs including \"Los Angeles\", which later featured on the 'Flying High\" double cd released on A&M in 1998. Phoenix disbanded when Clark and Smith could not agree on a common style.[2][3] Following the break up, Clark formed Dillard & Clark with banjo player Doug Dillard. With guitarist Bernie Leadon (later with The Flying Burrito Brothers and The Eagles), they produced two country rock and bluegrass-flavored albums: The Fantastic Expedition of Dillard & Clark and Through the Morning Through the Night, both of which fared poorly on the charts but were praised by critics. In 1969 a single was released, \"Lyin Down The Middle\". Through the Morning Through the Night was more bluegrass in character than its predecessor, used electric instrumentation and included Donna Washburn (Dillard's girlfriend) as a backing vocalist, all of which contributed to the departure of Bernie Leadon. The loss of Leadon as a co-writer meant that the album featured more covers than originals and the change of musical direction caused Clark to lose faith in the group, which disbanded in late 1969. In hindsight, Dillard & Clark, together with The Flying Burrito Brothers, Buffalo Springfield, Poco and The Byrds can be credited as prime influences on later soft Country rock performers such as The Eagles, Pure Prairie League and Firefall.\n\nIn 1970, Clark began work on a new single, recording two tracks with the original members of the Byrds (each recording his part separately). The resulting songs, \"She's The Kind Of Girl\" and \"One in a Hundred\", were not released at the time due to legal problems and were included later on Roadmaster. Frustrated with the music industry, Clark bought a home at Albion near Mendocino, married, and fathered two children while living off his still substantial Byrds royalties.\n\nIn 1970 and 1971, Clark contributed vocals and two compositions (\"Tried So Hard\" and \"Here Tonight\") to albums by the Flying Burrito Brothers.\n\nWhite Light\n\nIt wasn't until 1971 that a further Gene Clark solo set finally emerged. The album was titled White Light on the actual record, although the fact that the name was not included on the cover sleeve led some later reviewers to assume mistakenly that it was titled 'Gene Clark'. The record was produced by the much sought after Native American guitarist Jesse Ed Davis with whom Clark developed great rapport, partly due to their common Indian ancestry. A largely-acoustic work supplemented by slide guitar work by Davis, the album contained many introspective tracks such as \"With Tomorrow\", \"Because of You\", \" Where My Love Lies Asleep\" and \"For a Spanish Guitar\" (supposedly hailed by Bob Dylan as a song he would have been proud to compose). All of the material was written by Clark, with the exception of the Dylan number \"Tears of Rage\". Launched to considerable critical acclaim, the LP failed to gain commercial success, except in the Netherlands where it was also voted album of the year by rock music critics. Once more, Clark's refusal to undertake promotional touring adversely affected sales.\n\nIn the spring of 1971, Clark was commissioned by Dennis Hopper to contribute the tracks \"American Dreamer\" and \"Outlaw Song\" to Hopper's film project, \"American Dreamer\".\n\nA re-recorded, longer version of the song \"American Dreamer\" was later used in the 1977 film \"The Farmer\", along with an instrumental version of the same song plus \"Outside the Law (The Outlaw)\" (a re-recording of \"Outlaw Song\").\n\nIn 1972, Clark assembled a backing group consisting of highly accomplished country rock musicians to accompany him on a further album with A&M. Progress was slow and expensive and the project was terminated before completion by A&M. The resulting eight tracks, together with those recorded with The Byrds in 1970/71 and another with The Flying Burrito Brothers (\"Here Tonight\"), were belatedly released as Roadmaster in the Netherlands only.\n\nIn 1972, the Dillard & Clark song \"Through The Morning Through The Night\" was used in Quincy Jones's soundtrack of the Sam Peckinpah movie The Getaway.\n\nByrds\n\nClark then left A&M to rejoin the original Byrds and cut the album Byrds (released in 1973) which charted well (US # 20). Clark's compositions \"Full Circle\" and \"Changing Heart\" plus the Neil Young covers on which he did the lead vocal work (\"See The Sky About To Rain\" and \"Cowgirl In The Sand\") were widely regarded as the standout tracks on a record which received some negative critical response. Disheartened by the bad reviews and unhappy with David Crosby's performance as the record's producer, the group members chose to dissolve The Byrds. Clark briefly joined McGuinn's solo group, with which he premiered \"Silver Raven\", arguably his most celebrated post-Byrds opus.\n\nNo Other\n\nOn the basis of the quality of Clark's Byrds contributions, David Geffen signed him to Asylum Records in early 1974. Asylum was the home of the most prominent exponents of the singer-songwriter movement of the era and carried the kind of hip cachet that Clark hadn't experienced since his days with The Byrds. He retired to Mendocino and spent long periods at the picture window of his friend (and future co-writer and drummer) Andy Kandanes' cliff-top home with a notebook and acoustic guitar in hand, staring at the Pacific Ocean. Deeply affected by his visions, he composed numerous songs which would serve as the basis for his only Asylum LP, the aptly titled No Other. Produced by Thomas Jefferson Kaye with a vast array of session musicians and backing singers, the album was an amalgam of country rock, folk, gospel, soul and choral music with poetic, mystical lyrics. The fact that No Other wasn't a conventional pop/rock opus meant that its chances of success were greatly minimised by Clark's relative obscurity. Furthermore, its production costs of $100,000 which yielded only eight tracks prompted Geffen to berate Clark and Kaye. The album then stalled in the charts at #144. On a more personal note, the singer's return to Los Angeles and his reversion to a hedonistic lifestyle resulted in the disintegration of his marriage. In spite of these setbacks, he mounted his first solo tour (by road) , playing colleges and clubs with backing group, the Silverados.\n\nTwo Sides to Every Story\n\nThroughout 1975 and 1976, Clark hinted to the press that he was assembling a set of \"cosmic Motown\" songs fusing country-rock with R&B and funk, elaborating on the soundscapes of No Other. A set of ten demos were submitted to RSO Records, who promptly bought out Clark's contract.\n\nIn 1977, Clark released his RSO Records debut entitled Two Sides to Every Story. Once again produced by Thomas Jefferson Kaye but with a much more understated hand, the record was another characteristic offering of his style of sensitive country-rock balladry but failed to achieve US chart success. In a belated attempt to find an appreciative public, he temporarily overcame his fear of flying and launched an international promotional tour.\n\nMcGuinn, Clark and Hillman\n\nFor his British tour dates, Clark found himself on the same bill as ex-Byrds Roger McGuinn and Chris Hillman. The three signed with Capitol Records which released their self-titled debut in 1979. McGuinn, Clark and Hillman was a rebirth in both performing and songwriting for Clark. McGuinn's \"Don't You Write Her Off\" reached #33 in April 1979. Many felt that the album's slick production and disco rhythms didn't flatter the group, and the album had mixed success both critically and commercially, but it sold enough to generate a follow up. McGuinn, Clark and Hillman's second release was to have been a full group effort entitled City, but a combination of Clark's unreliability and his dissatisfaction with their musical direction (mostly regarding Ron and Howard Albert's production) resulted in the billing change on City to \"Roger McGuinn and Chris Hillman, featuring Gene Clark\". Despite the turmoil, Clark penned a classic love song, \"Won't Let You Down\", rumoured to have been offered as an olive branch to the other former Byrds. By 1981, Clark had left, and the group recorded one more album as \"McGuinn/Hillman\".\n\nRehabilitation, Firebyrd, and So Rebellious a Lover\n\nClark moved to Hawaii with Jesse Ed Davis to try to overcome his drug dependency, remaining there until the end of 1981. Upon his return to L.A., he assembled a new band and proceeded to record what would eventually become the album Firebyrd (the title acknowledges the Byrds and Firefall origins of some members). While waiting for Firebyrd to be released, Clark joined up with Chris Hillman and others in an abortive venture called Flyte which failed to secure a recording contract and was quickly dissolved. Firebyrd's eventual release in 1984 coincided with the emergence of jangle rockers like R.E.M. and Tom Petty who had sparked a new interest in the Byrds. Clark began developing new fans among L.A.'s roots-conscious paisley underground scene. Later in the decade, he embraced his new status by appearing as a guest with The Long Ryders and by cutting a duo album with Carla Olson of the Textones titled So Rebellious a Lover in 1986.\n\nLater career, illness and death\n\nSo Rebellious a Lover became a modest commercial success, but Clark began to develop serious health problems; he had ulcers, aggravated by years of heavy drinking (often used to alleviate his chronic travel anxiety), and in 1988 he underwent surgery, during which much of his stomach and intestines had to be removed. A period of abstinence and recovery followed until Tom Petty's cover of \"I'll Feel a Whole Lot Better,\" on his 1989 album Full Moon Fever, yielded a huge amount of royalty money to Clark who quickly reverted to drug and alcohol abuse. The Byrds set aside their differences long enough to appear together at their induction into the Rock & Roll Hall of Fame in January 1991, where the original lineup played a few songs together, including Clark's \"I'll Feel a Whole Lot Better.\" However, Clark's health continued to decline as his drinking accelerated and on May 24, 1991, he died at the age of 46 of a heart attack. He was buried in Tipton under a simple headstone inscribed \"Harold Eugene Clark - No Other.\"\n\nDiscography\n\nStudio Albums\n\n    * Gene Clark with the Gosdin Brothers (1967)\n    * The Fantastic Expedition of Dillard & Clark (1968) – with Doug Dillard\n    * Through the Morning, Through the Night (1969) – with Doug Dillard\n    * White Light a.k.a. Gene Clark (1971)\n    * Roadmaster (1972)\n    * No Other (1974)\n    * Two Sides to Every Story (1977)\n    * McGuinn, Clark & Hillman (1978) – with Roger McGuinn and Chris Hillman\n    * City (1980) – with Roger McGuinn and Chris Hillman\n    * Firebyrd (1984)\n    * So Rebellious a Lover (1987) – with Carla Olson\n\nLive albums\n\n    * Silhouetted in Light (1992) – with Carla Olson\n    * In Concert (2007) – with Carla Olson\n    * Silverado '75 - Live & Unreleased (2008)\n\nCompilations\n\n    * Echoes (1991) – collection of early material recorded with The Byrds and the Gosdin Brothers\n    * American Dreamer 1964-1974 (1993) – best of\n    * Flying High (1998) – anthology\n    * Gypsy Angel (2001) – collection of previously unreleased material\n    * Under the Silvery Moon (2003) – collection of previously unreleased material\n\nCovered songs\n\nDuring his career and subsequent to his death, Gene Clark's songs have been covered by a number of artists. Ian Matthews was an early promoter of Clark's songs, covering \"Polly\" on Matthews' 1972 Journeys from Gospel Oak album, and \"Tried So Hard\" on his 1974 Some Days You Eat The Bear album. Death In Vegas and Paul Weller covered his song \"So You Say You Lost Your Baby\" on their 2003 album Scorpio Rising. Shady (David Baker & friends) covered Life's Greatest Fool on their album 'World'. In 2007, two of his songs were recorded by Alison Krauss and Robert Plant on the T-Bone Burnett produced Raising Sand: \"Polly Come Home\" and \"Through the Morning, Through the Night.\" Also in 2007, Chris and Rich Robinson released a live version of \"Polly\" on their Brothers of a Feather: Live at the Roxy album. This Mortal Coil covered \"Strength of Strings\" from his LP No Other and \"With Tomorrow\" from LP White light. <a href=\"https://www.last.fm/music/Gene+Clark\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
