{"artist":{"name":"George Jones","mbid":"f2903be0-79a7-4334-8cc5-e45309482a97","url":"https://www.last.fm/music/George+Jones","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/68a9b55c3e204cedb9f51d2b95da7cad.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"312547","playcount":"2837067"},"similar":{"artist":[{"name":"Merle Haggard","url":"https://www.last.fm/music/Merle+Haggard","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fc4c0c3eb9944e068c512baeae6bd2a4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fc4c0c3eb9944e068c512baeae6bd2a4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fc4c0c3eb9944e068c512baeae6bd2a4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fc4c0c3eb9944e068c512baeae6bd2a4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fc4c0c3eb9944e068c512baeae6bd2a4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fc4c0c3eb9944e068c512baeae6bd2a4.png","size":""}]},{"name":"Waylon Jennings","url":"https://www.last.fm/music/Waylon+Jennings","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d158430c051a4c139c7d3fa47a2459c1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d158430c051a4c139c7d3fa47a2459c1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d158430c051a4c139c7d3fa47a2459c1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d158430c051a4c139c7d3fa47a2459c1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d158430c051a4c139c7d3fa47a2459c1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d158430c051a4c139c7d3fa47a2459c1.png","size":""}]},{"name":"Conway Twitty","url":"https://www.last.fm/music/Conway+Twitty","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2605666eebf14ed4ad35a891e213c46e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2605666eebf14ed4ad35a891e213c46e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2605666eebf14ed4ad35a891e213c46e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2605666eebf14ed4ad35a891e213c46e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2605666eebf14ed4ad35a891e213c46e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2605666eebf14ed4ad35a891e213c46e.png","size":""}]},{"name":"Buck Owens","url":"https://www.last.fm/music/Buck+Owens","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1b5bf4e145c64615bfb3ae7f63c8dbb6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1b5bf4e145c64615bfb3ae7f63c8dbb6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1b5bf4e145c64615bfb3ae7f63c8dbb6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1b5bf4e145c64615bfb3ae7f63c8dbb6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1b5bf4e145c64615bfb3ae7f63c8dbb6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1b5bf4e145c64615bfb3ae7f63c8dbb6.png","size":""}]},{"name":"Johnny Paycheck","url":"https://www.last.fm/music/Johnny+Paycheck","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3274b6b35afd4cffb51295f0996936bf.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3274b6b35afd4cffb51295f0996936bf.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3274b6b35afd4cffb51295f0996936bf.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3274b6b35afd4cffb51295f0996936bf.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3274b6b35afd4cffb51295f0996936bf.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3274b6b35afd4cffb51295f0996936bf.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"classic country","url":"https://www.last.fm/tag/classic+country"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"americana","url":"https://www.last.fm/tag/americana"},{"name":"george jones","url":"https://www.last.fm/tag/george+jones"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/George+Jones/+wiki"}},"published":"07 Sep 2006, 21:17","summary":"By most accounts, George Jones (born George Glenn Jones  September 12, 1931 in Saratoga, Texas, died April 26, 2013, in Nashville, Tennessee), was the finest vocalist in the recorded history of country music. Initially, he was a hardcore honky tonker in the tradition of Hank Williams, but over the course of his career he developed an affecting, nuanced ballad style. In the course of his career, he never left the top of the country charts, even as he suffered innumerable personal and professional difficulties. <a href=\"https://www.last.fm/music/George+Jones\">Read more on Last.fm</a>","content":"By most accounts, George Jones (born George Glenn Jones  September 12, 1931 in Saratoga, Texas, died April 26, 2013, in Nashville, Tennessee), was the finest vocalist in the recorded history of country music. Initially, he was a hardcore honky tonker in the tradition of Hank Williams, but over the course of his career he developed an affecting, nuanced ballad style. In the course of his career, he never left the top of the country charts, even as he suffered innumerable personal and professional difficulties. Only Eddy Arnold had more Top Ten hits, and Jones always stayed closer to the roots of hardcore country.\n\nJones was born and raised in east Texas, near the city of Beaumont. At an early age, he displayed an affection for music. He enjoyed the gospel he heard in church and on the family's Carter Family records, but he truly became fascinated with country music when his family bought a radio when he was seven. When he was nine, his father bought him his first guitar. Soon, his father had Jones playing and singing on the streets on Beaumont, earning spare change. At 16, he ran away to Jasper, TX, where he sang at a local radio station. Jones married Dorothy, his first wife, in 1950 when he was 19 years old. The marriage collapsed within a year and he enlisted in the Marines at the end of 1951. Though the U.S. was at war with Korea, Jones never served overseas — he was stationed at a military camp in California, where he kept singing in bars. After he was discharged, Jones immediately began performing again.\n\nIn 1953, Jones was discovered by record producer Pappy Daily, who was also the co-owner of Starday Records, a local Texas label. Impressed with Jones' potential, Daily signed the singer to Starday. \"No Money in This Deal,\" Jones' first single, was released in early 1954, but it received no attention. Starday released three more singles that year, which all were ignored. Jones released \"Why, Baby, Why\" late in the summer of 1955 and the single became his first hit, peaking at number four. However, its momentum was halted by a cover version by Webb Pierce and Red Sovine that hit number one on the country charts.\n\nJones was on the road to success and Daily secured the singer a spot on the Louisiana Hayride, where he co-billed with Elvis Presley. Jones reached the Top Ten with regularity in 1956 with such singles as \"What Am I Worth\" and \"Just One More.\" That same year, Jones recorded some rockabilly singles under the name Thumper Jones which were unsuccessful, both commercially and artistically. In August, he joined the cast of the Grand Ole Opry and his first album appeared by the end of the year. In 1957, Starday Records signed a distribution deal with Mercury Records and Jones' records began appearing under the Mercury label. Daily began recording Jones in Nashville, and his first single for the new label, \"Don't Stop the Music,\" was another Top Ten hit. Throughout 1958, he was landing near the top of the charts, culminating with \"White Lightning,\" which spent five weeks at number one in the spring of 1959. His next big hit arrived two years later, when the ballad \"Tender Years\" spent seven weeks at number one. \"Tender Years\" displayed a smoother production and larger arrangement than his previous hits, and it pointed the way toward Jones' later success as a balladeer.\n\nIn early 1962, Jones reached number five with \"Achin', Breakin' Heart,\" which would turn out to be his last hit for Mercury Records. Daily became a staff producer for United Artists Records in 1962 and Jones followed him to the label. His first single for UA, \"She Thinks I Still Care,\" was his third number one hit. In 1963, Jones began performing and recording with Melba Montgomery. During the early '60s, mainstream country music was getting increasingly slick, but Jones and Montgomery's harmonies were raw and laden with bluegrass influences. Their first duet, \"We Must Have Been out of Our Minds\" (spring 1963), was their biggest hit, peaking at number three. The pair continued to record together throughout 1963 and 1964, although they never again had a Top Ten hit; they also reunited in 1966 and 1967, recording a couple of albums and singles for Musicor. Jones had a number of solo hits in 1963 and 1964 as well, peaking with the number three \"The Race Is On\" in the fall of 1964.\n\nUnder the direction of Daily, Jones moved to the new record label Musicor in 1965. His first single for Musicor, \"Things Have Gone to Pieces,\" was a Top Ten hit in the spring of 1965. Between 1965 and 1970, he had 17 Top Ten hits for Musicor. While at Musicor, Jones recorded almost 300 songs in five years. During that time, he cut a number of first-rate songs, including country classics like \"Love Bug,\" \"Walk Through This World With Me,\" and \"A Good Year for the Roses.\" He also recorded a fair share of mediocre material, and given the sheer amount of songs he sang, that isn't surprising. Although Jones made a couple of records that were genuine tributes or experiments, he also tried to fit into contemporary country styles, such as the Bakersfield sound. Not all of the attempts resulted in hits, but he consistently charted the Top Ten with his singles, if not with his albums. Musicor wound up flooding the market with George Jones records for the rest of the '60s. Jones' albums for Musicor tended to be arranged thematically, and only two, his 1965 duet George Jones & Gene Pitney and 1969's I'll Share My World With You, charted. That meant that while Jones was one of the most popular and acclaimed singers in country music, there was still a surplus of material.\n\nLike his discography, Jones' personal life was spinning out of control. He was drinking heavily and began missing concerts. His second wife, Shirley, filed for divorce in 1968, and Jones moved to Nashville, where he met Tammy Wynette, the most popular new female singer in country music. Soon, Jones and Wynette fell in love; they married on February 16, 1969. At the same time Jones married Wynette, tensions that had been building between Jones and longtime producer Daily culminated. Jones was unhappy with the sound of his Musicor records, and he placed most of the blame on Daily. After his marriage, Jones wanted to record with Wynette, but Musicor wouldn't allow him to appear on her label, Epic, and Epic wouldn't let her sing on a Musicor album. Furthermore, Epic wanted to lure Jones away from Musicor. Jones was more than willing to leave, but he had to fulfill his contract before the company would let him go.\n\nWhile he continued recording material for Musicor, Epic entered contract negotiations with their rivals, and halfway through 1971, Jones severed ties with Musicor and Daily. He signed away all the rights to his Musicor recordings in the process. The label continued to release Jones albums for a couple of years, and they also licensed recordings to RCA, who released two singles and a series of budget-priced albums in the early '70s. Jones signed with Epic Records in October of 1971. It was the culmination of a busy year for Jones, one that saw him and Wynette becoming the biggest stars in country music, racking up a number of Top Ten hits as solo artists and selling out concerts across the country as a duo. Jones had successfully remade his image from a short-haired, crazed honky tonker to more relaxed, sensitive balladeer. At the end of the year, he cut his first records for Epic.\n\nJones' new record producer was Billy Sherrill, who had been responsible for Wynette's hit albums. Sherrill was known for his lush, string-laden productions and his precise, aggressive approach in the studio. Under his direction, musicians were there to obey his orders and that included the singers as well. Jones had been accustomed to the relaxed style of Daily, who was the polar opposite of Sherrill. As a result, the singer and producer were tense at first, but soon the pair developed a fruitful working relationship. With Sherrill, Jones became a full-fledged balladeer, sanding away the rough edges of his hardcore honky tonk roots.\n\n\"We Can Make It,\" his first solo single for Epic, was a celebration of Jones' marriage to Wynette, written by Sherrill and Glenn Sutton. The song was a number two hit early in 1972, kicking off a successful career at Epic. \"The Ceremony,\" Jones and Wynette's second duet, followed \"We Can Make It,\" and also became a Top Ten hit. \"Loving You Could Never Be Better,\" followed its predecessors into the Top Ten at the end of 1972. By now, the couple's marriage was becoming a public soap opera, with their audience following each single as if they were news reports. Even though they were proclaiming their love through their music, the couple had begun to fight frequently. Jones was sinking deep into alcoholism and drug abuse, which escalated as the couple continued to tour together.\n\nThough every single he released in 1973 went into the Top Ten, Jones' personal life was getting increasingly difficult. Wynette filed for divorce in August 1973. Shortly after she filed the papers, the couple decided to reconcile and her petition was withdrawn. Following her withdrawal, the duo had a number one single with the appropriately titled \"We're Gonna Hold On.\" In the summer of 1974, Jones had his first number one hit since \"Walk Through This World With Me\" with \"The Grand Tour,\" a song that drew a deft portrait of a broken marriage. He followed it with another number one hit, \"The Door.\" Not long after its release, he recorded \"These Days (I Barely Get By),\" which featured lyrics co-written by Wynette. Two days after he recorded the song, Wynette left Jones; they divorced within a year.\n\nThe late '70s were plagued with trouble for Jones. Between 1975 and the beginning of 1980, he had only two Top Ten solo hits — \"These Days (I Barely Get By)\" (1975) and \"Her Name Is\" (1976). Though they divorced, Jones and Wynette continued to record and tour together, and that is where he racked up the hits, beginning with the back-to-back 1976 number ones, \"Golden Ring\" and \"Near You.\" The decrease in hits accurately reflects the downward spiral in Jones' health in the late '70s, when he became addicted not only to alcohol, but to cocaine as well. Jones became notorious for his drunken, intoxicated rampages, often involving both drugs and shotguns. Jones would disappear for days at a time. He began missing a substantial amount of concerts — in 1979 alone, he missed 54 shows — which earned him the nickname \"No-Show Jones.\"\n\nJones' career began to pick up in 1978, when he began flirting with rock & roll, covering Chuck Berry's \"Maybellene\" with Johnny Paycheck and recording a duet with James Taylor called \"Bartender's Blues.\" The success of the singles — both went Top Ten — led to an album of duets, My Very Special Guests, in 1979. Though it was poised to be a return to the top of the charts for Jones, he neglected to appear at the scheduled recording sessions and had to overdub his vocals after his partners recorded theirs. That same year, doctors told the singer he had to quit drinking, otherwise his life was in jeopardy. Jones checked into a rehab clinic, but left after a month, uncured. Due to his cocaine addiction, his weight had fallen from 150 pounds to a mere 100. \n\nDespite his declining health, Jones managed a comeback in 1980. It began with a Top Ten duet with Tammy Wynette, \"Two Story House,\" early in the year, but the song that pushed him back to the top of the charts was the dramatic ballad \"He Stopped Loving Her Today.\" The single hit number one in the spring of the year, beginning a new series of Top Ten hits and number one singles that ran through 1986. The string of hits was so successful it rivaled the peak of his popularity in the '60s. \"He Stopped Loving Her Today\" was followed by the Top Ten \"I'm Not Ready Yet\" and an album, I Am What I Am, in the fall of the 1980. I Am What I Am became his most successful album, going platinum.\n\nThroughout 1981 and 1983, he had eight Top Ten hits. Although he was having hits again, he hadn't kicked his addictions. Jones was still going on crazed, intoxicated rampages, which culminated with a televised police chase of Jones, who was driving drunk, through the streets of Nashville. Following his arrest, Jones managed to shake his drug and alcohol addictions with the support of his fourth wife, Nancy Sepulvada. Jones and Sepulvada married in March of 1983. Soon after their marriage, he began to detoxicate and by the end of 1983, he had completed his rehabilitation.\n\nJones continued to have Top Ten hits regularly until 1987, when country radio became dominated by newer artists; ironically, the artists that kept him off the charts — singers like Randy Travis, Keith Whitley, and Dwight Yoakam — were heavily influenced by Jones himself. Jones and Sepulvada moved back to Nashville in 1987. In 1988, he recorded his final album with Billy Sherrill, One Woman Man. The title song, which was a hit for Johnny Horton in 1956, was Jones' final solo Top Ten hit. One Woman Man was his last record for Epic Records. After its release, he moved to MCA, releasing his first record for the label, And Along Came Jones, in the fall of 1991. In between its release and One Woman Man arrived a duet with Randy Travis, \"A Few Ole Country Boys,\" that was a Top Ten hit in the fall of 1990. Jones' records for MCA didn't sell nearly as well as his Epic albums, but his albums usually were critically acclaimed. In 1995, he reunited with Wynette to record One. In April of 1996, Jones published his autobiography, I Lived to Tell It All. In 1998, he returned with another studio album, It Don't Get Any Better Than This. \n\nFollowing the release of It Don't Get Any Better Than This, Jones moved from MCA to Elektra/Asylum, who signed him on the provision that he would record hardcore country music. Jones was completing work on his debut for the label when he crashed his car into a bridge in Nashville on March 6, 1999, critically injuring himself. Amazingly, he pulled through the accident, but the investigation proved that Jones had been drinking and driving — a troubling revelation, given his long history with alcoholism. He plead guilty to a lesser charge, DWI, and entered a rehab program. The release of his Elektra/Asylum debut, Cold Hard Truth, went on as scheduled, appearing in stores in the summer of 1999. The Rock: Stone Cold Country 2001 followed in 2001. Hits I Missed...And One I Didn't from 2005 found Jones looking back over the years and picking songs that he originally declined to record, but were hits for the other artists.  <a href=\"https://www.last.fm/music/George+Jones\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
