{"artist":{"name":"Gershon Kingsley","mbid":"79837901-1e7a-4dad-80e9-3faf0668e09e","url":"https://www.last.fm/music/Gershon+Kingsley","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ea29517e56b94f849ef6dc22c580d89f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ea29517e56b94f849ef6dc22c580d89f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ea29517e56b94f849ef6dc22c580d89f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ea29517e56b94f849ef6dc22c580d89f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ea29517e56b94f849ef6dc22c580d89f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ea29517e56b94f849ef6dc22c580d89f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"18905","playcount":"149641"},"similar":{"artist":[{"name":"Hot Butter","url":"https://www.last.fm/music/Hot+Butter","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2654df41efcf492b8cca3029c428abb2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2654df41efcf492b8cca3029c428abb2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2654df41efcf492b8cca3029c428abb2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2654df41efcf492b8cca3029c428abb2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2654df41efcf492b8cca3029c428abb2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2654df41efcf492b8cca3029c428abb2.png","size":""}]},{"name":"Jean-Jacques Perrey","url":"https://www.last.fm/music/Jean-Jacques+Perrey","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2e209743f8d642489e932f773c03768f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2e209743f8d642489e932f773c03768f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2e209743f8d642489e932f773c03768f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2e209743f8d642489e932f773c03768f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2e209743f8d642489e932f773c03768f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2e209743f8d642489e932f773c03768f.png","size":""}]},{"name":"Perrey & Kingsley","url":"https://www.last.fm/music/Perrey+&+Kingsley","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a50822b82d3744cfbf7b2b660ec4a10f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a50822b82d3744cfbf7b2b660ec4a10f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a50822b82d3744cfbf7b2b660ec4a10f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a50822b82d3744cfbf7b2b660ec4a10f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a50822b82d3744cfbf7b2b660ec4a10f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a50822b82d3744cfbf7b2b660ec4a10f.png","size":""}]},{"name":"Mort Garson","url":"https://www.last.fm/music/Mort+Garson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f3ff8382ed7c4614797c18b05e778c30.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f3ff8382ed7c4614797c18b05e778c30.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f3ff8382ed7c4614797c18b05e778c30.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f3ff8382ed7c4614797c18b05e778c30.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f3ff8382ed7c4614797c18b05e778c30.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f3ff8382ed7c4614797c18b05e778c30.png","size":""}]},{"name":"Bruce Haack","url":"https://www.last.fm/music/Bruce+Haack","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/db90be93638c4dbb95f9d6405f15115d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/db90be93638c4dbb95f9d6405f15115d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/db90be93638c4dbb95f9d6405f15115d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db90be93638c4dbb95f9d6405f15115d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db90be93638c4dbb95f9d6405f15115d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db90be93638c4dbb95f9d6405f15115d.png","size":""}]}]},"tags":{"tag":[{"name":"electronic","url":"https://www.last.fm/tag/electronic"},{"name":"moog","url":"https://www.last.fm/tag/moog"},{"name":"experimental","url":"https://www.last.fm/tag/experimental"},{"name":"Avant-Garde","url":"https://www.last.fm/tag/Avant-Garde"},{"name":"musique concrète","url":"https://www.last.fm/tag/musique+concr%C3%A8te"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Gershon+Kingsley/+wiki"}},"published":"13 Sep 2006, 09:27","summary":"Gershon Kingsley was born Goetz Gustav Ksinski in Bochum, Westfalia, Germany on October 28,1922. He grew up in Berlin, but fled to Palestine in 1938 because of the rise of Nazism. Separated from his family at age 15, Kingsley lived and worked on a kibbutz (a cooperative farm) in a land that would become Israel. Here, he became a self-taught pianist and later performed with local jazz bands around Jerusalem and Tel Aviv.  He is probably most famous for his \"Popcorn\" tune, popularized by Hot Butter. <a href=\"https://www.last.fm/music/Gershon+Kingsley\">Read more on Last.fm</a>","content":"Gershon Kingsley was born Goetz Gustav Ksinski in Bochum, Westfalia, Germany on October 28,1922. He grew up in Berlin, but fled to Palestine in 1938 because of the rise of Nazism. Separated from his family at age 15, Kingsley lived and worked on a kibbutz (a cooperative farm) in a land that would become Israel. Here, he became a self-taught pianist and later performed with local jazz bands around Jerusalem and Tel Aviv.  He is probably most famous for his \"Popcorn\" tune, popularized by Hot Butter.\n\nHe served as a gaffir (mounted patrolman) and studied at the Jerusalem Conservatory, then came to America in 1946 with hopes of attending the Julliard School of Music. The school, however, would not accept him because he had no high school degree. So, at the age of twenty-four, he left for Los Angeles, finished high school at night and attended the LA Conservatory of Music (now known as Cal Arts). For work, he would play the organ at several synagogues in the area.\n\nAfter graduating from the conservatory with a BA in Music, Kingsley began to conduct for summer stock theater at the \"Music Circus\" in Sacramento, California.\n\nBut when Kingsley moved to New York in 1955, his career really began to take flight. After a season conducting for the \"Melody Fair\" musical theater in Framingham, Massachusetts, he became the musical director for a Broadway production of The Entertainer starring Lawrence Olivier. Then, in 1958, he was nominated for a \"Tony\" Award for Best Musical Direction in the Broadway musical hit La Plume de ma Tante. He conducted and arranged for several Broadway and Off-Broadway productions, including Porgy & Bess, Jamaica, Ernest in Love, The Cradle Will Rock and Fly Blackbird. Kingsley earned two \"Obie\" Awards for his Off-Broadway theatrical work.\n\nAround this time, Kingsley also was also musical director for the Robert Joffrey Ballet, Joséphine Baker and the highly-acclaimed television special The World of Kurt Weill starring Lotte Lenya.\n\nAs a composer, Kingsley has focused primarily on theatrical works both religious and secular. His religious works are inspired by Jewish and Hebrew texts and are described as \"scenic cantatas.\" They include: A Prophet's Song of Love, What Is Man?, Shabbat for Today , They Never Had the Chance to Live, Simcha, The Fifth Cup and Friday of Thanksgiving. Shabbat for Today and The Fifth Cup have been nationally broadcast and performed extensively throughout the U.S. He also wrote the popular choral anthem \"Shepherd Me, Lord.\"\n\nIn 1966, while working as the Staff Arranger for Vanguard Records, Kingsley collaborated with French composer Jean-Jacques Perrey on a highly-experimental pop album entitled \"The In Sound from Way Out.\" (LINK TO: Insound) Here, they combined dozens of intricately designed tape loops with live studio musicians to produce an altogether new sound that pushed the envelope of modern music and became an instant hit with the advertising industry. A second album, called \"Kaleidoscopic Vibrations\" highlighted the potential of the Moog synthesizer and produced the tune \"Baroque Hoedown,\" which became part of the Main Street Electrical Parade at Disney theme parks worldwide.\n\nKingsley soon became one of the foremost artists of Moog music. In 1969, he released an album entitled \"Music to Moog By, which received enthusiastic reviews and has since become a classic among Moog connoisseurs.\n\nIn 1970, Kingsley formed the First Moog Quartet, a four-synthesizer ensemble that was a pioneering effort to bring electronic music into classical music venues. The group made history when it performed the first live show of synthesized music ever in Carnegie Hall. The concert, which featured dancers, abstract film collage and otherworldly music received very mixed reviews. \"People were kind of confused about the concert,\" says Kingsley. \"I understand, because it was just so new.\"\n\nSoon after the show, Arthur Fiedler, then conductor of the Boston Pops, asked Kingsley to compose a work for synthesizer quartet and symphony orchestra. \"Concerto Moogo\", as it was known, was premiered in 1971 at the Boston Symphony Hall and was televised across the country. The First Moog Quartet (under Kingsley's direction) subsequently made a nationwide tour of universities and performed with several orchestras, including the Miami, Detroit and Indianapolis Symphonies as well as the Munich and Cologne Radio Orchestras in Germany.\n\nThe next year, Kingsley's electronic composition \"Popcorn\", (a classically-inspired pop song) became an international hit and inspired hundreds of arrangements and stylized remakes worldwide and as recently as this year.\n\nKingsley has also composed extensively for television and motion pictures. His work has won him an \"Emmy\" Award for the music of A New Voice in the Wilderness, and two \"Clio\" Awards for outstanding music in TV commercials. He also wrote theme music for the American game show \"The Joker's Wild\" and the German shows \"Kommödchen\" and \"Babbelgamm.\"\n\nIn the mid 1980's, Kingsley focused on the then-nascent genre of electronic New Age music and released \"Much Silence\" on Relativity Theory Records. This was followed up by \"Sanctuary\" and \"Anima\", a collection of Kingsley's New Age music produced by Kingsley Sound, Inc.\n\nIn 1992, Kingsley composed two separate works to commemorate the 500th anniversary of Columbus' voyage to America: Cristobal, a musical performed at New York's Union Square Theater; and Tierra, an opera performed at the Gasteig Concert Hall in Munich, Germany. Voices from the Shadow , a theatrical concert piece based on the poetry of the holocaust, had its premiere in 1998 at Lincoln Center in New York City.\n\nMost recently, Kingsley has finished work on several projects, including a new version of \"Popcorn\" to be released on the Beastie Boys' Grand Royal record label, and \"Selma\", a cycle of songs inspired by the holocaust poetry of Selma Meerbaum-Eisinger. He has also completed a new avant-garde, electronic album entitled \"Music Between Chairs\".\n\nOver the last 2 years, Kingsley and Michael Kunze (libretto) cooperated on the opera \"RAOUL\" about Raoul Wallenberg, the Swedish trademan who saved thousand of jews from certain death in the Nazi concentration camps.The premier concert version has been performed at the Goethe Institute New York on April 30, 2004. <a href=\"https://www.last.fm/music/Gershon+Kingsley\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
