{"artist":{"name":"Ghorwane","mbid":"7ba22880-978f-4e4c-849a-3baf167fc9c0","url":"https://www.last.fm/music/Ghorwane","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a40dec31481635799f4725c59a294c81.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a40dec31481635799f4725c59a294c81.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a40dec31481635799f4725c59a294c81.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a40dec31481635799f4725c59a294c81.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a40dec31481635799f4725c59a294c81.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a40dec31481635799f4725c59a294c81.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"6724","playcount":"24549"},"similar":{"artist":[{"name":"Eyuphuro","url":"https://www.last.fm/music/Eyuphuro","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/315a6023fe1c4da3b8b7e52198cb09c8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/315a6023fe1c4da3b8b7e52198cb09c8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/315a6023fe1c4da3b8b7e52198cb09c8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/315a6023fe1c4da3b8b7e52198cb09c8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/315a6023fe1c4da3b8b7e52198cb09c8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/315a6023fe1c4da3b8b7e52198cb09c8.png","size":""}]},{"name":"Ifang Bondi","url":"https://www.last.fm/music/Ifang+Bondi","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3f77191d2230c78fda8c8ca24558dd21.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3f77191d2230c78fda8c8ca24558dd21.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3f77191d2230c78fda8c8ca24558dd21.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f77191d2230c78fda8c8ca24558dd21.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f77191d2230c78fda8c8ca24558dd21.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f77191d2230c78fda8c8ca24558dd21.png","size":""}]},{"name":"Mabulu","url":"https://www.last.fm/music/Mabulu","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1629a806fa81449da6f32c9f74dbc72e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1629a806fa81449da6f32c9f74dbc72e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1629a806fa81449da6f32c9f74dbc72e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1629a806fa81449da6f32c9f74dbc72e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1629a806fa81449da6f32c9f74dbc72e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1629a806fa81449da6f32c9f74dbc72e.png","size":""}]},{"name":"Orchestra Marrabenta Star de Moçambique","url":"https://www.last.fm/music/Orchestra+Marrabenta+Star+de+Mo%C3%A7ambique","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e5ef2ffe223f419da1ee69a979a00a3b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e5ef2ffe223f419da1ee69a979a00a3b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e5ef2ffe223f419da1ee69a979a00a3b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5ef2ffe223f419da1ee69a979a00a3b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5ef2ffe223f419da1ee69a979a00a3b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5ef2ffe223f419da1ee69a979a00a3b.png","size":""}]},{"name":"Eric Agyeman","url":"https://www.last.fm/music/Eric+Agyeman","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f2f9e858fd234e9f8beca53529ec1b19.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f2f9e858fd234e9f8beca53529ec1b19.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f2f9e858fd234e9f8beca53529ec1b19.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2f9e858fd234e9f8beca53529ec1b19.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2f9e858fd234e9f8beca53529ec1b19.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2f9e858fd234e9f8beca53529ec1b19.png","size":""}]}]},"tags":{"tag":[{"name":"Mozambique","url":"https://www.last.fm/tag/Mozambique"},{"name":"african","url":"https://www.last.fm/tag/african"},{"name":"world","url":"https://www.last.fm/tag/world"},{"name":"World Music","url":"https://www.last.fm/tag/World+Music"},{"name":"africa","url":"https://www.last.fm/tag/africa"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Ghorwane/+wiki"}},"published":"13 Feb 2009, 17:48","summary":"Ghorwane, the “Good Guys” of Mozambique by José Pinto Sá\n\n\nIn the hot and dusty Gaza province of Mozambique there is a small lake called Ghorwane that never runs dry, even in the hottest season. In 1983, a group of young musicians in Maputo, took the name Ghorwane as they launched their musical career. Today they are one of Mozambique’s most respected bands. Ghorwane chose to base their music on traditional Mozambican rhythms, combined with Afropop and fusion. <a href=\"https://www.last.fm/music/Ghorwane\">Read more on Last.fm</a>","content":"Ghorwane, the “Good Guys” of Mozambique by José Pinto Sá\n\n\nIn the hot and dusty Gaza province of Mozambique there is a small lake called Ghorwane that never runs dry, even in the hottest season. In 1983, a group of young musicians in Maputo, took the name Ghorwane as they launched their musical career. Today they are one of Mozambique’s most respected bands. Ghorwane chose to base their music on traditional Mozambican rhythms, combined with Afropop and fusion. At the time when most established groups earned a living by imitating foreign artists, this approach came as a stimulating innovation. The injection of life they have shot into the stagnant music scene, and their subsequent success, have inspired other bands to take a similar route.\n\nThe band is noted for the political and social criticism in their songs which has put them at loggerheads with the government from time to time. They have mirrored the frustration of their people at the continuing war that was grinding deeper into despair day after day, year after year. The lyrics are sung in African languages of Mozambique, like Changana, Ronga and Chope. The security services often attended their shows with instructions to listen closely to their lyrics. What saved them was that, in 1985 during the festival to celebrate the ten years of independence, Samora Machel (then President of Mozambique) declared that “It’s prohibited to lie in the People’s Republic of Mozambique” and cites Ghorwane as an example calling them “bons rapazes” - good guys - which they are called until today by the Mozambican people. \n\nIn 1986 Ghorwane recorded a number of songs amongst which \"Massotcha\" written by Zeca Alage, which spoke about the horror of war and the danger of the military to the people they meant to be protecting. This song immediately became number one on the Mozambican hit parade. Again voices were raised to lay a total censorship on the band and again Samora Machel defended his “bons rapazes” and invited them to play at the anniversary of his wedding, a few months before the dead of Samora Machel.\nIn 1987 Ghorwane were invited by the DDR to perform at a political music festival. Just before their departure their visa were refused. The leader of the Mozambican National Youth Organization advised this as according to him the lyrics of Ghorwane were subversive. The same year in September, Ghorwane played for the first time abroad at the independence festival in Swaziland, together with the South African groups P.J. Powers and Stimela.\n\nPeter Gabriel invited them to play at the WOMAD Festival in 1990. During this festival Realworld offered them an opportunity to record the CD \"Majurugenta\". Just before the European promotional tour of “Majurugenta” in 1993 Ghorwane’s most beloved member the saxophone player and composer Zeca Alage was assassinated. In memorial of Zeca Ghorwane decided to go on with the promotional tour. The CD was launched and distributed by Virgin Records. For distribution in southern Africa, Ghorwane printed a new version of \"Majurugenta\".\n\nWith Karen Boswell as musical director, Ghorwane made the music for the soap opera series \"Não é preciso empurrar\" - you don’t have to push -, an education series for the elections in 1994. The text was written by Mia Couto, a well known Mozambican writer. A year later Ghorwane accompanied forty Mozambican artists to the SADC Music Festival in Zimbabwe.\n\nGhorwane made the recordings of their second CD \"Kudumba\" in 1996 which was released in 1997 by Piranha.\n\nAfter the devastating floods that hit Mozambique in the beginning of the year 2000, Ghorwane participated in a Project called MOZAMBIQUE RELIEF. A production of a CD that would benefit the victims of the floods.\n\n“Recorded in Maputo, Mozambique in April 2000, this collection of southern African music brings together some of Mozambique's best musicians for a benefit record in aid of rebuilding and helping victims of the country's flooding disaster. \nThe devastating floods and cyclones that hit Mozambique between February and early April were the worst in 40 years. It affected 4.5 million people (27% of the total population) and a million people lost everything. About this time, Finnish musician Eero Koivistoinen was suppose to travel to a village in the Zavala district and make a field recording with a timbila ensemble for Naxos World. But with the disaster making the project impossible at the time, he and Naxos World executive Andrew Sun drew up a new plan. \nKoivistoinen had worked with Ghorwane, the most famous band to come out of Mozambique (they had recorded an album for Peter Gabriel's Real World label) and their leader Joao Carlos Schwalbach rounded up other artists in the local music community in Maputo, Mozambique. The result is an inspired and solid set of Afro-pop music made by artists from the community, but more significantly a portion of the proceeds from this recording will come back to help the country. \nAs Koivistonen explains, \"Every musician involved understood the importance of the matter. There was a possibility of helping to rebuild the country, because the profits from the record would come back to Mozambique through Oxfam. In this respect, the project is unique: the Mozambicans can help themselves.\" \nOf the participating acts, Ghorwane is indeed the best known and most respected band in Mozambique. They contribute three tracks to the CD, 'Mayvavo' (two versions) and 'Wavitika.'.”(Naxos World)\n\n\nEven though the war is over Ghorwane have not stopped their political and social criticism concerning developments in their country and the influence of the foreign countries and organizations in aid programs.\n\nwww.ghorwane.com\n <a href=\"https://www.last.fm/music/Ghorwane\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
