{"artist":{"name":"Gian Marco","url":"https://www.last.fm/music/Gian+Marco","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/db1378b3fd8548db9d54efa89fc27e11.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/db1378b3fd8548db9d54efa89fc27e11.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/db1378b3fd8548db9d54efa89fc27e11.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db1378b3fd8548db9d54efa89fc27e11.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db1378b3fd8548db9d54efa89fc27e11.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db1378b3fd8548db9d54efa89fc27e11.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"16742","playcount":"186420"},"similar":{"artist":[{"name":"Santiago Cruz","url":"https://www.last.fm/music/Santiago+Cruz","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0cc5f2ff9da0468d869ca72408176b1c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0cc5f2ff9da0468d869ca72408176b1c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0cc5f2ff9da0468d869ca72408176b1c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0cc5f2ff9da0468d869ca72408176b1c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0cc5f2ff9da0468d869ca72408176b1c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0cc5f2ff9da0468d869ca72408176b1c.png","size":""}]},{"name":"Andrés Cepeda","url":"https://www.last.fm/music/Andr%C3%A9s+Cepeda","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b821a3aabd194c158d2159a498060145.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b821a3aabd194c158d2159a498060145.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b821a3aabd194c158d2159a498060145.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b821a3aabd194c158d2159a498060145.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b821a3aabd194c158d2159a498060145.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b821a3aabd194c158d2159a498060145.png","size":""}]},{"name":"Christian Meier","url":"https://www.last.fm/music/Christian+Meier","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e2e358e150d74e6fa89bd23ad9194e9e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e2e358e150d74e6fa89bd23ad9194e9e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e2e358e150d74e6fa89bd23ad9194e9e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e2e358e150d74e6fa89bd23ad9194e9e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e2e358e150d74e6fa89bd23ad9194e9e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e2e358e150d74e6fa89bd23ad9194e9e.png","size":""}]},{"name":"Mar de Copas","url":"https://www.last.fm/music/Mar+de+Copas","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a96161a59f474ce9a3fce8a106a3e291.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a96161a59f474ce9a3fce8a106a3e291.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a96161a59f474ce9a3fce8a106a3e291.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a96161a59f474ce9a3fce8a106a3e291.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a96161a59f474ce9a3fce8a106a3e291.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a96161a59f474ce9a3fce8a106a3e291.png","size":""}]},{"name":"Piso 21","url":"https://www.last.fm/music/Piso+21","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/148bbb1541b0e863abe4f5da8078a927.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/148bbb1541b0e863abe4f5da8078a927.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/148bbb1541b0e863abe4f5da8078a927.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/148bbb1541b0e863abe4f5da8078a927.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/148bbb1541b0e863abe4f5da8078a927.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/148bbb1541b0e863abe4f5da8078a927.png","size":""}]}]},"tags":{"tag":[{"name":"Peru","url":"https://www.last.fm/tag/Peru"},{"name":"peruvian","url":"https://www.last.fm/tag/peruvian"},{"name":"latin","url":"https://www.last.fm/tag/latin"},{"name":"pop espanol","url":"https://www.last.fm/tag/pop+espanol"},{"name":"spanish","url":"https://www.last.fm/tag/spanish"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Gian+Marco/+wiki"}},"published":"24 May 2006, 17:56","summary":"Gian Marco Javier Zignago Alcóver es un cantante y compositor peruano. Es reconocido como un prestigioso cantante por vender miles de copias de álbumes de cuyas canciones es autor en su mayoría. Ganador del Grammy Latino 2005 al mejor álbum Cantautor y nombrado embajador de buena voluntad en el Perú por UNICEF son alguno de los reconocimientos obtenidos en sus más de 15 años de trayectoria profesional.\n\nSu madre es la conocida actriz y cantante peruana <a href=\"https://www.last.fm/music/Gian+Marco\">Read more on Last.fm</a>","content":"Gian Marco Javier Zignago Alcóver es un cantante y compositor peruano. Es reconocido como un prestigioso cantante por vender miles de copias de álbumes de cuyas canciones es autor en su mayoría. Ganador del Grammy Latino 2005 al mejor álbum Cantautor y nombrado embajador de buena voluntad en el Perú por UNICEF son alguno de los reconocimientos obtenidos en sus más de 15 años de trayectoria profesional.\n\nSu madre es la conocida actriz y cantante peruana, Regina Alcóver Ureta, y su padre, el difunto compositor y cantante peruano Javier Zignago, conocido en el ambiente musical como \"Joe Danova\".\n\nCon sólo dos años de edad cantó por primera vez en televisión en la ciudad de Buenos Aires, Argentina, en el programa Domingos Gigantes, bajo la conducción de Orlando Marconi. Un año después, canta en Caracas, Venezuela, en el programa La Revista de los Sábados. La audiencia televisiva disfrutó impresionada de un niño de tres años que cantaba una canción de moda titulada Eva María.\n\nGian Marco estudio primaria y secundaria en el colegio Santa Margarita en el afluente barrio de Monterrico en Lima, Perú.\n\nEn 1981, a los 11 años de edad, participa al lado de su madre en la obra musical Papito Piernas Largas, grabando un tema dentro del disco de la obra.\nDurante sus años juveniles, Gian Marco participó en una serie de eventos artísticos, cantando y actuando, desarrollando su talento y preparándose para lo que sería después, y es todavía, su exitosa carrera profesional.\n\nAños más tarde, guitarra en mano, buscaría en diversos locales de la capital -entre ellos La Estación de Barranco, el que más tarde recuerda en su tema Retrato- el aplauso y reconocimiento por sus primeras canciones y composiciones. Así se fue consolidando la vena artística de este joven talento.\n\nA los 18 años Gian Marco viaja a la ciudad de Santiago de Chile (Chile) para especializarse en diseño gráfico. Aunque todo parecía caminar bien, su alma necesitaba de la música, por ello decide demostrar su arte logrando presentarse en los locales más concurridos de Santiago y Viña del Mar. Su nombre empezaba a sonar, pues su estilo personal llamaba la atención de quienes lo escuchaban por primera vez.\n\nAño y medio más tarde regresa a Lima y clasifica un tema en la versión peruana del Festival OTI 1989. Logró captar la atención de la prensa especializada, siendo el artista más promocionado en dicho evento. Es ahí donde Discos Independientes le propone grabar su primer disco. A comienzos de 1990 sale al mercado discográfico nacional su primera producción titulada Gian Marco, bajo la dirección musical de Pepe Ortega.\n\nEn 1992 graba su segundo larga duración titulado Personal, realizado en Santiago de Chile de la mano de Pepe Ortega. Esta producción logró colocar en ese año, en los rankings los temas Te Extrañaré y Dame un Beso.\n\nGian Marco graba la canción principal de la Copa América Perú 2004 llamada Más allá de los sueños.\n\nEn el 2003 recibió en los Premios de La Música de la Sociedad General de Autores y Editores de España (SGAE) el premio como Artista Revelación Latino.\nLuego vino el álbum Resucitar (2004), un álbum mucho más orgánico y como él mismo dice no canta tanto al desamor como el anterior, es un álbum más positivo. Este disco le dio un éxito gracias a su amistad con Emilio Estefan , con el que llegó a obtener un Grammy Latino en el año 2005. De este disco se desprendieron los singles Resucitar, Sin querer, Gota de lluvia, Después de mi, Lejos de ti y Soy.\n\nEn el 2005 Gian Marco realiza un gran concierto por sus 15 años de carrera, el cual se realizó en el Estadio Monumental U y contó con más de 40,000 espectadores. Varios invitados, entre ellos Regina Alcover (su madre), Mauricio y palo de agua, Pelo Madueño y Antonio Cartagena, entre otros, arroparon a Gianmarco en este emotivo concierto. El concierto terminó con una magnífica interpretación de la canción Hoy, la que terminó con un mix de huaynos peruanos y el reconocimiento al gran cantautor peruano.\n\nEl 17 de noviembre de 2006 Gian Marco lanza al mercado \"8\". Este álbum contiene 10 temas inéditos y presenta como primer single en territorio peruano la canción titulada No te avisa. En Colombia y el resto del mundo el primer single es Que pasa, una canción en la cual Gian Marco incursiona en el rap y da a sus seguidores un sonido un tanto distinto de lo que normalmente están acostumbrados a oír.\n\nEn el 2007 continua la promoción de su más reciente disco de estudio (\"8\") con el segundo single en Peru: \"Quiero saber\", estrena los videos para \"Que pasa\" y \"No te avisa\", y graba un comercial para la empresa de telefonía celular \"Claro\" junto a la \"foquita\" Farfán, en el cual estrena una nueva canción llamada \"Algo nuevo\". Durante el año 2007 también continua con su faceta de compositor y coloca dos canciones en el nuevo álbum de Alejandro Fernandez: \"No se me hace fácil\" y \"Sueño contigo\". En el mes de junio del mismo año realiza un concierto junto al tenor Juan Diego Flórez en el Jockey Club del Perú en la ciudad de Lima. Este año también sale una canción grabada exclusivamente para un comercial de la empresa \"Claro\" llamada \"Algo nuevo\".\n\nDespués de tener como singles en Peru a \"No te avisa\" y \"Quiero saber\", e internacionalmente a \"Que pasa\", Gian Marco lanza su nuevo single \"Loco\", el cual continua con la promoción del disco \"8\". Posteriormente se conluye la promoción de este álbum con las canciones \"Vientos del sur\" y finalmente \"Nunca más te vi\".\n\nA finales del 2007 se lanza el primer libro de Gian marco llamado \"La madera del alma: relatos para escuchar el silencio\", el cual es un cuento de corte infantil.\n\nEl 18 de junio de 2008 sale a la venta \"Desde adentro\", el más reciente disco de Gian Marco, que incluye canciones que fueron compuestas para artistas como Gloria Estefan, Obie Bermudez, Alejandro Fernandez, entre otros. También se incluyen dos canciones nuevas: \"Todavía\" y \"Hasta que la vida pase\". Este álbum saca a relucir un sonido más acústico, a diferencia del anterior \"8\", y demuestra la madurez musical de Gian Marco a sus casi 20 años de carrera. <a href=\"https://www.last.fm/music/Gian+Marco\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
