{"artist":{"name":"Go Fish","mbid":"d4620364-82ec-4c34-9265-a2b72dfa8e3e","url":"https://www.last.fm/music/Go+Fish","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b164a8e1cfc74ea4a3e24935d1baee0f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b164a8e1cfc74ea4a3e24935d1baee0f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b164a8e1cfc74ea4a3e24935d1baee0f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b164a8e1cfc74ea4a3e24935d1baee0f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b164a8e1cfc74ea4a3e24935d1baee0f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b164a8e1cfc74ea4a3e24935d1baee0f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"5461","playcount":"99420"},"similar":{"artist":[{"name":"Glad","url":"https://www.last.fm/music/Glad","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3d61e3aad6034bbe993cbaed7175af65.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3d61e3aad6034bbe993cbaed7175af65.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3d61e3aad6034bbe993cbaed7175af65.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d61e3aad6034bbe993cbaed7175af65.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d61e3aad6034bbe993cbaed7175af65.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d61e3aad6034bbe993cbaed7175af65.png","size":""}]},{"name":"Tonic Sol-fa","url":"https://www.last.fm/music/Tonic+Sol-fa","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6327651c97244c59abb32973387fb1f7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6327651c97244c59abb32973387fb1f7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6327651c97244c59abb32973387fb1f7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6327651c97244c59abb32973387fb1f7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6327651c97244c59abb32973387fb1f7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6327651c97244c59abb32973387fb1f7.png","size":""}]},{"name":"Acappella","url":"https://www.last.fm/music/Acappella","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/53621bf9cbc74fa3a42d6aa639c4af42.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/53621bf9cbc74fa3a42d6aa639c4af42.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/53621bf9cbc74fa3a42d6aa639c4af42.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/53621bf9cbc74fa3a42d6aa639c4af42.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/53621bf9cbc74fa3a42d6aa639c4af42.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/53621bf9cbc74fa3a42d6aa639c4af42.png","size":""}]},{"name":"Ball in the House","url":"https://www.last.fm/music/Ball+in+the+House","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e063416c4fbf414daa7c0fce5790d7c2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e063416c4fbf414daa7c0fce5790d7c2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e063416c4fbf414daa7c0fce5790d7c2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e063416c4fbf414daa7c0fce5790d7c2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e063416c4fbf414daa7c0fce5790d7c2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e063416c4fbf414daa7c0fce5790d7c2.png","size":""}]},{"name":"The House Jacks","url":"https://www.last.fm/music/The+House+Jacks","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4b716e4e8b234a03a52c265c83b1dec2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4b716e4e8b234a03a52c265c83b1dec2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4b716e4e8b234a03a52c265c83b1dec2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4b716e4e8b234a03a52c265c83b1dec2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4b716e4e8b234a03a52c265c83b1dec2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4b716e4e8b234a03a52c265c83b1dec2.png","size":""}]}]},"tags":{"tag":[{"name":"christian","url":"https://www.last.fm/tag/christian"},{"name":"a cappella","url":"https://www.last.fm/tag/a+cappella"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"male vocalists","url":"https://www.last.fm/tag/male+vocalists"},{"name":"childrens","url":"https://www.last.fm/tag/childrens"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Go+Fish/+wiki"}},"published":"29 Oct 2008, 05:00","summary":"Go Fish Official Bio\n\nFor most people, a room filled with thousands of screaming children goes into the category of nightmare. But for the guys in Go Fish, it sounds like music to their ears—a dream come true.\n\nJamie Statema, Jason Folkmann and Andy Selness—Go Fish—are arguably one of the most unique groups in the music industry. Not only do they make music for children and families, but they create amazing sounds with just their voices and percussion. <a href=\"https://www.last.fm/music/Go+Fish\">Read more on Last.fm</a>","content":"Go Fish Official Bio\n\nFor most people, a room filled with thousands of screaming children goes into the category of nightmare. But for the guys in Go Fish, it sounds like music to their ears—a dream come true.\n\nJamie Statema, Jason Folkmann and Andy Selness—Go Fish—are arguably one of the most unique groups in the music industry. Not only do they make music for children and families, but they create amazing sounds with just their voices and percussion.\n\nFor children, Go Fish may be their first real concert experience, complete with lights, backdrops and fog machines. It’s a rock and roll show, says the group, tailor-made for kids. “There’s a misconception out there of what children’s music has to be,” says Andy. “Quite honestly, it doesn’t have to be simple. You don’t have to dumb down music for kids. Because of that, parents really enjoy this music as well.\n\n”No gimmicks, either—which is a relief to parents who are up to their ears in big red cars, purple dinosaurs and backpacks. Just great songs, most written by Jamie, that creatively communicate biblical values. “Parents are important,” adds Jamie. “We want them to enjoy this with their kids, and not have dad sitting in the audience thinking, ‘Oh, I’m just totally taking one for the team now.’”\n\n“The most common remark we hear from parents is, ‘You guys are the one CD that our entire family can agree to listen to in the car. Please don’t stop what you’re doing!’” says Jason. “That sums up why we do what we do—to have the opportunity to make music that brings entire families together.”\n\nFollowing a string of successful independent recordings and two projects with the inpop label, Go Fish focused their energy on creating music for kids and families, releasing Splash in 2003, followed by Superstar (2004), Snooze (2006) and the Showtime DVD (2006). Go Fish is now adding Snow, their second Christmas recording, to the impressive line-up.\n\nWhile kids will still love Snow, this is indeed a CD for the whole family, the group notes. Adults will recognize some traditional songs, but with a whole new Go-Fish twist. Both “Joy to the World” and “We Three Kings” get fresh spins as the trio adds new music and lyrics to the tried-and-true. The classic “Away in A Manger,” for instance, ends with the hymn “Beautiful Savior.”\n\n“People like familiarity, especially at Christmastime, but we really took a lot of effort to make sure that even the songs people know sound unique and have new ideas attached to them,” explains Jamie. “Add that they are mostly all percussion and vocals, and we feel it makes a unique Christmas collection.” True to the Go Fish mission, Snow is a clear-cut Christian record—no “holiday” songs here. From the hymn “My Jesus I Love Thee,” to “It’s About the Cross,” which leads the listener from the manger to the cross, there’s a theme of the entirety of God’s love.\n\nJamie, Jason and Andy even brought in a little help to get their point across on “Christmas with a Capital C.” Conservative comedian Brad Stine joins in on the tune as they challenge the political correctness of saying “Happy Holidays” instead of “Merry Christmas.”\n\nGo Fish will be bringing music from Snow to a dozen cities across the U.S. this winter, playing such major venues as the Paramount Theatre in Cedar Rapids, Iowa, and The Target Center in Minneapolis. The Snow Tour promises to rank as one of the highlights of a surprising career which has celebrated numerous benchmarks, including a sold-out performance at the 14,000 seat Excel Center in St. Paul, Minnesota, and recent coverage on NBC’s Today Show. But it is not these accomplishments that drive Go Fish forward—it is simply walking out their mission, which was borne many years ago.\n\nFrom the start, founding member Jamie Statema knew he wanted to be involved in something unique. And although he struggled between his musical aspirations and youth ministry, he ultimately found that special something in a concert over a decade ago, when a Canadian band called The Nylons visited St. Paul.\n\nIt was the first time he’d seen an acappella group perform—just great vocals and percussion, but with real pop production. They were a mainstream band, but Jamie wanted to bring some of the same elements to Christian music. With that foundation, Jamie formed Go Fish in 1993. The group recorded their first independent project in 1995, which has gone on to sell more than 100,000 units. Andy and Jason joined the group in 1998 and Go Fish began to come into its own.\n\nThe trio quickly developed a strong following throughout Minnesota, Wisconsin, Iowa and North and South Dakota. Wanting to break out into other areas of the country, they sought the help of the Nashville-based inpop label, recording two albums and making headway at radio stations with a more pop-oriented sound.\n\n“We were an acappella group until that point,” recalls Jamie. “Then after signing with inpop, we added instruments and went a different direction. In the process, we learned that we already had a good grasp of what we were doing, and who we were called to be both musically and spiritually.”\n\nAfter parting ways with inpop, the trio formed their own label, gfk records. Coming full-circle helped them confirm a desire to get back to what they were good at—vocal music. And along with that came the realization that they’d always had families coming to their shows, from toddlers to grandparents.\n\nIn 2003 Go Fish decided to swing things differently with an acappella children’s record. Figuring it was either going to be the last thing they did or the best thing, they created Splash. But the response was immediate, with nearly 8,000 in attendance over their first six shows. Just as immediate was the clarity of God’s calling.\n\n“If this was all over today, I would look back and remember the first weekend we did our kids’ concerts,” remembers Jamie. “Because after eight years of doing Go Fish, we all knew what those years were for—without a doubt, we knew where God wanted us. All the ups and downs—it was a crazy journey to get to that place, but so clear how necessary those years were to prepare us for what we’re doing now.” “I would love to say that we were these smart marketing guys, that we knew we could have a potential career doing this—but that’s not it at all!” he laughs. “We’re not in this as a stepping stone to something else. This is where God wants us, and it feels pretty important.”\n\nWith research from the Barna Group emphasizing the importance of reaching children, citing that most Christians today come to faith before the age of 14, the mission of Go Fish is clear. “We’re talking about leaving a legacy—not just doing something different musically, but making an impact on lives, especially children,” says Andy. “We want to instill values in the home again, by bringing it back to the basic foundation of the Bible. We’re targeting the kids because they are the next generation of influential people.”\n\n“Long after we are gone, we hope that the music speaks for itself,” adds Jason. “Not only the quality and creativity, but the lasting effect it can have in the hearts of those who enjoy it.”\n\nWith all three members married, and Andy and Jamie now parents, that outreach is even more personal. “When you have children, you want to protect them with everything you have—but you can’t,” says Jamie. “And so, when you open that door and let someone else play a part in the life of your child, that is a huge thing, especially when that person is talking about principles for living. We take that responsibility extremely seriously, even in the little things. When I see a dad come through the autograph line with his little boy, I think, ‘If I was that dad, what would I want this performer to do for my son that would just make my his day?’”\n\nAnd making kids’ and parents’ days is what Go Fish is all about. Great harmonies, direct lyrics, inspiring messages—rolled up into a dynamic presentation that is making an impact and creating memories for countless families across the country.\n <a href=\"https://www.last.fm/music/Go+Fish\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
