{"artist":{"name":"Gorki","mbid":"2fd1f1f6-9b93-49c5-85f8-64ab5d72bf59","url":"https://www.last.fm/music/Gorki","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/53df54ad1f324f7c82b6aea47fe1d1e1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/53df54ad1f324f7c82b6aea47fe1d1e1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/53df54ad1f324f7c82b6aea47fe1d1e1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/53df54ad1f324f7c82b6aea47fe1d1e1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/53df54ad1f324f7c82b6aea47fe1d1e1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/53df54ad1f324f7c82b6aea47fe1d1e1.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"40625","playcount":"859543"},"similar":{"artist":[{"name":"Noordkaap","url":"https://www.last.fm/music/Noordkaap","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/94ddc5a50f414547bc2a87eb21e55359.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/94ddc5a50f414547bc2a87eb21e55359.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/94ddc5a50f414547bc2a87eb21e55359.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94ddc5a50f414547bc2a87eb21e55359.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94ddc5a50f414547bc2a87eb21e55359.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94ddc5a50f414547bc2a87eb21e55359.png","size":""}]},{"name":"De Mens","url":"https://www.last.fm/music/De+Mens","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9c98694c7a034cea9a271f750fab6ebe.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9c98694c7a034cea9a271f750fab6ebe.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9c98694c7a034cea9a271f750fab6ebe.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c98694c7a034cea9a271f750fab6ebe.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c98694c7a034cea9a271f750fab6ebe.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c98694c7a034cea9a271f750fab6ebe.png","size":""}]},{"name":"Admiral Freebee","url":"https://www.last.fm/music/Admiral+Freebee","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9eee68fee9724830a9c7c536c874065d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9eee68fee9724830a9c7c536c874065d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9eee68fee9724830a9c7c536c874065d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9eee68fee9724830a9c7c536c874065d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9eee68fee9724830a9c7c536c874065d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9eee68fee9724830a9c7c536c874065d.png","size":""}]},{"name":"Raymond van het Groenewoud","url":"https://www.last.fm/music/Raymond+van+het+Groenewoud","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/51edc8397f91419296e0030b51909546.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/51edc8397f91419296e0030b51909546.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/51edc8397f91419296e0030b51909546.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/51edc8397f91419296e0030b51909546.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/51edc8397f91419296e0030b51909546.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/51edc8397f91419296e0030b51909546.png","size":""}]},{"name":"Yevgueni","url":"https://www.last.fm/music/Yevgueni","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/722b55c8dbeb417997d83bc335ee7d97.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/722b55c8dbeb417997d83bc335ee7d97.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/722b55c8dbeb417997d83bc335ee7d97.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/722b55c8dbeb417997d83bc335ee7d97.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/722b55c8dbeb417997d83bc335ee7d97.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/722b55c8dbeb417997d83bc335ee7d97.png","size":""}]}]},"tags":{"tag":[{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"belgian","url":"https://www.last.fm/tag/belgian"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"Belgium","url":"https://www.last.fm/tag/Belgium"},{"name":"Nederlandstalig","url":"https://www.last.fm/tag/Nederlandstalig"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Gorki/+wiki"}},"published":"14 Mar 2006, 15:30","summary":"Gorki is a poetic yet powerful Dutch-singing group from Ghent, Belgium.  Since 1989 they operated under the name of Gorky (with a \"y\") but slightly changed their name when frontman Luc De Vos reformed the band in 1992. Luc De Vos died the 29th of November 2014 at the age of 52. \n\nAs many Belgian bands, Gorky rose to the attention of the crowd during Humo's Rock Rally. They finished third in the edition of 1990, enough to gain record company interest. <a href=\"https://www.last.fm/music/Gorki\">Read more on Last.fm</a>","content":"Gorki is a poetic yet powerful Dutch-singing group from Ghent, Belgium.  Since 1989 they operated under the name of Gorky (with a \"y\") but slightly changed their name when frontman Luc De Vos reformed the band in 1992. Luc De Vos died the 29th of November 2014 at the age of 52. \n\nAs many Belgian bands, Gorky rose to the attention of the crowd during Humo's Rock Rally. They finished third in the edition of 1990, enough to gain record company interest. Together with producer Wouter Van Belle, they recorded their self-titled debut album, which was intimistic and powerful at the same time. Singer Luc De Vos managed to write very personal yet recognizable lyrics filled with imaginative imagery. Not less than five singles were taken from the album. Songs such as \"Lieve kleine Piranha\" and especially \"Mia\" remain very popular up till today. \n\nIn 1992 the band recorded a semi-acoustic album \"Boterhammen\" in a park in Brussels. This was a series of intimistic concerts held every Friday during summer, an initiative by the Ancienne Belgique called 'Boterhammen in het park'. This album features guest performances of Rick De Leeuw, singer of the Dutch group Tröckener Kecks and guitarist Patrick Riguelle (see Riguelle & Hautekiet, Kadril). This album becomes the last act of the group Gorky.\n  \t\nSoon afterwards Luc De Vos reforms the band and the record company insists it would be called Gorki (with an \"i\"). Together with old-timer Sylvain Van Holme (a.o. Two Man Sound) the new band moves to Dakar in Senegal to go record the album \"Hij leeft\" in the Xippi studios of Youssou N'Dour. The album is much more subtle than the older products of Gorki \"which makes the melodies and the superior lyrics of De Vos sound even better\" (Oor). The album achieves a gold status in Belgium and 3 singles are released.\n\n1994 and 1995 are a lot more quiet for the group. Luc De Vos goes literary and becomes a columnist for leading Flemish newspaper \"De Standaard\" and radio station \"Studio Brussel\".\n\nIn 1995 the group bivouac in the ICP-studios in Brussels together with Jo Bogaert (the man behind Technotronic) to record their fourth album entitled \"Monstertje\" (Little monster). Record company Virgin initially refused the mix Bogaert had made in his home studio, so the album is remixed for a second time. Singles from the album are \"Lang zullen ze leven\" (Long will they live - For they are jolly good fellows), \"Monstertje\" (Little monster) and \"Kom me toch halen\" (Come and get me).\n\nLuc de Vos died unexpectedly on 11/29/2014, only 52 years of age.\n\t\n[Dutch/Nederlands]\n\nIn 1998 komt \"Ik Ben Aanwezig\" eraan, in een productie van Attie Bauw, die een vrij mislukte poging onderneemt om Gorki van een veelgelaagd naar Radiohead refererend geluid te voorzien. De nieuwe platenmaatschappij Sony brengt van de plaat \"Punk is dood\", \"Mijn dierbare vijand\" en het in duet met Tom Barman van dEUS gezongen \"Ik ben aanwezig\" uit als single, terwijl ook \"Wie zal er voor de kinderen zorgen\" het op de radio goed deed.\n\nIn 1999 wordt er een compilatie-album van het oude Gorky-werk uitgebracht door Virgin, en verliest Gorki zijn drummer aan de hoge ogen gooiende groep Arid. Een vervanger wordt gevonden in Eric Bosteels (eerder o.m. in de live-bezetting van Hooverphonic).\n\nIn 2000 luidt het bericht uit Wippelgem dan weer \"Eindelijk Vakantie\", een geheel nieuw album met een hoes geschilderd door Bent van Looy (Das Pop). De productie was in handen van de net uit Hooverphonic ontslagen Frank Duchêne, en de \"verrassende samenwerking\" kwam er op deze plaat in het nummer \"In mijn betere wereld\" via de strijkers van Die Anarchistische Abendunterhaltung. Als (promo)singles worden \"We zijn zo jong\", \"Geld en Olie\" en \"XTC\" naar voor geschoven, en deze verdienden de groep na al die jaren eindelijk een plaats op het Werchter festival.\n\nVreemd genoeg is het dit keer vooral in Nederland dat deze plaat aanslaat: ze eindigt ze zelfs bijna in de top 10 van het jaar die door Oor wordt opgemaakt. De VPRO zend bovendien een gesmaakte documentaire uit over Luc & Co in de reeks Lolapalooza. In verkoopscijfers lijkt deze media-aandacht zich daar echter niet dadelijk te vertalen.\n\n[Dutch/Nederlands]\n\nIn het voorjaar van 2001 begint Gorki opnieuw aan een Ronde van Vlaanderen. 'Eindelijk vakantie - Live' brengt een mix van harde en ingetogen nummers, die op smaak wordt gebracht met enkele hilarische columns. In de zomermaanden wordt het succes van Rock Werchter bevestigd op Folk Dranouter, maar daarna wordt het opnieuw stil rond Gorki. Tot de hofnar van het Vlaamse lied bewijst dat er geen zekerheden zijn, en een Engelstalig project uit de grond stampt. \n\nDaarvoor omringt hij zich met Axl Peleman, Reinert D'Haene en Matthias Van Der Hallen. Nieuwbakken idolen van Camden en Yum, in een vorig leven samen bekend als Ashbury Faith. Het viertal noemt zich 'Automatic Buffalo' (naar de gelijknamige song van The Sheila Divine), en brengt eind juni een eerste EP uit. Het titelnummer, 'All men are equal', gooit hoge ogen in de Afrekening. In november krijgt het dan ook een logisch vervolg met full-album 'Party People', dat op veel meer dan enkel beleefdheidsapplaus mag rekenen. \"Het is alsof De Vos een verjongingskuur heeft ondergaan\", bloklettert Eddy Hendricx van Focus Knack. \"Hij huilt weer als een hongerige wolf, zoals in zijn begindagen, intussen al zo'n decennium geleden. Niettemin blijft hij de bitterzoete mengeling, zijn tekstuele handelsmerk, trouw. Melancholie en humor zijn juist gedoseerd, hij bezingt de schoonheid van de jeugd, maar is tegelijkertijd doordrongen door de vergankelijkheid ervan.\" \n\nEnkele maanden later gaat Luc De Vos trouwens helemaal internationaal. Samen met Wannes Van De Velde werkt hij mee aan 'Djar', van het Arabische gezelschap El Ashwak. Het resultaat, een mix van chanson, kleinkunst en etnische pop, wordt in het najaar van 2001 op een cd geperst, en ondersteund met een bedevaart langs Vlaamse (Multi)culturele Centra.\n\nIntussen blijft Gorki, net als Elvis, gewoon bestaan. In 2001 leent de groep een Black Sabbath-cover ('Paranoïd') aan 'Psychoasis', een benefietalbum ten voordele van psychisch zieken. In 'De Tijdloze' van Studio Brussel wint Gorky elk jaar aan populariteit. Mia groeit haast uit tot een icoon van de eenentwintigste eeuw en zorgt met een 2de plaats dit jaar voor dé verrassing.\n\nEn van dan af gaat het linea recta naar 'Vooruitgang'. Voor dat zesde album laat Luc De Vos zich bijstaan door Frank Vander linden (De Mens) en Geoffrey Burton (Arno, PJDS) . Producer Staf Verbeeck past de bijdragen treffend in elkaar. \"Vooruitgang is franjeloos gearrangeerd en de band klinkt melodieus en catchy als nooit tevoren\" weet Bram Vermeersch van RifRaf. \"De Vos klinkt minder klagend maar krachtdadiger en melodieuzer, met evenveel emotionele diepgang maar zelfverzekerder en minder eendimensionaal melancholisch\", vindt Dag Allemaal (!). Fans kunnen zich in elk geval verheugen in een extra cd-rom, waarop de tienjarige geschiedenis van de groep in kaart is gebracht.\n\nDe singles ‘Tijdbom’ en ‘Ik Doe Mee’ werpen hoge ogen in De Afrekening. Wat volgt is een succesvolle zomertournee die onder meer halt houdt op Seat Beach Rock. De groep speelt er samen met ’T Hof Van Commerce ‘Ik Doe Mee’. Tijdens andere optredens duikt Quinten van ABN op als onverwachte gast.\n\nOok als schrijver boekt Luc De Vos vooruitgang. In oktober 2002 verschijnt zijn literair debuut bij het prestigieuze Atlas, de Nederlandse uitgever van Jeroen Brouwers en Kristien Hemmerechts. In ‘Het Woord Bij De Daad’ verhaalt De Vos over zijn omzwervingen langs de podia en het leven als muzikant. De Standaard kent De Vos een “eigen stem” toe: “bescheiden, weemoedig, soms ontroerend, vaak grappig en een enkele keer hilarisch”.\n\n‘De Olifant is Grijs’, de derde single uit ‘Vooruitgang’ met als b-kantje ‘Zal Ik Het Ooit Begrijpen’, blijkt een ideale gangmaker voor een nieuwe theatertournee die start in oktober. Gorki kiest voor de toekomst. Virtuele gasten als Flip Kowlier, Mauro Pawlowski, Tim Van Haemel en Geoffrey Burton (Arno, PJDS) worden geprojecteerd op een groot scherm achter het podium en spelen zo een streepje mee met De Vos en zijn vaste bandleden.\n\nDe groep lokt volle zalen, de première in AB is uitverkocht en de slotshow in een eveneens tot de nok gevulde AB verschijnt in december 2003 op de cd/dvd ‘Gorki Live - Het Beste Van’. Een must voor elke rechtgeaarde Gorki-fan want de dvd bevat ook videoclips, de Lola Da Musica reportage rond Luc De Vos, filmpjes van ‘Aan Tafel’, Gorki brengt Brel en beelmateriaal uit het vrt-archief.\n\nLuc De Vos begeeft zich na de theateroptredens op het solo-pad. Hij begeleidt zichzelf op gitaar en leest voor uit ‘Het Woord Bij De Daad’. Vanaf april 2003 breken opnieuw drukke tijden aan voor Gorki. De nieuwe concerttour start, de groep neemt voor de radio 1 wedstrijd ‘Een Nieuw lied’ ‘De Grot’ van Gerd Vandenrijn op en naar aanleiding van het vijfentwintigjarig overlijden van Jacques Brel covert Gorki voor JimTv ‘De Sluiswacht, het door Patrick Riguelle vertaalde ‘L’Eclusier’. Uit het Gorki-kamp weerklinkt ook goed nieuws als ‘Het Beste Van Gorki’ uit ’99 aftikt op 40.000 verkochte exemplaren.\n\nLuc De Vos blijft in zijn pen kruipen en levert vanaf juni elke week een column aan het Gentse stadsmagazine 09. Voor het tv1-programma ‘Aan Tafel’ gaat hij opnieuw aan de slag als reporter.\n De Vos duikt onder in de wereld van snelle wagens en dure paarden, van golfwedstrijden en exclusieve garden parties, waar het geld rolt en de champagne vloeit.\nGorki blijft intussen onverminderd doorgaan. Tijdens de Gentse Feesten speelt de band tien keer hun theatershow in een telkens overvolle Minard Schouwburg om daarna de Feesten treffend af te sluiten met een concert op het Boomtown Festival. Na een drukke zomer legt de Gorki-karavaan de teugels neer. Luc De Vos zit echter niet stil en treedt in oktober en november solo op in Vlaamse jeugdhuizen en parochiezalen.\n\n25 december 2003 wordt een historische kerstdag. Vos, de volksheld uit Wippelgem, de Gentse teddybeer heeft er dan tien jaar op gewacht: ‘Mia’ staat op 1 in De Tijdloze van Studio Brussel. De luisteraars van Radio 1 blijven ‘Mia’ eveneens aan de borst drukken: 'Mia' voor de tweede keer op kop in '100 op 1'.\nLuc De Vos blijft diversifiëren binnen de sector en schrijft samen met Tom Pintens, bekend van Zita Swoon en 2000 Monkeys, liedjes voor ‘Kaatje Is Verdronken’. Een voorstelling waarmee het toneelgezelschap ‘De Kempvader’ (Tom Van Dyck, Kyoko Scholiers, Lucas Van den Eynde en Tania Van der Sanden) van februari tot en met april 2004 volle zalen lokt. De Vos en Pintens, voor de gelegenheid zingende kabouters, brengen de soundtrack live ten gehore. Het titelnummer ‘Kaatje Is Verdronken’ staat hoog genoteerd in Humo’s Top 20 en het radio 1-programma Carte Blanche.\n\nAls de luisteraars van Studio Brussel Luc De Vos bekronen tot ‘De Vlaming van de jaren ‘90’ mag Luc De Vos zich een icoon van een generatie noemen. Stubru-nethoofd Mark Coenen verwoordt het als volgt: “Hij brengt het geloof weer onder de mensen, hij weet ze te ontroeren, hij is extreem intelligent, maar toch bescheiden gebleven. Hij zingt en schrijft, hij maakt liedjes en romans. Hij is het ‘Wonder van Wippelgem. Dé Vlaming van de jaren '90 is geworden: LUC DE VOS.”\nEn het houdt niet op: in maart wordt in Gent het nieuwe boek van Luc De Vos voorgesteld. De rest is geschiedenis: een volstrekt unieke autobiografie van een katholieke jeugd. “Tot een roman verwerkte memoires doorspekt met –hoe heet het?-pensées”, aldus Rudy Vandendaele van Humo.\n\nNauwelijks een maand later verschijnt het langverwachte nieuwe studio-album van Gorki. Op de cover van ‘Plan B’ (inclusief lege cd-rom voor een legale kopie en een Russisch paspoort als booklet) prijkt de karakteristieke kop van de Russische roerganger Leonid Brezjnev. RifRaf spreekt van “een sterk album met tekstuele vondsten waarbij de concurrentie verbleekt”. “Luc De Vos, Eric Bosteels, Luc Heyvaerts en Erik Van biesen tonen zich de hele plaat lang een perfect ingespeeld team, de productie van Michel Dierickx is très poppy en geheel vlekkeloos, en gastmuzikanten Jean-Marie Aerts en Frank Clarysse musiceren uitstekend”, meent Humo.\n\nDe eerste single uit het album doet het alvast meer dan uitstekend. ‘Een Schaduw In De Schemering’ staat na enkele weken met stip op 1 in De Afrekening. Luc De Vos is heel opgetogen met het goede nieuws: \"Merci iedereen, de laatste keer dat we op nummer 1 stonden was in 1991 met Lieve Kleine Piranha, 13 jaar geleden. De aanhouder wint!!!!\"\nVerder worden ook \"Elektronica voor Geliefden\" en \"Engeland\" als single op de radio losgelaten.\nSteeds tot feesten bereid, viert Gorki de verkoop van 7500 exemplaren met een spetterende party in de Culture Club in Gent. De aanwezigen krijgen als geschenk een halve gouden cd. Zowaar een collectorsitem.\n\nIn het najaar maakt Gorki zich op voor een nieuwe theatertour die in december 2004 een orgelpunt moet kennen in de Capitole. In thuisbasis Gent. In het eerste deel van de show neemt Vos zijn publiek solo mee op sleeptouw door zijn weergaloze teksten. Vooral zijn stukje over Freddy Mercury is absoluut niet te missen! In het tweede deel laat Luc zich omringen door zijn 3 vertrouwde Gorki-kompanen en barst het rockgeweld los. En ja hoor, Gorki wordt opnieuw uitgebreid met gastmuzikanten die virtueel deelnemen aan het spektakel...\n\nMia bevestigt de trend die vorig jaar is gezet, en kaapt opnieuw de eerste plaats weg in zowel 'De Tijdloze' van Stubru, als '100 op 1' van Radio 1. Tijd voor wat rust. 2005 is voor Gorki een sabbatjaar.\nEchter veel rust kent Luc De Vos niet, want in maart geeft Gorki een optreden op het Woordfees Festival in Zuid-Afrika en zwiert Luc zijn 3de boek op de markt. In de acht gebundelde verhalen in 'De Volksmacht' vertelt Luc De Vos in zijn zo typische stijl over de veranderingen die zich sinds zijn jeugd in Vlaanderen hebben voltrokken en over het droevige maar zoveel vreugde en plezier schenkende bestaan van een moderne popzanger en een notoir podiumbeest. In de zomer maakt Luc tijd voor 'Uitblazen', een muziekfestival waar Luc De Vos samen met de fanfare Sint-Cecilia Zarren-Werken een overzicht brengt van de grootste Gorki-hits, afgewisseld met recenter werk. En ze kunnen het niet laten... ter gelegenheid van hun 15 jarig bestaan, sluit Gorki Folk Dranouter af! De lokale fanfare uit Zarren-Werken begeleidt hen bij een aantal nummers, Tom Pintens en Stef Kamil Carlens van Zita Swoon deden ook even mee. \nHet massaal opgekomen publiek was zelden uitzinniger. Gorki was zelden beter, grootser of innemender.  \n\nOp 29 november 2014 overleed Luc de Vos onverwacht. Hij werd slechts 52 jaar oud...\n\n2006\n- Op nieuwjaarsdag ligt 'Homo Erectus', het nieuwe meesterwerk van Gorki, in de winkels. De plaat bevat 12 nieuwe nummers en werd geproduced door gitaarvituoos Jean-Marie Aerts.\n- Single joerie schopt het tot nummer 1 in de Afrekening. De bijhorende videoclip zorgt voor heel wat opschudding.\n\n2007\n- De nieuwe Theatertour doet in het gehele land stof opwaaien. Vos zit op bed en verwarmt zijn publiek met oude en nieuwe songs samen met verschillende bekende Vlamingen en Nederlanders.\n\t  \t  \t \n2008\n-Voor rijpere jeugd. Nieuw album beschikbaar\n\n2010\n- Het nieuwe album Research and Development komt uit\n\n\nBand members (Gorky):\n- Luc De Vos : vocals, guitar\n- Geert Bonne : drums\n- Wout De Schutter : bass\n\nBand members (Gorki):\n- Luc De Vos : vocals, guitar\n- Erik Van Biesen : bass\n- Luc Heyvaerts : keyboards\n- Wim Rogge : guitar\n- Steven Van Havere / Eric Bosteels / Bert Huysentruyt : drums <a href=\"https://www.last.fm/music/Gorki\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
