{"artist":{"name":"Grayson Capps","mbid":"f2ab6fbd-e2d6-4f14-bc02-5dca733b2ed8","url":"https://www.last.fm/music/Grayson+Capps","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f657f9789a67478badc9576e496f3685.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f657f9789a67478badc9576e496f3685.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f657f9789a67478badc9576e496f3685.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f657f9789a67478badc9576e496f3685.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f657f9789a67478badc9576e496f3685.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f657f9789a67478badc9576e496f3685.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"22658","playcount":"255394"},"similar":{"artist":[{"name":"Lonnie Pitchford","url":"https://www.last.fm/music/Lonnie+Pitchford","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/defad494ba59495dba212bc397e284ef.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/defad494ba59495dba212bc397e284ef.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/defad494ba59495dba212bc397e284ef.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/defad494ba59495dba212bc397e284ef.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/defad494ba59495dba212bc397e284ef.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/defad494ba59495dba212bc397e284ef.png","size":""}]},{"name":"Big Bill Morganfield","url":"https://www.last.fm/music/Big+Bill+Morganfield","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e4d0da06ba2e4dba9cb9cf1d988c5143.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e4d0da06ba2e4dba9cb9cf1d988c5143.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e4d0da06ba2e4dba9cb9cf1d988c5143.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e4d0da06ba2e4dba9cb9cf1d988c5143.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e4d0da06ba2e4dba9cb9cf1d988c5143.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e4d0da06ba2e4dba9cb9cf1d988c5143.png","size":""}]},{"name":"Nathan Larson","url":"https://www.last.fm/music/Nathan+Larson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/94672ec5f4914211b6724044545c4981.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/94672ec5f4914211b6724044545c4981.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/94672ec5f4914211b6724044545c4981.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94672ec5f4914211b6724044545c4981.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94672ec5f4914211b6724044545c4981.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94672ec5f4914211b6724044545c4981.png","size":""}]},{"name":"Ray Bonneville","url":"https://www.last.fm/music/Ray+Bonneville","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a7ee15db98a3431f84cd7895854a5532.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a7ee15db98a3431f84cd7895854a5532.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a7ee15db98a3431f84cd7895854a5532.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a7ee15db98a3431f84cd7895854a5532.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a7ee15db98a3431f84cd7895854a5532.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a7ee15db98a3431f84cd7895854a5532.png","size":""}]},{"name":"Greg Trooper","url":"https://www.last.fm/music/Greg+Trooper","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f2c3756654d546edaa5ece2eb03480ed.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f2c3756654d546edaa5ece2eb03480ed.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f2c3756654d546edaa5ece2eb03480ed.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2c3756654d546edaa5ece2eb03480ed.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2c3756654d546edaa5ece2eb03480ed.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2c3756654d546edaa5ece2eb03480ed.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"New Orleans","url":"https://www.last.fm/tag/New+Orleans"},{"name":"Soundtrack","url":"https://www.last.fm/tag/Soundtrack"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Grayson+Capps/+wiki"}},"published":"17 Jan 2008, 20:39","summary":"Grayson Capps (born April 17, 1967 in Opelika, Alabama) is an American singer-songwriter.\n\nThe title Rott 'N' Roll originated with Capps’ fans in New Orleans as an explanation of his music. Prostitutes, alcoholics, vagrants and drifters often inhabit the southern troubadour’s songs, while his live performances are ignited by sanctified Southern soul, howling back-country stomp and raucous roadhouse blues..  Slowly, but surely, the phrase spread from one city to the next as the definition of the Grayson Capps experience. <a href=\"https://www.last.fm/music/Grayson+Capps\">Read more on Last.fm</a>","content":"Grayson Capps (born April 17, 1967 in Opelika, Alabama) is an American singer-songwriter.\n\nThe title Rott 'N' Roll originated with Capps’ fans in New Orleans as an explanation of his music. Prostitutes, alcoholics, vagrants and drifters often inhabit the southern troubadour’s songs, while his live performances are ignited by sanctified Southern soul, howling back-country stomp and raucous roadhouse blues..  Slowly, but surely, the phrase spread from one city to the next as the definition of the Grayson Capps experience. For Grayson himself, Rott 'N' Roll has come to represent the state of mind needed to play uncompromising roots music as a means for survival in the Dirty South; the yin and yang between the debauchery of life on the road and the come down upon returning home.. Yet, as Grayson makes clear on “Back To The Country,” the album’s opening track, when Rott 'N' Roll is the credo, even the serenity of home means, \"eating cornbread and raising hell.\"  \n\nCapps first discovered music in Alabama where he was born and raised. His father and friends would sit around the house getting drunk, telling stories and strumming acoustic guitars. They'd run down songs by Hank Williams, Tom T. Hall, Glenn Campbell and Woodie Guthrie to name but a few. The idealism of those \"Cannery Row\" experiences would come to define his outlook on the world. Heading off to Tulane University as a theater major on scholarship, Grayson also took up playing music. He'd form two bands that would have moderate national success--The House Levelers and Stavin' Chain--receiving acclaim in publications like Spin and USA Today and opening shows for Keith Richards, The Replacements and Crowded House. After graduating college, he took to squatting with friends in a string of abandoned houses on the outskirts of the Big Easy, stealing electricity, growing a garden and busking for whatever money was needed. Grayson recounts those times on a number of songs off his debut album, If You Knew My Mind. One of those memories even finds its way onto Rott 'N' Roll in the form of \"Ike.\"  \n\nWith both bands ultimately breaking up, Capps began performing as a solo artist. It was around this time that the young filmmaker Shainee Gabel (who befriended Capps through a previous project they'd worked on together) discovered his father's unpublished novel Off Magazine Street. She fell in love with the story and set out to turn it into a film. Through a confluence of events, the movie A Love Song For Bobby Long, starring John Travolta and Scarlett Johansson, was born. Capps wrote four songs for the film, including the title track. He made a cameo appearance, as well. The story was based upon those early years with his father's friends back in Alabama. Bobby Long was, indeed, a real person. He died unceremoniously in a Johnson City, Tennessee V.A. hospital. All these years later, Grayson saw Bobby's life memorialized by Hollywood. Life as art or art as life? \n\nCapps signed with Hyena Records just prior to the film's premier. He simultaneously released his aforementioned debut album, If You Knew My Mind, to rave reviews from publications like No Depression, Harp and American Songwriter. He set out touring, building his audience with marathon live shows that married his keen sense of storytelling to the glory of Southern rock. He made it to Europe for a string of shows. To this day his audience continues to swell on the other side of the Atlantic as witnessed by his recent sold out performance at The Paradiso in Amsterdam.  \n\nWhile on the road in August 2005, Hurricane Katrina hit New Orleans and changed everything. With the city in flux and the demands for a new album pressing down on him, Capps moved to a converted farmhouse in Franklin, Tennessee with his longtime companion Trina Shoemaker (who co-produces Rott 'N' Roll) and his son Waylon. He recorded the album Wail & Ride. More touring followed, including performances at Bonnaroo and The New Orleans Jazz & Heritage Festival.  He'd also release a dusty collection of acoustic tracks from 2002 called Songbones as a limited edition set.  \n\nAll of this leads to Rott 'N' Roll, the definitive Capps document to date. Cut at his home studio in Franklin, it's the first album to solely feature his band, The Stumpknockers. Its predecessor, Wail & Ride, presented Capps as a singer-songwriter, delicately framing his songs with pristine sound and a mix of studio musicians alongside his band-mates. Rott 'N' Roll, on the other hand, is about an attitude, a mood and a viewpoint, warts and all. Everything was tracked live and much of the final product is culled from first takes. The band, featuring Tommy “Ol’ Grover” MacLuckie on lead guitar, Josh Kerin on bass and John Milham on drums, would spend days at Capps' farmhouse rehearsing during the afternoons and hanging out around a bonfire in his backyard at night. If the spirit moved them, they'd cut a track, overdub a guitar part, record a drunken chorus of rednecks who found their way to the sessions from all points south: \"Gran Maw Maw\" and \"Big Ol' Woman\" being case in point. If they weren't feeling inspired, they'd wander around the mountain that serves as Grayson's backyard, quite literally bonding with the Native American spirits.  Rott ‘N’ Roll’s second song \"Arrowhead\" paints a picture of this idyllic setting.  \n\nThroughout the 13 tracks on Rott 'N' Roll, the listener gets a front row seat to the subversion. \"Big Black Buzzard\" circles with wicked hill country fervor that could make R.L. Burnside run for cover cover. \"The Sun Don't Shine On Willy\" is informed by Grayson’s gift for the Southern Gothic, with lyrics like: \"He looks like old Boo Radley, he’s pale and his veins are blue, now he looks like one of them Hadleys after they’ve been drunk a month or two.\" Yet, there are also moments of clarity and tenderness. \"Guitar\" is perhaps Grayson's most autobiographical song to date. \"Going Back To The Country,\" while full of hiss and swagger, addresses the search for truth and simplicity in a fast changing, often deceptive modern world. \"The Fear Fruit Bearing Tree\" is a biting piece of poetry that speaks truth to power in these times of corporate greed and government fear mongering. \"Sock Monkey,\" marks guitarist Tommy MacLuckie's songwriting debut with a blast of country punk absurdity. \n\nHaving drawn comparisons over his last few albums to the likes of Tom Waits, Townes Van Zandt and Drive By Truckers, to name but a few, Rott ‘N’ Roll proves Grayson Capps an artist equally singular in vision as those to whom he’s compared. He doesn’t always paint the prettiest pictures or offer a gleamy white smile, but he does reach down deep to remind us of our own humanity. Grayson’s own words illuminate it best: “How many times must it be said? Though blood runs blue, you still think it’s red, because that’s how it appears when it hits oxygen. Our life is an illusion, and we create the confusion, so take a dose of seclusion to dilute the delusion. And hope that it’s not in vein that we look into the spheres of the fear-fruit bearing tree before we eat again.” \n\nFor more information on Grayson Capps and/or promo, interview and photos requests, please contact Kevin Calabro at Hyena Records: 718-369-6567 or HyenaRecords@aol.com \n\nwww.graysoncapps.com\nwww.myspace.com/graysoncapps <a href=\"https://www.last.fm/music/Grayson+Capps\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
