{"artist":{"name":"Groundhogs","mbid":"e7cab571-1fa7-4ccc-8fb5-b4f1093df973","url":"https://www.last.fm/music/Groundhogs","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/259a0901b2d44c9c915fec71bfecd319.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/259a0901b2d44c9c915fec71bfecd319.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/259a0901b2d44c9c915fec71bfecd319.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/259a0901b2d44c9c915fec71bfecd319.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/259a0901b2d44c9c915fec71bfecd319.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/259a0901b2d44c9c915fec71bfecd319.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"61531","playcount":"552247"},"similar":{"artist":[{"name":"Edgar Broughton Band","url":"https://www.last.fm/music/Edgar+Broughton+Band","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/83e8fd59b1c240f283ae94dcc65fb29a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/83e8fd59b1c240f283ae94dcc65fb29a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/83e8fd59b1c240f283ae94dcc65fb29a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/83e8fd59b1c240f283ae94dcc65fb29a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/83e8fd59b1c240f283ae94dcc65fb29a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/83e8fd59b1c240f283ae94dcc65fb29a.png","size":""}]},{"name":"Steamhammer","url":"https://www.last.fm/music/Steamhammer","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a3817faf0ddf49c4c92fbda8b1360bb0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a3817faf0ddf49c4c92fbda8b1360bb0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a3817faf0ddf49c4c92fbda8b1360bb0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a3817faf0ddf49c4c92fbda8b1360bb0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a3817faf0ddf49c4c92fbda8b1360bb0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a3817faf0ddf49c4c92fbda8b1360bb0.png","size":""}]},{"name":"Cactus","url":"https://www.last.fm/music/Cactus","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ce63c7fd30a64c9f86b3900999901657.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ce63c7fd30a64c9f86b3900999901657.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ce63c7fd30a64c9f86b3900999901657.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ce63c7fd30a64c9f86b3900999901657.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ce63c7fd30a64c9f86b3900999901657.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ce63c7fd30a64c9f86b3900999901657.png","size":""}]},{"name":"Leaf Hound","url":"https://www.last.fm/music/Leaf+Hound","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0760c31c53934ef994bc82050b44578e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0760c31c53934ef994bc82050b44578e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0760c31c53934ef994bc82050b44578e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0760c31c53934ef994bc82050b44578e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0760c31c53934ef994bc82050b44578e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0760c31c53934ef994bc82050b44578e.png","size":""}]},{"name":"Savoy Brown","url":"https://www.last.fm/music/Savoy+Brown","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/43bf0ad1b262438a851e306a8c389432.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/43bf0ad1b262438a851e306a8c389432.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/43bf0ad1b262438a851e306a8c389432.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43bf0ad1b262438a851e306a8c389432.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43bf0ad1b262438a851e306a8c389432.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43bf0ad1b262438a851e306a8c389432.png","size":""}]}]},"tags":{"tag":[{"name":"blues rock","url":"https://www.last.fm/tag/blues+rock"},{"name":"Progressive rock","url":"https://www.last.fm/tag/Progressive+rock"},{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"classic rock","url":"https://www.last.fm/tag/classic+rock"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Groundhogs/+wiki"}},"published":"14 Feb 2006, 19:21","summary":"The Groundhogs fronted by Tony McPhee on guitar and vocals were a top progressive blues rock group. Emerging in the early sixties as a blues band, noted for backing visiting American Blues Artists such as John Lee Hooker. The band evolved in the latter part of the sixties into a heavy rock group scoring a hit with their fourth and possibly most popular album 'Split'. Through the seventies the band continued to record and play live as a trio with changing band members <a href=\"https://www.last.fm/music/Groundhogs\">Read more on Last.fm</a>","content":"The Groundhogs fronted by Tony McPhee on guitar and vocals were a top progressive blues rock group. Emerging in the early sixties as a blues band, noted for backing visiting American Blues Artists such as John Lee Hooker. The band evolved in the latter part of the sixties into a heavy rock group scoring a hit with their fourth and possibly most popular album 'Split'. Through the seventies the band continued to record and play live as a trio with changing band members, towards the end of the seventies recording as a four piece with addition of a second guitar. The band disbanded in the late seventies later to reform a year or so later as a trio with new members. The Groundhogs continued through the nineteen eighties with many personnel changes through to 2004 when Tony McPhee laid the band to rest.\nIn 2007 Tony McPhee once again put a working band together for live concerts. To date the band is still working fronted by Tony McPhee despite having had a stroke.\n\nDuring the early 1970s, The Groundhogs were among the most popular and successful groups in the UK, with three Top 10 LPs to their credit in under two years. Originally formed circa 1964 (and first known as The Dollar Bills before becoming John Lee's Groundhogs, to reflect their admiration for John Lee Hooker), the group was led by singer/songwriter/lead guitarist Tony (T.S.) McPhee. The first version of the group lasted about a year, after which McPhee joined Truth, who had released a UK Top 30 hit in early 1966 with a cover version of 'Girl', the Lennon & McCartney song from the 'Rubber Soul' album by The Beatles, before McPhee joined. They followed it up later in 1966 with another near-hit, a cover version of 'I Go To Sleep', a song written by Ray Davies of The Kinks, on which McPhee did play, but soon dispersed. From there, he briefly joined Boz & The Boz People (led by Boz Burrell, later of King Crimson and Bad Company), and then Herbal Mixture (with John Dummer - McPhee also worked with John Dummer's Blues Band, and appeared on their debut LP, 'Cabal', in 1968). And even before all that, he had turned down the chance to replace Eric Clapton in John Mayall's Bluesbreakers, when Clapton went off on his legendary trip to Greece in the Summer of 1965...\n\nIn 1968, Roy Fisher, the manager of the early incarnation of The Groundhogs, was working as a photographer, and in that guise, went to Liberty Records, where he met Andrew Lauder, then a young A&R man for the label. Lauder told Fisher that if The Groundhogs could be reassembled, he would sign the group and they could make an LP. McPhee instantly agreed, and contacted bass player Pete Cruickshank, who had been in the original Groundhogs, and had also worked with McPhee in Herbal Mixture, and with the addition of drummer Ken Pustelnik and harmonica player Steve Rye, the group re-formed in 1968, when they released their debut LP, 'Scratching The Surface' (now reissued on BGOCD 15). \n\nThe producer of that album was Mike Batt, later the man behind the remarkable success of The Wombles. For the second Groundhogs LP in 1969, 'Blues Obituary' (with which the band tried to distance themselves from their image as a blues band, hence the album title), McPhee was the producer, and the considerably increased sales of that album (now re-issued as BGOCD 6) brought the band (now a three-piece, after Steve Rye's departure) to the brink of fame.\n\nThe LP which actually achieved that milestone was 'Thank Christ For The Bomb', released in 1970, which peaked in the Top 10 of the UK album chart. In 1997, McPhee recalled the circumstances behind the album with the attention-grabbing title, which ran against fashionable philosophy at the time (although some say that fearsome weapons like the Atom Bomb and the Hydrogen Bomb are the major reason for it being over 50 years since the last World War). McPhee refuses to take the entire credit for this revolutionary theory, admitting: \"Well, it was forced on me a bit\". Roy Fisher suggested that McPhee should think of something controversial for the new LP. \"John Lennon had just made his famous quote about The Beatles being more popular than Christ, and everyone was up in arms. So Roy said 'Let's marry it up with the bomb. How about 'Thank Christ For The Bomb?'.  So I went home and I had to write these lyrics, and my initial thoughts were that in the First World War, if you were injured you were sent home. And that was my first idea - a soldier is blown up and his toes are blown off so he goes home again. No, that's not enough. So I thought, well, let's make it the atomic bomb, really piss people off. My thought was, and it's been said by other people, that once something is invented you can't forget it, it's there, so there's no point in trying to pretend it doesn't exist. I always felt that through the ages, the broadsword must have been the ultimate weapon at one point, because they could chop people's heads off all over the place, and the crossbow and the longbow - there's always been the ultimate weapon, it's just a question of degree, really\". \n\nThe album made The Groundhogs a fashionable chart act, helped, interestingly enough by a certain disc jockey: \"It did very well. I've got to say that John Peel broke that album because he had that Sunday afternoon radio show, and he did the same for us as he did for 'Sabre Dance', he played that to death and he broke it, and he picked on 'Soldier' as a particular track and he really broke that album\". As an aside, one of Peel's reputed favourite all-time acts, The Fall, in fact covered a Groundhogs song from the album after 'Thank Christ For The Bomb', 'Split' (now reissued as BGOCD 76).\n\nThe group's next LP came out in 1972 and was entitled, 'Who Will Save The World' (BGOCD 77). After its release, Ken Pustelnik left the band, and was replaced by Clive Brooks. The band recorded the following LP, 'Hogwash' (BGOCD 44), later that same year. After that, the Groundhogs moved to another label connected with the group's new management, who had taken over from Roy Fisher after 'Who Will Save The World'. The new arrangements ultimately proved to be a mistake, and led to the band splitting up in April 1975, only for McPhee to launch a brand new Groundhogs line-up later that year, responding to popular demand. \n\nThe new lineup rejoined Liberty/UA, where they had enjoyed considerable success, and recorded a new album, 'Crosscut Saw', in 1975, and a year later, made 'Black Diamond'; both these LPs have now been reissued on a single CD (BGOCD 131). After that, The Groundhogs again split up as punk rock became the order of the day. McPhee reflects: \"We were never fashionable, and I'm sure that was because music writers couldn't pigeonhole us. They couldn't say we were a blues band, they couldn't say we were heavy metal, because we were neither, we were a heavy metal blues band, so whatever they didn't like, they called us. If they hated blues, we were a blues band, if they hated heavy metal, we were a heavy metal band. In the early 1980s, I went back to London and did some blues gigs and got the Tony McPhee Blues Band together. Then the 'Hogging The Stage' live double album was released, credited to The Groundhogs, which reached the independent chart, and I thought oh, I give in, it's Groundhogs again. And the daft thing was that when we were doing the 'Half Moon' at Putney as the Tony McPhee Band, we did pretty well, we got 200 people in there, but when we called it The Groundhogs, doing the same set we got 500 people. It's stupid...\"\n\nJohn Tobler, 1997\nTaken from the CD reissue of \"Thank Christ For The Bomb\" (1970), BGO CD 67 \n\nhttp://www.alexgitlin.com/ghogs.html <a href=\"https://www.last.fm/music/Groundhogs\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
