{"artist":{"name":"GWAR","mbid":"f7ccd53a-234c-4800-8d1b-21b201bad1de","url":"https://www.last.fm/music/GWAR","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/76ab9fc224a3461c9af6053c4f00fa06.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/76ab9fc224a3461c9af6053c4f00fa06.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/76ab9fc224a3461c9af6053c4f00fa06.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76ab9fc224a3461c9af6053c4f00fa06.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76ab9fc224a3461c9af6053c4f00fa06.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76ab9fc224a3461c9af6053c4f00fa06.png","size":""}],"streamable":"0","ontour":"1","stats":{"listeners":"141731","playcount":"3741865"},"similar":{"artist":[{"name":"Green Jellÿ","url":"https://www.last.fm/music/Green+Jell%C3%BF","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c9ea6c1568f24018882397173612116d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c9ea6c1568f24018882397173612116d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c9ea6c1568f24018882397173612116d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9ea6c1568f24018882397173612116d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9ea6c1568f24018882397173612116d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9ea6c1568f24018882397173612116d.png","size":""}]},{"name":"Ghoul","url":"https://www.last.fm/music/Ghoul","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/df17c2663d934f50975727b70144250b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/df17c2663d934f50975727b70144250b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/df17c2663d934f50975727b70144250b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df17c2663d934f50975727b70144250b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df17c2663d934f50975727b70144250b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df17c2663d934f50975727b70144250b.png","size":""}]},{"name":"Carnivore","url":"https://www.last.fm/music/Carnivore","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3722065d62b8402d95f55d370fcc9beb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3722065d62b8402d95f55d370fcc9beb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3722065d62b8402d95f55d370fcc9beb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3722065d62b8402d95f55d370fcc9beb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3722065d62b8402d95f55d370fcc9beb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3722065d62b8402d95f55d370fcc9beb.png","size":""}]},{"name":"Overkill","url":"https://www.last.fm/music/Overkill","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7b79f78c33154c7fb74f00c3f67269df.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7b79f78c33154c7fb74f00c3f67269df.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7b79f78c33154c7fb74f00c3f67269df.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b79f78c33154c7fb74f00c3f67269df.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b79f78c33154c7fb74f00c3f67269df.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b79f78c33154c7fb74f00c3f67269df.png","size":""}]},{"name":"Warbringer","url":"https://www.last.fm/music/Warbringer","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fdb40fff4ccb494dbf5b921be8e05144.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fdb40fff4ccb494dbf5b921be8e05144.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fdb40fff4ccb494dbf5b921be8e05144.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fdb40fff4ccb494dbf5b921be8e05144.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fdb40fff4ccb494dbf5b921be8e05144.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fdb40fff4ccb494dbf5b921be8e05144.png","size":""}]}]},"tags":{"tag":[{"name":"thrash metal","url":"https://www.last.fm/tag/thrash+metal"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"metal","url":"https://www.last.fm/tag/metal"},{"name":"heavy metal","url":"https://www.last.fm/tag/heavy+metal"},{"name":"punk","url":"https://www.last.fm/tag/punk"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/GWAR/+wiki"}},"published":"18 Feb 2006, 20:17","summary":"GWAR is a satirical thrash metal/punk band formed in 1985-1986 by a group of artists and musicians at Virginia Commonwealth University in Richmond, Virginia. The band is perhaps best known for their elaborate sci-fi/horror film inspired costumes, raunchy lyrics, and graphic stage performances, which can consist of scatology, sadomasochism, necrophilia, paedo-necrophilia, beastio-necrophilia, fire dancing, fake pagan rituals, mock executions/mutilations, and other controversial violent and political themes. <a href=\"https://www.last.fm/music/GWAR\">Read more on Last.fm</a>","content":"GWAR is a satirical thrash metal/punk band formed in 1985-1986 by a group of artists and musicians at Virginia Commonwealth University in Richmond, Virginia. The band is perhaps best known for their elaborate sci-fi/horror film inspired costumes, raunchy lyrics, and graphic stage performances, which can consist of scatology, sadomasochism, necrophilia, paedo-necrophilia, beastio-necrophilia, fire dancing, fake pagan rituals, mock executions/mutilations, and other controversial violent and political themes. GWAR was, for a long time, on the leading edge of shock rock, going as far as appearing on Jerry Springer in character and in full costume during the mid-1990s.\n\nThe band was the result of the collaboration between Hunter Jackson and Dave Brockie, then the singer for a punk band called Death Piggy. Jackson was working on a movie at the time the two met. The movie, entitled Scumdogs of the Universe, featured a plot involving terrifying intergalactic barbarians. Jackson and Brockie combined their ideas, re-named the band Gwar, and have been performing as ghoulish intergalactic warriors ever since. Their costumes are generally made of foam latex, styrofoam, and hardened rubber. It should be noted that the costumes they are wearing actually cover very little with the rest of their bodies being accentuated with makeup. They further their production in concert by dousing, spraying, and at times nearly drowning their audiences with imitation blood, semen, gore, and other bodily fluids. All the fluids are made of water and dye that washes out easily. It is rumored that corn syrup or a similar product has been used as a thickener.\n\nAnother trademark of GWAR's live show is their mutilations of celebrities and figures in current events. Victims of GWAR's antics have included O.J. Simpson, George W. Bush, Paris Hilton, and many others. The band also makes frequent references to political and historical figures, fantasy literature, and mythology. For instance, the song \"Whargoul\" makes reference to Minas Morgul, a setting in J.R.R. Tolkien's Lord of the Rings books; and the title of their sixth album, Ragnarok, comes from Norse mythology.\n\nGWAR, though by no means a small-time band, have not enjoyed as much mainstream recognition as many other bands. Around the time of their second album (Scumdogs of the Universe), they enjoyed a fair deal of success, due in part to Beavis and Butt-head. After that, however, GWAR's popularity waned and they were even featured on the VH1 program \"Where Are They Now.\" Though not at the peak of their popularity, GWAR was recently invited to play on the Sounds of the Underground tour, which was very well received. \n\nGwar were, at one time, banned from performing in their home city of Richmond, Virginia due to their raucous stage performances. During that time they would appear in their home town under the pseudonym Rawg and play sans costumes. The ban was later lifted and the band can now play in Richmond again in full gory attire. GWAR was banned earlier in North Carolina for obscenity reasons (Brockie was arrested for wearing his \"Cuttlefish of Cthulu\" prosthetic penis; this incident was the inspiration for GWAR's America Must Be Destroyed album). Band members and associates often have cookouts at their house, dubbed \"Gwar-BQ's.\" The video for \"Saddam a Go-Go\" from This Toilet Earth appeared in the hit movie Empire Records. Gwar was/is primarily a band of former art students, and this is reflected in the obscure references made in some of their songs. Gwar fans are known as Bohabs or Scumdogs.\n\nThe origin and meaning of the band's name has been left intentionally vague by its members, although the most widely accepted explanation (though false and denied by the band members) is that GWAR is an acronym for \"God What an Awful Racket!\" One rumor states that the name may have come from Alan Moore and Dave Gibbons' graphic novel Watchmen, in which a poster reads, \"Pink Triangle LIVE at the Gay Women Against Rape Benefit Concert.\" Other unsubstantiated rumors state that GWAR! is the sound monsters make in old horror movies, or that a fan at a club yelled \"You should call your band...\" and vomited before he could finish, making a sound close to the word GWAR. A final possibility, and the most viable as of yet, coming from sources close to the band suggests strongly that the name comes from the answer David Brockie gave to Hunter Jackson when asked what the band should be called. David Brockie simply responded with a mostly unintelligble word and isolated a single sound out of the rubble therefore creating GWAR.\n\nOn Sunday March 23, 2014, Brockie was found dead in his apartment by a band member. According to police, Brockie was found deceased and sitting upright in a chair. Foul play, drugs, and suicide have been ruled out as causes of death and they will await word from a medical examiner on the cause. \nGwar's management confirmed the reports of Brockie's death on the official Gwar website at 4am on March 24, 2014. In an official statement released later that day, Gwar's manager Jack Flanagan said \"It is with a saddened heart, that I confirm my dear friend Dave Brockie, artist, musician, and lead singer of GWAR passed away at approximately 6:50 PM EST Sunday March 23, 2014. His body was found Sunday by his band mate at his home in Richmond, VA. Richmond authorities have confirmed his death and next of kin has been notified. A full autopsy will be performed. He was 50 years old, born August 30, 1963. My main focus right now is to look after my band mates and his family. More information regarding his death shall be released as the details are confirmed.\" News of Brockie's death spread quickly with many of his fellow musical peers and bandmates responding through social media. \nMike Bishop, former member of Gwar, was one of the first to confirm Brockie's death. Bishop said \"Dave was one of the funniest, smartest, most creative and energetic persons I've known. He was brash sometimes, always crass, irreverent, he was hilarious in every way. But he was also deeply intelligent and interested in life, history, politics and art. His penchant for scatological humors belied a lucid wit. He was a criminally underrated lyricist and hard rock vocalist, one of the best, ever! A great front man, a great painter, writer, he was also a hell of a bass guitarist. I loved him. He was capable of great empathy and had a real sense of justice.” \n <a href=\"https://www.last.fm/music/GWAR\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
