{"artist":{"name":"Harry Connick, Jr.","mbid":"fd23e684-270f-4507-9cb0-a0e0d7854d16","url":"https://www.last.fm/music/Harry+Connick,+Jr.","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/85d67dbe4fa740e890e7bf4749a3161c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/85d67dbe4fa740e890e7bf4749a3161c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/85d67dbe4fa740e890e7bf4749a3161c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85d67dbe4fa740e890e7bf4749a3161c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85d67dbe4fa740e890e7bf4749a3161c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85d67dbe4fa740e890e7bf4749a3161c.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"558315","playcount":"4966602"},"similar":{"artist":[{"name":"Bing Crosby","url":"https://www.last.fm/music/Bing+Crosby","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/88a8a2245baf4a0d9f0f1a393c07754a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/88a8a2245baf4a0d9f0f1a393c07754a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/88a8a2245baf4a0d9f0f1a393c07754a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/88a8a2245baf4a0d9f0f1a393c07754a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/88a8a2245baf4a0d9f0f1a393c07754a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/88a8a2245baf4a0d9f0f1a393c07754a.png","size":""}]},{"name":"Michael Bublé","url":"https://www.last.fm/music/Michael+Bubl%C3%A9","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a03401ae735b40e4c0545ae03fdc5490.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a03401ae735b40e4c0545ae03fdc5490.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a03401ae735b40e4c0545ae03fdc5490.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a03401ae735b40e4c0545ae03fdc5490.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a03401ae735b40e4c0545ae03fdc5490.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a03401ae735b40e4c0545ae03fdc5490.png","size":""}]},{"name":"Tony Bennett","url":"https://www.last.fm/music/Tony+Bennett","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/451a7e7a3923408fa5145a2d39c7fe83.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/451a7e7a3923408fa5145a2d39c7fe83.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/451a7e7a3923408fa5145a2d39c7fe83.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/451a7e7a3923408fa5145a2d39c7fe83.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/451a7e7a3923408fa5145a2d39c7fe83.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/451a7e7a3923408fa5145a2d39c7fe83.png","size":""}]},{"name":"Dean Martin","url":"https://www.last.fm/music/Dean+Martin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/44d557bbaaa84c3c98ebe83893c088c6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/44d557bbaaa84c3c98ebe83893c088c6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/44d557bbaaa84c3c98ebe83893c088c6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44d557bbaaa84c3c98ebe83893c088c6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44d557bbaaa84c3c98ebe83893c088c6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44d557bbaaa84c3c98ebe83893c088c6.png","size":""}]},{"name":"Sammy Davis, Jr.","url":"https://www.last.fm/music/Sammy+Davis,+Jr.","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d09df1ac42a74c9f8fd9c999f1287cde.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d09df1ac42a74c9f8fd9c999f1287cde.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d09df1ac42a74c9f8fd9c999f1287cde.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d09df1ac42a74c9f8fd9c999f1287cde.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d09df1ac42a74c9f8fd9c999f1287cde.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d09df1ac42a74c9f8fd9c999f1287cde.png","size":""}]}]},"tags":{"tag":[{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"swing","url":"https://www.last.fm/tag/swing"},{"name":"Big Band","url":"https://www.last.fm/tag/Big+Band"},{"name":"jazz vocal","url":"https://www.last.fm/tag/jazz+vocal"},{"name":"New Orleans","url":"https://www.last.fm/tag/New+Orleans"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Harry+Connick,+Jr./+wiki"}},"published":"11 Feb 2006, 18:45","summary":"Joseph Harry Fowler Connick, Jr. (born September 11, 1967) is an American singer, pianist, composer, actor, and humanitarian. Connick’s music encompasses jazz, some of it very much in the style of the crooners of the 1940s and early 1950s, funk and blues.\nBiography\n\n[edit] Early life\nConnick, Jr. was born Joseph Harry Fowler Connick, Jr.[1] in New Orleans, Louisiana, the son of Anita, a judge, lawyer, and former Louisiana Supreme Court justice, and Harry Connick, Sr. <a href=\"https://www.last.fm/music/Harry+Connick,+Jr.\">Read more on Last.fm</a>","content":"Joseph Harry Fowler Connick, Jr. (born September 11, 1967) is an American singer, pianist, composer, actor, and humanitarian. Connick’s music encompasses jazz, some of it very much in the style of the crooners of the 1940s and early 1950s, funk and blues.\nBiography\n\n[edit] Early life\nConnick, Jr. was born Joseph Harry Fowler Connick, Jr.[1] in New Orleans, Louisiana, the son of Anita, a judge, lawyer, and former Louisiana Supreme Court justice, and Harry Connick, Sr., who was the district attorney of New Orleans from 1977-2003, successfully running against Jim Garrison.[2] His parents also owned a record store. Connick, Jr.'s mother, a native of New York City, was Jewish, and his father is of Irish Catholic background.[3][4] Connick, Jr. has a sister, Suzanna. He was raised in the Lakeview neighbourhood of New Orleans.Connick's musical talents soon came to the fore when he learned the keyboards at the age of three, played publicly at age six and recorded with a local jazz band at 10. His musical talents were developed at the New Orleans Center for Creative Arts and under the tutelage of Ellis Marsalis and James Booker.\n\nConnick attended Jesuit High School and Isidore Newman School in New Orleans. He moved to New York City to study at Hunter College and the prestigious Manhattan School of Music, where a Columbia Records executive persuaded him to sign with that label. His first record for the label, Harry Connick Jr., was a mainly instrumental album of standards. He soon acquired a reputation in jazz because of extended stays at high-profile New York venues. His next album, 20, featured his vocals and added to this reputation.\n\n\n[edit] When Harry Met Sally... — chart and movie success\nWith Connick's growing reputation, director Rob Reiner asked him to provide a soundtrack for his 1989 romantic comedy When Harry Met Sally..., starring Meg Ryan and Billy Crystal. The soundtrack consisted of several standards, including \"It Had to Be You\", \"Let's Call the Whole Thing Off\" and \"Don't Get Around Much Anymore\", and achieved double-platinum status in the United States. He won his {HE'S GAY! THIS IS BULLSHIT K? K. I HATE HARRY CONNICK JR!}  first Grammy for Best Jazz Male Vocal Performance for his work on the soundtrack.\n\nConnick made his screen debut in Memphis Belle (1990), about a B-17 Flying Fortress bomber crew in World War II. In that year, he began a two-year world tour. In addition, he released two albums in July 1990: the instrumental jazz trio album Lofty's Roach Souffle and a big-band album of mostly original songs titled We Are in Love, which also went double platinum. We Are in Love earned him his second consecutive Grammy for Best Jazz Male Vocal.\n\n\"Promise Me You'll Remember\", his contribution to the Godfather III soundtrack, was nominated for both an Academy Award and a Golden Globe in 1991. In a year of recognition, he was also nominated for an Emmy for Best Performance in a Variety Special for his PBS special Swingin' Out Live, which was also released as a video. In October 1991, he released his third consecutive multi-platinum album, Blue Light, Red Light, on which he wrote and arranged the songs. In October 1991, he starred in Little Man Tate, directed by Jodie Foster, playing the friend of a child prodigy who goes to college.\n\nConnick was arrested in 1992 and charged with having a 9mm pistol in his possession at JFK International Airport. After spending a day in jail, he agreed to make a public-service television commercial warning against breaking gun laws. The court agreed to drop all charges if Connick stayed out of trouble for six months.\n\nIn November 1992, Connick released 25, a solo piano collection of standards that again went platinum. He also re-released the album Eleven. Connick contributed \"A Wink and a Smile\" to the Sleepless in Seattle soundtrack, released in 1993. His multi-platinum album of holiday songs, When My Heart Finds Christmas, was the best-selling Christmas album in 1993.\n\n\n[edit] Flirtation with funk in the mid-1990s\nIn 1994, Connick decided to branch out. He released She, an album of New Orleans funk that also went platinum. In addition, he released a song called \"(I Could Only) Whisper Your Name\" for the soundtrack of The Mask, starring Jim Carrey, which is his most successful single in the United States to date.\n\nConnick took his funk music on a tour of the United Kingdom in 1994, an effort that did not please some of his fans, who were expecting a jazz crooner. Connick also took his funk music to the People's Republic of China in 1995, playing at the Shanghai Center Theatre. The performance was televised live in China for what became known as the Shanghai Gumbo special. In his third film Copycat, Connick played a killer. Released in 1995, Copycat also starred Holly Hunter and Sigourney Weaver. The following year, he released his second funk album, Star Turtle, which did not sell as well as previous albums, although it did reach No. 38 on the charts. However, he appeared in the most successful movie of 1996, Independence Day, with Will Smith and Jeff Goldblum.\n\n\n[edit] Back to basics: return to jazz, 1999—current\n \nHarry Connick Jr at the Johnny Mercer Theather, Savannah, Georgia Feb 27, 2007For his 1997 release To See You, Connick recorded original love songs, touring the United States and Europe with a full symphony orchestra backing him and his piano in each city. As part of his tour, he played at the Nobel Peace Prize Concert in Oslo, Norway, with his final concert of that tour in Paris being recorded for a St. Valentine's Day special on PBS in 1998. He also continued his film career, starring in Excess Baggage opposite Alicia Silverstone and Benicio del Toro in 1997.\n\nIn May 1998, he had his first leading role in director Forest Whitaker's Hope Floats, with Sandra Bullock as his female lead. He released Come By Me, his first album of big band music in eight years in 1999, and embarked on a world tour visiting the United States, Europe, Japan and Australia. In addition, he provided the voice of Dean McCoppin in the animated film The Iron Giant. Connick wrote the score for Susan Stroman's Broadway musical Thou Shalt Not, based on Émile Zola's novel Thérèse Raquin, in 2000; it premiered in 2001. His music and lyrics garnerned a Tony Award nomination. He was also the narrator of the film My Dog Skip, released in that year.\n\nIn March 2001, Connick starred in a television production of South Pacific with Glenn Close, televised on the ABC network. He also starred in his twelfth movie, Mickey, featuring a screenplay by John Grisham that same year. In October 2001, he again released two albums: Songs I Heard, featuring big band reworkings of children's show themes, and 30, featuring Connick on piano with guest appearances by several other musical artists. Songs I Heard won Connick another Grammy for best traditional pop album and he toured performing songs from the album, holding matinees at which each parent had to be accompanied by a child.\n\nIn 2002, he received US Patent #6,348,648 for a \"system and method for coordinating music display among players in an orchestra.\"[5] Connick appeared as Grace Adler's boyfriend (and later husband) Leo Markus on the NBC sitcom Will & Grace from 2002 to 2006. In July 2003, Connick released his first instrumental album in fifteen years, Other Hours Connick on Piano Volume 1. It was released on Branford Marsalis's new label Marsalis Music and led to a short tour of nightclubs and small theaters.\n\nConnick appeared in the film Basic with John Travolta and Samuel L. Jackson. In October 2003, he released his second Christmas album, Harry for the Holidays, which went gold and reached No. 12 on the Billboard 200 album chart. He also had a television special on NBC featuring Whoopi Goldberg, Nathan Lane, Marc Anthony and Kim Burrell. Only You, his seventeenth album for Columbia Records, was released in February 2004. A collection of 1950s and 1960s ballads, Only You, went Top Ten on both sides of the Atlantic and was certified gold in the United States in March 2004. The Only You tour with big band went on in America, Australia and a short trip to Asia. Harry for the Holidays was certified platinum in November 2004. A music DVD Harry Connick Jr. — \"Only You\" in Concert was released in March 2004, after it had first aired as a Great Performances special on PBS. The special won him an Emmy for Outstanding Music Direction. The DVD received a Gold & Platinum Music Video — Long Form awards from the RIAA in November 2005.\n\nAn animated holiday special, The Happy Elf, aired on NBC in December 2005, with Connick as the composer, the narrator, and one of the executive producers. Shortly after, it was released on DVD. The holiday special was based on his original song The Happy Elf, from his 2003 album Harry for the Holidays. Another album from Marsalis Music was recorded in 2005, Occasion : Connick on Piano, Volume 2, a duo album with Harry Connick, Jr. on piano together with Branford Marsalis on saxophone. A music DVD, A Duo Occasion, was filmed at the Ottawa International Jazz Festival 2005 in Canada, and released in November 2005.\n\nHe appeared in another episode of NBC sitcom Will & Grace in November 2005, and appeared in additional three episodes in 2006. Bug, a film directed by William Friedkin, is a psychological thriller filmed in 2005, starring Connick, Ashley Judd, and Michael Shannon. The film was released in 2007. He starred in the Broadway revival of The Pajama Game, produced by the Roundabout Theater Company, along with Michael McKean and Kelli O'Hara, at the American Airlines Theatre in 2006. It ran from February 23 to June 17, 2006, including five benefit performances running from June 13 to June 17. The Pajama Game cast recording was nominated for a Grammy, after being released as part of Connick's double disc album Harry on Broadway, Act I.\n\nHe hosted the Weather Channel's mini series 100 Biggest Weather Moments which aired in 2007. He was part of the documentary Note by Note: The Making of Steinway L1037, released in November 2007. He sat in on piano on Bob French's 2007 album Marsalis Music Honors Series: Bob French. He appeared in the film P.S. I Love You, with Hilary Swank and Gerard Butler, released in December 2007. A third album in the Connick on Piano series, Chanson du Vieux Carré was released in 2007, and Connick has received two Grammy nominations for the track \"Ash Wednesday\", for the upcoming Grammy awards in 2008. Chanson du Vieux Carré was released simultaneously with the album Oh, My NOLA. Connick toured North America and Europe in 2007, and will be touring Asia and Australia in 2008, as part of his My New Orleans Tour. The film Chilled in Miami is set to begin filming in January 2008, co-starring Connick and Renée Zellweger. Connick did the arrangements for, wrote a couple of songs, and sings a duet on Kelli O'Hara's new album, set to be released in May 2008.[6]\n\n\n[edit] Involvement for Hurricane Katrina Victims\nOn September 2, 2005, Harry Connick, Jr. helped to organize, and appeared in, the NBC-sponsored live telethon concert, A Concert for Hurricane Relief, for relief in the wake of Hurricane Katrina. As a native son of New Orleans, he spent several days touring the city, to draw attention to the plight of citizens stranded at the Ernest N. Morial Convention Center and other places. At the concert he paired with host Matt Lauer (Today Show), and entertainers including Tim McGraw, Faith Hill, Kanye West, Mike Myers, and John Goodman.\n\nOn September 6, 2005, Connick was made honorary chair of Habitat for Humanity’s “Operation Home Delivery,” a long-term rebuilding plan for families victimized by Hurricane Katrina in the Big Easy and along the Gulf Coast of new orleans.\n\nMain article: Musicians' Village\nConnick and Branford Marsalis devised an initiative to help restore New Orleans's musical heritage. Habitat for Humanity and New Orleans Area Habitat for Humanity, working with Connick and Branford Marsalis announced December 6, 2005, plans for a Musicians' Village in New Orleans. The Musicians' Village will include Habitat-constructed homes, with an Ellis Marsalis Center for Music, as the area's centerpiece. The Habitat-built homes will provide musicians and anyone else who qualifies the opportunity to buy decent, affordable housing.\n\n\n[edit] Personal life\nOn April 16, 1994, Connick, Jr. married model Jill Goodacre, originally from Texas, at the St. Louis Cathedral, New Orleans, Louisiana. They have three daughters: Georgia Tatom (born April 17, 1996), Sarah Kate (September 12, 1997), and Charlotte (born June 26, 2002). The family currently resides in Connecticut.\n\nHe is a founder of the Krewe of Orpheus, a music-based New Orleans krewe, taking its name from Orpheus of classical mythology. The Krewe of Orpheus parades on St. Charles Avenue and Canal Street in New Orleans on Lundi Gras (Fat Monday) — the day before Mardi Gras (Fat Tuesday).\n\n\n[edit] Discography\n\n[edit] Albums\nU.S. certification information is from Recording Industry Association of America,[7] chart positions are from All Music Guide[8] and Billboard.[9]\n\nYear Album information Additional information \n2007 Oh, My NOLA \nRelease Date: January 30, 2007 \nGenre: Big band \nLabel: Sony \nChart Positions: #1 US Jazz, #11 US \nRIAA certification: - \n My New Orleans Tour \n \n2007 Chanson du Vieux Carre : Connick On Piano, Volume 3 \nRelease Date: January 30, 2007 \nGenre: Big band \nLabel: Marsalis music \nChart Positions: #3 US Jazz \nRIAA certification: - \nInstrumental album (vocals by band members Leroy Jones on track #5 and Lucien Barbarin on track #8) \n 2008 Grammy nomination:\nBest Instrumental Composition\n- \"Ash Wednesday\" \n2008 Grammy nomination:\nBest Instrumental Arrangement\n- \"Ash Wednesday\" \n \n2006 Harry on Broadway, Act I \nRelease Date: May 9, 2006 \nGenre: Cast album \nLabel: Sony \nChart Positions: #1 US Cast Album, #97 US \nRIAA certification: - \nDouble disc: \"The Pajama Game\" cast recording (CD1)/ \"Songs from Thou Shalt Not\" with Kelli O'Hara and Harry Connick, Jr. (CD2) \n \"The Pajama Game\"\ncast recording (CD1):\n2007 Grammy nomination:\nBest Musical Show Album \n \n2005 Occasion : Connick on Piano, Volume 2 \nRelease Date: June 14, 2005 \nGenre: Jazz duo \nLabel: Marsalis music \nChart Positions: #5 US Jazz \nRIAA certification: - \nInstrumental album (no vocals) \n \n2004 Only You \nRelease Date: February 3, 2004 \nGenre: Pop, ballads \nLabel: Sony \nChart Positions: #1 US Jazz, #5 US \nRIAA certification: Platinum (US) \n 2005 Grammy nomination:\nBest Traditional Pop Vocal Album \n \n2003 Harry for the Holidays \nRelease Date: October 28, 2003 \nGenre: Christmas, Big band/Orchestra \nLabel: Sony \nChart Positions: #1 US Jazz, #12 US \nRIAA certification: Platinum (US) \n \n2003 Other Hours : Connick on Piano, Volume 1 \nRelease Date: July 15, 2003 \nGenre: Jazz \nLabel: Marsalis music \nChart Positions: #2 US Jazz \nRIAA certification: - \nInstrumental album (no vocals) \n \n2002 Thou Shalt Not \nRelease Date: June 18, 2002 \nGenre: Cast album \nLabel: Papa's-June Music \nChart Positions: - \nRIAA certification: - \nOriginal Broadway Cast Recording, Music & lyrics by Harry Connick, Jr. (who does not sing on this album) \n 2002 Tony nomination:\nBest Original Musical Score \n \n2001 Songs I Heard \nRelease Date: October 23, 2001 \nGenre: Big band/Orchestra \nLabel: Sony \nChart Positions: #2 US Jazz, #88 US \nRIAA certification: - \n 2002 Grammy winner:\nBest Traditional Pop Vocal Album \n \n2001 30 \nRelease Date: October 23, 2001 \nGenre: Solo piano \nLabel: Sony \nChart Positions: #3 US Jazz, #94 US \nRIAA certification: - \n \n1999 Come by Me \nRelease Date: June 1, 1999 \nGenre: Big band \nLabel: Sony \nChart Positions: #1 US Jazz, #36 US \nRIAA certification: Gold (US) \n 2000 Grammy nomination:\nBest Traditional Pop Vocal Performance \n \n1997 To See You \nRelease Date: November 11, 1997 \nGenre: Ballads w/Orchestra \nLabel: Sony \nChart Positions: #1 US Jazz, #53 US \nRIAA certification: Gold (US) \n \n1996 Star Turtle \nRelease Date: July 2, 1996 \nGenre: Funk \nLabel: Sony \nChart Positions: #38 US \nRIAA certification: Gold (US) \n \n1994 She \nRelease Date: July 12, 1994 \nGenre: Funk \nLabel: Sony \nChart Positions: #16 US \nRIAA certification: Platinum (US) \n \n1993 When My Heart Finds Christmas \nRelease Date: October 26, 1993 \nGenre: Christmas, Big band/Orchestra \nLabel: Sony \nChart Positions: #13 US \nRIAA certification: 3xPlatinum (US) \n \n1992 25 \nRelease Date: November 24, 1992 \nGenre: Piano \nLabel: Sony \nChart Positions: #1 US Jazz, #19 US \nRIAA certification: Platinum (US) \n \n1991 Blue Light, Red Light \nRelease Date: September 23, 1991 \nGenre: Big band \nLabel: Sony \nChart Positions: #1 US Jazz, #17 US \nRIAA certification: 2xPlatinum (US) \n 1992 Grammy nomination:\nBest Traditional Pop Performance \n1992 Grammy nomination:\nBest Instrumental Arrangement w/ Vocals\n- \"Blue Light, Red Light (Someone's There)\" \n \n1990 Lofty's Roach Souffle \nRelease Date: July 3, 1990 \nGenre: Jazz trio \nLabel: Sony \nChart Positions: #4 US Jazz, #94 US \nRIAA certification: - \nInstrumental album (no vocals) \n 1991 Grammy nomination:\nBest Instrumental Composition\n- \"One Last Pitch (Take 2)\" — Harry Connick, Jr. & Joe Livingston \n \n1990 We Are in Love \nRelease Date: July 3, 1990 \nGenre: Big Band/orchestra \nLabel: Sony \nChart Positions: #1 US Jazz, #22 US \nRIAA certification: 2xPlatinum (US) \n 1991 Grammy winner:\nBest Jazz Vocal Performance by a Male \n1991 Grammy nomination:\nBest Instrumental Arrangement w/ Vocals\n- \"Recipe For Love\" — Harry Connick, Jr. & Mark Shaiman \n \n1989 When Harry Met Sally... \nRelease Date: July 13, 1989 \nGenre: Big Band/orchestra \nLabel: Sony \nChart Positions: #1 US Jazz, #42 US \nRIAA certification: 2xPlatinum (US) \n 1989 Grammy winner:\nBest Jazz Vocal Performance by a Male \n \n1988 20 \nRelease Date: November 1, 1988 \nGenre: Solo piano \nLabel: Sony \nChart Positions: #6 US Jazz, #133 US \nRIAA certification: Platinum (US) \n \n1987 Harry Connick Jr. \nRelease Date: November 17, 1987 \nGenre: Solo piano \nLabel: Sony \nChart Positions: - \nRIAA certification: Gold (US) \nInstrumental album (no vocals) \n \n1979 11 \nRelease Date: November 20, 1992 (Originally Released: 1979) \nGenre: Piano, dixieland \nLabel: Sony \nChart Positions: #14 US Jazz \nRIAA certification: - \n \n1977 Dixieland Plus \nRelease Date: 1977 \nGenre: Dixieland \nLabel: Adco Productions \nChart Positions: - \nRIAA certification: - \n \n\n\n[edit] Soundtrack appearances\n1991 The Godfather Part III — Carmine Coppola — #12 \"Promise Me You'll Remember\" \n1993 Sleepless In Seattle — Various Artists — #8 \"A Wink And A Smile\" \n1994 The Mask — Various Artists — #5 \"(I Could Only) Whisper Your Name\" \n1996 One Fine Day — Various Artists — #11 \"This Guy's In Love With You\" \n1998 Kissing a Fool — Various Artists — \"Learn to Love\" and \"We Are in Love\" (appears in the movie, not on the soundtrack) \n2001 South Pacific — Various Artists — #9 \"Younger Than Springtime\", #14 \"You've Got To Be Carefully Taught\" and #17 \"My Girl Back Home\" \n\n[edit] Various\n1989 Jubilation — Various Artists — #7 \"You Go To My Head\" \n1990 A Jazzy Wonderland — Various Artists — #1 \"This Christmas\" \n1990 Making Every Moment Count — Peter Allen — #3 \"When I Get My Name In Lights\" \n1991 Simply Mad About The Mouse — Various Artists — #6 \"The Bare Necessities\" \n1992 Swing Time, Japan compilation — Harry Connick, Jr — #1 \"Let Me Love You, It's OK\" \n1993 France, I Wish You Love, France, compilation — Harry Connick, Jr — #3 \"I Wish You Love\" \n1996 Voodoo Mama/Hear Me In The Harmony (CD-single) — Harry Connick, Jr — #1 \"Voodoo Mama\" \n1998 New Orleans... My Home Town — Harry Connick, Sr. — #2 \"Rocky Mountain Moon\" \n1999 Come By Me, Japan — Harry Connick, Jr — \"Just A Closer Walk With Thee\" \n1999 And So This Is Christmas — Various Artists — \"Silver Bells\" \n2002 The Season for Romance — Lee Ann Womack & Harry Connick, Jr (duet) — \"Baby It's Cold Outside\" \n2000 Come By Me, France — Harry Connick, Jr — \"Parle Plus Bas\" \n2007 Marsalis Music Honors Series: Bob French — Bob French — Sitting in on piano \n2008 Wonder in the World — Kelli O'Hara - arranged and orchestrated by Connick, three tracks written by Connick, plays piano on 12 of the 14 tracks, and sings a duet with O'Hara. \n\n[edit] Filmography\nYear Film information Role \nTBA Chilled in Miami \nRelease Date: TBA \nGenre: comedy \nDistributed by: Universal Pictures \n Ted Mitchell \n \n2008 Living Proof \nRelease Date: October 2008 \nGenre: documentary film \nDistributed by: Lifetime \n Dr. Denny Slamon \n \n2007 P.S. I Love You \nRelease Date: December 21, 2007 \nGenre: drama, comedy \nDistributed by: Warner Bros. Pictures, Summit Entertainment \n Daniel Connelly \n \n2007 Bug \nRelease Date: May 25, 2007 \nGenre: drama, psychological thriller \nDistributed by: Lionsgate \n Jerry Goss \n \n2005 The Happy Elf \nRelease Date: December 2, 2005 \nGenre: Christmas TV special, animation \nDistributed by: IDT Entertainment, NBC \n Lil' Farley (narrator) \n \n2004 Mickey \nRelease Date: April 30, 2004 \nGenre: Baseball movie \nDistributed by: Mickey Productions, Slugger Pictures, Anchor Bay Entertainment \n Glen Ryan (Tripp Spence) \n \n2003 Basic \nRelease Date: March 28, 2003 \nGenre: action/mystery \nDistributed by: Columbia Pictures \n Pete Vilmer \n \n2001 Life Without Dick \nRelease Date: 2001 \nGenre: dark comedy \nDistributed by: Columbia Pictures \n Daniel Gallagher \n \n2001 The Simian Line \nRelease Date: November 16, 2001 \nGenre: drama \nDistributed by: Gabriel Film Group \n Rick \n \n2001 South Pacific \nRelease Date: August 28, 2001 (DVD) \nGenre: drama \nDistributed by: Buena Vista, ABC \n Lt. Joseph Cable \n \n2000 My Dog Skip \nRelease Date: 2000 \nGenre: drama \nDistributed by: Warner Bros. \n Narrator \n \n1999 Wayward Son \nRelease Date: \nGenre: drama \nDistributed by: \n Jesse Banks Rhodes \n \n1999 The Iron Giant \nRelease Date: 1999 \nGenre: animated science fiction \nDistributed by: Warner Bros. \n Dean McCoppin \n \n1998 Hope Floats \nRelease Date: May 1998 \nGenre: romantic drama \nDistributed by: 20th century Fox \n Justin Matisse \n \n1997 Excess Baggage \nRelease Date: 29 August 1997 \nGenre: drama, comedy \nDistributed by: Columbia TriStar \n Greg Kistler \n \n1996 Independence Day \nRelease Date: July 3, 1996 \nGenre: science fiction \nDistributed by: 20th century Fox \n Captain Jimmy Wilder \n \n1995 Copycat \nRelease Date: October 13, 1995 \nGenre: suspense thriller \nDistributed by: Warner Bros. \n Daryll Lee Cullum \n \n1991 Little Man Tate \nRelease Date: October 18, 1991 \nGenre: drama \nDistributed by: Orion Pictures Corporation \n Eddie \n \n1990 Memphis Belle \nRelease Date: October 12, 1990 \nGenre: War film \nDistributed by: Warner Bros. \n Sgt. Clay Busby \n \n\n\n[edit] Various\n1990 Carly in Concert: My Romance Carly Simon - guest artist (VHS) \n1991 Cheers — TV show guest appearance \n1992 Super Bowl XXVI — performed U.S. National Anthem \n1993 The Harry Connick Jr. Christmas Special (CBS) \n1997 Action League Now!, Rock-A-Big-Baby (TV)(short film) (voice, as \"Big Baby\") \n1998 Harry Connick Jr.: Romance in Paris (PBS Special) \n1999 The Worlds of Harry Connick Jr. (Bravo) \n2001 Evening at Pops (PBS) \n2002 Will & Grace (NBC 2002-2006) \n2003 Harry for the Holidays (NBC) \n2004 Only You: In Concert (PBS) \n2007 100 Biggest Weather Moments (The Weather Channel) — host \n2007 Note by Note: The Making of Steinway L1037 \n\n[edit] Videography\n1990 Singin' and Swingin' (Sony Music) \n1990 Swingin' Out Live (Sony Music) \n1993 The New York Big Band Concert (Sony Music) \n1994 The Harry Connick Jr. Christmas Special \n2003 Harry for the Holidays (Columbia) \n2004 Only You: In Concert (Sony Music) \n2005 A Duo Occasion \n\n[edit] Broadway\n2001 Thou Shalt Not (Broadway Musical) — composer \n2006 The Pajama Game (Broadway Musical) \n2008 Nice Work If You Can Get It (Broadway Musical) (2008 in Boston, 2009 on Broadway)planned[10] \n\n[edit] Further reading\nBeuttler, Bill. \"When Harry Met Stardom\", Music, American Way, 1990-08-01. Retrieved on 2007-10-02.  \nEggar, Robin. \"When Harry met Katrina\", Music, The Times, 2007-09-30. Retrieved on 2007-10-02.  \n\"Harry Connick Jnr discusses playing, singing and arranging.\" [radio transcript]. 2005. The Music Show. Presented by Andrew Ford. \n\n[edit] References\n^ Internet Broadway Database: Harry Connick, Jr. Credits on Broadway. Internet Broadway Database. Retrieved on 2007-07-02. \n^ Harry Connick, Jr. Biography (1967-) \n^ Feher, Heather. \"HARRY CONNICK JR. TO BE GRACE'S NEW BOYFRIEND\", Zap2it, 2002-09-26. Retrieved on 2007-12-24.  \n^ Stephanie Mansfield, \"Deconstructing Harry\", Vogue, April 1998: 211, 214, 216; online posting, connick.com, accessed July 17, 2007 \n^ System and method for coordinating music display among players in an orchestra. \n^ Kelli O'Hara gets ready to ring in the holidays and prepares for a busy new year; Neal Huff engages in some Trumpery; and Jenn Gambatese enlivens Is He Dead?Feature on TheaterMania.com \n^ http://www.riaa.com/gp/database/default.asp \n^ allmusic \n^ Billboard.biz - Music Business - Billboard Charts - Album Sales - Concert Tours \n^ playbill article, May 5, 2008, Connick, Jr. to Return to Broadway in Nice Work If You Can Get It; Marshall at Helm Retrieved 5-6-2008 \n\n[edit] External links\nHarry Connick Jr. official website \nHarry Connick Jr. website on Sony Music \nconnick.com : the original Harry Connick, Jr. fan site \nHarry Connick, Jr. at the Internet Movie Database \nHarry Connick, Jr. at the Internet Broadway Database \nArticle on Connick's United States patent 6,348,648 for a \"system and method for coordinating music display among players in an orchestra.\" \nAudio interview recorded April 2007 in Toronto, Canada \n[show]v • d • eHarry Connick, Jr. \n \nDiscography \n \nStudio vocal albums Dixieland Plus · 11 · 20 · We Are in Love · Blue Light, Red Light · 25 · When My Heart Finds Christmas · She · Star Turtle · To See You · Come by Me · 30 · Songs I Heard · Harry for the Holidays · Only You · Oh, My NOLA \n \nStudio instrumental albums Harry Connick Jr. · Lofty's Roach Souffle · Other Hours : Connick on Piano, Volume 1 · Occasion : Connick on Piano, Volume 2 · Chanson du Vieux Carre : Connick On Piano, Volume 3 \n \nMovie, TV and Broadway\nSoundtracks When Harry Met Sally... · The Godfather Part III · Sleepless in Seattle · The Mask · One Fine Day · Kissing a Fool · South Pacific · Thou Shalt Not · The Happy Elf · Harry on Broadway, Act I \n \nMusic DVD/VHS Singin' & Swingin' · Swinging Out Live · The New York Big Band Concert · The Harry Connick Jr. Christmas Special · Harry for the Holidays · Only You: In Concert · A Duo Occasion \n \nFilmography \n \nFilm Memphis Belle · Little Man Tate · Copycat · Independence Day · Excess Baggage · Hope Floats · The Iron Giant · Wayward Son · My Dog Skip · The Simian Line · Life Without Dick · Basic · Mickey · Bug · P. S., I Love You · Chilled in Miami \n \nTV South Pacific · Will & Grace · The Happy Elf \n \nRelated articles \n \nMusicians' Village · Jill Goodacre · Harry Connick, Sr. · The Pajama Game · Thou Shalt Not · Leo Markus · Krewe of Orpheus · My New Orleans Tour \n \n[show]v • d • eGreat American Songbook \n \nSongwriters Adair · Adams · Adler · Ager · Ahlert · Arlen · Bacharach · Basie · A. Bergman · M. Bergman · Berlin · Bernstein · Blake · Blane · Bloom · Bock · Bricusse · Brown · Burke · Cahn · Carleton · Carmichael · Cohan · Coleman · Comden · H. David · M. David · Dennis · DeRose · DeSylva · Dietz · Donaldson · Dubin · Duke · Ebb · Eliscu · Ellington · Evans · Fain · Fields · Freed · G. Gershwin · I. Gershwin · A. Green · J. Green · Guettel · Hamlisch · Hammerstein · Harbach · Harburg · Harnick · Hart · Henderson · Herman · Heyman · Jobim · Jones · Kander · Kern · Lane · Legrand · Leigh · Lerner · Levant · C. Lewis · S. Lewis · Livingston · Loesser · Loewe · Mancini · Mandel · Mann · Martin · McHugh · Mercer · Newley · Noble · Parish · Porter · A. Previn · D. Previn · Raksin · Raposo · Razaf · Rodgers · D. Rose · V. Rose · Ross · Schwartz · Sissle · Sondheim · Stept · Stillman · Strayhorn · Strouse · Styne · Tiomkin · Troup · Van Heusen · Waller · Warren · Washington · Webb · Webster · Weill · Whiting · Wilder · Williams · Yellen · Youmans · Young ·\n \n \nSingers Alexandria · Allison · K. Allyson · E. Anderson · I. Anderson · Andrews · J. Andrews · Anka · Apaka · Armstrong · Astaire · Austin · Azama · M. Bailey · P. Bailey · Baker · Barber · Bennett · Benton · Bergen · Berigan · Boone · Boswell · Bowlly · Brewer · Brice · Bublé · V. Carr · Carroll · Carter · E. Cassidy · Channing · Charles · Chevalier · Christy · Cincotti · B. Clark · V. Clark · Clooney · Cole · Columbo · Como · Connick · Connor · Cornell · Crosby · Damone · Dandridge · Darin · Davis  · Day · Daye · Dearie · DeShannon · Desmond · Dietrich · Downey · Drake · Eberle · Eberly · Eckstine · Eddy · Edwards · E. Ennis · S. Ennis · Etting · A. Faye · F. Faye · Feinstein · Fisher · Fitzgerald · Flint · Ford · Forrest · Four Freshmen · Franchi · Francis · Gambarini · Garland · Gilberto · Gormé · Goulet · Gray · Greco · Hall · Hanshaw · Hartman · Haymes · Hendricks · Herman · Hibbler · Hildegarde · Hilliard · Hi-Lo's · Ho · Holiday · Holliday · Horn · Horne · Howard · Humes · Humperdinck · Hunter · Jackie and Roy · James · Jefferson · Jeffries · Jolson · A. Jones · E. Jones · J. Jones · N. Jones · Jordan · Kallen · Keel · Kelly · Kenney · Kent · Kerr · Kiley · King · Kitt · Kral · Krall · C. Laine · F. Laine · Langford · Lanza · C. Lawrence · S. Lawrence · Lee · Liberace · Lombardo · London · Longet · Lucas · Lund · Lupone · Lutcher · Lynn · Lynne · MacDonald · MacRae · Maggart · D. Martin · M. Martin · T. Martin · McCorkle · McDonald · McRae · M. Mercer · Merman · Merrill · Merry Macs · Midler · Mills · Minnelli · Modernaires · Monheit · Monro · Monroe · Mooney · H. Morgan · J. Morgan · R. Morgan · Morse · Murphy · O'Connell · O'Day · O'Hara · Page · Paris · B. Peters · Peyroux · Piaf · Pied Pipers · Pizzarelli · Pleasure · Prysock · Ma Rainey · Raitt · Raney · Reese · Reeves · Robeson · Ronstadt · Ross · Rushing · Russell · Scott · Shore · Short · Simon · Simone · Sims · Sinatra · Singers Unlimited · Sloane · B. Smith · J. Smith · Ka. Smith · Ke. Smith · Sommers · Southern · Stafford · Starr · Staton · Stevens · Stewart · Streisand · Sullivan · Sutton · Suzuki · Swingle Singers · Syms · Thornton · Tilton · Todd · Tormé · Tracy · Tucker · Tunnell · Umeki · Vale · Vallée · Vaughan · Veloso · Wain · Ward · Warren · Warwick · Washington · Waters · Wayne · Whiting · Wiley · A. Williams · J. Williams · V. Williams · C. Wilson · N. Wilson · Wright\n \n \nAwards \nPreceded by\nBill Conti\nfor 75th Annual Academy Awards Emmy Award for Outstanding Music Direction\n2004\nfor Only You: In Concert Succeeded by\nMichael Kosarin\nfor A Christmas Carol \nPreceded by\nJoni Mitchell\nfor Both Sides Now Grammy Award for Best Traditional Pop Vocal Album\n2002\nfor Songs I Heard Succeeded by\nTony Bennett\nfor Bennett Sings Ellington: Hot & Cool \nPreceded by\nHarry Connick, Jr.\nfor When Harry Met Sally... Grammy Award for Best Jazz Vocal Performance, Male\n1991\nfor We Are In Love Succeeded by\nTake 6\nfor He Is Christmas \nPreceded by\nBobby McFerrin\nfor Brothers Grammy Award for Best Jazz Vocal Performance, Male\n1990\nfor When Harry Met Sally... Succeeded by\nHarry Connick, Jr.\nfor We Are In Love \n\nRetrieved from \"http://en.wikipedia.org/wiki/Harry_Connick%2C_Jr.\"\nCategories: 1967 births | American actor-singers | American baritones | American jazz pianists | American jazz singers | American Jews | American male singers | American pop singers | American Roman Catholics | American songwriters | American stage actors | Emmy Award winners | Grammy Award winners | Harry Connick, Jr. | Irish-American musicians | Irish-Americans | Jazz-funk pianists | Jewish American musicians | Jewish actors | Jewish singers | Living people | Louisiana actors | Manhattan School of Music alumni | Musicians of New Orleans | New Orleans jazz musicians | People from Louisiana | People from New Orleans, Louisiana | Swing pianists | Swing singers | Traditional pop music singers | Jewish Christians <a href=\"https://www.last.fm/music/Harry+Connick,+Jr.\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
