{"artist":{"name":"Havok","mbid":"c4f35f4b-0716-463b-b3f2-40feede7b2e1","url":"https://www.last.fm/music/Havok","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/168b6292c2e04095b30c7f24e0432597.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/168b6292c2e04095b30c7f24e0432597.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/168b6292c2e04095b30c7f24e0432597.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/168b6292c2e04095b30c7f24e0432597.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/168b6292c2e04095b30c7f24e0432597.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/168b6292c2e04095b30c7f24e0432597.png","size":""}],"streamable":"0","ontour":"1","stats":{"listeners":"44149","playcount":"1494329"},"similar":{"artist":[{"name":"Warbringer","url":"https://www.last.fm/music/Warbringer","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fdb40fff4ccb494dbf5b921be8e05144.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fdb40fff4ccb494dbf5b921be8e05144.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fdb40fff4ccb494dbf5b921be8e05144.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fdb40fff4ccb494dbf5b921be8e05144.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fdb40fff4ccb494dbf5b921be8e05144.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fdb40fff4ccb494dbf5b921be8e05144.png","size":""}]},{"name":"Evile","url":"https://www.last.fm/music/Evile","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a4ea4afb8db049be8caf36cc6b78576b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a4ea4afb8db049be8caf36cc6b78576b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a4ea4afb8db049be8caf36cc6b78576b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a4ea4afb8db049be8caf36cc6b78576b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a4ea4afb8db049be8caf36cc6b78576b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a4ea4afb8db049be8caf36cc6b78576b.png","size":""}]},{"name":"Lich King","url":"https://www.last.fm/music/Lich+King","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d283dff94ace41eaadb0d90591759fa3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d283dff94ace41eaadb0d90591759fa3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d283dff94ace41eaadb0d90591759fa3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d283dff94ace41eaadb0d90591759fa3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d283dff94ace41eaadb0d90591759fa3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d283dff94ace41eaadb0d90591759fa3.png","size":""}]},{"name":"Gama Bomb","url":"https://www.last.fm/music/Gama+Bomb","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/64cd97c912384881ab11d2cae69a2355.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/64cd97c912384881ab11d2cae69a2355.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/64cd97c912384881ab11d2cae69a2355.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/64cd97c912384881ab11d2cae69a2355.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/64cd97c912384881ab11d2cae69a2355.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/64cd97c912384881ab11d2cae69a2355.png","size":""}]},{"name":"Exodus","url":"https://www.last.fm/music/Exodus","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0c3a84670d1c402897f982a0067c5c7b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0c3a84670d1c402897f982a0067c5c7b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0c3a84670d1c402897f982a0067c5c7b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0c3a84670d1c402897f982a0067c5c7b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0c3a84670d1c402897f982a0067c5c7b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0c3a84670d1c402897f982a0067c5c7b.png","size":""}]}]},"tags":{"tag":[{"name":"thrash metal","url":"https://www.last.fm/tag/thrash+metal"},{"name":"death metal","url":"https://www.last.fm/tag/death+metal"},{"name":"Technical Death Metal","url":"https://www.last.fm/tag/Technical+Death+Metal"},{"name":"metal","url":"https://www.last.fm/tag/metal"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Havok/+wiki"}},"published":"15 Feb 2006, 09:47","summary":"There are at least four artists called Havok: (1) an American thrash metal band ; (2) a German death metal band; (3) a Swedish extreme metal band; and (4) an underground rapper.\n\n1) Havok Formed in February of 2004: HAVOK is the thrash metal powerhouse reigning from Colorado that continues to win over thousands of fans from various parts of the world. Incorporating blisteringly fast guitar riffs, machine-like drumming, groovy bass lines, searing leads <a href=\"https://www.last.fm/music/Havok\">Read more on Last.fm</a>","content":"There are at least four artists called Havok: (1) an American thrash metal band ; (2) a German death metal band; (3) a Swedish extreme metal band; and (4) an underground rapper.\n\n1) Havok Formed in February of 2004: HAVOK is the thrash metal powerhouse reigning from Colorado that continues to win over thousands of fans from various parts of the world. Incorporating blisteringly fast guitar riffs, machine-like drumming, groovy bass lines, searing leads, and hard-hitting vocals, HAVOK is able to maintain that *punch-you-in-the-throat* style of music. Although there are many other thrash bands out there, there is one thing that sets HAVOK apart from the others. This band puts their own stamp on the genre by employing a more technical side of music, while maintaining the feel. HAVOK's live show is where the band really catches peoples' attention, with their non-stop energy level and their ability to get the audience involved. They are a must-see for any fan of live music! This Denver outfit has had their name compared to the likes of Metallica, Megadeth, Slayer, Anthrax, Pantera, Testament, Overkill, Exodus, Suicidal Tendencies, Motorhead, etc… And for good reason! They possess a distinct approach to thrash: one that emulates the abrasive styles of classic 80s thrash metal, but with a much-needed fresh edge. HAVOK has received tons of positive feedback for their efforts to make thrash a mainstay in modern music: and they will continue to spread the intensity until they decide the job is done! Given their talent, determination, and constantly growing fan base, HAVOK is destined to become a mainstay in this scene!\n\nHavok's current lineup includes: David Sanchez(guitars/vocal), Jessie De Los Santos (bass), Reece Scruggs(Lead Guitars), and Pete Webber (Drums), go to www.myspace.com/havok and read the blog. \n\nTo date havok has released the demo Thrash Can, the demo Murder By Metal, and the ep Pwn 'Em All. Their first full length album 'Burn' was released in 2009 and their sophomore effort, Time is Up, was released in February of 2011.\nPlease visit http://www.myspace.com/havok for more details.\nAlso visit their ReverbNation site at http://www.reverbnation.com/havok and the Candlelight website at candlelightrecordsusa.com\nOr watch live videos at http://youtube.com/user/havokcoloradothrash\n\n2) Havok is a German death metal band from Blaubeuren (20km west of Ulm).\nThey released one EP called \"Havok\" and also have a demo called \"Unleashed Demo\". They were influenced by bands like Six Feet Under, Fleshcrawl, In Flames, Slayer and As I Lay Dying and already supported bands like Final Breath or Disbelief. You can listen to samples at either their homepage or their Myspace site.\nStarting March 2010, Amazon.de will offer their 11-track album Rebuilding Sodom as mp3-download, naming the band as \"Havok (GER)\" to avoid confusion. \n\nhttp://www.havok-music.de\nhttp://www.myspace.com/havokmusic\n\n3) HAVOK is a Swedish extreme metal act from Lund signed to ViciSolum Productions. They released their first demo \"Realms of Reverie\" in 2006, the single \"World Shroud\" in 2007 and \"Apathy Esplanade\" in 2008. (\"World Shroud\" was among other things featured as \"best demo release in Scandinavia 2007\" by Close-Up Magazine.) In the beginning of 2009 they released their debut album \"Being And Nothingness\". In 2013 their sophomore album \"Statues of Sisyphus\" was released, to great acclaim. HAVOK began in the year of 2003, when guitarists Mahan Ahmadi and Miguel Cabrera founded the technical thrash/death metal outfit Ecliptica, in the southern Swedish city of Lund. During the winter of 2004, they conveniently found drummer Johan Cronqvist. With him came the change of band-name, turning the music towards a more brutal, chaotic death metal sound, yet still with remnants from the thrash days. Trying out various musicians to fill the void behind microphone and bass, the summer of 2005 brought the vocalist Johan Bergström. Some months later, Andreas Johansson joined the band, filling the last gap in the line-up.\n\nAs time progressed, the song-writing kept evolving, leaving older songs behind, sharpening their composing skills. A few live performances in Lund took place. In July 2006, Havok entered Flatpig Studios in Malmö, recording their four track début demo, Realms of Reverie. Despite a generally positive response, Havok were not overly satisfied with how the sound turned out, quickly moving on composing the follow-up single, entitled World Shroud. It was recorded at the end of 2006 at the Blacklodge Studio in Örkelljunga, and was released in early February 2007. The new recording received great acclaim, for example the title \"Best of Sweden\" in Close-Up Magazine in April -07, sending the band to perform at the Peace&Love Festival in Borlänge (the fastest growing music festival in Sweden). Several other gigs took place in Lund and Malmö throughout the year.\n\nIn August, Miguel Cabrera announced he was about to leave the band, for personal reasons, and in mid-September he did. Havok went on without him to record the promotional EP Apathy Esplanade in the autumn, again at the Blacklodge. Featuring guest musicians from various local acts, it was released in February 2008, also receiving quite overwhelming exultations. Actually, it wasn't really printed and released - only some hand-made copies were circulated and traded, as it was still just a promo.\n\nTime passed, finding a new guitarist in Simon Dahlberg during the summer of 2008, while simultaneously negotiating a contract with aspiring Stockholm-based label Vici Solum Productions. In September, we returned to Flatpig, recording our début album Being & Nothingness, which is to be released world wide in the early months of 2009. \n\nMeanwhile in 2009, the production started on what would be Havok's second album, Statues of Sisyphus. Guitarist Miguel Cabrera was once again back writing and performing with Havok. The recording of the second album continued from early 2009 all throughout 2010 in several different studios, among them Sireköpinge (with Christian from Malum) and Flatpig. The album would, however, not be released until the spring of 2013 when Havok already announced their departure from the scene. The following lines are an excerpt from Havok last announcement:\"Upon going into the studio, to record what was to become known as Statues of Sisyphus, we inarguably reached the conclusion that this was to be the last thing we were going to produce as Havok. This has been an important part of our lives for many years and we have had the pleasure to share stages with great bands and had an unceasing support from fans and magazines. But as all things, good or bad, Havok has now reached the inevitable end.\"\n\nThe Swedish Havok's is also the one to release nearly all of their recorded material to the public on Last.fm.\n\nhttp://www.havok.se\n\n4) Havok is an underground rapper, and member of BDG.\n <a href=\"https://www.last.fm/music/Havok\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
