{"artist":{"name":"Andrew W.K.","mbid":"ef2d4a1c-195e-41f4-839e-bdfd3f85adc3","url":"https://www.last.fm/music/Andrew+W.K.","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b5924b34809546228b52faf0fb705eae.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b5924b34809546228b52faf0fb705eae.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b5924b34809546228b52faf0fb705eae.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b5924b34809546228b52faf0fb705eae.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b5924b34809546228b52faf0fb705eae.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b5924b34809546228b52faf0fb705eae.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"351229","playcount":"7405114"},"similar":{"artist":[{"name":"CKY","url":"https://www.last.fm/music/CKY","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2dca0ad0dfd8a0844ae6e98f8b16ca4f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2dca0ad0dfd8a0844ae6e98f8b16ca4f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2dca0ad0dfd8a0844ae6e98f8b16ca4f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2dca0ad0dfd8a0844ae6e98f8b16ca4f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2dca0ad0dfd8a0844ae6e98f8b16ca4f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2dca0ad0dfd8a0844ae6e98f8b16ca4f.png","size":""}]},{"name":"The Darkness","url":"https://www.last.fm/music/The+Darkness","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0357a625be1346fc9cbc2ae68ef70198.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0357a625be1346fc9cbc2ae68ef70198.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0357a625be1346fc9cbc2ae68ef70198.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0357a625be1346fc9cbc2ae68ef70198.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0357a625be1346fc9cbc2ae68ef70198.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0357a625be1346fc9cbc2ae68ef70198.png","size":""}]},{"name":"The Wildhearts","url":"https://www.last.fm/music/The+Wildhearts","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b08dfe42bdda41fd8852c72492253c10.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b08dfe42bdda41fd8852c72492253c10.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b08dfe42bdda41fd8852c72492253c10.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b08dfe42bdda41fd8852c72492253c10.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b08dfe42bdda41fd8852c72492253c10.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b08dfe42bdda41fd8852c72492253c10.png","size":""}]},{"name":"Buckcherry","url":"https://www.last.fm/music/Buckcherry","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0c75cf39e4b94580bc38d2e2cb6c06e0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0c75cf39e4b94580bc38d2e2cb6c06e0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0c75cf39e4b94580bc38d2e2cb6c06e0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0c75cf39e4b94580bc38d2e2cb6c06e0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0c75cf39e4b94580bc38d2e2cb6c06e0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0c75cf39e4b94580bc38d2e2cb6c06e0.png","size":""}]},{"name":"Sammy Hagar","url":"https://www.last.fm/music/Sammy+Hagar","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9e44f5dbbc674603bb0adc0702f2fa57.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9e44f5dbbc674603bb0adc0702f2fa57.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9e44f5dbbc674603bb0adc0702f2fa57.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9e44f5dbbc674603bb0adc0702f2fa57.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9e44f5dbbc674603bb0adc0702f2fa57.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9e44f5dbbc674603bb0adc0702f2fa57.png","size":""}]}]},"tags":{"tag":[{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"hard rock","url":"https://www.last.fm/tag/hard+rock"},{"name":"party","url":"https://www.last.fm/tag/party"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"metal","url":"https://www.last.fm/tag/metal"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Andrew+W.K./+wiki"}},"published":"13 Feb 2006, 23:14","summary":"Andrew W.K. was born Andrew Wilkes-Krier in Stanford, California in 1979, before moving to Michigan at age 4. He began piano lessons promptly at age 5, studying at The University Of Michigan School Of Music Pedagogy program. By his early teens Andrew had already exhibited great enthusiasm and talent for both music and the visual arts. He spent his high school years playing drums and keyboard in an almost endless variety of short-lived, but passionate groups, all centered in southeast Michigan's explosive cultural scene. <a href=\"https://www.last.fm/music/Andrew+W.K.\">Read more on Last.fm</a>","content":"Andrew W.K. was born Andrew Wilkes-Krier in Stanford, California in 1979, before moving to Michigan at age 4. He began piano lessons promptly at age 5, studying at The University Of Michigan School Of Music Pedagogy program. By his early teens Andrew had already exhibited great enthusiasm and talent for both music and the visual arts. He spent his high school years playing drums and keyboard in an almost endless variety of short-lived, but passionate groups, all centered in southeast Michigan's explosive cultural scene. By the age of 17, Andrew had graduated from high school - one year early - in an effort to dedicate all his time to his creative endeavors. He was accepted to The School Of The Art Institute Of Chicago, but instead chose to move to New York City in 1997, at age 18, to pursue his vision alone.\n\nUpon arriving in New York, Andrew found odd jobs in art galleries, department stores, avant-garde fashion boutiques, selling opera tickets, and as a gumball machine salesman; anything to support his real interest: making the most exciting music he could. He pursued this goal day and night, putting all of his abilities and resources into the writing and recording of his own material. Shortening his name from Andrew Wilkes-Krier to Andrew W.K., he set out on a mission to get his music heard not only in New York, but also around the world. Without a band or even a partner, Andrew began performing solo concerts anywhere he could get them. Using only a keyboard, drum machine, and his voice, Andrew played shows up and down the east coast. He vowed to play any show, any place, any time, and wound up performing everywhere from coffee houses to basements. Quickly the word spread of the energy and raw excitement of Andrew and the music, and soon he found himself performing for larger crowds. After performing several shows with friends and fellow New York performers, Fishcerspooner, Andrew was invited to play 2 engagements at a popular Belgian Arts Festival called Over The Edges. This was only the very beginning of a fast and wild ride.\n\nAndrew signed a recording contract with Island Def Jam Records/Universal Music, and began the recording of his debut full-length CD. Titled I GET WET, the album's release in 2001 caused a widespread and diverse wave of reaction, landing Andrew on the covers of international music magazines, like the UK's NME, which featured him not once, but twice on the cover of the same issue (adding an additional page to accommodate the double image). More press followed, catapulting Andrew to overnight exposure in the international music world. Magazines worldwide praised the originality and undeniable intensity of his music, and articles in GQ, Rolling Stone, Spin, Q, Mojo, New York Magazine, Vanity Fair, Jane, The New Yorker, FHM, Playboy, Oui, The New York Times, Los Angeles Times, Alternative Press, i-D, The Face, Dazed & Confused, Bizzare, Newsweek, The New York Post, Stuff, The Washington Post, The Village Voice, and dozens and dozens and dozens of others, the world over, all agreed that the A.W.K. style had made a mark in the wide world of music.\n\nNow that Andrew W.K. had arrived, it was time to take the music to the stage, and Andrew had to form a band. Instead of auditioning random applicants, Andrew decided to write a letter to his favorite drummer, a man named Donald Tardy, who plays in the band Obituary. Andrew sent Donald the music and asked if he would join his band. Having no expectations, Andrew was shocked when Tardy wrote back and agreed to play the music. After Donald came an additional 7 musicians, including Gregg Roberts (bass guitar, vocals), Sgt. Frank (guitar), Jimmy Coup (guitar, vocals), Kendall A. (guitar, vocals), E. Payne (guitar, vocals), John Sutton (guitar), and even a second drummer, Richie Russo, who played on stage next to Donald, in perfect synchronicity. Andrew relocated to Brandon, Florida, in order to rehearse with the band and prepare the music for live performances. Immediately following the release of I GET WET, Andrew W.K. and his newly formed band began a world tour, which would continue for 3 years and over 500 concerts. Major U.S. tours, including highly coveted Ozzfest and Warped Tour dates, as well as countless hall and arena shows with everyone from Aerosmith, to The Locust, gave the music even further exposure and proved that A.W.K. music goes beyond genre and classifaction - it seemed purely \"a man and music\". Major network television appearances on Saturday Night Live, Late Night With Conan O'Brien, Last Call With Carson Daly, The Daily Show With Jon Stewart, CNN, Fox Sports, Access Hollywood, Top Of The Pops, VH1, and MTV led to an eventual T.V. series of his own, entitled Your Friend, Andrew W.K. The show featured Andrew giving personal advice to fans who wrote in asking for help. MTV2 presented the series, along with countless other Andrew W.K. appearances on MTV, VH1, Much Music, and FUSE.\n\nIn the midst of his non-stop schedule, Andrew recorded and released his second album, THE WOLF, which was received with enthusiasm by both fans and the media alike. The album was recorded much in the same tradition Andrew established with his earliest songs: Andrew himself playing every instrument, and recording track after track of music, with each song tracking at least 90 individual parts, if not 200 or more individual tracks. Andrew and his band took the new album to the stage and performed tours across the globe, including festivals in Reading, Leeds, Tokyo, Osaka, and Taiwan. During this wave of shows, Andrew broke his foot on stage while getting tangled in his own microphone cable. Rather than sit it out and heal at home, W.K. decided to continue the tour, and played the remaining 60 shows in a wheelchair. One of these performances was filmed at the Spike T.V. Video Game Awards. Earlier in the year, W.K. had sustained a head injury during the filming of his music video, We Want Fun, with director Spike Jonze, for the Jackass Movie soundtrack. Despite these physical setbacks, the music continued and the party continues to spread, one person at a time.\n\nAt the close of 2004, Andrew began work on the massive WHO KNOWS? live-concert movie. In it, more than 300 hours of live concert footage, spanning 1992-2004, was condensed into a rapid-fire viewing experience. The film was edited using a special multi-track video process, in which multiple performances can be synchronized and layered together, with the audio and video overlapping to create a seamless sequence of shots from different concerts. The layering process of the video is similar to the layering process Andrew uses to record his music, and when performing. The movie was screened at sell-out shows in New York City and Hollywood, where Andrew performed in-person piano solos. WHO KNOWS? was released on DVD by Music Video Distributors / R. Jayne / R.C.U. Video.\n\nAndrew W.K. released his third album, entitled \"Close Calls With Brick Walls\" in Spring 2006. The album was released exclusively in Asia due to legal issues surrounding usage of the name \"Andrew W.K.\"  Andrew toured both South Korea and Japan extensively in 2006. .\n\nIn December 2009, a lecture recorded at Madame Jojo's in London in September 2008 was published online. In it Andrew W.K. claimed that the Andrew W.K. persona was created by a committee including himself, his father, and other individuals, and that he was the \"next person playing Andrew W.K.\" Claiming, \"I'm not the guy you've seen from the I Get Wet album... I'm not that same person. I don't just mean that in a philosophical or conceptual way. It's not the same person at all.\" Andrew W.K. later went on to clarify that he believed that he, as well as his fans that have followed him since the original album, have become \"different people.\"\n\nHe went further on to say: \"Andrew W.K. was created by a large group of people. They met, and I was there, and we talked about how we could come up with something that would move people. It was done in the spirit of commerce. It was done in the spirit of entertainment, which usually goes hand in hand with commerce. I was auditioned, along side many other people, to fill this role of a 'great frontman', 'a great performer'. On the one hand it may be a little scary to admit this to you all, that I may not be exactly who you thought I was, and that the guy who was, in fact, first hired as Andrew W.K. is a different person than the guy sitting here on the stage tonight. I'm the next person who is playing Andrew W.K.\"\n\nHowever On Tuesday 24 February, 2010, Andrew WK hosted an event Santos Party House in New York, where members of the public could ask him anything they liked.  He stated that \"I am Andrew W.K., the same that has been here from the beginning... I am... I am, I am the same Andrew W.K. at this appearance as at all Andrew W.K.-related appearances.\"\n\nLater in 2010 due to finding a loophole in his contractual agreements he was able to release his 2006 album \"Close Calls With Brick Walls\" world wide. He released this along with another album  called \"Mother Of Mankind\" which contained rare and unreleased tracks from 1999 right through to 2010. \nHe still lives in New York City.\n\nIn 2011, he released an EP called the \"Party all Goddamn night\" EP. This was released exclusively in Japan. Andrew W.K. is currently working on a new as yet unnamed album which is due for release some time in 2012.\n\n\n <a href=\"https://www.last.fm/music/Andrew+W.K.\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
