{"artist":{"name":"Ian Moore","mbid":"9bc79fce-21c3-43d0-a1ca-e0405efde098","url":"https://www.last.fm/music/Ian+Moore","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e8d569386d0c422fb5639bfb87a68c1a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e8d569386d0c422fb5639bfb87a68c1a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e8d569386d0c422fb5639bfb87a68c1a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e8d569386d0c422fb5639bfb87a68c1a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e8d569386d0c422fb5639bfb87a68c1a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e8d569386d0c422fb5639bfb87a68c1a.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"10264","playcount":"85304"},"similar":{"artist":[{"name":"Storyville","url":"https://www.last.fm/music/Storyville","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/78d1bf07e4563b4169407d3a018966b9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/78d1bf07e4563b4169407d3a018966b9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/78d1bf07e4563b4169407d3a018966b9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/78d1bf07e4563b4169407d3a018966b9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/78d1bf07e4563b4169407d3a018966b9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/78d1bf07e4563b4169407d3a018966b9.png","size":""}]},{"name":"Vallejo","url":"https://www.last.fm/music/Vallejo","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/43db428d4bf644f0be3e26920fc013d2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/43db428d4bf644f0be3e26920fc013d2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/43db428d4bf644f0be3e26920fc013d2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43db428d4bf644f0be3e26920fc013d2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43db428d4bf644f0be3e26920fc013d2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43db428d4bf644f0be3e26920fc013d2.png","size":""}]},{"name":"Chris Duarte Group","url":"https://www.last.fm/music/Chris+Duarte+Group","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7cc0fb3882af4ffa89331561130a62bd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7cc0fb3882af4ffa89331561130a62bd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7cc0fb3882af4ffa89331561130a62bd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7cc0fb3882af4ffa89331561130a62bd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7cc0fb3882af4ffa89331561130a62bd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7cc0fb3882af4ffa89331561130a62bd.png","size":""}]},{"name":"Guy Forsyth","url":"https://www.last.fm/music/Guy+Forsyth","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/39e608de484f4f0ea5f313fb00d77789.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/39e608de484f4f0ea5f313fb00d77789.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/39e608de484f4f0ea5f313fb00d77789.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/39e608de484f4f0ea5f313fb00d77789.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/39e608de484f4f0ea5f313fb00d77789.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/39e608de484f4f0ea5f313fb00d77789.png","size":""}]},{"name":"Chris Duarte","url":"https://www.last.fm/music/Chris+Duarte","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/eb5d5657d27d4ec7b19073ab255b810c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/eb5d5657d27d4ec7b19073ab255b810c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/eb5d5657d27d4ec7b19073ab255b810c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eb5d5657d27d4ec7b19073ab255b810c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eb5d5657d27d4ec7b19073ab255b810c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eb5d5657d27d4ec7b19073ab255b810c.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"austin","url":"https://www.last.fm/tag/austin"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"texas","url":"https://www.last.fm/tag/texas"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Ian+Moore/+wiki"}},"published":"21 Dec 2006, 23:50","summary":"Ian Moore (born August 8, 1968) is a guitarist and singer-songwriter from Austin, Texas. He studied fiddle as a child, but switched to guitar when wrist problems interfered. His music contains elements of folk, rock and roll, world music, and blues. Covers include Jimmy Cliff's \"Many Rivers to Cross\", the Beatles' \"Hey Bulldog,\" and Bob Dylan's \"You're a Big Girl Now.\" He has played with such musicians as the Rolling Stones, Bob Dylan, and ZZ Top, and appeared in Billy Bob Thornton's movie Sling Blade. <a href=\"https://www.last.fm/music/Ian+Moore\">Read more on Last.fm</a>","content":"Ian Moore (born August 8, 1968) is a guitarist and singer-songwriter from Austin, Texas. He studied fiddle as a child, but switched to guitar when wrist problems interfered. His music contains elements of folk, rock and roll, world music, and blues. Covers include Jimmy Cliff's \"Many Rivers to Cross\", the Beatles' \"Hey Bulldog,\" and Bob Dylan's \"You're a Big Girl Now.\" He has played with such musicians as the Rolling Stones, Bob Dylan, and ZZ Top, and appeared in Billy Bob Thornton's movie Sling Blade.\n\n###\n\nBob Dylan said it best: He who is not busy being born is busy dying. Singer, songwriter and guitarist Ian Moore lives and creates by that precept. And his new album on Justice Records, To Be Loved, vividly displays the artistic benefits of doing so.\n\nIt’s a way of living that has led Moore from emerging as, at first glance, a teenage guitar prodigy in the early 1990s in his hometown of Austin, Texas to fruition as a full-blooded musical artist, now based in Seattle. His rich and keenly intelligent compositions invoke critics’ comparisons to some of the most respected names in both classic and contemporary rock’n’roll music. Such musical auteurs as The Beatles, Brian Wilson and Big Star on the one hand, and master singer-songwriters such as Richard Thompson, Nick Drake, Leonard Cohen and both Tim and Jeff Buckley on the other hand. Not to mention such diverse creative talents as Wilco, The Flaming Lips, Neutral Milk Hotel and even being hailed as a “Roy Orbison for the 21st Century.”\n\nCalculate a central point among all of the above --  but first also throw in early Moore favorites like Stevie Wonder, Curtis Mayfield and Sly & The Family Stone as well as The Rolling Stones — and you find an artist who may be hard to pin down to a certain genre or style. But who cares? There’s a satisfaction in listening to how Moore absorbs the spectrum of music that he loves and finds inspiring and then follows his muse to places that awe, delight and touch those key, deep places within the human soul. As Harp magazine observes of Moore, “Since the early ‘90s the native Texan has refused corporate molding in favor of freedom and the artistic rewards are staggering.”\n\nIt may have been Moore’s guitar talents that first won him attention. But as Tucson Weekly recently noted, “His recent albums have positioned him as one of the most soulful singer-songwriters around, and one of the most diverse.” Or as Seattle’s influential weekly The Stranger said not long ago, “Your new favorite artist has arrived.” Similar praise greeted Moore on his national debut nearly 15 years ago  because, for Moore, the path and process to where he is going has always been his focus, and it has consistently made arriving at each destination that much sweeter.\n\nTo Be Loved, Moore’s new release on the Justice Records label, follows on the heels of 2004’s Luminaria, hailed by All Music Guide as his “best album by some distance.” To Be Loved travels even further along Moore’s musical journey into the mystical realm of what No Depression describes as his “lush pop and soul tapestries.”\n\nIt’s an album that can truly be described as timeless, mixing in an almost yin/yang fashion both contemporary and classic sonic experimentalism and musical eclecticism alongside the finest flavors from the rock and pop lexicon. Something of a song cycle, it lyrically visits those places where love finds us and takes us, as well as where it is lost and found. Atop a rock solid foundation of gifted song craftsmanship and eloquent, emotive lyricism, Moore fashions a panorama of musical moods and soundscapes ranging from spectral beauty to almost punk-ish rock energy, touching on and even mixing together many places in between.\n\nTo Be Loved both catches the ear at first listen — witness the infectious chorus of “30 Days,” the propulsive rocking on “Killing Joke,” and the mesmeric rock/soul groove at the heart of “Civil Light” — and then reveals more of its deep riches and delicious intricacies with each successive spin. \t\t\t\t\t\t\t\t\t\t\n\nThe traditional palette of rock instrumentation is used to maximum effect (and without even one extended solo, it is a tour de force guitar album in its spectrum of of six-string parts and sounds played by Moore and his Seattle friends Paul Hiraga and Johnny Sangster) while everything from the theremin to vibes to the human whistle as well as horns and strings are also part of piquantly blended musical mosaic. It proves Moore’s budding mastery as a producer and arranger while offering the best expression yet of his singing, songwriting and guitar playing gifts. At the same time as it transcends the strictures of genre and style, To Be Loved falls squarely along the line of brilliant progressive pop-rock albums that runs from Rubber Soul through Big Star’s Sister Lovers on to recent releases by latter-day icons Wilco.\n\nTo Be Loved is the second studio album (of six overall) that Moore has produced himself. To with, it’s an even fuller flourishing of the musical artistry that has earned him high praise from the very first, but never more so (yet) than it did on Luminaria. “The burden of the contemporary singer/ songwriter is in formulating a sound that is completely unique. With Luminaria, Ian Moore accomplishes just that,” noted Billboard. The Portland Mercury heralded it as “a majestic record, as heartfelt and poignant as it is well executed,” while The Stranger hailed the disc as a “highly successful… intricately layered, soulful pop record.”\n\nNo Depression credits Moore’s emergence as a “genre-spanning stylist” to “reinventing himself — organically, with no hint of cynical calculation.” To get the full picture of Moore’s story and identity, put the accent firmly on the notion of organic growth. Even though his first work may seem to differ from what he creates today, a closer examination reveals that the artist that he is now has been at work all along.\n\nAs can be said of many talents, Ian Moore grew up immersed in music, and even more so than most. But the more salient point is that a continuing growth and immersion in music of all sorts and styles is his life story. Although it was his prodigious guitar skills that brought him initial national attention, Moore’s first instrument was the violin at the age of six. At the same time, he was not only surrounded by the best popular and roots music on record at home but also accompanied his music loving parents out to shows as the fertile Austin music scene was blossoming. He can be spied as a youngster on the cover art of Jerry Jeff Walker’s pivotal live recording, ¡Viva Terlingua!, and grew up — or in his case maybe better, began musically growing — in such legendary music clubs as the Armadillo World Headquarters, Soap Creek Saloon and Antone’s Nightclub, where all the colors (pardon the pun) of his genre-defying\nstyle were to be heard, often by artists whose own sound and approach transcended musical categorization.\n\n“I was a record collector when I was a kid and had tons and tons of 45s and lots of early soul and rock’n’roll records,” Moore explains. His hometown steeped Moore in such diverse local favorites as Doug Sahm, Roky Erickson & The 13th Floor Elevators, the frequently visiting Meters and Neville Brothers as well as Austin’s rocking The LeRoi Brothers and Tailgators and even The Butthole Surfers among countless others across the spectrum of popular music. So when Moore emerged at age 16 into Austin’s clubs as a performer and bandleader himself just a few years after taking up the guitar, it was only natural — and yes, fitting — that he was seen as something of a prodigy.\n\nPreternaturally mature might be a better way to put it, as revealed by what followed as well as a retrospective look and listen. The “hotshot six-stringer from Austin” tag that first identified him was all but inescapable. Guitar icons Stevie Ray and Jimmie Vaughan were not just artists he had heard many times — along with a host of other players both locally as well as on record and touring through town — but Moore also watched them develop as they informed his musical development at the same time.  \n\t                      \t\t   \t\t\t\t\t            \t\nHe rubbed shoulders in the clubs from a young age and later on stage with such other emergent Austin guitar-playing talents as Will and Charlie Sexton and Doyle Bramhall II, all of whom were also first heralded as Austin guitar slingers but later came to be known as gifted singers, writers and more, just like Moore.\n\n“When I first went on the road, the only touchstone anyone outside of Austin had for what I was into was Stevie Ray Vaughan,” Moore recalls. “And I love Stevie — that guy was amazing and couldn’t be anything other than a major influence given how much I’d seen him even before the rest of the world learned about him. Charlie and Doyle and I have all since talked about the comparison and how we all got really annoyed at the time, even though we all knew better than anyone what an honor it was. But we were all about more than just Stevie and the guitar, and he was also about more than just the guitar too.\n\n“I was always more about the singers and songwriters,” Moore explains. “Even as a huge Hendrix fan when I was young, what impressed me on hearing his albums was that he was a great songwriter, stylist and arranger.”\n\nFrom Moore’s earliest shows in Austin, what also won him attention — in a city where mere guitar wizards are a dime a dozen — was an intriguingly firm and well-formed craftsmanship as a writer and his strong and fluent voice that also rang with a broad musical grounding. Or what The Washington Post more recently identified as “his sophisticated songcraft and soulful, sometimes soaring tenor.” \n\nA stint playing lead guitar on tour with Joe Ely chummed up even more media and record label interest in Moore outside of the buzz he had stoked in Austin. On his self-titled 1993 debut album, Moore’s guitar gifts were integrated into songs that drew their lexicon and grooves from the soul and R&B music that he was weaned on. His determination to not be boxed into the dictates of the music industry or short and limiting marketing tags rather than where his muse led him, resulted in Moore signing a deal and then parting ways with EMI Records before he released his first record under the influential and recently revived Capricorn Records independent label imprint. He also began flexing his broad-based musical and cultural interests in a video clip for the song “Harlem” directed by Ice Cube and filmed in the South Central ghetto of Los Angeles.\n\nThose early career days were heady times for Moore — reams of media notice and arena gigs opening for The Rolling Stones and ZZ Top — and after a Live From Austin EP, he clearly signaled that genuine musical artistry was his mission with 1995’s Modernday Folklore. To wit, esteemed critic, curator and art historian Dave Hickey (who it should be noted was an Austin music scene denizen in his college years) anointed the album as one of the best moments of 1996 in contemporary art in the respected journal Art America.\n\nMoore also spent part of that same year on tour (and sitting in) with Bob Dylan as well as appearing as an actor in Billy Bob Thornton’s acclaimed film Sling Blade. “It was a really cool time and I started thinking outside the bounds of what Austin was, which at that point had largely defined my music,” Moore recalls.\n\nHe also broke free from any perceived notions and boundaries by moving from Austin to Vashon Island, Washington, near Seattle, where he lives with his wife and children. “Moving up to Seattle was really interesting and cool as well as scary. I was like, okay, I’m going to take the biggest crutch that I have — I was an Austin celebrity; every piece of press that people wrote about me said ‘Austin, Texas guitar player’ — and toss it aside.”\n\nThe release of Ian Moore’s Got The Green Grass in 1999 on his own Hablador Records underscored his musical independence in both his creativity and career. With each successive release — 2000’s And All  The Colors… (Koch International), the live Via Satellite on Hablador the following year and Luminaria (Yep Roc Records) — Moore’s devotion to genuine musical artistry flourished into highly satisfying and often stunning results.\n\nIt’s not just following his muse and aspiring to the highest creative standards set by others that was instilled in Moore all but from birth, but also a sense of artistic fluidity. “One of the things I always loved about the Beatles is that they were incredibly varied and their albums were all over the place. That to me is what great pop music is about,” Moore explains. “I want my records to be all over the place. I think that is far more interesting and honest and more in line with being a human being.\n\n“I always like that in other artists: When you take something for granted about someone and they destroy the very core of what you thought they were about with something equally fascinating and appealing,” Moore observes. “You’ve got to try it from a different angle. You’ve got to see where you can go and switch stuff up. For me that’s really the joy of it all.”\n\nOn To Be Loved, Moore doesn’t just continue to create outside the box — or any boxes, really — but also delved inside the boxes of musical recording to better understand and achieve his artistic goals and spark further creative and intellectual growth. Much of the album was recorded at his home studio, equipped with outboard gear like microphones, preamps and compressors that he built himself. “It’s been really inspiring to me because it’s like getting behind the Wizard of Oz’s curtain and understanding the process better and the physics of sound. I really got into it on this record. A lot of this record to me is exploring the sonic aspects of recording and how to make these different sounds that I have always loved.”\n\nAt the same time, there’s an additional payback to learning electronics and engineering by doing it. “The nature of something like electronics or anything else that challenges your mind is that it develops your brain in a way that stimulates different neural pathways. It basically reroutes your brain. It’s harder when you get older, but you can do it. That’s basically what my plan was and I feel like it’s happening.”\n\nThen again, it’s been happening for Moore all along. He enjoys a strong following as a live performer, touring both with his band Action Company and smaller configurations thereof. He continues to find sustenance in the music that he knows, discovers and also is around him: for instance, touring with another once young soul rebel Paul Weller and keeping his six-string gun for hire with punk turned roots music insurgent Jon Langford — both, like Moore, are artists marked by wide-ranging and fluid creativity.\n\n“To me, it’s all about the journey,” Moore concludes. “Yeah, I go through a lot of changes. But I think that if I keep doing this and keep changing all the time, hopefully I will enjoy a fan base that will be upset if I don’t change.” Because he who is not busy… you get the point, right?\n\n-Rob Patterson\n <a href=\"https://www.last.fm/music/Ian+Moore\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
