{"artist":{"name":"Jah Cure","mbid":"07b5e94b-95ac-467d-80e0-a691c709dd11","url":"https://www.last.fm/music/Jah+Cure","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0ae17b9cf4de405ebf2896cdd86eecb1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0ae17b9cf4de405ebf2896cdd86eecb1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0ae17b9cf4de405ebf2896cdd86eecb1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0ae17b9cf4de405ebf2896cdd86eecb1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0ae17b9cf4de405ebf2896cdd86eecb1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0ae17b9cf4de405ebf2896cdd86eecb1.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"191591","playcount":"1496071"},"similar":{"artist":[{"name":"Morgan Heritage","url":"https://www.last.fm/music/Morgan+Heritage","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ddd1fd19c5e84ad098d2481a9c1b7be7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ddd1fd19c5e84ad098d2481a9c1b7be7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ddd1fd19c5e84ad098d2481a9c1b7be7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ddd1fd19c5e84ad098d2481a9c1b7be7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ddd1fd19c5e84ad098d2481a9c1b7be7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ddd1fd19c5e84ad098d2481a9c1b7be7.png","size":""}]},{"name":"Cocoa Tea","url":"https://www.last.fm/music/Cocoa+Tea","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cec83f04af5c44f9b1e87d3388f2d69d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cec83f04af5c44f9b1e87d3388f2d69d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cec83f04af5c44f9b1e87d3388f2d69d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cec83f04af5c44f9b1e87d3388f2d69d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cec83f04af5c44f9b1e87d3388f2d69d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cec83f04af5c44f9b1e87d3388f2d69d.png","size":""}]},{"name":"Richie Spice","url":"https://www.last.fm/music/Richie+Spice","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c9916daace394ff0b6796421a562519e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c9916daace394ff0b6796421a562519e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c9916daace394ff0b6796421a562519e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9916daace394ff0b6796421a562519e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9916daace394ff0b6796421a562519e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9916daace394ff0b6796421a562519e.png","size":""}]},{"name":"Alaine","url":"https://www.last.fm/music/Alaine","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f64d3f70cfc948afad07b0786f3d2bb1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f64d3f70cfc948afad07b0786f3d2bb1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f64d3f70cfc948afad07b0786f3d2bb1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f64d3f70cfc948afad07b0786f3d2bb1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f64d3f70cfc948afad07b0786f3d2bb1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f64d3f70cfc948afad07b0786f3d2bb1.png","size":""}]},{"name":"Romain Virgo","url":"https://www.last.fm/music/Romain+Virgo","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/50baaf739de24bd1b8b1fbb3923694ea.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/50baaf739de24bd1b8b1fbb3923694ea.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/50baaf739de24bd1b8b1fbb3923694ea.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50baaf739de24bd1b8b1fbb3923694ea.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50baaf739de24bd1b8b1fbb3923694ea.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50baaf739de24bd1b8b1fbb3923694ea.png","size":""}]}]},"tags":{"tag":[{"name":"reggae","url":"https://www.last.fm/tag/reggae"},{"name":"dancehall","url":"https://www.last.fm/tag/dancehall"},{"name":"roots reggae","url":"https://www.last.fm/tag/roots+reggae"},{"name":"Rasta","url":"https://www.last.fm/tag/Rasta"},{"name":"roots","url":"https://www.last.fm/tag/roots"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Jah+Cure/+wiki"}},"published":"12 May 2006, 11:29","summary":"Jah Cure (real name Siccature Alcock) is a Jamaican reggae musician. He was born on October 11th, 1978 in Hanover, Jamaica and raised in Kingston. He was given the name Jah Cure by Capleton whom he met while growing up in Kingston. His first big break came in 1997 when he released the single \"King of the Jungle\" which was a duet with Sizzla. The single was produced by Beres Hammond who went on to become his mentor. He then released a steady stream of singles that won him critical and popular acclaim. <a href=\"https://www.last.fm/music/Jah+Cure\">Read more on Last.fm</a>","content":"Jah Cure (real name Siccature Alcock) is a Jamaican reggae musician. He was born on October 11th, 1978 in Hanover, Jamaica and raised in Kingston. He was given the name Jah Cure by Capleton whom he met while growing up in Kingston. His first big break came in 1997 when he released the single \"King of the Jungle\" which was a duet with Sizzla. The single was produced by Beres Hammond who went on to become his mentor. He then released a steady stream of singles that won him critical and popular acclaim.\n\nIn November 1998, while driving around Montego Bay, Jah Cure was pulled over by the police and arrested on charges of gun possession, rape and robbery. He was prosecuted in April 1999, found guilty and sentenced to 15 years in prison. Since the arrest, Jah Cure has firmly maintained his innocence. Jah Cure is not scheduled to be released from jail until 2007 at the earliest.\n\nWhile in prison he has had access to recording equipment and has released three albums and a number of singles, some of which have topped the Jamaican charts. His first album Free Jah’s Cure was released in 2000, it was followed by Ghetto Life in 2003 and Freedom Blues in 2005. More recently Jah Cure has released the songs 'Love is', 'Longing For' and 'True Reflections', showing his unique voice and lyrical ability.\n\nBY TYRONE S REID Observer staff reporter reidt@jamaicaobserver.com\nSunday, July 29, 2007\n\nFrom Jamaica Observer -- BY TYRONE S REID Observer staff reporter reidt@jamaicaobserver.com\nSunday, July 29, 2007:\n\nAfter eight years \"behind the prison walls\" of the Tower Street Adult Correctional facility in Kingston, the day that he was \"longing for\" - his release - came yesterday, but not with the fanfare and flourish that many Jamaicans had highly anticipated.\n\nDuring his time behind bars, reggae singer Jah Cure created headlines that won him legions of fans, many who started petitions advocating his release. But yesterday, the reggae artiste, born Siccature Alcock, who was scheduled to be released at 8:00 am, walked out of the maximum security prison minutes after 5:00 am, according to guards.\n\nBut even though Jah Cure's early morning release stumped his fans, as well as journalists, scores of chalice-carrying Rastafarians were at the prison gate to greet their 'brother', a senior warder told the Sunday Observer.\n\n\"Mi seh, some chalice bun out yah this morning. Ah nuff Rasta come out in di early morning. The one dem who hear bout the early release,\" the warder said. \"Him walk out like Nelson Mandela and him greet some of the man them before the warden escort him away.\"\nThe senior warder, who spoke to some of the people who had gathered for the 8:00 am release, said the decision was made to prevent any commotion outside the prison gates.\n\n\"I am sorry to know that people came to see him and didn't get the chance. We had to try and avoid the crowd,\" the warder, dressed in a bright blue uniform, told the crowd, after declining to give his name.\nYesterday, the Sunday Observer received positive comments about Alcock's character while he was an inmate on the A-North block.\n\"He was a well-behaved inmate. We never have no problem with him,\" one worker at the prison said.\n\nAnother said: \"Yes man, him just love him music. Him did alright.\"\nOne female warden agreed with her co-workers, before advising us to direct any further questions to \"the head office\".\nIn the meantime, several fans who refused to believe that their \"artiste\" had already left the compound set up camp outside and openly expressed their opinions about his imprisonment and subsequent release.\n\nOne female vendor outside the prison, who gave her name only as Miss Yvonne, told the Sunday Observer that Alcock received many visitors each month, the majority being females.\n\n\"Him get visitors from all over the world. The other day a white girl come here from France but him didn't take the visit,\" Miss Yvonne said. \"Him go to prison go make him name. I hope that him learn him lesson and move on with him life,\" she said, adding that she heard that Jah Cure made a stop at Rockfort to \"wash off\" after leaving the prison.\n\nHer other interesting comments, which had everyone cracking up, included: \"Mi hear seh Jah Cure pay all warden rent when him did ovah deh.\" \nOne man who said he drove from St Thomas to witness the singer's release said he was very disappointed but wished Jah Cure all the best.\n\"Even though him have the whole world claim that them love him, him have to be careful,\" he said.\n\nAnother man, a broom vendor from Clarendon, said he wanted to get a glimpse of the man whose songs he can't get enough of. \nTrisha, a female fan and a feelance photographer, said people should not judge Alcock as he was capable of making mistakes and changing like other humans.\n\"I believe that to each his own. If it wasn't time for him to be released, he wouldn't have been released. I just hope that he has learnt from the experience,\" she said.\n\nHer friend, Kelly, added: \"I think he deserved to be released. I just want to get to see him in person now. I hope he wil change too.\"\nAlcock, who was born in Hanover in 1978, was reportedly given the name Jah Cure by Capleton whom he met while growing up in Kingston.\n\nAccording to police reports, in November 1998, while driving around Montego Bay Alcock was pulled over by the police and arrested on charges of gun possession, rape and robbery. He was taken before the courts in April 1999, found guilty and sentenced to 15 years in prison. \nSince the arrest, Jah Cure has firmly maintained his innocence. The story surrounding his case dominated media headlines and barber shop conversations for months, leading to several \"Free Jah Cure\" campaigns.\n\nWhile in prison, the singer had access to recording equipment and has released three albums and a number of singles, some of which have done well on local reggae charts. His debut album, Free Jah's Cure was released in 2000, and was followed by Ghetto Life (2003) and Freedom Blues (2005). His popular singles include True Reflections, Love is and Longing For. -- Jamaica Observer\n\nJah Cure performed for the first time in Holland from http://www.radioreggaetrade.com:\n\nJah Cure's first performance since his release from prison on July 28 has left a lasting impression on his European fans. On Sunday August 12 at the Reggae Sundance Festival in Eindhoven, Holland, Jah Cure performed in front of 20,000 persons who were longing for this day. Below are reports from journalists who were able to capture this historic moment. \n\n\"The field felt it. Jah Cure's performance at Reggae Sundance in Holland would become a historical moment. While the world was waiting for his release, Jah Cure has given hope to many with his music. With this in mind all his songs felt much more powerful. Longing For, What Will It Take, Jamaica and Prison Walls; he did them in his distinguished way of singing. Almost complaining as if he carries a heavy weight on his back. He reaches the high notes, even if he has to press them out of his toes. That's the way the crowd likes to hear him! He stood on stage dressed all in white with his sympathetic and relaxed attitude. Compared to other artists he's different in his stage performance. He shows a lot of tranquility. I think Holland was blessed with Jah Cure on the 12 th of August 2007.\" - Melvin Toemin, FunX FM, Rotterdam.\n\n\"The show was amazing. The best show I have ever been to. Jah Cure gave a strong performance... Amazing!\" - Julian, www.Reggaephotos.de , Germany. \n\n\"Jah Cure's debut performance since his much publicised release from prison promised much, and for once the hype around an artistes performance delivered on all fronts. He seemed completely at home on stage and was greeted by a rapturous reception from the European crowd. His rapport with the audience was instantly noticeable, and with the majestic Dean Frazer leading the Iyah Cure Band it was hard to believe that this was not an outfit that had toured around Europe and the world for some time. And this was actually their first public outing! Cure's vocal performance was on point throughout, and his fans around the world have a treat in store when he visits their region.\" - Ray Paul, BBC 1Xtra, United Kingdom. \n\n\"The audience sang along line by line. The atmosphere was electrifying. In the run-up to the Reggae Sundance festival it was evident that most of the over 20,000 visitors travelled there because of Jah Cure. It was history in the making! Jamaica had Bob Marley, Jamaica had Garnett Silk and now Jamaica has Jah Cure, who is on the best way to becoming a superstar. That was the consensus after his outstanding, professional, winning performance, which was the crowning glory of the festival and which put tears in so many eyes because of the beauty of his voice and the circumstances surrounding his very first performance after over eight years in prison.\" - Ellen Kohlings, Riddim, Germany \n\nJamaican fans and journalists will have the opportunity to make their own judgments at Cure's next performance at Curefest, the 3-day event focusing on the work and music of Jah Cure to be held on October 12-14, 2007 in Oracabessa Bay, St. Mary, Jamaica.\n\n\ncheck: freejahcure.net\n\n\n <a href=\"https://www.last.fm/music/Jah+Cure\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
