{"artist":{"name":"James Ingram","mbid":"1c9d555e-d20a-46d9-93a3-bf7e0d263ece","url":"https://www.last.fm/music/James+Ingram","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/05c24663e0f04df1a1659d1282b1bf22.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/05c24663e0f04df1a1659d1282b1bf22.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/05c24663e0f04df1a1659d1282b1bf22.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05c24663e0f04df1a1659d1282b1bf22.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05c24663e0f04df1a1659d1282b1bf22.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05c24663e0f04df1a1659d1282b1bf22.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"88169","playcount":"544294"},"similar":{"artist":[{"name":"Peabo Bryson","url":"https://www.last.fm/music/Peabo+Bryson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5141f5d9f4b2480fa2ce7fe42b920b61.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5141f5d9f4b2480fa2ce7fe42b920b61.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5141f5d9f4b2480fa2ce7fe42b920b61.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5141f5d9f4b2480fa2ce7fe42b920b61.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5141f5d9f4b2480fa2ce7fe42b920b61.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5141f5d9f4b2480fa2ce7fe42b920b61.png","size":""}]},{"name":"Freddie Jackson","url":"https://www.last.fm/music/Freddie+Jackson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/28fb0de91bc9454e8ca571dc8661f88b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/28fb0de91bc9454e8ca571dc8661f88b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/28fb0de91bc9454e8ca571dc8661f88b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/28fb0de91bc9454e8ca571dc8661f88b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/28fb0de91bc9454e8ca571dc8661f88b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/28fb0de91bc9454e8ca571dc8661f88b.png","size":""}]},{"name":"Patti Austin","url":"https://www.last.fm/music/Patti+Austin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c3a838017796483fb1c2857527496d10.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c3a838017796483fb1c2857527496d10.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c3a838017796483fb1c2857527496d10.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c3a838017796483fb1c2857527496d10.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c3a838017796483fb1c2857527496d10.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c3a838017796483fb1c2857527496d10.png","size":""}]},{"name":"Luther Vandross","url":"https://www.last.fm/music/Luther+Vandross","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b8884bc0d43b4f6182deb26f01893789.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b8884bc0d43b4f6182deb26f01893789.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b8884bc0d43b4f6182deb26f01893789.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8884bc0d43b4f6182deb26f01893789.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8884bc0d43b4f6182deb26f01893789.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8884bc0d43b4f6182deb26f01893789.png","size":""}]},{"name":"Anita Baker","url":"https://www.last.fm/music/Anita+Baker","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ac0093f70ffe45ab8e1794017c4999da.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ac0093f70ffe45ab8e1794017c4999da.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ac0093f70ffe45ab8e1794017c4999da.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ac0093f70ffe45ab8e1794017c4999da.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ac0093f70ffe45ab8e1794017c4999da.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ac0093f70ffe45ab8e1794017c4999da.png","size":""}]}]},"tags":{"tag":[{"name":"soul","url":"https://www.last.fm/tag/soul"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"adult contemporary","url":"https://www.last.fm/tag/adult+contemporary"},{"name":"urban","url":"https://www.last.fm/tag/urban"},{"name":"rnb","url":"https://www.last.fm/tag/rnb"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/James+Ingram/+wiki"}},"published":"23 Sep 2006, 21:25","summary":"James Ingram (born February 16, 1952 in Akron, Ohio) is a Music icon, Multi Grammy award-winner and back-to-back Oscar nominee who inspires and touches the hearts of millions of listeners worldwide through his abundant gifts as a singer, performer, songwriter, composer, arranger and producer.\n\nIn early 2009 Ingram returns to his roots with the release of his first complete inspirational CD, the much-anticipated Stand (in the Light).  Inspired by the plight of the Hurricane Katrina victims <a href=\"https://www.last.fm/music/James+Ingram\">Read more on Last.fm</a>","content":"James Ingram (born February 16, 1952 in Akron, Ohio) is a Music icon, Multi Grammy award-winner and back-to-back Oscar nominee who inspires and touches the hearts of millions of listeners worldwide through his abundant gifts as a singer, performer, songwriter, composer, arranger and producer.\n\nIn early 2009 Ingram returns to his roots with the release of his first complete inspirational CD, the much-anticipated Stand (in the Light).  Inspired by the plight of the Hurricane Katrina victims, Stand features new works and “Yah Mo Be There” — his legendary, Grammy award-winning 1983 collaboration with Michael McDonald — and is the natural advancement in a career grounded in faith; blessed with the influence and mentorship of some of the seminal forces in American music history including Ray Charles, Marvin Gaye, Donny Hathaway and Stevie Wonder; and shaped and molded by Quincy Jones. \n\nFrom funk to soul to R&B to pop to adult contemporary to inspirational, James Ingram’s multi-faceted talents have dazzled the American music scene since the early ’80s. The Akron, Ohio, native went from playing local bars with Revelation Funk to Los Angeles, where he landed the types of gigs that most aspiring musicians only dream about: singing background vocals and playing piano for Ray Charles’ recording studio sessions; recording studio sessions and playing keyboards behind the Coasters for Dick Clark; and recording background vocals for his mentor, Marvin Gaye. \n\nThen fate brought Ingram together with Quincy Jones and to a pivotal breakthrough in his career. Up to this point, Ingram had not yet surfaced as a solo artist, but after a chance listen to Ingram’s demo of “Just Once” — which had been recorded for the sum of $50 — Jones immediately recognized the man, the voice and the music as the musical triumvirate that would both captivate listeners and command the music industry’s attention. \n\nJones quickly chose Ingram to perform both “Just Once” and “One Hundred Ways” on Jones’ upcoming album, The Dude. Released in 1980, The Dude was a multi-platinum international success and resulted in three Grammy nominations for Ingram: Best New Artist, Best Pop Male Vocal, and Best R&B Vocal for “One Hundred Ways,” for which he won his first Grammy. Ingram also made Grammy history when — in his first live performance ever as a singer — he performed “Just Once” as the telecast’s opening act and became the first artist to open a Grammy ceremony with a ballad and the only artist to win a Grammy without having his own album in release. The Dude remains the most Grammy-nominated album in history and marked the first of 15 nominations Ingram has received to date (see attached award list and discography for complete information).\n\nAfter this stunning debut, Ingram’s much-anticipated 1983 solo album, It’s Your Night, surpassed industry expectations. The album was the debut for the Michael McDonald collaboration “Yah Mo Be There,” (Ingram’s 2nd Grammy) which was honored with the Grammy for Best R&B Performance for a Group or Duo, and “There’s No Easy Way” was considered one of the year’s stand-out ballads. It’s Your Night sold nearly one million copies; secured an unprecedented achievement by appearing simultaneously on both The Top 20 Pop and The Top 5 R&B Charts. Ultimately, “Yah Mo Be There” became the most-played song of the year.  \n\nIngram’s talents as a songwriter and performer were tapped by some of the most celebrated artists of the era, most prominent was his “P.Y.T. (Pretty Young Thing)” for Michael Jackson’s Thriller (1982), which sold more than 50 million units,. He performed “Baby Come To Me,” with Patti Austin (1984) on her debut album, which went on to become a No. 1 Pop record.  Other chart-topping, Top 10 collaborations include “The Secret Garden,” the No.1 hit with Barry White, Al B. Sure and El Debarge on Quincy Jones’ multi-platinum Back on the Block album, (1990). James, as a song writer is timeless he received Grammy recognition for his participation on the song entitled “Good Life”, in the “Best Rap Song” category, performed by Kanye West (featuring T-Pain) in 2007.\n\nHollywood soon called for Ingram’s wide-ranging songwriting and vocal abilities and several hit singles for blockbuster motion and animated pictures followed. “How Do You Keep The Music Playing” — a songwriting collaboration between Michel Legrand and Marilyn and Alan Bergman, performed by Ingram and Patti Austin — was featured in Best Friends (1982) and received a Grammy Award nomination for Best Pop Duo/Group as well as an Academy Award nomination in the Original Song category. \n\nOther important contributions to feature films include “Don’t Make Me No Never Mind,” co-written with Quincy Jones and Roy Gaines for Steven Spielberg’s The Color Purple (1985), and Ingram’s duet with Anita Baker, “When You Love Someone,” by Bryan Adams, for Forget Paris (1995). “Somewhere Out There,” performed by Ingram and Linda Ronstadt for Steven Spielberg’s animated American Tail (1986) also received a Grammy for Song of the Year. Then 1993 and 1994 brought Ingram back-to-back Academy Award nominations. His duets with Dolly Parton, “The Day I Fall in Love,” featured in Beethoven 2 (1993), and Anita Baker, “Look What Love Has Done,” the theme song from Junior (1994), were songwriting collaborations with Carole Bayer Sager and recognized in Oscar’s Original Song category. \n\nThe '90s were a fruitful decade for Ingram, who began it by co-producing “I Don’t Have the Heart” with Thom Bell — the first and only time Bell has co-produced on any project — and taking it to No. 1 in 1990. In 1999, Ingram released Forever More: The Best of James Ingram, which included some of his biggest hits as well as new material \n\nWorldwide acclaim has led to concert tours in the U.S. and abroad, where he continues to play before sold-out stadiums in The Philippines, Japan, Singapore, Dubai, Brunei, Indonesia and Hong Kong. Fans at home have been able to see Ingram perform live everywhere from Compton to The White House.\n\nThe blessings of success also have allowed Ingram to pursue two of his personal passions: humanitarian work and composition for live theater. In 1987, Ingram was hand-picked by Quincy Jones to perform in “We are the World,” the universal gift and legendary singing and fund-raising effort from the recording industry, which raised more than $100 million in aid for those suffering from famine in Africa. Ingram also continues to work with long-time collaborator, choreographer/producer Debbie Allen on a number of musical projects. Most recently, they partnered on Stand (In the Light) and several musical theater works including \"Brothers of the Night, “The Legend” and “Alex in Wonderland.\"\n\nFaith and family are Ingram’s main sources of inspiration, driving his industry achievements; legendary collaborations with revered mentors and peers; humanitarian work; and celebrated performances at some of the most-high-profile events of our time, including The Oscars, The Grammy Awards and The Super Bowl. The son of a Deacon, Ingram is one of six children and a self-taught musician, adept at piano, guitar, bass, drums and synthesizer. Today, he makes his home in Los Angeles with Debbie, his wife of 36 years, and their six children.\n\n <a href=\"https://www.last.fm/music/James+Ingram\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
