{"artist":{"name":"Janie Fricke","mbid":"fd2a2e7a-c2fe-4046-963d-a1a5d863015b","url":"https://www.last.fm/music/Janie+Fricke","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/40afbce00b824d218f9e11b0262e6c5f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/40afbce00b824d218f9e11b0262e6c5f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/40afbce00b824d218f9e11b0262e6c5f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40afbce00b824d218f9e11b0262e6c5f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40afbce00b824d218f9e11b0262e6c5f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40afbce00b824d218f9e11b0262e6c5f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"14118","playcount":"94812"},"similar":{"artist":[{"name":"T.G. Sheppard","url":"https://www.last.fm/music/T.G.+Sheppard","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8bcb09307e1a40e999afc37dbc681801.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8bcb09307e1a40e999afc37dbc681801.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8bcb09307e1a40e999afc37dbc681801.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8bcb09307e1a40e999afc37dbc681801.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8bcb09307e1a40e999afc37dbc681801.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8bcb09307e1a40e999afc37dbc681801.png","size":""}]},{"name":"Eddy Raven","url":"https://www.last.fm/music/Eddy+Raven","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/84a4547a32d24ea39f27601b1b5ad1b3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/84a4547a32d24ea39f27601b1b5ad1b3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/84a4547a32d24ea39f27601b1b5ad1b3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84a4547a32d24ea39f27601b1b5ad1b3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84a4547a32d24ea39f27601b1b5ad1b3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84a4547a32d24ea39f27601b1b5ad1b3.png","size":""}]},{"name":"Charly McClain","url":"https://www.last.fm/music/Charly+McClain","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dbdd1f3b89164326a30ce4dbba49ddc6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dbdd1f3b89164326a30ce4dbba49ddc6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dbdd1f3b89164326a30ce4dbba49ddc6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dbdd1f3b89164326a30ce4dbba49ddc6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dbdd1f3b89164326a30ce4dbba49ddc6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dbdd1f3b89164326a30ce4dbba49ddc6.png","size":""}]},{"name":"Holly Dunn","url":"https://www.last.fm/music/Holly+Dunn","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/063c2b63fd5c4483bb6818942caad163.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/063c2b63fd5c4483bb6818942caad163.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/063c2b63fd5c4483bb6818942caad163.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/063c2b63fd5c4483bb6818942caad163.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/063c2b63fd5c4483bb6818942caad163.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/063c2b63fd5c4483bb6818942caad163.png","size":""}]},{"name":"Earl Thomas Conley","url":"https://www.last.fm/music/Earl+Thomas+Conley","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/770cec0a7d354b8fa72740ed29e9dcb6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/770cec0a7d354b8fa72740ed29e9dcb6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/770cec0a7d354b8fa72740ed29e9dcb6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/770cec0a7d354b8fa72740ed29e9dcb6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/770cec0a7d354b8fa72740ed29e9dcb6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/770cec0a7d354b8fa72740ed29e9dcb6.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"country pop","url":"https://www.last.fm/tag/country+pop"},{"name":"80s","url":"https://www.last.fm/tag/80s"},{"name":"janie fricke","url":"https://www.last.fm/tag/janie+fricke"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Janie+Fricke/+wiki"}},"published":"25 Feb 2007, 03:30","summary":"Janie Fricke (born December 19, 1947 in South Whitley, Indiana) is an American Country Music singer, best remembered for a series of smooth Countrypolitan hits in the early to mid 1980s. Two of her best-known hits are \"He's a Heartache\" and \"Tell Me a Lie\". Overall in her career, Fricke scored eight No. 1 Country hits and nine Country Top Ten hits.\n\nChildhood & teen years\nBorn in South Whitley, In 1947, she learned piano and guitar as a child; early vocal influences were folk artists like Joan Baez and Judy Collins. <a href=\"https://www.last.fm/music/Janie+Fricke\">Read more on Last.fm</a>","content":"Janie Fricke (born December 19, 1947 in South Whitley, Indiana) is an American Country Music singer, best remembered for a series of smooth Countrypolitan hits in the early to mid 1980s. Two of her best-known hits are \"He's a Heartache\" and \"Tell Me a Lie\". Overall in her career, Fricke scored eight No. 1 Country hits and nine Country Top Ten hits.\n\nChildhood & teen years\nBorn in South Whitley, In 1947, she learned piano and guitar as a child; early vocal influences were folk artists like Joan Baez and Judy Collins. [2] Despite growing up in a musical family, spending much of her childhood singing at home, school, and church, it did not occur to her that music might be a profession. Whilst studying for a bachelor's degree in elementary education at Indiana University, she kept active musically but It remained a hobby, not a serious career choice. Then, when she began to earn extra money singing commercial jingles she began to see that music might earn her a living. [3]\n\nCareer discovery\nIn 1975, Fricke moved to Nashville, Tennessee, where she became an in-demand background vocalist. Fricke sang background for other Country singers of the time including Crystal Gayle, Ronnie Milsap, Tanya Tucker, Conway Twitty, and Eddie Rabbitt. However, it was her work on several tracks by Johnny Duncan that first brought Fricke to national attention. After supplying uncredited background vocals for such Duncan hits as \"Jo and the Cowboy,\" \"Thinkin' of a Rendezvous,\" \"It Couldn't Have Been Any Better,\" and \"Stranger,\" she was finally rewarded with equal billing with Duncan on \"Come a Little Bit Closer.\" Her contribution to Duncan's number one hit \"Stranger\" in 1977 probably generated much of the interest in that song,  When Fricke sang the line, \"Shut out the light and lead me....\". [4] people began to speculate who the mysterious singer was. As a result, she gained a recording contract of her own with Columbia records, where she remained for over ten years from 1977.\n\nCountry music career\n1977 – 1980: Country beginnings\nFricke's 1977 debut single, \"What're You Doing Tonight,\"  just missed the Top 20. Collaborations with Charlie Rich (the number one hit \"On My Knees\") and Duncan (the Top Five \"Come a Little Bit Closer\") kept Fricke going strong through 1978, but her solo singles over the next couple of years had a hard time taking off. [5] Fricke had two Top 20 hits between 1978 and 1979, \"Please Help Me I'm Fallling (In Love With You)\", which reached #12 and \"I'll Love Away Your Troubles for Awhile\", which peaked at #14. However, Country radio still failed to regularly play her material, and, because of this, most of her other singles did not chart very high between 1978 and 1981. She was also part of the Louise Mandrell special \"Diamonds, Gold and Platinum\"  in 1983 among other TV specials.\n\nDuring this time, Fricke released three studio albums, starting in 1977 with the excellent Singer of Songs. The album produced her first three singles, \"What're Doing Tonight\", \"Please Help Me I'm Fallin' (In Love With You)\", and \"Baby's It's You\". In 1979 she released her second and third studio albums, Love Notes and From the Heart. Only Love Notes produced one Top 20 hit. None of Fricke's albums at this time had charted yet on Billboard's Top Country Albums chart.\n\n1981 – 1989: Breakthrough success\nIn late 1980, Fricke's producer, Billy Sherrill noticed her limited success.  He advised her to establish an identity, focusing on one style.  Fricke began to record ballads and had a breakout year in 1981, landing two Top Five hits with \"Down to My Last Broken Heart\" and \"I'll Need Someone to Hold Me (When I Cry).\" [6]  1982-1984 saw her score six number one hits — \"Don't Worry 'Bout Me Baby,\" \"It Ain't Easy Bein' Easy,\" \"Tell Me a Lie,\" \"He's a Heartache,\" Let's Stop Talkin' About It,\" and \"Your Heart's Not in It.\" [7] All of these #1s were from her 1982 album, It Ain't Easy which became a successful-selling album. On Fricke's #1 hit, \"Don't Worry 'Bout Me Baby\", Country music singer, Ricky Skaggs can be heard in the background singing harmony vocals. In 1983, Fricke toured with Country band, Alabama.\n\nShe then broadened her style to include more up-tempo tracks. [8] In 1982 and 1983, Fricke was awarded \"Female Vocalist of the Year\" by the Country Music Association. In 1983, she released her next studio album, Love Lies, which peaked at #10 on the Top Country Albums chart. The album spawned a #1 single, \"Let's Stop Talkin' About It\" and a Top 10, \"If the Fall Don't Get You\". In 1984, Fricke released her next album, First Word in Memory. The lead single, \"Your Heart's Not In It\" was a #1 hit in 1984, followed by the title track, which became a Top 10 hit the same year. In the 80s, Fricke also played one of the criminals, Ginny, who hid loot in the dash of a getaway car that was to become the \"General Lee\" in the Dukes of Hazzard episode \"Happy Birthday, General Lee\", Episode 131.\n\nFricke landed five more Top Ten hits from 1985-1986, including another # 1 in \"Always Have, Always Will\" and a # 2 in \"She's Single Again.\" [9] These singles came from her 1985 album, Somebody Else's Fire, which peaked at #21 on the Top Country Albums chart. Also in 1985, Fricke was featured in Merle Haggard's single, \"A Place to Fall Apart\" which became a #1 hit that year. The single was based on a letter Haggard wrote to ex-wife, Leona Williams, with whom he had duetted with in the 1970s. In 1986, Fricke released her next album, Black and White. The album included her last #1 hit, \"Always Have, Always Will\", as well as her last Top 20 hit, \"When a Woman Cries\", which peaked at #20 in 1986.\n\nAnnoyed by mispronunciations of her name, she changed the spelling to \"Frickie\" in 1986, but a few years later, reverted to the original spelling.\n\nAs Neo-traditional Country music artists like Patty Loveless and Randy Travis became popular in 1987, the more pop influenced style Fricke had been recording since the early part of the decade lost favor with Country radio and Fricke's success began to decline. She recorded a Top 25 hit with Larry Gatlin called \"From Time to Time (It Sure Feels Like Love Again)\", released on Gatlin's 1987 Partners album. Fricke's 1987 album, After Midnight released one Top 40 Country hit, \"Are You Satisfied\", which peaked at #32. The other singles from the album did not reach the Top 40. Fricke's 1988 album Saddle in the Wind album peaked at #64 on the Top Country Albums chart. After 1989's Labor of Love album, Fricke and Columbia records parted company. Her last charted single was also released in 1989.  \"Give 'Em My Number\" peaked at #43 on the Billboard Country Chart.\n\n1990 – present: Current music career\nShe recorded two albums for the small Branson label in 1992 and 1993, and issued the gospel record Hymns of Faith on Intersound in 1996. [10] Fricke's album Bouncin' Back was released in 2000 under her own label, JMF Records. She decided to sell her album exclusively on the Internet. Fricke continues to tour extensively but sets aside time to spend with her family on her ranch near Lancaster, Tx. [11] In 2004, Fricke released a Bluegrass album on DM records, The Bluegrass Sessions. The tracks were re-workings of Fricke's previously-recorded Country hits, recorded  Bluegrass style.\n\nFricke continues to be actively involved in the music industry. In 2005, she attended the Country Music Association Awards. Fricke was the Firefighters' Marshal for Winchester, Virginia's \"80th Annual Shenandoah Apple Blossom Festival\" in May, 2007.\n\nPhilanthropic efforts\nIn 1985, Fricke established the \"Janie Fricke Scholarship\" at Indiana University to benefit gifted students in the School of Music. Scholarships are open to active members of the Singing Hoosiers vocal ensemble who demonstrate financial need. [12] Fricke has also participated in the \"Country Music Hall of Fame Fundraising Campaign\". Other artists who also support the project include, Big & Rich, Kenny Chesney, Kate Campbell, Amy Grant, James Otto and Gretchen Wilson.\n\nAwards\nYear -  Award Program - Award \n1979 - Music City News Country - Most Promising Female Artist of the Year \n1982 - Country Music Association - Female Vocalist of the Year \n1983 - Country Music Association - Female Vocalist of the Year \n1983 - Academy of Country Music - Top Female Vocalist \n1984 - Music City News Country - Female Artist of the Year \n1984 - Music City News Country - Female Artist of the Year \n\nDiscography\nMain article: Janie Fricke discography\n\nReferences\n^ Janie Fricke at All Music Guide \n^ Janie Fricke biography at All Music Guide; retrieved March 29, 2008 \n^ Janie Fricke biography at Musician Guide.com; also retrieved March 29, 2008 \n^ Janie Fricke biography at Musician Guide.com \n^ Janie Fricke biography at All Music Guide \n^ Janie Fricke biography at All Music Guide.com \n^ Janie Fricke biography at All Music Guide.com \n^ Janie Fricke biography at All Music Guide.com \n^ Janie Fricke biography at All Music Guide \n^ Janie Fricke biography at All Music Guide; retrieved March 29, 2008. \n^ Janie Fricke biography at Musician Guide.com \n^ Janie Fricke biography at Musician Guide.com \n\nExternal links\nJanie Fricke Official Website \nCMT.com: Janie Fricke \nDukes of Hazzard Episode Guide \nRetrieved from \"http://en.wikipedia.org/wiki/Janie_Fricke\"\n <a href=\"https://www.last.fm/music/Janie+Fricke\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
