{"artist":{"name":"Jeff And Sheri Easter","url":"https://www.last.fm/music/+noredirect/Jeff+And+Sheri+Easter","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/05135d4b76cc429f839e39f31baba5f0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/05135d4b76cc429f839e39f31baba5f0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/05135d4b76cc429f839e39f31baba5f0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05135d4b76cc429f839e39f31baba5f0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05135d4b76cc429f839e39f31baba5f0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05135d4b76cc429f839e39f31baba5f0.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"0","playcount":"0"},"similar":{"artist":[]},"tags":{"tag":[{"name":"Southern Gospel","url":"https://www.last.fm/tag/Southern+Gospel"},{"name":"bluegrass","url":"https://www.last.fm/tag/bluegrass"},{"name":"christian","url":"https://www.last.fm/tag/christian"},{"name":"country gospel","url":"https://www.last.fm/tag/country+gospel"},{"name":"jeff and sheri easter","url":"https://www.last.fm/tag/jeff+and+sheri+easter"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/Jeff+And+Sheri+Easter/+wiki"}},"published":"11 Jun 2008, 09:57","summary":"For Jeff and Sheri, gospel music is genetically programmed into their DNA. As members of acclaimed musical families—Jeff’s father is one of the Easter Brothers and Sheri’s mother is a member of The Lewis Family—they grew up surrounded by the sound of people praising God through their musical gifts.\n\nIn August of 1984, both were at the Albert E. Brumley Sundown to Sunup Gospel Singing in Arkansas. Jeff, who was playing bass for the Singing Americans at the time <a href=\"https://www.last.fm/music/+noredirect/Jeff+And+Sheri+Easter\">Read more on Last.fm</a>","content":"For Jeff and Sheri, gospel music is genetically programmed into their DNA. As members of acclaimed musical families—Jeff’s father is one of the Easter Brothers and Sheri’s mother is a member of The Lewis Family—they grew up surrounded by the sound of people praising God through their musical gifts.\n\nIn August of 1984, both were at the Albert E. Brumley Sundown to Sunup Gospel Singing in Arkansas. Jeff, who was playing bass for the Singing Americans at the time, took the opportunity to reintroduce himself to Sheri’s mother Polly; they had met on a previous occasion. Polly introduced Jeff to Sheri and the two were married ten months later. \n\nThey traveled and performed as part of The Lewis Family for several years. But in 1988 they decided it was time to strike out on their own, and they haven’t looked back since. Also joining Jeff & Sheri on the road is their son, Madison, who plays electric guitar for the group and their daughter, Morgan, who joins them on occasion for a special solo when she’s not helping with the newest addition to the Easter family, Maura Grace. Greg and Charlotte Ritchie have been performing with Jeff & Sheri since 1994 and 1996, respectively. Their son, Landon, is a regular highlight of Jeff & Sheri’s program, offering a little comedy with help from Jeff. However Greg and CHarlotte have recently resigned from performing with Jeff and Sheri, leaving room for Morgan to sing in place of Charlotte.\n\nJeff & Sheri have been nominated for numerous Dove Awards and won three. They’ve also received a Grammy nomination, and Sheri has been named the Singing News Favorite Alto ten times and the Singing News Female Vocalist four times. Jeff & Sheri’s wall of awards also include three Society for the Preservation of Bluegrass Music Association Awards, two International Country Gospel Music Association, nine Voice Awards for Female Artist, five Voice Awards for Song/Single of the Year, two Voice Awards for Christian Country Group, four SGM Fan Fair/USGN awards, five SGN Scoops Diamond Awards, four Hearts Aflame Awards, and three Cash Box awards. They have also participated in the Gaither Homecoming Video Series since 1993, which has sold over 15 million units.\n\nApart from their frequent appearances on the Gaither Homecoming tour and videos, Jeff & Sheri have a fairly heavy touring schedule of their own. “When we perform, we want people to leave a little different than when they came in,” Sheri explains. “We want them to have a great time smiling, laughing, crying and healing. We want them to know God loves them and that He is in control.” \n\n <a href=\"https://www.last.fm/music/+noredirect/Jeff+And+Sheri+Easter\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
