{"artist":{"name":"Jeff Scott Soto","mbid":"9946e322-2eb6-43dd-ae66-dd28114f1522","url":"https://www.last.fm/music/Jeff+Scott+Soto","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/67c5e18da5034c5094715f47895b851a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/67c5e18da5034c5094715f47895b851a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/67c5e18da5034c5094715f47895b851a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/67c5e18da5034c5094715f47895b851a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/67c5e18da5034c5094715f47895b851a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/67c5e18da5034c5094715f47895b851a.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"38204","playcount":"562778"},"similar":{"artist":[{"name":"Talisman","url":"https://www.last.fm/music/Talisman","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cb064d243f16476297e66b625c040dc7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cb064d243f16476297e66b625c040dc7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cb064d243f16476297e66b625c040dc7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cb064d243f16476297e66b625c040dc7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cb064d243f16476297e66b625c040dc7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cb064d243f16476297e66b625c040dc7.png","size":""}]},{"name":"W.E.T.","url":"https://www.last.fm/music/W.E.T.","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/082cc63bb6514753be9f07f8ffb35a6d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/082cc63bb6514753be9f07f8ffb35a6d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/082cc63bb6514753be9f07f8ffb35a6d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/082cc63bb6514753be9f07f8ffb35a6d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/082cc63bb6514753be9f07f8ffb35a6d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/082cc63bb6514753be9f07f8ffb35a6d.png","size":""}]},{"name":"Revolution Saints","url":"https://www.last.fm/music/Revolution+Saints","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/891b8584b18845b6c5ce63f9f7856728.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/891b8584b18845b6c5ce63f9f7856728.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/891b8584b18845b6c5ce63f9f7856728.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/891b8584b18845b6c5ce63f9f7856728.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/891b8584b18845b6c5ce63f9f7856728.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/891b8584b18845b6c5ce63f9f7856728.png","size":""}]},{"name":"Tyketto","url":"https://www.last.fm/music/Tyketto","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0655714aea754cc6a5acfe27682557a6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0655714aea754cc6a5acfe27682557a6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0655714aea754cc6a5acfe27682557a6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0655714aea754cc6a5acfe27682557a6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0655714aea754cc6a5acfe27682557a6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0655714aea754cc6a5acfe27682557a6.png","size":""}]},{"name":"Harem Scarem","url":"https://www.last.fm/music/Harem+Scarem","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a78c6a5c3e7e4983ad238be9497bd853.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a78c6a5c3e7e4983ad238be9497bd853.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a78c6a5c3e7e4983ad238be9497bd853.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a78c6a5c3e7e4983ad238be9497bd853.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a78c6a5c3e7e4983ad238be9497bd853.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a78c6a5c3e7e4983ad238be9497bd853.png","size":""}]}]},"tags":{"tag":[{"name":"hard rock","url":"https://www.last.fm/tag/hard+rock"},{"name":"melodic rock","url":"https://www.last.fm/tag/melodic+rock"},{"name":"heavy metal","url":"https://www.last.fm/tag/heavy+metal"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Jeff+Scott+Soto/+wiki"}},"published":"20 Sep 2006, 19:03","summary":"Jeff Scott Soto has been involved in bands included Yngwie Malmsteen, Panther, Axel Rudi Pell, Eyes, Talisman, Takara, Humanimal, Human Clay, Kryst The Conqueror, Redlist, The Boogie Knights, Soul Sirkus and W.E.T..\n\nBy the time he reached his mid-30’s, Jeff Scott Soto had already spent twenty years splitting his time between recording studios and concert stages around the world. From heavy metal and funk to AOR and pop, Jeff has done it all.\n\nBorn November 4 <a href=\"https://www.last.fm/music/Jeff+Scott+Soto\">Read more on Last.fm</a>","content":"Jeff Scott Soto has been involved in bands included Yngwie Malmsteen, Panther, Axel Rudi Pell, Eyes, Talisman, Takara, Humanimal, Human Clay, Kryst The Conqueror, Redlist, The Boogie Knights, Soul Sirkus and W.E.T..\n\nBy the time he reached his mid-30’s, Jeff Scott Soto had already spent twenty years splitting his time between recording studios and concert stages around the world. From heavy metal and funk to AOR and pop, Jeff has done it all.\n\nBorn November 4, 1965, in Brooklyn, New York, Jeff Scott Soto relocated to the San Fernando Valley in California at the age of eight. During his formative years, while his friends were drawn to the likes of Kiss, Jeff’s musical tastes leaned more toward bands like Queen, Journey and Motown artists like the Jackson 5. Following graduation from high school in 1983, Jeff and his older brother Joey formed a series of dead-end metal bands.\n\nIn late 1984, Soto answered an open call for audition tapes by former Alcatrazz guitarist Yngwie J. Malmsteen. Jeff’s major label debut on ‘Yngwie J. Malmsteen’s Rising Force’ was released on Polydor that year. In 1985, Jeff returned to the recording studio to record Malmsteen’s ‘Marching Out’. The band began kicked off a tour in Japan, creating quite a stir; a Tokyo concert was filmed and later released on video as ‘Chasing Yngwie: Live in Tokyo, ‘85’.\n\nAfter leaving Yngwie’s band, Jeff recorded demos with ex-Kiss guitarist Vinnie Vincent and later resurfaced with Japanese guitarist Kuni Takeuchi on 1988’s ‘Lookin’ for Action’. Jeff also recorded vocals, albeit under an alias, for ‘Kryst the Conqueror’, a project spearheaded by members of punk legends The Misfits.\n\nIn 1990 Jeff Scott Soto collaborated with former Rising Force band mate, bassist Marcel Jacob, in a distinctly European metal band called Talisman. He also appeared with hard-rocking California party band Eyes. Neither band toured extensively; Jeff found time to record 1991’s ‘Skrapp Mettle’ album, wisely appearing under an assumed name.\n\n1992 brought Jeff together with German guitarist Axel Rudi Pell for ‘Eternal Prisoner’, the first of four studio albums he would record with Pell. Throughout the Nineties, Soto split his time between Axel Rudi Pell, Talisman, the short-lived Eyes and Takara. 1993 saw the release of four albums to feature Jeff’s vocal work: Talisman’s sophomore release ‘Genesis’, the Eyes demo album ‘Windows of the Soul’, the soundtrack to the cartoon film ‘Biker Mice from Mars’ and ‘Eternal Faith’ by Takara. Jeff went on to write and record two more albums with Takara, 1995’s ‘Taste of Heaven’ and 1998’s ‘Blind in Paradise’.\n\n1994 was a banner year. Talisman released ‘Five Out of Five Live’, recorded on their successful debut Japanese tour. While they busied themselves writing the next studio album, ‘Humanimal’, Jeff recorded ‘Between the Walls’ with Axel Rudi Pell, and paired up with Takara’s Gary Schutt, contributing lead vocals to Schutt’s ‘Sentimetal’ solo disc.\n\n1995 brought Soto’s first solo endeavor, ‘Love Parade’. It was a funky affair, with affectionate nods to influences Prince and Queen. Following the release of Talisman’s ‘Life’ that year, Marcel and Jeff recorded the first of two albums as Human Clay. Former taskmaster Yngwie Malmsteen appeared on the album, repaying Jacob and Soto’s contributions on Malmsteen’s own ‘Inspiration’ album. Rounding out 1996, Jeff recorded a third studio album with Axel Rudi Pell, ‘Black Moon Pyramid’. Two Talisman best-of compilations also appeared that year, ‘Besterious’ and ‘Best of Talisman’.\n\nWhile Jeff could be heard on the raw ‘U4IA’ album by Human Clay and his final Pell album, 1997’s ‘Magic’, he could also be heard singing “Grease” and “YMCA” on the Boogie Knights album ‘Welcome to the Jungle Boogie’. The band was the premier party band of its kind, appearing in movies, on TV and at special events nationwide. The grueling pace of his Boogie Knights schedule didn’t keep Jeff from completing 1998’s ‘Truth’ album with the revamped Talisman. ‘Truth’ featured some of Jeff’s most impressive vocal work, as well as innovative arrangements of songs by Queen, Prince and Madonna.\n\nMost of 1999 and 2000 was spent doing odd sessions here and there. Jeff recorded contributions for tributes to both Van Halen and Ozzy, laid down lead vocals for the film ‘Rock Star’ and recorded a series of demos with Zakk Wylde. Perhaps most interesting was an invitation to perform with Queen’s Brian May at the annual Queen convention in the UK. Jeff has since furthered his reputation among Queen fans with a series of appearances with the SAS Band (Spike’s All Stars), Queen sideman Spike Edney’s band.\n\nIn early 2002 Jeff, Marcel and guitarist Pontus Norgren convened under the banner of Humanimal to record a single self-titled album. Later that same year, Jeff shared the stage with Queen’s Brian May and Roger Taylor at an October event celebrating Queen’s induction to the Hollywood Walk of Fame. Jeff also made his UK debut as a headliner at the 2002 Gods festival, an acclaimed performance later released on CD and DVD.\n\n2003 was all about Jeff Scott Soto the solo artist. First came the release of Jeff’s second solo album, ‘Prism’, featuring a who’s who of musicians from Jeff’s career and a duet with the great Glenn Hughes. Then upon the release of ‘Cats & Dogs’, a reunited Talisman undertook a short tour in the late summer, at the tail end of Soto’s successful European solo tour. Highlighting Jeff’s solo tour was an encore performance at the 2003 UK Queen Convention, issued on CD and DVD to the delight of Soto’s growing fan base.\n\nSoto began 2004 with the writing and recording of his third solo album, titled ‘Lost in the Translation’. In addition, a performance at the January, 2004 NAMM show with Journey guitarist Neal Schon blossomed into a new project called Soul SirkUS. Jeff released ‘Lost in the Translation’ – which also featured Soul SirkUS band mate Neal Schon - to widespread acclaim, and effectively brought 2004 to a close with a return to stages in the United States, Europe and South America in support of the album. He also extended his reach around the globe with a two-week solo tour of Australia.\n\nSoul SirkUS became Jeff’s focus for much of 2005. Following the release of the band’s debut CD ‘World Play’, Soul SirkUS spent all of April and May on tour, criss-crossing the United States and Europe. Soto returned to Europe and South America for a solo tour in the Fall of 2005, before returning home to begin work on what would be his fourth solo album.\n\nThe early months of 2006 were spent writing music in an altogether new direction, as Jeff collaborated with several notable Swedish songsmiths. At the same time, Jeff squeezed in enough time to record vocals for a somewhat unexpected Talisman album, the appropriately titled ‘7’. Thanks to a promotional push in the UK spearheaded by Richard Mace, Soto’s music garnered valuable airplay on the BBC radio network. In May of 2006, Soto parlayed his surge in popularity into ‘Essential Ballads’, a compilation of album cuts, b-sides and rarities that acted as a perfect calling card for the uninitiated. In July 2006, having just kicked off a major co-headlining tour of North America with Def Leppard, Journey suddenly found itself without a lead singer. Within the week, and without the benefit of a rehearsal, Jeff Scott Soto found himself face to face with 20,000 screaming Journey fans. By the time the tour buses rolled to a halt at the tail end of November, due to overwhelming demand the tour had been extended a full three months beyond its original August ending date. In December of 2006 came the official announcement of Jeff Scott Soto as the lead singer for Journey.\n\nJune 2007 brought the disappointing news of Jeff Scott Soto’s departure from Journey. This turn of events precluded any opportunity for Journey and JSS to collaborate in the studio and capitalize on the enormous potential of their union, a sentiment echoed on countless forums and fan sites across the internet. Jeff wasted no time, however; he dedicated the remainder of 2007 to completing his next solo album, begun prior to joining Journey. ‘A Beautiful Mess’, initially released via iTunes in September 2008, proved to be some of the most forward-thinking songs of Soto’s career, making it apparent that Jeff had reached the next stage in his evolution as an artist.\n\nJeff Scott Soto, or JSS as he is affectionately referred to by his fans, continues to stir the numerous irons he has in the fire at any given moment. News of Jeff’s latest and greatest endeavors will be forthcoming, as always, when they are ready to share with the world.\n\nIt’s an exciting time to be a fan of the music of Jeff Scott Soto. And in case you hadn’t noticed, Jeff’s made a lot of music to be a fan of. This biography is only the tip of the iceberg. So for the completists out there, print off a copy of Jeff’s discography, and happy hunting! \n\nSolo albums\n\n    * 1994 - Love Parade\n    * 2002 - Holding On (EP)\n    * 2002 - Prism\n    * 2003 - JSS Live at the Gods (live)\n    * 2004 - Believe in Me (EP)\n    * 2004 - Lost In The Translation\n    * 2006 - Essential Ballads\n    * 2009 - Beautiful Mess <a href=\"https://www.last.fm/music/Jeff+Scott+Soto\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
