{"artist":{"name":"Jennifer Clarke","url":"https://www.last.fm/music/Jennifer+Clarke","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/41b31543c05842feb020dbfbfdd467aa.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/41b31543c05842feb020dbfbfdd467aa.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/41b31543c05842feb020dbfbfdd467aa.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/41b31543c05842feb020dbfbfdd467aa.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/41b31543c05842feb020dbfbfdd467aa.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/41b31543c05842feb020dbfbfdd467aa.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"100","playcount":"470"},"similar":{"artist":[{"name":"Jeff Merchant","url":"https://www.last.fm/music/Jeff+Merchant","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/facb00435fc84d54ab1e41f450116f99.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/facb00435fc84d54ab1e41f450116f99.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/facb00435fc84d54ab1e41f450116f99.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/facb00435fc84d54ab1e41f450116f99.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/facb00435fc84d54ab1e41f450116f99.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/facb00435fc84d54ab1e41f450116f99.png","size":""}]},{"name":"Phil DaRosa","url":"https://www.last.fm/music/Phil+DaRosa","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Garth Adam","url":"https://www.last.fm/music/Garth+Adam","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Paul Turner","url":"https://www.last.fm/music/Paul+Turner","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/38833a917cff4b1c800091b6a320109c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/38833a917cff4b1c800091b6a320109c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/38833a917cff4b1c800091b6a320109c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/38833a917cff4b1c800091b6a320109c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/38833a917cff4b1c800091b6a320109c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/38833a917cff4b1c800091b6a320109c.png","size":""}]},{"name":"Echo Helstrom","url":"https://www.last.fm/music/Echo+Helstrom","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3fd79f64c4ea4aaf9b185cbe5ac69655.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3fd79f64c4ea4aaf9b185cbe5ac69655.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3fd79f64c4ea4aaf9b185cbe5ac69655.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3fd79f64c4ea4aaf9b185cbe5ac69655.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3fd79f64c4ea4aaf9b185cbe5ac69655.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3fd79f64c4ea4aaf9b185cbe5ac69655.png","size":""}]}]},"tags":{"tag":[{"name":"the bedford","url":"https://www.last.fm/tag/the+bedford"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Jennifer+Clarke/+wiki"}},"published":"10 Nov 2011, 00:47","summary":"Singer-songwriter Jennifer Clarke is part poet, part pirate of the Eastern seaboard and part drifter. A full-time commercial fishing Captain, she has also been writing songs for as many winters as she can remember. “I used to fish throughout the winters,” she says, “but I finally indulged my lifelong dream of making records, and now I split my time between the two.” She has just released her third album, Trinkets in Rubble, while preparing for a move to Los Angeles from her home on Martha’s Vineyard. <a href=\"https://www.last.fm/music/Jennifer+Clarke\">Read more on Last.fm</a>","content":"Singer-songwriter Jennifer Clarke is part poet, part pirate of the Eastern seaboard and part drifter. A full-time commercial fishing Captain, she has also been writing songs for as many winters as she can remember. “I used to fish throughout the winters,” she says, “but I finally indulged my lifelong dream of making records, and now I split my time between the two.” She has just released her third album, Trinkets in Rubble, while preparing for a move to Los Angeles from her home on Martha’s Vineyard. Jennifer casts a wide net to arrive at a musicianship whose compositions and arrangements are steeped in fervent imagination, whose lyrics are searingly intimate and whose style is unequivocally unique and deeply resonant. \n\nJennifer grew up on a farm in the shadows of the Blue Ridge mountain range in Delaplane, Virginia. The one-horse town’s post office, antique store and railroad station didn’t offer much distraction from farm life, so Jennifer spent her youth baling hay, running Black Angus cattle, skinning rattlesnakes, fly fishing and roaming the land by pony, dirt bike, go cart, dune buggy and bicycle. Throughout, she dreamed of being a singer-songwriter. She left home at fifteen and performed her first singing gig the following year at an open mic night at The Sunflower Café in Boston’s Harvard Square to a standing ovation, although she didn’t heartily pursue her songwriting career until much later. Her lone star lifestyle bred a fierce independence, self-reliance and an appreciation for nature.\n\nAfter going to boarding school in New England, Jennifer worked as a radio DJ prior to attendance at Boston University, where she studied abroad at both University of Rome and Oxford. Post-college, she worked at WGBH, public television’s flagship station, and later as a researcher for National Public Radio. After deciding she had exhausted all the appealing television jobs in Boston, Jennifer relocated to Los Angeles, where she worked as an investigative reporter for Primetime Live in Hollywood. It was during this time that she met her husband, comedian Lenny Clarke.\n\nThe two relocated to Martha’s Vineyard in Massachusetts after their marriage in the mid ‘90s. Surrounded by the fertile waters of Cape Cod, Jennifer decided to indulge her longtime fishing hobby and purchased an old Boston Whaler. Her career as a fisherwoman was about to become much more than a hobby. After meeting the legendary Wampanoag Indian Captain Buddy Vanderhoop, who educated her on the striped bass fishing methods of his tribe, Jennifer went on to win several fishing tournament victories both locally and abroad. She won the Martha's Vineyard Striped Bass and Bluefish Derby and its Grand Slam—twice—along with every award presented by the American Striper Association's East Coast Tournament Trail (the first such awards to go to a woman), all while fishing alone. She then earned her Captain’s license and started her own business, Captain Clarke Charters, where she chartered fishing excursions off the island of Martha’s Vineyard.\n\nIt was around this time that Jennifer released her first album, Time Flies. The album caught the attention of Aaron Barker (songwriter for George Strait), who encouraged her to travel to Nashville and co-write with some of his peers. While Jennifer wrote songs with Nashville’s legends, she also piqued the interest of legendary producer Fred Molin (Kris Kristofferson, Jimmy Web). Fred eventually produced her second album, More Than I Have, enlisting top session players in Music City. Some of the record was recorded in Boston with guitar greats Stu Kimball (Bob Dylan) and Duke Levine (Mary Chapin Carpenter, Peter Wolf). The title track was used on the FX series starring Denis Leary, Rescue Me.\n\nAfter spending the majority of 2010 writing her next record in Boston, Jennifer met producer Steve Catizone (Wyclef Jean, Earth Wind & Fire, Sully Erna, Jojo) at Boston’s Sanctum Sound studio. Steve produced a single Jennifer co-wrote to benefit Caron, one of the country's pre-eminent recovery facilities for substance abuse. A powerful partnership was born: one song turned into one of the most magical collaborations of Jennifer’s career. The two labored throughout the winter to produce Trinkets in Rubble. “I'm confident the album is my finest work yet,” says Jennifer, “and I can't wait to get it out to the rest of the world!”\n\nTrinkets in Rubble is lyrically adept and beautifully arranged. The record features a tight core of musicians: Charles Haynes (Raphael Saadiq, Meshell Ndegeocello, Kanye West) on drums, Barron Browne (Jean Luc-Ponty, Billy Cobham, Andrea Bocelli) on bass, Duke Levine on guitars and Steve and Jennifer on keys. Jennifer’s music is engaging, original and strongly personal—a new take on sophisticated, soulful alt-country and rock that defies categorization. Riding the sonic breaker’s foam, Jennifer is both Captain and siren’s song, virtuoso and vixen, songstress and muse.\n <a href=\"https://www.last.fm/music/Jennifer+Clarke\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
