{"artist":{"name":"Jeremy Fisher","mbid":"7be30286-3510-4bc4-a587-51d9ad7c2b47","url":"https://www.last.fm/music/Jeremy+Fisher","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/27e49126658c4000b716c7f8629a75a6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/27e49126658c4000b716c7f8629a75a6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/27e49126658c4000b716c7f8629a75a6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/27e49126658c4000b716c7f8629a75a6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/27e49126658c4000b716c7f8629a75a6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/27e49126658c4000b716c7f8629a75a6.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"33577","playcount":"327721"},"similar":{"artist":[{"name":"Matthew Barber","url":"https://www.last.fm/music/Matthew+Barber","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0a7b52006f854908a7883d50b4d15ec9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0a7b52006f854908a7883d50b4d15ec9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0a7b52006f854908a7883d50b4d15ec9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0a7b52006f854908a7883d50b4d15ec9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0a7b52006f854908a7883d50b4d15ec9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0a7b52006f854908a7883d50b4d15ec9.png","size":""}]},{"name":"Royal Wood","url":"https://www.last.fm/music/Royal+Wood","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4e7c6a2cc27f436fa3f83a89b21a23c5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4e7c6a2cc27f436fa3f83a89b21a23c5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4e7c6a2cc27f436fa3f83a89b21a23c5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4e7c6a2cc27f436fa3f83a89b21a23c5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4e7c6a2cc27f436fa3f83a89b21a23c5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4e7c6a2cc27f436fa3f83a89b21a23c5.png","size":""}]},{"name":"Sarah Harmer","url":"https://www.last.fm/music/Sarah+Harmer","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f580330794b3416b8c9a08e6c8df8f95.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f580330794b3416b8c9a08e6c8df8f95.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f580330794b3416b8c9a08e6c8df8f95.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f580330794b3416b8c9a08e6c8df8f95.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f580330794b3416b8c9a08e6c8df8f95.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f580330794b3416b8c9a08e6c8df8f95.png","size":""}]},{"name":"Mo Kenney","url":"https://www.last.fm/music/Mo+Kenney","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1d8df6e3643541e1a35f14e317d5999c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1d8df6e3643541e1a35f14e317d5999c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1d8df6e3643541e1a35f14e317d5999c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1d8df6e3643541e1a35f14e317d5999c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1d8df6e3643541e1a35f14e317d5999c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1d8df6e3643541e1a35f14e317d5999c.png","size":""}]},{"name":"Amelia Curran","url":"https://www.last.fm/music/Amelia+Curran","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/034a7f7ad27945fdbe4888c582980726.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/034a7f7ad27945fdbe4888c582980726.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/034a7f7ad27945fdbe4888c582980726.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/034a7f7ad27945fdbe4888c582980726.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/034a7f7ad27945fdbe4888c582980726.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/034a7f7ad27945fdbe4888c582980726.png","size":""}]}]},"tags":{"tag":[{"name":"Canadian","url":"https://www.last.fm/tag/Canadian"},{"name":"folk","url":"https://www.last.fm/tag/folk"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"acoustic","url":"https://www.last.fm/tag/acoustic"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Jeremy+Fisher/+wiki"}},"published":"26 Feb 2007, 23:45","summary":"I’m highly motivated,” says postmillennial troubadour Jeremy Fisher. “I love getting my hands in there.” The Vancouver-based writer/artist used those hands (which are generally affixed to his trusty acoustic guitar) to shoot the stop-motion footage and fashion the anthropomorphic title character of his $60 homemade video for “Cigarette,” which has became a viral phenomenon of mega-proportions on YouTube, with north of 2 million views as this is written.  <a href=\"https://www.last.fm/music/Jeremy+Fisher\">Read more on Last.fm</a>","content":"I’m highly motivated,” says postmillennial troubadour Jeremy Fisher. “I love getting my hands in there.” The Vancouver-based writer/artist used those hands (which are generally affixed to his trusty acoustic guitar) to shoot the stop-motion footage and fashion the anthropomorphic title character of his $60 homemade video for “Cigarette,” which has became a viral phenomenon of mega-proportions on YouTube, with north of 2 million views as this is written. \n\nJeremy has a tendency to get his legs involved as well: In 2002, he biked across the entire continent, from Seattle to Halifax, Nova Scotia—and that’s a loooooong way, folks—to promote his first album, Back Porch Spirituals, recorded in a friend’s basement. That trek took six months and included 30 official shows, plus a number of impromptu performances, and it laid the foundation for what is now a sizable fan base in Fisher’s native Canada. He also has a history of busking in the more conventional manner—whatever it takes to get his music heard. We’re talkin’ grass-roots, interactive DIY to the max with this talented and dedicated—or maybe driven is a better word—young artist. \n\nFisher’s new album, Goodbye Blue Monday (released in the U.S. September 18 on Wind-up Records), is a timeless burst of acoustic rock & roll that’s brainy and hook-filled, playful and provocative, all at the same time. Take “Cigarette,” which employs the cancer stick as a metaphor for addictive relationships—the enticement, the yearning, the withdrawal and the damage. Or “Scar That Never Heals,” which examines the anatomy of heartbreak. At the same time, both are thoroughly infectious tracks with choruses that are, well, addictive. That’s Fisher’s M.O. \n\nThe album’s extremes are represented by the buoyant “High School” (a recut version of the single from Fisher’s second album, Let It Shine, which picked up substantial airplay in Canada) on the one hand, and the politically charged “American Girls” and “Lay Down (Ballad of Rigoberto Alpizar)” on the other. This is the sort of record that sounds like you’ve been playing it forever even as it explores themes that are altogether unprecedented—and that is no mean feat. Says Hawksley Workman (Tegan & Sara), who produced, played and sang backing vocals on the album, “Jeremy’s a brilliant and direct songwriter with a bright soul.”\n\nAs a curly-haired singer with an acoustic guitar, Fisher gets the requisite comparisons to Bob Dylan, while his boyish tenor, dexterous fingerpicking and electrifying hooks eerily recall Paul Simon. “It was a little weird to hear that sort of stuff at first,” he says, “but I’m really flattered that people see those resemblances, and I’m sure that some of the records Simon and Dylan listened to are in my collection—Delta blues singers like Charlie Patton, Robert Johnson, Mississippi John Hurt and Big Bill Broonzy, Alan Lomax’s field recordings, Depression-era stuff. For some reason, I identified with all that old stuff when I was going through this renaissance in my songwriting—it’s what inspired me to continue making music.” \n\nWith one foot in roots idioms and the other in rock, Fisher has an unusually broad palate to work with. He spent by far the greater part of his career playing solo, and there’s a disarming spontaneity to his performances. “I’ve probably done 80 percent of my shows solo,” he says, “and I built my thing on top of that. When I was busking, I shed all the things I’d been doing that didn’t work—it developed my songwriting and my performing, and it built my confidence. I feel like I really came into my own performing on the street, and for a while that’s all I wanted to do. So it’s been a hard road trying to find the right band, and the newest incarnation of my band is starting to feel the closest to how comfortable I am as a solo performer.”\n\nAs committed as he is to having fun, Fisher is totally serious about his mission. “Music can do a lot of things,” he says, “but the greatest thing music can do is to make listening to a record the best three-and-a-half minutes of your day, or the best night of your week when you go to a show. It’s an escape from the hum-drum; it’s a drug that’s actually good for you. What I’m really trying to do is relate to people on a human level, and in my songs I tend to gravitate toward the human element of a story. For example, ‘Lay Down (Ballad of Rigoberto Alpizar)’ is about a guy who got murdered by an air marshal in the Miami Airport, but the viewpoint I use is the fictitious voice of the guy who shot him. So what I’m trying to do is communicate with people, and music is the best way I know how to do that. Music is such a mysterious thing, because it’s pretty much invisible, but a song can convey an amazing amount of emotion.”\n\nThat’s certainly the case with “American Girls,” which boasts another audaciously unsettling premise. “I wrote the chorus and lyrics immediately after reading the verdict on Private Lynndie England, who was the Abu Ghraib soldier who took all the photos with the Iraqi prisoners,” Fisher points out. It was so controversial and got so much attention, and she ended up being the scapegoat, but the verdict got buried in the back of the newspapers because it wasn’t sensational enough, and I didn’t want to let it go by without being documented. That song and ‘The Ballad of Rigoberto Alpizar’ are both about events that are monumental but not nearly as important as the fact that a certain superstar wasn’t wearing underwear when she got out of a limo. This is a very weird culture we live in.” \n\nAs for the making of that little video with the big impact, well, there was a serious purpose behind that too. “I wanted there to be something out there that was from me—that wasn’t based on marketing—using what I had in my apartment as creatively as possible,” he says. “Just to be out there and relate to people in that way, and say, ‘Here’s something from me that I made for you. I can’t answer every email, but I want you to know that we’re communicating.’ It’s very important to me to be authentic in everything I do and find a creative way to get it all done. I remember being 12 years old and sending fan letters to pro skateboarders, hoping they’d get to read it and hoping they might write back. So I know what it feels like.”\n\nA lot of time and effort went into that $60 clip. “The cigarette was made out of modeling clay,” Fisher explains, “and every frame was an individual picture I took, so it was a very long process, especially posing the cigarette with live people and getting them to do certain things at the same time. It’s pretty involved. Like, you sit there for an hour moving this little cigarette around, and then you push the spacebar and you have 10 seconds of footage, but somehow it’s rewarding. It’s funny, because I’m not all that patient a person.” He pauses for a beat. “But I’m dedicated.”\n\nNo two ways about that. For Jeremy Fisher, it’s all about attending to the details, telling the truth, being real and giving people the best three-and-a-half minutes of their day.\n\n\n <a href=\"https://www.last.fm/music/Jeremy+Fisher\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
