{"artist":{"name":"Jerry Goldsmith","mbid":"db403e3d-4753-45d6-8fcb-94db03e882e1","url":"https://www.last.fm/music/Jerry+Goldsmith","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/05bcfb1485438eff0cbf6b53b2cf8486.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/05bcfb1485438eff0cbf6b53b2cf8486.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/05bcfb1485438eff0cbf6b53b2cf8486.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05bcfb1485438eff0cbf6b53b2cf8486.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05bcfb1485438eff0cbf6b53b2cf8486.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05bcfb1485438eff0cbf6b53b2cf8486.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"350076","playcount":"5160552"},"similar":{"artist":[{"name":"Dennis McCarthy","url":"https://www.last.fm/music/Dennis+McCarthy","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ac146d565395410186406f9996d369ca.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ac146d565395410186406f9996d369ca.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ac146d565395410186406f9996d369ca.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ac146d565395410186406f9996d369ca.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ac146d565395410186406f9996d369ca.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ac146d565395410186406f9996d369ca.png","size":""}]},{"name":"James Horner","url":"https://www.last.fm/music/James+Horner","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ff3622ead1b542df9a46af828127f3e7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ff3622ead1b542df9a46af828127f3e7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ff3622ead1b542df9a46af828127f3e7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ff3622ead1b542df9a46af828127f3e7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ff3622ead1b542df9a46af828127f3e7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ff3622ead1b542df9a46af828127f3e7.png","size":""}]},{"name":"Cliff Eidelman","url":"https://www.last.fm/music/Cliff+Eidelman","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d994fea926944ec78098b55d52f74a87.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d994fea926944ec78098b55d52f74a87.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d994fea926944ec78098b55d52f74a87.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d994fea926944ec78098b55d52f74a87.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d994fea926944ec78098b55d52f74a87.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d994fea926944ec78098b55d52f74a87.png","size":""}]},{"name":"Alan Silvestri","url":"https://www.last.fm/music/Alan+Silvestri","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/39a5d76d172b184a6ebf69669ebb9a00.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/39a5d76d172b184a6ebf69669ebb9a00.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/39a5d76d172b184a6ebf69669ebb9a00.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/39a5d76d172b184a6ebf69669ebb9a00.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/39a5d76d172b184a6ebf69669ebb9a00.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/39a5d76d172b184a6ebf69669ebb9a00.png","size":""}]},{"name":"John Williams","url":"https://www.last.fm/music/John+Williams","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d29b3a48e1bb4c888aeb7a0fae62d4f0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d29b3a48e1bb4c888aeb7a0fae62d4f0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d29b3a48e1bb4c888aeb7a0fae62d4f0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d29b3a48e1bb4c888aeb7a0fae62d4f0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d29b3a48e1bb4c888aeb7a0fae62d4f0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d29b3a48e1bb4c888aeb7a0fae62d4f0.png","size":""}]}]},"tags":{"tag":[{"name":"Soundtrack","url":"https://www.last.fm/tag/Soundtrack"},{"name":"instrumental","url":"https://www.last.fm/tag/instrumental"},{"name":"Classical","url":"https://www.last.fm/tag/Classical"},{"name":"score","url":"https://www.last.fm/tag/score"},{"name":"composers","url":"https://www.last.fm/tag/composers"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Jerry+Goldsmith/+wiki"}},"published":"23 May 2006, 22:09","summary":"Jerrald King \"Jerry\" Goldsmith (February 10, 1929 – July 21, 2004) was a famous and prolific American film score composer from Los Angeles, California. Goldsmith was nominated for eighteen Academy Awards (winning one, for The Omen), and also won five Emmy Awards.\n\nGoldsmith learned to play the piano at age six. At fourteen, he studied composition, theory and counterpoint with teachers Jacob Gimpel and Mario Castelnuovo-Tedesco. Goldsmith attended the University of Southern California <a href=\"https://www.last.fm/music/Jerry+Goldsmith\">Read more on Last.fm</a>","content":"Jerrald King \"Jerry\" Goldsmith (February 10, 1929 – July 21, 2004) was a famous and prolific American film score composer from Los Angeles, California. Goldsmith was nominated for eighteen Academy Awards (winning one, for The Omen), and also won five Emmy Awards.\n\nGoldsmith learned to play the piano at age six. At fourteen, he studied composition, theory and counterpoint with teachers Jacob Gimpel and Mario Castelnuovo-Tedesco. Goldsmith attended the University of Southern California, where he attended courses taught by veteran composer Miklós Rózsa. Goldsmith developed an interest in writing scores for movies after being inspired by Rózsa.\n\nIn 1950, Goldsmith found work at CBS as a clerk in the network's music department. He soon began writing scores for radio (including CBS Radio Workshop, Frontier Gentleman, for which he wrote the title music, and Romance) and CBS television shows (including The Twilight Zone). He remained at CBS until 1960, after which he moved on to Revue Studios, where he would compose music for television shows such as Dr. Kildare and The Man from U.N.C.L.E.\n\nIn 1963, Goldsmith was first nominated for an Oscar for John Huston's film Freud. Shortly after, he met Alfred Newman, who was instrumental in Goldsmith's hiring by 20th Century-Fox. Goldsmith went on to collaborate with many great filmmakers throughout his career, including Robert Wise (The Sand Pebbles, Star Trek: The Motion Picture), Howard Hawks (Rio Lobo), Otto Preminger (In Harm's Way), Roman Polanski (Chinatown), Steven Spielberg/Tobe Hooper (Poltergeist), and Ridley Scott (Alien). But his most fruitful collaboration was arguably that with Franklin Schaffner (for whom Goldsmith scored Planet of the Apes, Patton and Papillon).\n\nGoldsmith was perhaps the most eclectic composer in cinema, providing tailor-made scores for many different genres, including war films (The Blue Max), film noir (L.A. Confidential), action movies (First Blood), erotic thrillers (Basic Instinct), sports pictures (Rudy), westerns (Breakheart Pass), comic book adaptations (Supergirl), and science fiction (Total Recall and five Star Trek films). His ability to write visceral, terrifying music won him his only Academy Award for his violent choral/orchestral score for The Omen. He also was awarded with Emmys for television scores like the Holocaust drama QB VII, and the epic Masada, as well as the theme from Star Trek: Voyager.\n\nGoldsmith was also the composer of the Carolco Pictures logo and the late-1990s Universal Studios logo.\n\nDue to his wide grasp of different musical techniques, Goldsmith's scores were never as quickly identifiable as those of composers with narrower abilities. While his work could be as light-hearted as the main title of Dennis the Menace, it also included QB VII's \"Kaddish for the Six Million\", a choral work honoring the victims of the Holocaust.\n\nGoldsmith was a lover of innovation and adaptation, and the use of strange instruments. His score for Alien for example featured an orchestra augmented by shofar, steel drum and serpent (a Medieval instrument), while creating further \"alien\" sounds by filtering string pizzicati through an echoplex. Many of the instruments in Alien were used in such atypical ways they were virtually unidentifiable. Goldsmith was also a studious researcher of ethnic music, and found uses for South American Zampoñas in Under Fire, native tribal chants in Congo, and brilliantly interwove a traditional Irish folk melody with African rhythms in The Ghost and the Darkness. His genius for creation and innovation delighted his fans - and often intimidated his peers. Henry Mancini, another great film music composer, once admitted that Goldsmith \"scares the hell out of us.\"\n\nGoldsmith also composed for The Waltons TV series (including its famous theme), a fanfare for the Academy Awards presentation show and the score for one of the Disneyland Resort's most popular attractions, Soarin' Over California. Goldsmith never cared for the term \"film composer\", as he also wrote a fair amount of \"absolute\" music for the concert hall as well (such as \"Music For Orchestra\", which was premiered by Leonard Slatkin and the Minnesota Orchestra in 1970).\n\nOne of Goldsmith's least-heard (and what some movie fans call his greatest) scores was for the 1985 Ridley Scott film Legend. Director Scott had commissioned Goldsmith to write an orchestral score for the movie, but was initially heard only in European theatres, and replaced with electronic music and pop songs for the American release due to studio politics (it has since been restored for DVD release).\n\nOver time Goldsmith's interest in unusual instruments seemed to wane, and he relied more and more on synthesisers in searching for new timbres. While his electronic work was unquestionably inventive, many—colleagues and fans alike—began to feel he was becoming a little too synthesised. Some of his 80s work sounds a little dated today, owing to synth timbres (particularly on the Yamaha DX7) which were common to the era. That said, Goldsmith also got some extraordinary sounds out of the DX7 and other digital keyboards of the 80s, many of which remain quite arresting 20 years on.\n\nAlthough born and raised in Los Angeles, Goldsmith had tremendous affection, for the city of London (fellow virtuoso composer Elliot Goldenthal also shares this same affection), where he recorded many of his scores, and even maintained a home for a time. He also conducted many concerts of his music in London, and once said during an interview on BBC Radio that he felt the British musicians were the best in the world.\n\nGoldsmith's final theatrical score was for the 2003 live action/animated film Looney Tunes: Back in Action. His score for the Richard Donner film Timeline the same year was rejected during the complicated post-production process. However, Goldsmith's score has since been released on CD, not long after the composer's death.\n\nA list of his most distinguished film scores, most of which were Oscar nominated and all of which exhibit his unerring dramatic instinct, might by general consensus include Freud, A Patch of Blue, The Blue Max, The Sand Pebbles, Planet of the Apes, Patton, Papillon, Chinatown, The Wind and the Lion, The Omen, Logan's Run, Islands in the Stream (acknowledged by Goldsmith as his own personal favorite), The Boys from Brazil, Capricorn One, Alien, The First Great Train Robbery, Star Trek: The Motion Picture, Twilight Zone: The Movie, Lionheart, The Russia House, Total Recall, Medicine Man, Basic Instinct, Hoosiers, The Edge, The 13th Warrior and The Mummy. Goldsmith's Oscar-nominated score for Under Fire (1983) prominently featured solo guitar work by Pat Metheny. Of all the scores he wrote, Goldsmith has said that Basic Instinct was the hardest and most complex, according to a mini-documentary on the special edition DVD.\n\nIt is said that the prologue to the 1965 movie, The Agony and The Ecstasy, written in the days when he was lesser-known, remained up until the very end of his career one of Jerry Goldsmith's personal favourites. <a href=\"https://www.last.fm/music/Jerry+Goldsmith\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
