{"artist":{"name":"Jerry Lewis","mbid":"b59ac58d-036e-4bba-8112-c32a34c4575b","url":"https://www.last.fm/music/Jerry+Lewis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/45fc80068d704e5194e73938dc8348ac.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/45fc80068d704e5194e73938dc8348ac.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/45fc80068d704e5194e73938dc8348ac.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/45fc80068d704e5194e73938dc8348ac.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/45fc80068d704e5194e73938dc8348ac.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/45fc80068d704e5194e73938dc8348ac.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"10085","playcount":"43487"},"similar":{"artist":[{"name":"Winston Blake (Judge Winchester)","url":"https://www.last.fm/music/Winston+Blake+(Judge+Winchester)","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Ramon & The Crystalites","url":"https://www.last.fm/music/Ramon+&+The+Crystalites","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0ddceb8504fe4b7496ccbe19cd017c8e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0ddceb8504fe4b7496ccbe19cd017c8e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0ddceb8504fe4b7496ccbe19cd017c8e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0ddceb8504fe4b7496ccbe19cd017c8e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0ddceb8504fe4b7496ccbe19cd017c8e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0ddceb8504fe4b7496ccbe19cd017c8e.png","size":""}]},{"name":"Truth Fact & Correct","url":"https://www.last.fm/music/Truth+Fact+&+Correct","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Brent Dowe","url":"https://www.last.fm/music/Brent+Dowe","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2d75fe147f3946a1a64cd085c060fbcb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2d75fe147f3946a1a64cd085c060fbcb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2d75fe147f3946a1a64cd085c060fbcb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2d75fe147f3946a1a64cd085c060fbcb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2d75fe147f3946a1a64cd085c060fbcb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2d75fe147f3946a1a64cd085c060fbcb.png","size":""}]},{"name":"The Jay Boys","url":"https://www.last.fm/music/The+Jay+Boys","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6c2b8c0b117b40809b4f6101e93a2aed.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6c2b8c0b117b40809b4f6101e93a2aed.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6c2b8c0b117b40809b4f6101e93a2aed.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c2b8c0b117b40809b4f6101e93a2aed.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c2b8c0b117b40809b4f6101e93a2aed.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c2b8c0b117b40809b4f6101e93a2aed.png","size":""}]}]},"tags":{"tag":[{"name":"reggae","url":"https://www.last.fm/tag/reggae"},{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"oldies","url":"https://www.last.fm/tag/oldies"},{"name":"funny","url":"https://www.last.fm/tag/funny"},{"name":"trojan","url":"https://www.last.fm/tag/trojan"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Jerry+Lewis/+wiki"}},"published":"01 Jan 2010, 06:14","summary":"# Jerry Lewis is a 1970's reggae artist. His songs \"Rhythm Pleasure\" and \"Burning Wire\" are on several reggae compilations. His toasting was backed by The Aggrovators, a dub/reggae backing band in the 1970s and 1980s, one of the main session bands of producer Bunny Lee.\n\n# Jerry Lewis (J. Levitch, March 16, 1926 – August 20, 2017) was an American actor, comedian, singer, film producer, film director, screenwriter and humanitarian. He is known for his slapstick humor in film, television, stage and radio. <a href=\"https://www.last.fm/music/Jerry+Lewis\">Read more on Last.fm</a>","content":"# Jerry Lewis is a 1970's reggae artist. His songs \"Rhythm Pleasure\" and \"Burning Wire\" are on several reggae compilations. His toasting was backed by The Aggrovators, a dub/reggae backing band in the 1970s and 1980s, one of the main session bands of producer Bunny Lee.\n\n# Jerry Lewis (J. Levitch, March 16, 1926 – August 20, 2017) was an American actor, comedian, singer, film producer, film director, screenwriter and humanitarian. He is known for his slapstick humor in film, television, stage and radio. He and Dean Martin were partners as the hit popular comedy duo of Martin and Lewis aka Dean Martin & Jerry Lewis. Following that success, he was a solo star in motion pictures, nightclubs, television shows, concerts, album recordings and musicals.\n\nLewis initially gained attention as part of a double act with singer Dean Martin, who served as straight man to Lewis' zany antics in the Martin and Lewis comedy team. The performers were different from most other comedy acts of the time because they relied on their interaction instead of planned skits. After forming in 1946, they quickly rose to national prominence, first with their popular nightclub act, next as stars of their own radio program. The two men made many appearances on early live television, their first on the June 20, 1948, debut broadcast of Toast of the Town on CBS (later officially renamed The Ed Sullivan Show on September 25, 1955).\n\nThis was followed on October 3, 1948, by an appearance on the NBC series Welcome Aboard, then a stint as the first of a series of hosts of The Colgate Comedy Hour in 1950. Just before appearing on The Colgate Comedy Hour, Lewis hired Norman Lear and Ed Simmons to become regular writers for the Martin and Lewis bits. The duo began their Paramount film careers as ensemble players in My Friend Irma (1949), based on the popular radio series of the same name. This was followed by a sequel My Friend Irma Goes West (1950).\n\nStarting with At War with the Army (1950), Martin and Lewis were the stars of their own vehicles in fourteen additional titles, That's My Boy (1951), Sailor Beware (1952), Jumping Jacks (1952), (plus appearing in the Crosby and Hope film, Road to Bali (1952) as cameos) The Stooge (1952), Scared Stiff (1953), The Caddy (1953), Money from Home (1953), Living It Up (1954), 3 Ring Circus (1954), You're Never Too Young (1955), Artists and Models (1955) and Pardners (1956) at Paramount, ending with Hollywood or Bust (1956). All sixteen movies were produced by Hal B. Wallis. Attesting to the comedy team's popularity, DC Comics published the best-selling The Adventures of Dean Martin and Jerry Lewis comics from 1952 to 1957. In 1954, the team appeared on episode 191 of What's My Line? as mystery guests. As Martin's roles in their films became less important over time, the partnership came under strain. Martin's participation became an embarrassment in 1954 when Look magazine published a publicity photo of the team for the magazine cover but cropped Martin out. The partnership ended on July 24, 1956.\n\nBoth Martin and Lewis went on to successful solo careers, and neither would comment on the split nor consider a reunion. They made occasional public appearances together until 1961, but were not seen together again until a surprise reunion on a Muscular Dystrophy Telethon in 1976, arranged by Frank Sinatra. The pair eventually reconciled in the late 1980s after the death of Martin's son, Dean Paul Martin, in 1987. The two men were seen together on stage for the last time when Martin was making what would be his final live performance at Bally's Hotel and Casino in Las Vegas in 1989. Lewis wheeled out a cake for Martin's 72nd birthday, sang \"Happy Birthday\" to him, and joked, \"Why we broke up, I'll never know.\"\n\nAfter his partnership with Martin ended, he and his wife Patty took a vacation in Las Vegas to consider the direction of his career. He felt his life was in a crisis state: \"I was unable to put one foot in front of the other with any confidence. I was completely unnerved to be alone ...\" While there, he received an urgent request from his friend Sid Luft, who was Judy Garland's husband and manager, saying that she couldn't perform that night in Las Vegas due to strep throat, and asking Lewis to fill in. However, Lewis had not sung on a stage since he was five years old, twenty-five years before. But he appeared before the audience of a thousand nonetheless, doing jokes and clowning with the audience while Garland sat off-stage, watching. He then sang a rendition of a song he'd learned as a child, \"Rock-A-Bye Baby\", along with \"Come Rain or Come Shine.\" Lewis recalled, \"When I was done, the place exploded. I walked off the stage knowing I could make it on my own...\" At his wife's pleading, Lewis used his own money to record the songs on a single.\n\nCapitol Records heard it and insisted he do an album. The album, Jerry Lewis Just Sings, went to number 3 on the Billboard charts, staying near the top for four months and selling a million and a half copies. Having now proven he could sing and do live shows, he began performing regularly at the Sands Hotel in Las Vegas beginning in late 1956, which marked a turning point in his life and career. The Sands signed him for five years, to perform six weeks each year, and paid him the same amount they had paid Martin and Lewis as a team. The critics gave him positive reviews: \"Jerry was wonderful. He has proved that he can be a success by himself,\" wrote one.[19] He appeared on his first solo television show for NBC in January 1957, followed by performances for clubs in Miami, New York, Chicago and Washington. In February he followed Judy Garland at the Palace Theater in New York; ex-partner Martin called during this period to wish him the best of luck. \"I've never been happier,\" said Lewis. \"I have peace of mind for the first time.\"\n\nLewis rose to stardom as a solo act in television and movies starting with the first of six appearances on What's My Line? from 1956 to 1966, then starred in The Jazz Singer episode of Startime. Lewis remained at Paramount and became a comedy star in his own right with his first film as a solo comic, The Delicate Delinquent (1957). Meanwhile, DC Comics published a new comic book series titled The Adventures of Jerry Lewis, running from 1957 to 1971. Teaming with director Frank Tashlin, whose background as a Warner Bros. Looney Tunes cartoon director suited Lewis's brand of humor, he starred in five more films, The Sad Sack (1957), Rock-A-Bye Baby (1958), The Geisha Boy (1958), Don't Give Up The Ship (1959) and even appeared uncredited as Itchy McRabbitt in Li'l Abner (1959). By the end of his contract with producer Hal B. Wallis, Lewis had several productions of his own under his belt. In 1959, a contract between Paramount Pictures and Jerry Lewis Productions was signed specifying a payment of $10 million plus 60% of the profits for 14 films over a seven-year period. In 1960, Lewis finished his contract with Wallis with Visit to a Small Planet (1960) and wrapped up work on his own production Cinderfella, which was postponed for a Christmas 1960 release and Paramount, needing a quickie feature film for its summer 1960 schedule, held Lewis to his contract to produce one.\n\nLewis came up with The Bellboy (1960). Using the Fontainebleau Hotel in Miami as his setting—and on a small budget, with a very tight shooting schedule, and no script—Lewis shot the film by day and performed at the hotel in the evenings.[22] Bill Richmond collaborated with him on the many sight gags. Lewis later revealed that Paramount was not happy financing a 'silent movie' and withdrew backing. Lewis used his own funds to cover the $950,000 budget. Lewis would next star in an episode of Celebrity Golf. During production Lewis pioneered the technique of using video cameras and multiple closed circuit monitors, which allowed him to review his performance instantly. His techniques and methods of video assist, documented in his book and his USC class, enabled him to complete most of his films on time and under budget. He popularized the practice, though he did not explicit invent it. Lewis followed The Bellboy by directing several more films that he co-wrote with Richmond while some were directed by Tashlin, including The Ladies Man (1961), The Errand Boy (1961), It's Only Money (1962) and The Nutty Professor (1963). Lewis did a cameo appearance in It's a Mad, Mad, Mad, Mad World (1963). Further on, more Lewis films were Who's Minding the Store? (1963), The Patsy (1964) and The Disorderly Orderly (1964). Also in 1961, Lewis guest starred in an episode of The Garry Moore Show. Lewis hosted two different versions of The Jerry Lewis Show (a 1963 lavish, big-budget 13-week show for ABC and a 1967 one-hour variety show for NBC).\n\nLewis directed and co-wrote The Family Jewels (1965) about a young heiress who must choose among six uncles, one of whom is up to no good and out to harm the girl's beloved bodyguard who practically raised her. Lewis played all six uncles and the bodyguard. Lewis would next appear in Boeing Boeing (1965). Also in 1965, Lewis made television appearances on Ben Casey, The Andy Williams Show and Hullabaloo. By 1966, Lewis, then 40, was no longer an angular juvenile, his routines seemed more labored and his box office appeal waned to the point where Paramount Pictures new executives felt no further need for the Lewis comedies and did not wish to renew his 1959 profit sharing contrac Undaunted, Lewis packed up and went to Columbia Pictures, where he made Three On A Couch (1966), then appeared in Way...Way Out (1966) for 20th Century Fox. During 1966, Lewis guest starred in Batman, Password and in a pilot for Sheriff Who. Lewis continued with more movies, such as The Big Mouth (1967) and Don't Raise the Bridge, Lower the River (1968).\n\nLewis appeared on an episode of Playboy After Dark. He then starred in Hook, Line & Sinker (1969). Lewis taught a film directing class at the University of Southern California in Los Angeles for a number of years and his students included Steven Spielberg and George Lucas. In 1968, he screened Spielberg's early film Amblin' and told his students, \"That's what filmmaking is all about.\" In 1970, Lewis guest appeared on The Red Skelton Show, then directed an episode of The Bold Ones. Lewis guest starred in an episode of The Engelbert Humperdinck Show.\n\nHe then directed and made his first offscreen voice performance as a bandleader in One More Time (1970), which starred Sammy Davis Jr. (a friend of Lewis) and also produced, directed and starred in Which Way to the Front? (1970). He would then make and star in the unreleased The Day the Clown Cried (1972), a drama set in a Nazi concentration camp. Lewis rarely discusses the film, but once suggested that litigation over post-production finances prevented the film's completion and release. However, he admitted during his book tour for Dean and Me that a major factor for the film's burial is that he is not proud of the effort. In 1973, Lewis was a guest on The Dick Cavett Show, then appeared on Celebrity Sportsman in 1974. Lewis appeared in a revival of Hellzapoppin' with Lynn Redgrave in 1976, but it closed on the road before reaching Broadway.[30] In 1979, Lewis guest hosted (as ringmaster) in Circus of the Stars.\n\nAfter an absence of 11 years, Lewis returned to film in Hardly Working (1981), a movie in which he both directed and starred. Despite being panned by critics, the movie eventually earned $50 million. Lewis next appeared in Martin Scorsese's film The King of Comedy (1983), in which he portrayed a late-night television host plagued by two obsessive fans, played by Robert De Niro and Sandra Bernhard. Lewis guest hosted Saturday Night Live and also appeared in Cracking Up a.k.a. Smorgasbord (1983) and Slapstick (Of Another Kind) (1984). In France, Lewis starred in both To Catch a Cop a.k.a. The Defective Detective (1984) and How Did You Get In? We Didn't See You Leave (1984). Lewis has stated that as long as he has control over distribution of those movies, they will never have an American release. Meanwhile, a syndicated talk show Lewis hosted for Metromedia in 1984 was not continued beyond the scheduled five shows.\n\nLewis starred in the ABC televised drama movie Fight For Life (1987) with Patty Duke. He starred in five episodes of Wiseguy, then appeared in Cookie (1989). Lewis had a cameo in Mr. Saturday Night (1992) then in 1993, guest appeared in an episode of Mad About You as an eccentric billionaire. Lewis made his Broadway debut, as a replacement cast member playing the devil in a revival of Damn Yankees, choreographed by Rob Marshall. while also starring in the film Arizona Dream (1994), as a car salesman uncle. Lewis then starred as a father of a young comic in Funny Bones (1995). In 2003, Lewis did a guest voice as Professor Frink's dad in an episode of The Simpsons then in 2006, guest appeared in an episode of Law & Order: Special Victims Unit.\n\n\nLewis has remained popular in France, evidenced by consistent praise by French critics in the magazine Cahiers du Cinéma for his absurd comedy, in part because he had gained respect as an auteur who had total control over all aspects of his films, comparable to Howard Hawks and Alfred Hitchcock. Liking Lewis has long been a common stereotype about the French in the minds of many English-speakers, and is often the object of jokes in English-speaking world pop culture. \"That Americans can't see Jerry Lewis's genius is bewildering,\" says N. T. Binh, a French film magazine critic. Such bewilderment was the basis of the book Why the French Love Jerry Lewis. In 2012, Lewis directed a musical theatre version of The Nutty Professor at the Tennessee Performing Arts Center in Nashville from July 31 to August 19 over the summer. In Brazil, Lewis appeared in Till Luck Do Us Part 2 (2013). He then next starred in a small role in the crime drama The Trust (2016). Lewis made a comeback in a lead role in Max Rose (2016).\n\nIn December 2016, Lewis expressed interest in making another film.\n\nLewis served as national chairman of the Muscular Dystrophy Association and hosted the live Labor Day broadcast of the Jerry Lewis MDA Telethon for 44 years. Lewis received several awards for lifetime achievements from the American Comedy Awards, Los Angeles Film Critics Association, Venice Film Festival, Academy of Motion Picture Arts and Sciences and was honored with two stars on the Hollywood Walk of Fame.\nJerry Lewis died August 20, 2017. <a href=\"https://www.last.fm/music/Jerry+Lewis\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
