{"artist":{"name":"Jewel","mbid":"d5b637f0-74b8-4df6-bddf-dc3784a6881a","url":"https://www.last.fm/music/Jewel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/571de3760ca6556585f62f598f8ce626.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/571de3760ca6556585f62f598f8ce626.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/571de3760ca6556585f62f598f8ce626.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/571de3760ca6556585f62f598f8ce626.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/571de3760ca6556585f62f598f8ce626.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/571de3760ca6556585f62f598f8ce626.png","size":""}],"streamable":"0","ontour":"1","stats":{"listeners":"837487","playcount":"10511316"},"similar":{"artist":[{"name":"Sarah McLachlan","url":"https://www.last.fm/music/Sarah+McLachlan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b7128d8127b54d86bc6eb3c558f9ef56.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b7128d8127b54d86bc6eb3c558f9ef56.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b7128d8127b54d86bc6eb3c558f9ef56.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b7128d8127b54d86bc6eb3c558f9ef56.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b7128d8127b54d86bc6eb3c558f9ef56.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b7128d8127b54d86bc6eb3c558f9ef56.png","size":""}]},{"name":"Lisa Loeb","url":"https://www.last.fm/music/Lisa+Loeb","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/264a80cfacdb4dac85356f4f9ea015e2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/264a80cfacdb4dac85356f4f9ea015e2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/264a80cfacdb4dac85356f4f9ea015e2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/264a80cfacdb4dac85356f4f9ea015e2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/264a80cfacdb4dac85356f4f9ea015e2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/264a80cfacdb4dac85356f4f9ea015e2.png","size":""}]},{"name":"Paula Cole","url":"https://www.last.fm/music/Paula+Cole","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e0d11637c1bb4c208bee0e767b81ffe7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e0d11637c1bb4c208bee0e767b81ffe7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e0d11637c1bb4c208bee0e767b81ffe7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0d11637c1bb4c208bee0e767b81ffe7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0d11637c1bb4c208bee0e767b81ffe7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0d11637c1bb4c208bee0e767b81ffe7.png","size":""}]},{"name":"Heather Nova","url":"https://www.last.fm/music/Heather+Nova","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a4a9c2b5fe2d440d973fef76d2490bd3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a4a9c2b5fe2d440d973fef76d2490bd3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a4a9c2b5fe2d440d973fef76d2490bd3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a4a9c2b5fe2d440d973fef76d2490bd3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a4a9c2b5fe2d440d973fef76d2490bd3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a4a9c2b5fe2d440d973fef76d2490bd3.png","size":""}]},{"name":"Sheryl Crow","url":"https://www.last.fm/music/Sheryl+Crow","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8dc870a42c0341206c1dfba9fb02f732.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8dc870a42c0341206c1dfba9fb02f732.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8dc870a42c0341206c1dfba9fb02f732.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8dc870a42c0341206c1dfba9fb02f732.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8dc870a42c0341206c1dfba9fb02f732.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8dc870a42c0341206c1dfba9fb02f732.png","size":""}]}]},"tags":{"tag":[{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"folk","url":"https://www.last.fm/tag/folk"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Jewel/+wiki"}},"published":"25 Feb 2006, 10:34","summary":"Jewel Kilcher (born May 23, 1974 in Payson, Utah, United States) is a singer, songwriter, actress, and poet, generally known just by her first name, Jewel. She has received four Grammy Award nominations.\n\nJewel is the daughter of Nedra Carroll, an artist and personal manager, and Atz Kilcher, an elementary school music teacher, folk singer and social worker. Her mother of Irish descent and her father is of Swiss-German origin. She is the cousin of actress Q'Orianka Kilcher. <a href=\"https://www.last.fm/music/Jewel\">Read more on Last.fm</a>","content":"Jewel Kilcher (born May 23, 1974 in Payson, Utah, United States) is a singer, songwriter, actress, and poet, generally known just by her first name, Jewel. She has received four Grammy Award nominations.\n\nJewel is the daughter of Nedra Carroll, an artist and personal manager, and Atz Kilcher, an elementary school music teacher, folk singer and social worker. Her mother of Irish descent and her father is of Swiss-German origin. She is the cousin of actress Q'Orianka Kilcher. She spent most of her young life in Homer, Alaska, United States, living with her father. The home she grew up in did not have indoor plumbing; it had a simple outhouse instead. She and her father sometimes earned a living by singing in bars and taverns. It was from these experiences she learned to yodel, a quality demonstrated in many of her songs. Her father was a Mormon, but they stopped attending the church shortly before she turned eight. Yule Kilcher, her grandfather, was a state senator involved in drafting Alaska's constitution for its admission into a state from a territory in 1959.\n\nDuring high school, Jewel was known to spell her name \"Jule\" or \"Juel,\" but she attributes this to simply playing with her name.\n\nJewel learned to play the guitar while at the Interlochen Arts Academy in Interlochen, Michigan, United States where she majored in operatic voice. She started writing songs at the age of seventeen.\n\nFor a time, she was poverty-stricken and lived in her van while traveling about the country doing street performances and small gigs. She gained some recognition by singing at the Innerchange Coffeehouse and Java Joe's in San Diego, California, United States. Her friend Steve Poltz's band, The Rugburns, played at the same venues. Jewel later collaborated with Poltz on some of her songs, including \"You Were Meant For Me\" (He also appeared in the second, best-known, video for this song). The Rugburns opened for Jewel on her Tiny Lights tour in 1997. Poltz appeared in Jewel's band on the Spirit World Tour 1999 playing guitar.\n\nIn 1993, Michael Balzary (better known by the stage name – Flea) of the rock band Red Hot Chili Peppers met Jewel after he saw her perform at a local cafe. He went back to her van where she was living, where she sang a few of her songs to him. He described her singing voice as being \"beautiful\" and \"breathtaking\".\n\nJewel was discovered by Inga Vainshtein in August 1993, when a musician from a local San Diego band, Rust, whom Vainshtein was managing at the time, called to tell her about a girl surfer who sang at a local coffee shop on Thursdays. Vainshtein drove to Innerchange coffee shop with a rep from Atlantic Records, and after the show they called Danny Goldberg, the head of Atlantic Records west coast operations, and asked him to pay for Jewel's demo. Vainshtein eventually became Jewel's manager, and was instrumental in creating a major bidding war, which led to Jewel's deal with Atlantic Records. She cut her debut album, Pieces of You, when she was nineteen and it was released in 1995. Jewel recorded \"Pieces of You\" in a studio on Neil Young's ranch, and was backed by his band, The Stray Gators, who played on Neil Young's \"Harvest\" and \"Harvest Moon\" albums. Part of the album was cut live at the Innerchange Coffeehouse in San Diego where she had risen to local fame. The album stayed on the Billboard 200 for an impressive two years, reaching number four at its peak. The album spawned the Top 10 hits \"You Were Meant for Me\", \"Who Will Save Your Soul\" and \"Foolish Games\". The album was a huge success and eventually sold over 12 million copies in the United States. alone, more than all of her subsequent albums put together.\n\nDue to her successes, she was chosen to sing the American national anthem at the opening of the Super Bowl in January 1998 in San Diego. She was introduced as \"San Diego's own Jewel!\" However, she was criticized for lip-syncing the anthem to a pre-recording. This was especially noticeable due to her missing her cue and not mouthing the first words.\n\nIn November 1998, Jewel released her second album, Spirit. The album peaked at #3 on the Billboard 200 and sold over 4 million copies in the United States. The songs \"Hands\" and \"Down So Long\" hit the Top 10. Other singles followed, a new version of \"Jupiter (Swallow The Moon)\", \"What's Simple Is True\", the theme song to her upcoming movie, and the charity single \"Life Uncommon\".\n\nA year later, In November 1999, Jewel released Joy: A Holiday Collection. The album sold over a million copies and peaked at #32 on the Billboard 200. She released a cover of \"Joy to the World\" from the album.\n\nIn November 2001, the album This Way was released. The album peaked at #9 on the Billboard 200 and sold over 1 million copies in the United States, standing as her most critically acclaimed album to date. Jewel hit the Top 10 with the song \"Standing Still\" and the Top 40 with the song \"Break Me\". Other singles released were \"This Way\" and \"Serve The Ego\", the latter giving Jewel her first number one club hit.\n\nIn 2003, Jewel released the album 0304. She writes in the liner notes, \"I wanted to make a record that was a modern interpretation of big band music. A record that was lyric driven, like Cole Porter, that also had a lot of swing. And a lot of it is thanks to Lester, because when I told him I wanted to make a record that combined dance, urban, and folk music, he didn't look at me like I was crazy.\" While some fans considered 0304 an innovative album that held to the tradition of her previous albums, others felt that it was too much of a departure from the style of her previous albums. Following the limited success of \"Serve the Ego\", Jewel moved to a more pop-oriented sound with the release of the single \"Intuition\". The song, which strays from her usual folk style with simple guitar instrumentation, starts off with a French accordion and experiments with pop beats using synthesizers. The song was successful, reaching #5 on the Billboard Adult Top 40. However, a number of Jewel's fans criticized her for abandoning her traditional folk style in exchange for a new pop sound. Accusations of \"selling out\" for personal gain, among other things, were made. Despite the different sound style, the song is lyrically similar to her previous work. It has a number of references to culture, including mentioning celebrities such as pop star Jennifer Lopez, model Kate Moss, magazines, film culture and commercialism.\n\nOn May 2, 2006, Jewel released her sixth album, Goodbye Alice In Wonderland. The album received mixed reviews, but still managed to debut at #8 on the Billboard Albums Chart. The album sold 82,000 copies in its first week out. The lead single \"Again and Again\" has had moderate success on Adult Top 40 Radio, peaking at #16. The second single, \"Good Day\", was released to radio in late June but failed to gain any traction on the radio airplay charts. Later, a video for \"Stephenville, TX\", her next single, has been seen on Yahoo! Launch.\n\nAs of December 2006, the album barely sold 270,000 copies. It is notable in that it is the only Jewel album not to achieve Gold certification, even though it has been hailed as arguably one of her best albums. As one music critic, Timothy Duggan, notes: \"This album showcases Jewel's unique talent as a lyricist, alongside a definite growth in her musicianship. It is what 'Pieces of You' might have been had Jewel had the musical knowledge then that she has now. A very satisfying work, all in all\". Rolling Stone however, called the album \"overdone and undercooked\" with a rating of 2 stars out of 5.\n\nIn early February 2007, Jewel recorded a duet with Jason Michael Carroll, \"No Good in Goodbye (With Jewel)\", that was featured on Carroll's debut CD, \"Waitin' in the Country\". She also made a promotional appearance on the T in Boston for the Verizon Yellow Pages, playing songs on a moving subway car and then doing an hour-long acoustic concert in South Station for a large crowd of adoring fans. In an interview with the Boston Globe, Jewel confirmed that she is no longer affiliated with a record label, confirming rumors that Atlantic Records failed to renew her contract after the lackluster sales of her then-latest album. She also hinted that she would like to do a country album next. She is working with John Rich of Big & Rich fame. He says that she is \"probably one of the greatest American singer-songwriters we have had\". He also said that \"every label in Nashville\" is talking to her now.\n\nIn November 2007, Jewel was signed to Valory Records, a newly formed division of the independent Big Machine Records label. Her first country album, Perfectly Clear, is currently scheduled for release on June 3, 2008; its lead single, Stronger Woman was released to country radio on January 17, 2008, and has entered the Top 20 on the Billboard Hot Country Songs charts. As of the April 26, 2008 country charts, the single was #13 on the charts, which is its peak position thus far.\n\nShe will tour with Brad Paisley, Chuck Wicks, and Julianne Hough on Paisley's 2008 tour.\n\nOfficial site: www.jeweljk.com\n\n\n <a href=\"https://www.last.fm/music/Jewel\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
