{"artist":{"name":"Jim Jones","mbid":"81148ae0-47e9-4830-ac97-8e69b6c71706","url":"https://www.last.fm/music/Jim+Jones","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/108643a6701645b7baacfd039e486434.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/108643a6701645b7baacfd039e486434.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/108643a6701645b7baacfd039e486434.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/108643a6701645b7baacfd039e486434.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/108643a6701645b7baacfd039e486434.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/108643a6701645b7baacfd039e486434.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"543078","playcount":"3103671"},"similar":{"artist":[{"name":"Juelz Santana","url":"https://www.last.fm/music/Juelz+Santana","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/867e7a647a7644a685d61c68baa327ef.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/867e7a647a7644a685d61c68baa327ef.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/867e7a647a7644a685d61c68baa327ef.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/867e7a647a7644a685d61c68baa327ef.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/867e7a647a7644a685d61c68baa327ef.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/867e7a647a7644a685d61c68baa327ef.png","size":""}]},{"name":"The Diplomats","url":"https://www.last.fm/music/The+Diplomats","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/81f306c437f947cfb6ca2d46dfebc546.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/81f306c437f947cfb6ca2d46dfebc546.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/81f306c437f947cfb6ca2d46dfebc546.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/81f306c437f947cfb6ca2d46dfebc546.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/81f306c437f947cfb6ca2d46dfebc546.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/81f306c437f947cfb6ca2d46dfebc546.png","size":""}]},{"name":"Cam'ron","url":"https://www.last.fm/music/Cam%27ron","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8c0824d963364c90baefc2ff844f2eb0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8c0824d963364c90baefc2ff844f2eb0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8c0824d963364c90baefc2ff844f2eb0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8c0824d963364c90baefc2ff844f2eb0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8c0824d963364c90baefc2ff844f2eb0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8c0824d963364c90baefc2ff844f2eb0.png","size":""}]},{"name":"Jadakiss","url":"https://www.last.fm/music/Jadakiss","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ba09d22fe758444bb39495fa90cf6c6d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ba09d22fe758444bb39495fa90cf6c6d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ba09d22fe758444bb39495fa90cf6c6d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba09d22fe758444bb39495fa90cf6c6d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba09d22fe758444bb39495fa90cf6c6d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba09d22fe758444bb39495fa90cf6c6d.png","size":""}]},{"name":"Max B","url":"https://www.last.fm/music/Max+B","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d763dc69c6e54c3ea84a8729d2962aa4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d763dc69c6e54c3ea84a8729d2962aa4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d763dc69c6e54c3ea84a8729d2962aa4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d763dc69c6e54c3ea84a8729d2962aa4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d763dc69c6e54c3ea84a8729d2962aa4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d763dc69c6e54c3ea84a8729d2962aa4.png","size":""}]}]},"tags":{"tag":[{"name":"rap","url":"https://www.last.fm/tag/rap"},{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"Dipset","url":"https://www.last.fm/tag/Dipset"},{"name":"east coast rap","url":"https://www.last.fm/tag/east+coast+rap"},{"name":"hip hop","url":"https://www.last.fm/tag/hip+hop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Jim+Jones/+wiki"}},"published":"11 Feb 2006, 20:31","summary":"DO NOT redirect Rev. Jim Jones here.\n\nThere are two artists by this name:\n\n1) Jim Jones is the stage name of American hip hop artist and director Joseph Guillermo Jones II.\n\n2) Jim Jones was a producer and experimental music artist best known as the guitarist for Pere Ubu.\n\n\n1) Fortitude, ambition and creative business tactics are at the forefront of Jim Jones’ career. The enigmatic Diplomat CEO and entrepreneur spent the past decade designing an empire that will solidify his place in Hip Hop history and beyond. <a href=\"https://www.last.fm/music/Jim+Jones\">Read more on Last.fm</a>","content":"DO NOT redirect Rev. Jim Jones here.\n\nThere are two artists by this name:\n\n1) Jim Jones is the stage name of American hip hop artist and director Joseph Guillermo Jones II.\n\n2) Jim Jones was a producer and experimental music artist best known as the guitarist for Pere Ubu.\n\n\n1) Fortitude, ambition and creative business tactics are at the forefront of Jim Jones’ career. The enigmatic Diplomat CEO and entrepreneur spent the past decade designing an empire that will solidify his place in Hip Hop history and beyond.\n\nAfter continued success with his Dipset crew and his Diplomat Record label, Jim’s solo album, On My Way To Church, debuted at #18 on Billboard Top 200 in August 2004, and has sold over 200,000 copies independently to date. The videos for the first single, “Certified Gangsta”, and second single, “Crunk Musik”, have received consistent airplay on both BET and MTV. Jim Jones is also exceedingly popular in the fast-paced world of mix-tape releases.\n\nBuilding upon successes from his record label to his new alcohol brand, Sizzurp, Jim Jones is preparing to release a new Documentary Film, currently titled THE JIM JONES PROJECT, which presents a candidly-told cautionary tale of a “gangsta” rapper in transition. A purposeful message in the documentary is intended to act as a deterrent for the self-destructive behaviors of at-risk youth who have taken the bravado of “gangsta” rap to heart.\n\nBronx-born-but Harlem raised, Jim Jones knew all to well at a very early age what the streets had to offer. While he experienced his share of trouble growing up in Harlem, he was fortunate enough to escape anything that would cause him to wind up as another statistic in the concrete jungle.\n\nIn addition to his many ventures, Jim Jones is also gaining respect for his role as a music video director winning several music award nominations. He created the vision behind several videos for Dipset emcee Cam’ron including “Oh Boy”, “Hey Ma” and “Get Em Girl/Killa Cam”, State Property’s “When You Hear That”, as well as his own popular “Certified Gangsta” and “How G Is This” videos.\n\nJim takes his ability to influence the world at large very serious, he continues to search for new ways to find social and political growth while progressing within the Hip Hop culture. Currently, Jim is an active participator in Russell Simmons’ Hip Hop Summit, The Andre Neal Foundation as well as the South East Queens Action Network for Public Schools, all which focus on building and strengthening the community through it’s youth, educating them on politics and teaching them how influential their voice is.\n\nEven his pursuit to bring the ideals of gangsta rap to the world with his Documentary Film, Jim makes it clear that he is no way advocating a movement toward it. “My advice for younger people is: Please don’t try this shit at home. There’s a difference between a gangsta and a gangbanger - a gangbanger is very ambitious, he has a fiery heart. When he knows how smart he is, he’ll turn into a gangsta. A gangsta becomes a businessman, because with power you gotta show restraint - you only show that power when your back is against the wall and people force you to come out swinging.” - Bio courtesy of Tygereye Entertainment\n\nAlong with fellow Harlem-based player Cam'ron, Jim Jones founded the Diplomat label, home to the Diplomats/Dipset and many of that crew's prolific solo activities. Though more of a businessman and behind-the-scenes figure than an MC (he was also named a director of AR at Warner Music Group in early 2005), Jones released solo albums in 2004 (On My Way to Church, which hit the Top 20 upon its August release) and 2005 (Diary of a Summer). Andy Kellman, All Music Guide\n\n2) Jim Jones (born James E. Jones, 1950 in Cleveland, Ohio. Died of a heart attack Feb 18 2008) graduated from Mayfield High School in 1968. He played baritone sax in the MHS Marching Band, alto sax in the concert band, and discovered an affinity for tape manipulation while in charge of the high school language lab. Jim attempted two quarters at Cuyahoga Community College in '69, but his interest in music won out. He formed the short-lived band, Lazarus, and worked as a clerk/buyer for Leo Mintz's Record Rendezvous retail chain for the next fifteen years. Jim started his own record shop, Platter-Puss Records, in '84. He sold the business in '87 after joining Pere Ubu. Jim got his first guitar in 1965, and taught himself to play in a self-devised open tuning. He was/is profoundly moved by music in nearly all forms, especially Indian music (thanks to George Harrison), 20th century classical & experimental, 50's thru 60's pop and mood music, and of course \"rock\" in it's many forms. Jim joined local \"underground\" band, Mirrors, in '74 as bass player. Mirrors shared gigs with Rocket From The Tombs and The Electric Eels (whom he later recorded with), and later transformed into The Styrenes. In '77 Jim quit The Styrenes and took some time off from work to become a member of the Pere Ubu road crew, doing the infamous Co-Ed Jail Tours of the US & Europe in support of The Modern Dance lp. Back from the tours Jim and fellow roadie, Pat Ryan, started a two-man experimental rock band called Foreign Bodies, which released a single. The next few years saw Jim honing his skills as a studio producer for a number of local Cleveland artists and bands, recording his own music, and composing electronic pieces for local theatre and dance companies. In 1980 Jim formed the raucous Easter Monkeys, and concomitantly became a member of Scott Krauss And Tony Maimone's project, Home & Garden. Gigs were played and recordings were released by both bands. Having worked with David Thomas And The Pedestrians On The Variations On A Theme album in '84, Jim was asked to join David's latest project, The Wooden Birds, in 1986. A year later that group (with the addition of Scott Krauss) became the revived Pere Ubu. Jim has recorded with the band since that time, but no longer tours. He currently appears and records with local bands Speaker\\Cranker, Noble Rot, and KNG NXN as mainly a keyboardist. Jim has overseen operations of the US arm of Ubutique in Cleveland since 1990. <a href=\"https://www.last.fm/music/Jim+Jones\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
