{"artist":{"name":"Jim Reeves","mbid":"63a8297a-49b4-49f1-82d0-b0cb70b3e1d8","url":"https://www.last.fm/music/Jim+Reeves","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/707e9a9c14a846ec80bfc38c51441811.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/707e9a9c14a846ec80bfc38c51441811.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/707e9a9c14a846ec80bfc38c51441811.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/707e9a9c14a846ec80bfc38c51441811.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/707e9a9c14a846ec80bfc38c51441811.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/707e9a9c14a846ec80bfc38c51441811.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"227934","playcount":"1455820"},"similar":{"artist":[{"name":"Don Gibson","url":"https://www.last.fm/music/Don+Gibson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1da41b384ade4faa8567888d26bd00d6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1da41b384ade4faa8567888d26bd00d6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1da41b384ade4faa8567888d26bd00d6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1da41b384ade4faa8567888d26bd00d6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1da41b384ade4faa8567888d26bd00d6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1da41b384ade4faa8567888d26bd00d6.png","size":""}]},{"name":"Charley Pride","url":"https://www.last.fm/music/Charley+Pride","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f766a108a3034a2886cbc993fbb6df77.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f766a108a3034a2886cbc993fbb6df77.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f766a108a3034a2886cbc993fbb6df77.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f766a108a3034a2886cbc993fbb6df77.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f766a108a3034a2886cbc993fbb6df77.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f766a108a3034a2886cbc993fbb6df77.png","size":""}]},{"name":"Faron Young","url":"https://www.last.fm/music/Faron+Young","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7a47e7a622474fb9cf1ead02d6fb4e40.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7a47e7a622474fb9cf1ead02d6fb4e40.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7a47e7a622474fb9cf1ead02d6fb4e40.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7a47e7a622474fb9cf1ead02d6fb4e40.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7a47e7a622474fb9cf1ead02d6fb4e40.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7a47e7a622474fb9cf1ead02d6fb4e40.png","size":""}]},{"name":"Hank Locklin","url":"https://www.last.fm/music/Hank+Locklin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fa9f833f608b4373a54a4d4b7e7de832.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fa9f833f608b4373a54a4d4b7e7de832.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fa9f833f608b4373a54a4d4b7e7de832.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa9f833f608b4373a54a4d4b7e7de832.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa9f833f608b4373a54a4d4b7e7de832.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa9f833f608b4373a54a4d4b7e7de832.png","size":""}]},{"name":"Billie Jo Spears","url":"https://www.last.fm/music/Billie+Jo+Spears","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/db2e468fccde4b188e21365754f39249.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/db2e468fccde4b188e21365754f39249.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/db2e468fccde4b188e21365754f39249.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db2e468fccde4b188e21365754f39249.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db2e468fccde4b188e21365754f39249.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db2e468fccde4b188e21365754f39249.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"classic country","url":"https://www.last.fm/tag/classic+country"},{"name":"jim reeves","url":"https://www.last.fm/tag/jim+reeves"},{"name":"oldies","url":"https://www.last.fm/tag/oldies"},{"name":"male vocalists","url":"https://www.last.fm/tag/male+vocalists"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Jim+Reeves/+wiki"}},"published":"07 Apr 2006, 07:04","summary":"James Travis \"Jim\" Reeves (August 20, 1923 – July 31, 1964) was an American  country and popular music singer-songwriter. With records charting from the 1950s to the 1980s, he became well known as a practitioner of the Nashville sound (a mixture of older country-style music with elements of popular music). Reeves scored his greatest success with the Joe Allison composition \"He'll Have to Go\". Known as \"Gentleman Jim\", his songs continued to chart for years after his death. <a href=\"https://www.last.fm/music/Jim+Reeves\">Read more on Last.fm</a>","content":"James Travis \"Jim\" Reeves (August 20, 1923 – July 31, 1964) was an American  country and popular music singer-songwriter. With records charting from the 1950s to the 1980s, he became well known as a practitioner of the Nashville sound (a mixture of older country-style music with elements of popular music). Reeves scored his greatest success with the Joe Allison composition \"He'll Have to Go\". Known as \"Gentleman Jim\", his songs continued to chart for years after his death. Reeves died at age 40 in the crash of a private airplane. He is a member of both the Country Music and Texas Country Music Halls of Fame.\n\nReeves was born in Galloway, Texas, a small rural community near Carthage. Winning an athletic scholarship to the University of Texas, he enrolled to study speech and drama, but quit after only six weeks to work in the shipyards in Houston. Soon he resumed baseball, playing in the semi-professional leagues before contracting with the St. Louis Cardinals \"farm\" team during 1944 as a right-handed pitcher. He played for the minor leagues for three years before severing his sciatic nerve while pitching, which ended his athletic career.\n\nReeves began to work as a radio announcer, and sang live between songs. During the late 1940s, he was contracted with a couple of small Texas-based recording companies, but without success. Influenced by such Western swing-music artists as Jimmie Rodgers and Moon Mullican, as well as popular singers Bing Crosby, Eddy Arnold and Frank Sinatra, it was not long before he was a member of Moon Mullican's band, and made some early Mullican-style recordings like \"Each Beat of my Heart\" and \"My Heart's Like a Welcome Mat\" from the late 1940s to the early 1950s.\nHe eventually obtained a job as an announcer for KWKH-AM in Shreveport, Louisiana, home of the popular former radio program, the Louisiana Hayride. According to former Hayride master of ceremonies Frank Page, who had introduced Elvis Presley on the program in 1954, singer Sleepy LaBeef was late for a performance, and Reeves was asked to substitute. (Other accounts—-including Reeves himself, in an interview on the RCA album Yours Sincerely—-name Hank Williams as the absentee.)\n\nReeves' first successful country music songs included \"I Love You\" (a duet with Ginny Wright), \"Mexican Joe\", and \"Bimbo\" which reached Number 1 in 1954 on the U.S. Country Charts, and other songs with both Fabor Records and Abbott Records. Abbott released his first album in November 1955, Jim Reeves Sings (Abbott 5001), which was the label's only album release. Earlier in 1955, he was signed to a 10-year recording contract with RCA Victor by Steve Sholes, who produced some of Reeves' first recordings at RCA and signed Elvis Presley for the company that same year. Also in 1955, he joined the Grand Ole Opry and made his first appearance on ABC-TV's Ozark Jubilee, where he was a fill-in host from May–July 1958.\nFor his earliest RCA recordings, Reeves was still singing with the loud style of his first recordings, considered standard for country and western performers at that time. He decreased his volume, using a lower pitch and singing with lips nearly touching the microphone, although there were protests at RCA. During 1957, with the endorsement of his producer Chet Atkins, he used this style for his version of a demonstration song of lost love intended for a female singer. \"Four Walls\" not only scored No. 1 on the country music charts, but scored No. 11 on the popular music charts. Reeves had helped begin a new style of country music, using violins and lusher background arrangements soon known as the Nashville sound.\nReeves became known as a crooner because of his rich light baritone voice. Songs such as \"Adios Amigo\", \"Welcome to My World\", and \"Am I Losing You?\" demonstrated this. His Christmas songs have been perennial favorites, including \"C-H-R-I-S-T-M-A-S\", \"Blue Christmas\" and \"An Old Christmas Card\".\nHe is also responsible for popularizing many gospel songs, including \"We Thank Thee\", \"Take My Hand, Precious Lord\", \"Across The Bridge\", \"Where We'll Never Grow Old\" and many others.\n\nReeves scored his greatest success with the Joe Allison composition \"He'll Have to Go\", a great success on both the popular and country music charts, which earned him a platinum record. Released during late 1959, it scored number one on Billboard magazine's Hot Country Songs chart on February 8, 1960, which it scored for 14 weeks consecutive. Country music historian Bill Malone noted that while it was in many ways a conventional country song, its arrangement and the vocal chorus \"put this recording in the country pop vein\". In addition, Malone lauded Reeves' vocal styling—lowered to \"its natural resonant level\" to project the \"caressing style that became famous\"—as why \"many people refer to him as the singer with the velvet touch.\" In 1963, he released his well proclaimed \"Twelve Songs of Christmas\" album, which had the well known songs \"C.H.R.I.S.T.M.A.S\" and \"An Old Christmas Card\". During 1975, RCA producer Chet Atkins told an interviewer, \"Jim wanted to be a tenor but I wanted him to be a baritone... After he changed his voice to that smooth deeper sound, he was immensely popular.\"\nReeves' international popularity during the 1960s, however, at times surpassed his popularity in the United States, helping to give country music a worldwide market for the first time.\n\nDuring the early 1960s, Reeves was more popular in South Africa than Elvis Presley and recorded several albums in the Afrikaans language. In 1963, he toured and was featured in a South African film, Kimberley Jim. The film was released with a special prologue and epilogue in South African cinemas after Reeves' death, praising him as a true friend of the country. The film was produced, directed, and written by Emil Nofal.[citation needed]\nReeves was one of an exclusive trio of performers to have released an album there that played at the little-used 16⅔ rpm speed. This unusual format was more suited to the spoken word and was quickly discontinued for music. The only other artists known to have released such albums in South Africa were Elvis Presley and Slim Whitman.\n\nReeves toured Britain and Ireland during 1963 between his tours of South Africa and Europe. Reeves and the Blue Boys were in Ireland from May 30 to June 19, 1963, with a tour of US military bases from June 10 to June 15, when they returned to Ireland. They performed in most counties in Ireland, though Reeves occasionally abbreviated performances because he was unhappy with the piano. In a June 6, 1963 interview with Spotlight magazine, Reeves expressed his concerns about the tour schedule and the condition of the pianos, but said he was pleased with the audiences.\nThere was a press reception for him at the Shannon Shamrock Inn organised by Tom Monaghan of Bunratty Castle, County Clare. Show band singers Maisie McDaniel and Dermot O' Brien welcomed him on May 29, 1963. A photograph appeared in the Limerick Leader on 1 June, 1963. Press coverage continued from May until Reeves's arrival with a photograph of the press reception in The Irish Press. Billboard magazine in the US also reported the tour before and after. The single \"Welcome to My World\" with the B/W side \"Juanita\" was released by RCA Victor during June 1963 and bought by the distributors Irish Records Factors Ltd. This scored the record number one while Reeves was there during June.\nThere were a number of accounts of his dances in the local newspapers and a good account was given in The Kilkenny People of his dance in the Mayfair Ballroom where 1,700 persons were present. There was a photograph in The Donegal Democrat of Reeves's singing in the Pavesi Ball Room on June 7 1963, and an account of his non-appearance on stage in The Diamond, Kiltimagh, County Mayo in The Western People representing how the tour went in different areas.\nHe planned to record an album of popular Irish songs, and had three number one songs in Ireland during 1963 and 1964: \"Welcome to My World\", \"I Love You Because\", and \"I Won't Forget You\". (The last two are estimated to have sold 860,000 and 750,000 respectively in Britain alone, excluding Ireland.) Reeves had 11 songs in the Irish charts from 1962 to 1967. He recorded two Irish ballads, \"Danny Boy\" and \"Maureen\". \"He'll Have to Go\" was his most popular song there and was at number one and on the charts for months during 1960. He was one of the most popular recording artists in Ireland, in the first ten after the Beatles, Elvis and Cliff Richard.\nHe was permitted to perform in Ireland by the Irish Federation of Musicians on the condition that he share the bill with Irish show bands, becoming popular by 1963. The British Federation of Musicians would not permit him to perform there because no agreement existed for British show bands to travel to America in exchange for the Blue Boys playing in Britain. Reeves, however, performed for British radio and TV programmes.\n\nReeves played at the sports arena Njårdhallen, Oslo on April 16, 1964 with Bobby Bare, Chet Atkins, the Blue Boys and the Anita Kerr Singers. They performed two concerts; the second was televised and recorded by the Norwegian network NRK (Norsk Rikskringkasting, the only one in Norway at the time). The complete concert, however, was not recorded, including some of Reeves' last songs. There are reports he performed \"You're the Only Good Thing (That's Happened to Me)\" in this section. The program has been repeated on NRK several times over the years.\nHis first success in Norway, \"He'll Have to Go\", scored No. 1 in the Top Ten and scored the chart for 29 weeks. \"I Love You Because\" was his greatest success in Norway, scoring No. 1 during 1964 and scoring on the list for 39 weeks. His albums spent 696 weeks in the Norwegian Top 20 chart, making him one of the most popular music artists in the history of Norway.\n\nReeves' last recording session for RCA Victor had produced \"Make the World Go Away\", \"Missing You\", and \"Is It Really Over?\" When the session ended with some time remaining on the schedule, Reeves suggested he record one more song. He taped \"I Can't Stop Loving You\", in what was to be his last RCA recording. He made one later recording, however, at the little studio in his home. During July 1964 Reeves recorded \"I'm a Hit Again\", using just an acoustic guitar as accompaniment. That recording was never released by RCA but appeared during 2003 as part of a collection of Reeves songs, after RCA had sold its rights to Reeves' recordings.\n\nOn July 31, 1964, Reeves and his business partner and manager Dean Manuel (also the pianist of Reeves' backing group, the Blue Boys) left Batesville, Arkansas, en route to Nashville in a single-engine Beechcraft Debonair aircraft, with Reeves at the controls. The two had secured a deal on some real estate (Reeves had also unsuccessfully tried to buy property from the LaGrone family in Deadwood, Texas, north of his birthplace of Galloway).\nWhile flying over Brentwood, Tennessee, they encountered a violent thunderstorm. A subsequent investigation showed that the small airplane had become caught in the storm and Reeves suffered spatial disorientation. The singer's widow, Mary Reeves (1929-1999), probably unwittingly started the rumor that he was flying the airplane upside down and assumed he was increasing altitude to clear the storm. However, according to Larry Jordan, author of the 2011 biography, Jim Reeves: His Untold Story, this scenario is refuted by eyewitnesses known to crash investigators who saw the plane overhead immediately before the mishap, and confirmed that Reeves was not upside down. Jordan writes extensively about forensic evidence (including from the long-elusive tower tape and accident report), which suggests that instead of making a right turn to avoid the storm (as he had been advised by the Approach Controller to do), Reeves turned left in an attempt to follow Franklin Road to the airport. In so doing, he flew further into the rain. While preoccupied with trying to re-establish his ground references, Reeves let his airspeed get too low and stalled the aircraft. Relying on his instincts more than his training, evidence suggests he applied full power and pulled back on the yoke before leveling his wings—a fatal, but not uncommon, mistake that induced a stall/spin from which he was too low to recover. Jordan writes that according to the tower tape, Reeves ran into the heavy rain at 4:51 p.m. and crashed only a minute later, at 4:52 p.m.\nWhen the wreckage was found some 42 hours later, it was discovered the airplane's engine and nose were buried in the ground due to the impact of the crash. The crash site was in a wooded area north-northeast of Brentwood approximately at the junction of Baxter Lane and Franklin Pike Circle, just east of Interstate 65, and southwest of Nashville International Airport where Reeves planned to land. Coincidentally, both Reeves and Randy Hughes, the pilot of Patsy Cline's ill-fated airplane, were trained by the same instructor.[citation needed]\nOn the morning of August 2, 1964, after an intense search by several parties (which included several personal friends of Reeves including Ernest Tubb and Marty Robbins) the bodies of the singer and Dean Manuel were found in the wreckage of the aircraft and, at 1:00 p.m. local time, radio stations across the United States began to announce Reeves' death formally. Thousands of people traveled to pay their last respects at his funeral two days later. The coffin, draped in flowers from fans, was driven through the streets of Nashville and then to Reeves' final resting place near Carthage, Texas.\n\n\nReeves was elected posthumously to the Country Music Hall of Fame during 1967, which honored him by saying, \"The velvet style of 'Gentleman Jim Reeves' was an international influence. His rich voice brought millions of new fans to country music from every corner of the world. Although the crash of his private airplane took his life, posterity will keep his name alive because they will remember him as one of country music's most important performers.\"\nDuring 1998, he was inducted into the Texas Country Music Hall of Fame in Carthage, Texas, where the Jim Reeves Memorial is located. The inscription on the memorial reads, \"If I, a lowly singer, dry one tear, or soothe one humble human heart in pain, then my homely verse to God is dear, and not one stanza has been sung in vain.\"\n\nReeves' records continued to sell well, both earlier as well as new albums, issued after his death. His widow, Mary, combined unreleased tracks with previous releases (placing updated instrumentals alongside Reeves' original vocals) to produce a regular series of \"new\" albums after her husband's death. She also operated the Jim Reeves Museum in Nashville from the mid-1970s until 1996. On the fifteenth anniversary of Jim's death Mary told a country music magazine interviewer, \"Jim Reeves my husband is gone; Jim Reeves the artist lives on.\"\nDuring 1966, Reeves' record \"Distant Drums\" scored No. 1 on the British singles chart and scored there for five weeks, besting competition from the Beatles' \"Yellow Submarine\" and \"Eleanor Rigby\" (a double-sided \"A\" release), and the Small Faces' song, \"All Or Nothing\". The song scored on the UK charts for 45 weeks and scored No. 1 on the US country music chart. Originally, \"Distant Drums\" had been recorded merely as a \"demo\" for its composer, Cindy Walker, believing it was for her personal use and had been deemed \"unsuitable\" for general release by Chet Atkins and RCA Victor. During 1966, however, RCA determined that there was a market for the song because of the war in Vietnam. It was named Song of the Year in the UK during 1966 and Reeves became the first American artist to receive the accolade. That same year, singer Del Reeves (no relation) recorded an album paying tribute to him.\nIn 1980, Reeves had another two Top Ten posthumous duet hits along with the late country star Patsy Cline, who featured on Have You Ever Been Lonely? and I Fall to Pieces. Although the two had never recorded together during their tragically short lives, producers Chet Atkins and Owen Bradley lifted their isolated vocal performances off their original 3-track stereo master session tapes, resynchronized them and re-recorded new digital backing tracks.\nReeves' compilation albums containing well-known standards continue to sell well. The Definitive Collection scored No. 21 in the UK album charts during July 2003, and Memories are Made of This scored No. 35 during July 2004. Bear Family Records produced a 16-CD boxed set of Reeves' studio recordings and several smaller sets, mainly radio broadcasts and demos. During 2007, the label released a set entitled Nashville Stars on Tour, including audio and video material of the RCA European tour during April 1964 in which Reeves features prominently.\nSince 2003, the US-based VoiceMasters has issued more than 80 previously unreleased Reeves recordings, including new songs as well as newly overdubbed material. Among them was \"I'm a Hit Again\", the last song he recorded in his basement studio just a few days before his death. VoiceMasters overdubbed this track in the same studio in Reeves' former home (now owned by a Nashville record producer). Reeves' fans repeatedly urged RCA or Bear Family to re-release some of the songs overdubbed during the years after his death which have never appeared on CD.\nA compilation CD The Very Best of Jim Reeves scored No. 8 on initial release in the UK album chart during May 2009, to later score its maximum of No. 7 during late June, his first top 10 album in the UK since 1992.\n\nReeves had many fans in both India and Sri Lanka since the 1960s, and is probably the all-time most popular English language singer in Sri Lanka. His Christmas carols are especially popular, and music stores continue to carry his CDs or audio cassettes.[citation needed] Two of his songs, \"There's a Heartache Following Me\" and \"Welcome to My World,\" were favorites of the Indian spiritual teacher Meher Baba.[citation needed] A follower of Meher Baba, Pete Townshend of the Who, recorded his own version of \"Heartache\" on his first major solo album Who Came First during 1972.\nRobert Svoboda, in his trilogy on aghora and the Aghori Vimalananda, mentions that Vimalananda considered Reeves a gandharva, i.e. in Indian tradition, a heavenly musician, who had been born on Earth. He had Svoboda play Reeves' \"Take My Hand, Precious Lord\" at his cremation.\n\nTributes to Reeves were composed in Britain and Ireland after his death. The song \"A Tribute to Jim Reeves\" was written by Eddie Masterson and recorded by Larry Cunningham and the Mighty Avons and during January 1965 it scored on the UK Charts and Top Ten in Ireland. It scored the UK Charts on the 10 December 1964 and was there for 11 weeks and sold 250,000 copies. The Dixielanders Show Band also recorded a Tribute to Jim Reeves written by Steve Lynch and recorded during September 1964 and it scored the North of Ireland Charts during September 1964. The Masterson song was translated later into Dutch and recorded.\nIn the UK, \"We'll Remember You\" was written by Geoff Goddard but not released until 2008 on the Now & Then: From Joe Meek To New Zealand double album by Houston Wells.\nJerry Jerry and the Sons of Rhythm Orchestra, a Canadian alternative rock band whose musical style blends elements of surf music, gospel music, rockabilly, garage and punk released the song entitled \"Jimmy Reeves\" on their 1992 album \"Don't Mind If I Do\" \nReeves remains a popular artist in Ireland and many Irish singers have recorded tribute albums. A play by author Dermot Devitt, Put Your Sweet Lips, was based on Reeves' appearance in Ireland at the Pavesi Ballroom in Donegal town on 7 June 1963 and reminiscences of people there.\nBlind R&B and blues music artist Robert Bradley (of the band Robert Bradley's Blackwater Surprise) paid tribute to Reeves in the album description of his release, Out of the Wilderness. Bradley is quoted as saying, \"This record brings me back to the time when I started out wanting to be a singer-songwriter, where the music did not need the New York Philharmonic to make it real...I wanted to do a record and just be Robert and sing straight like Jim Reeves on ‘Put Your Sweet Lips a Little Closer to the Phone.'\"\nBritish comedian Vic Reeves adopted his stage name from Reeves and Vic Damone, two of his favorite singers.\nIn the United States, Del Reeves (no relation) recorded and released a 1966 album entitled Del Reeves sings Jim Reeves.\nReeves' nephew, John Rex Reeves, appears occasionally on RFD-TV's Midwest Country, singing the songs of his uncle, and other popular country songs. <a href=\"https://www.last.fm/music/Jim+Reeves\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
