{"artist":{"name":"Jimmy McGriff","mbid":"58f23499-f263-4772-9b7a-2f6cd2fe428f","url":"https://www.last.fm/music/Jimmy+McGriff","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/06bf9294034b40598627b49329dded8a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/06bf9294034b40598627b49329dded8a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/06bf9294034b40598627b49329dded8a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06bf9294034b40598627b49329dded8a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06bf9294034b40598627b49329dded8a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06bf9294034b40598627b49329dded8a.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"113130","playcount":"696487"},"similar":{"artist":[{"name":"Reuben Wilson","url":"https://www.last.fm/music/Reuben+Wilson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4ba2b4b4f99f4df98213ddf2a67a899a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4ba2b4b4f99f4df98213ddf2a67a899a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4ba2b4b4f99f4df98213ddf2a67a899a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4ba2b4b4f99f4df98213ddf2a67a899a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4ba2b4b4f99f4df98213ddf2a67a899a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4ba2b4b4f99f4df98213ddf2a67a899a.png","size":""}]},{"name":"Jack McDuff","url":"https://www.last.fm/music/Jack+McDuff","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ee6baf03f9244a059c8645cf661a4860.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ee6baf03f9244a059c8645cf661a4860.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ee6baf03f9244a059c8645cf661a4860.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee6baf03f9244a059c8645cf661a4860.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee6baf03f9244a059c8645cf661a4860.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee6baf03f9244a059c8645cf661a4860.png","size":""}]},{"name":"Jimmy Smith","url":"https://www.last.fm/music/Jimmy+Smith","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3b28504b7ff243d8bd5490cd8f50c6e7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3b28504b7ff243d8bd5490cd8f50c6e7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3b28504b7ff243d8bd5490cd8f50c6e7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3b28504b7ff243d8bd5490cd8f50c6e7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3b28504b7ff243d8bd5490cd8f50c6e7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3b28504b7ff243d8bd5490cd8f50c6e7.png","size":""}]},{"name":"Richard \"Groove\" Holmes","url":"https://www.last.fm/music/Richard+%22Groove%22+Holmes","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8696c7793eb44680b625df9b39e695ec.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8696c7793eb44680b625df9b39e695ec.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8696c7793eb44680b625df9b39e695ec.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8696c7793eb44680b625df9b39e695ec.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8696c7793eb44680b625df9b39e695ec.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8696c7793eb44680b625df9b39e695ec.png","size":""}]},{"name":"Lonnie Smith","url":"https://www.last.fm/music/Lonnie+Smith","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e3b621ca258946d9bb080f99ac39a0f4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e3b621ca258946d9bb080f99ac39a0f4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e3b621ca258946d9bb080f99ac39a0f4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e3b621ca258946d9bb080f99ac39a0f4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e3b621ca258946d9bb080f99ac39a0f4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e3b621ca258946d9bb080f99ac39a0f4.png","size":""}]}]},"tags":{"tag":[{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"funk","url":"https://www.last.fm/tag/funk"},{"name":"organ","url":"https://www.last.fm/tag/organ"},{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"soul","url":"https://www.last.fm/tag/soul"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Jimmy+McGriff/+wiki"}},"published":"09 Dec 2006, 17:19","summary":"One of the all-time giants of the Hammond B-3, Jimmy McGriff (April 3, 1936 -- May 24, 2008) sometimes gets lost amid all the great soul-jazz organists from his hometown of Philadelphia. He was almost certainly the bluesiest of the major soul-jazz pioneers, and indeed, he often insisted that he was more of a blues musician than a jazz artist; nonetheless, he remained eclectic enough to blur the lines of classification. His sound -- deep, down-to-earth grooves drenched in blues and gospel feeling -- made him quite popular with R&B audiences <a href=\"https://www.last.fm/music/Jimmy+McGriff\">Read more on Last.fm</a>","content":"One of the all-time giants of the Hammond B-3, Jimmy McGriff (April 3, 1936 -- May 24, 2008) sometimes gets lost amid all the great soul-jazz organists from his hometown of Philadelphia. He was almost certainly the bluesiest of the major soul-jazz pioneers, and indeed, he often insisted that he was more of a blues musician than a jazz artist; nonetheless, he remained eclectic enough to blur the lines of classification. His sound -- deep, down-to-earth grooves drenched in blues and gospel feeling -- made him quite popular with R&B audiences, even more so than some of his peers; what was more, he was able to condense those charms into concise, funky, jukebox-ready singles that often did surprisingly well on the R&B charts. His rearrangement of Ray Charles' \"I Got a Woman\" was a Top Five R&B hit in 1962, and further hits like \"All About My Girl,\" \"Kiko,\" and \"The Worm\" followed over the course of the '60s. McGriff spent much of the '70s trying to keep pace with the fusion movement, switching to various electric keyboards and adopting an increasingly smooth, polished style. As the '80s dawned, McGriff gave up trying to sound contemporary and returned to his classic organ-trio sound; as luck would have it, vintage soul-jazz soon came back into vogue with a devoted cult of fans and critics, and McGriff was able to recover his creative vitality and take his place as one of the genre's elder statesmen.\n\nJames Harrell McGriff, Jr. was born April 3, 1936, in Philadelphia. His mother and father both played the piano, and he counted saxophonist Benny Golson and soul singer Harold Melvin among his cousins. First getting involved in music through his family's church, he received his first instrument, a drum set, at age eight; by his teen years, he had taken up acoustic bass and alto sax, and also learned vibes, piano, and drums by the time he finished high school. Bass remained his primary instrument for a while, although he was inspired to try his hand at the Hammond organ after seeing Richard \"Groove\" Holmes at a club in Camden, NJ. However, McGriff was drafted into the military after high school, and served in the Korean War as a military policeman. Upon returning to the United States, he decided to make law enforcement a career, and after completing the necessary training, he worked on the Philadelphia police force for two and a half years. Still, he never lost interest in music, and around 1955 he augmented his day job by working as a bass player behind vocalists like Carmen McRae and, most frequently, Big Maybelle, who had a regular gig at the local Pep's Showboat club.\n\nWith the Hammond organ rising in popularity around Philadelphia, jobs for bass players were scarce, and McGriff contacted Groove Holmes about learning the organ, this time in earnest. He bought his own Hammond B-3 in 1956, and spent the next six months practicing as hard as he could, either at Holmes' house or at Archie Shepp's house (where he stored the instrument). Skipping more and more work time to play gigs, he finally quit the police force, and enrolled at the local Combe College to study music. He later moved on to the prestigious Juilliard School of Music in New York, and also studied privately with Milt Buckner, Jimmy Smith, and Sonny Gatewood. McGriff's first recording was the single \"Foxy Due,\" cut for the small White Marsh label in 1958; it featured a young saxophonist named Charles Earland, who subsequently learned the organ from McGriff and, like his mentor, went on to become one of the instrument's quintessential performers.\n\nMcGriff was performing in a small club in Trenton, NJ in 1962 when a talent scout from the small Jell label heard him and offered him a chance to record. McGriff's instrumental soul-jazz rearrangement of Ray Charles' classic \"I've Got a Woman\" was released as a single, and sold well enough for Juggy Murray's New York-based Sue label to pick it up for wider release. With better distribution and promotion behind it, \"I've Got a Woman\" hit the national charts and became a bona fide hit, climbing into the Top Five on the R&B charts and the Top 20 over on the pop side. Sue issued McGriff's debut album, naturally also titled I've Got a Woman, in 1963; it too was a hit, nearly making the pop Top 20, and it spun off two more charting singles in the McGriff originals \"All About My Girl\" (number 12 R&B, Top 50 pop) and \"M.G. Blues.\" Sue released several more McGriff albums over the next two years, including the live At the Apollo, Jimmy McGriff at the Organ (which produced the chart single \"Kiko\"), the holiday hit Christmas With McGriff (actually his highest-charting album at number 15 pop), the charting Topkapi (a collection of soundtrack themes with orchestral backing), and another chart hit, Blues for Mister Jimmy, which proved to be his last on Sue.\n\nIn 1966, McGriff moved over to the Solid State label, where he hooked up with producer Sonny Lester, who would helm most of his records through the '70s. He debuted with Jimmy McGriff and the Big Band, which found him fronting an all-star swing orchestra featuring many Count Basie alumni (it was later reissued as A Tribute to Count Basie). McGriff recorded prolifically for Solid State over the remainder of the decade, including albums like A Bag Full of Soul (1966), A Bag Full of Blues (1967), and I've Got a New Woman (1968; mostly a look back at his Sue material). Most notably, though, McGriff scored another hit single with \"The Worm,\" which made the R&B Top 30 and sent the LP of the same name rocketing into the R&B Top Ten in early 1969. In addition to his Solid State recordings, McGriff cut several albums for Blue Note over 1969-1971, most notably Electric Funk, an early foray into jazz-funk fusion that teamed him with arranger/electric pianist Horace Ott; a similar outing that featured pop/rock and R&B covers, Soul Sugar, was released on Capitol during the same period. Additionally, McGriff toured as part of Buddy Rich's band during the late '60s, and again from 1971-1972.\n\nMcGriff made Groove Merchant his primary label in 1971, and although he briefly quit the business in 1972 to start a horse farm in Connecticut, the lure of music proved too powerful to overcome. Early in the decade, he alternated between funky electric outings (usually with covers of contemporary rock and R&B hits) and more traditional, small-group organ-jazz settings. Notable albums included 1973's Giants of the Organ Come Together, a summit with mentor and longtime friend Groove Holmes; a duo album with bluesman Junior Parker; 1976's Mean Machine, a slicker jazz-funk LP that returned him to the R&B album chart's Top 50; and the 1977 follow-up Red Beans, which also sold respectably.\n\nAfter 1977's Tailgunner (on LRC), McGriff's recorded output tailed off over the next few years. He resurfaced on the Milestone label in 1983, debuting with Countdown, a return to his classic, bluesy soul-jazz style that started to bring him back into the jazz spotlight. A series of strong albums followed during the '80s, including 1984's Skywalk, 1985's State of the Art, 1986's acclaimed The Starting Five, and 1988's Blue to the 'Bone (a near-Top Ten hit on the jazz LP charts); he also recorded a one-off session for Headfirst in 1990, You Ought to Think About Me, that made the jazz Top Ten. Additionally, McGriff co-led a group with saxophonist Hank Crawford during the late '80s, which released several albums, including 1990's popular On the Blue Side (number three on the jazz charts). He also returned to his roots in the church by playing on gospel singer Tramaine Hawkins' 1990 live album. McGriff and Crawford moved over to Telarc for a pair of albums over 1994-1995, Right Turn on Blue and Blues Groove. As soul-jazz returned to cult popularity in both America and the U.K., McGriff found himself playing higher-profile gigs and venues on both sides of the Atlantic. He returned to Milestone and resumed his solo career in 1996 with The Dream Team, which featured saxman David \"Fathead\" Newman and drummer Bernard \"Pretty\" Purdie, both of whom would become familiar faces on McGriff recordings in the years to come. Follow-ups included solid records like 1998's Straight Up, 2000's McGriff's House Party, 2001's Feelin' It, and 2002's McGriff Avenue, which looked back on some of his '60s hits.\n\nMcGriff died there at age 72 on May 24, 2008, due to complications of multiple sclerosis. <a href=\"https://www.last.fm/music/Jimmy+McGriff\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
