{"artist":{"name":"Joe Grushecky","mbid":"ce48dd78-903e-4737-aee7-5e70bba7e15d","url":"https://www.last.fm/music/Joe+Grushecky","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e61e7230eb0a4bc7a33060a5395ab2cc.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e61e7230eb0a4bc7a33060a5395ab2cc.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e61e7230eb0a4bc7a33060a5395ab2cc.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e61e7230eb0a4bc7a33060a5395ab2cc.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e61e7230eb0a4bc7a33060a5395ab2cc.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e61e7230eb0a4bc7a33060a5395ab2cc.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"4827","playcount":"26849"},"similar":{"artist":[{"name":"Patti Scialfa","url":"https://www.last.fm/music/Patti+Scialfa","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0c5b10bd4bda40ac80792329c5fbc8fd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0c5b10bd4bda40ac80792329c5fbc8fd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0c5b10bd4bda40ac80792329c5fbc8fd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0c5b10bd4bda40ac80792329c5fbc8fd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0c5b10bd4bda40ac80792329c5fbc8fd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0c5b10bd4bda40ac80792329c5fbc8fd.png","size":""}]},{"name":"Little Steven & The Disciples of Soul","url":"https://www.last.fm/music/Little+Steven+&+The+Disciples+of+Soul","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7e7db7121fc043be82b519cee435e740.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7e7db7121fc043be82b519cee435e740.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7e7db7121fc043be82b519cee435e740.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7e7db7121fc043be82b519cee435e740.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7e7db7121fc043be82b519cee435e740.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7e7db7121fc043be82b519cee435e740.png","size":""}]},{"name":"Joe D'Urso & Stone Caravan","url":"https://www.last.fm/music/Joe+D%27Urso+&+Stone+Caravan","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Joe Grushecky and the Houserockers","url":"https://www.last.fm/music/Joe+Grushecky+and+the+Houserockers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/76dff7095d0c4c3a9e8518524f772d26.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/76dff7095d0c4c3a9e8518524f772d26.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/76dff7095d0c4c3a9e8518524f772d26.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76dff7095d0c4c3a9e8518524f772d26.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76dff7095d0c4c3a9e8518524f772d26.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76dff7095d0c4c3a9e8518524f772d26.png","size":""}]},{"name":"Grin","url":"https://www.last.fm/music/Grin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fa7a5c668f334cc6bff6a9e0fb3f45af.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fa7a5c668f334cc6bff6a9e0fb3f45af.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fa7a5c668f334cc6bff6a9e0fb3f45af.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa7a5c668f334cc6bff6a9e0fb3f45af.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa7a5c668f334cc6bff6a9e0fb3f45af.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa7a5c668f334cc6bff6a9e0fb3f45af.png","size":""}]}]},"tags":{"tag":[{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"classic rock","url":"https://www.last.fm/tag/classic+rock"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"Rock and Roll","url":"https://www.last.fm/tag/Rock+and+Roll"},{"name":"genial","url":"https://www.last.fm/tag/genial"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Joe+Grushecky/+wiki"}},"published":"06 Oct 2010, 18:23","summary":"Joe Grushecky is a true rock 'n' roll survivor, the talented singer, songwriter, and guitarist first bursting onto the scene in 1979 with his band the Iron City Houserockers and their critically-acclaimed debut album, Love's So Tough. By the time the band released a follow-up in 1980's Have A Good Time But Get Out Alive, Grushecky had sharpened his songwriting skills to a razor's edge, and his intelligent blue-collar anthems mixed muscular, guitar-driven rock with elements of blues and soul like nobody before or since. <a href=\"https://www.last.fm/music/Joe+Grushecky\">Read more on Last.fm</a>","content":"Joe Grushecky is a true rock 'n' roll survivor, the talented singer, songwriter, and guitarist first bursting onto the scene in 1979 with his band the Iron City Houserockers and their critically-acclaimed debut album, Love's So Tough. By the time the band released a follow-up in 1980's Have A Good Time But Get Out Alive, Grushecky had sharpened his songwriting skills to a razor's edge, and his intelligent blue-collar anthems mixed muscular, guitar-driven rock with elements of blues and soul like nobody before or since.\n \nAfter two more albums that earned great reviews but sold few copies, the Iron City Houserockers called it a day. Grushecky, a Pittsburgh native, returned home to Steeltown and resumed his day job as a teacher working with at-risk youth, a position that he has pretty much held ever since. He stayed out of music for the better part of a decade, returning with a new band - Joe Grushecky and the Houserockers - which included his old ICH bandmate Art Nardini on bass, and released the acclaimed Swimming With The Sharks album.\n \nTwenty years and eight albums later, Joe Grushecky is still rocking at an age where many musicians have retired and started collecting social security checks. He hasn't had a label deal in 15 years, Grushecky and his long-time manager and his compatriots the Houserockers going it on their own, braving the tidal changes that have assaulted the music industry by rocking harder. Through the years, Grushecky has continued to hone his craft as a songwriter, and if fame and fortune have eluded him, he remains committed to music as a powerful creative force. Meeting him in 1995, and asking why a 50-year-old man would give up his job to hit the road with a band (for his American Babylon album), Grushecky simply smiled and said, \"it's rock 'n' roll, man, it's rock 'n' roll....\"\n \nEast Carson Street is Grushecky's first album since 2006's A Good Life, and his first with long-time band the Houserockers in six years. After venturing out on his own for an album, what did Grushecky want to accomplish with East Carson Street? \"I wanted to have a really good band record,\" says Grushecky. \"I approach every record the same, try to make it the best record that I can at that particular time. I got lucky this time because I'd been on a hot streak writing, and it was a very relaxed record to do.\"\n \nGrushecky also took a different tack in the recording of this album, which is also the first in years to feature a new band line-up. \"We took our time and worked on it, and were under no pressure to deliver it,\" he says. \"I wanted a record to showcase the talent of the band, especially since we'd gone through our first personnel changes in a while. We lost three guys and brought two guys in, my son being one of them.\" Gone are guitarist Billy Toms, percussionist Bernie Herr, and harmonica player Marc Reisman, who also dated back to the Iron City Houserockers days. The addition of guitarists Johnny Grushecky and Danny Gochnour has brought an even heavier rock 'n' roll sound to Grushecky's songs.\n \nOf the new line-up, Grushecky says \"the rhythm section is great, we have a certain feel, and we play like a band. This time the guys really expanded a little. We approached the record differently, recording this time...I don't want to compare myself to Bob Dylan, but the last couple records that we recorded with the Houserockers, we wouldn't rehearse them. I'd go in and write the song the night before and we'd record without rehearsing, which made the guys more nervous than it made me. This time, I gave them all the songs in advance and we worked on them.\"\n \nThe different strategy towards recording East Carson Street resulted in uniformly consistent and inspired performances by the band on what might be Grushecky's strongest set of songs to date. With the songwriting, too, Grushecky changed his usual modus operandi and collaborated on material with a number of outside writers. For the first time, he has also traveled to Nashville to hook up with some of the city's more talented wordsmiths.\n \n\"One of my friends, John Esposito, is the head of Warner Brothers in Nashville,\" says Grushecky, \"he's a Pittsburgh guy, and he and I are friends, and we've been talking about me trying to bust into the songwriting thing. I went down there a little more than a year ago, and I was down there for three hours and was already writing songs with Big Kenny and Debbie Allen. Since then I've been going back and writing with Al Anderson [formerly of N.R.B.Q.], he's probably the best-known guy; James House; and a bunch of other people. It's been fun and I've been enjoying it. I didn't know if I'd like it or not, but it's been a positive experience so far.\"\n \nOne of Grushecky's past collaborators - some guy by the name of Springsteen - makes a re-appearance on East Carson Street, co-writing the song \"Another Thin Line\" as well as singing on the song and playing guitar on two other tracks. The two have frequently put their heads together on songs, and they share a GrammyTM award for their 2004 song \"Code of Silence.\" \"He casts a long shadow,\" says Grushecky of Springsteen. \"When you play with Bruce, you have to be pretty confident in what you're doing or else he'll overwhelm it - not that he attempts to - with the strength of his personality. We always have a blast when we play together.\"\n \nEast Carson Street was released by Schoolhouse Records, Grushecky's independent label. Through his lengthy career, Grushecky has been signed to major labels, indie labels, and done it himself (with a little help from his friends). Although this independence brings a certain amount of creative freedom, it also has its drawbacks. \"Being independent is a huge plus for me, but the drawback is that you don't have anybody working your record,\" he says. \"Your chances of getting on radio are diminished, your chances of being in any major publications get slimmer...especially once you get to be a certain age, I think that a lot of people look at people our age and think that 'their best days have come and gone.'\"\n \nIn the 30 years since the release of the first Iron City Houserockers album, Grushecky has seen drastic changes in the music industry. \"The music industry is in a state of flux, but music itself is more popular than ever,\" he says. \"There's probably more music than ever being sold, more music consumed, it's just not in the formats that we have known all these years. The digital thing has pretty much taken over.\"\n \n\"It's been pretty interesting, watching it all develop,\" he adds. \"I do this thing with kids every year at a middle school, so it's 14-and-15-year-olds, and when I first started about ten years ago, barely anybody downloaded...if they did download, they were hesitant to admit it, but the majority of kids purchased CDs. Last year I did it, and out of 200 students, only about six people said they bought CDs. I went on this spiel about having the physical thing in your hand, do you enjoy the artwork and the lyrics, and they said 'naw, we just want a back-up of the ones we like in case our computer crashes.'\"\n \nLuckily, the changes in the music industry caused by the new digital era can be beneficial to indie artists like Grushecky. \"The Internet keeps guys like myself in business,\" he says. \"Anybody can email me, say anything...good and bad, but people contact me on a weekly basis and make nice comments about how much the music has meant to them through the years. With this record, I got a lot of European orders and orders from all over the United States, so it's been really working well.\"\n \nThe addition of his son Johnny to the Houserockers band has proven to be a smart move on the part of the veteran rocker. \"It's been great,\" he says of Johnny. \"Watching him play in his own band, it makes you realize why you picked up a guitar in the first place. They love to play music, they want to hear their sound, they want to be creative.\" As for Johnny's role in the band, Grushecky adds \"he brings an incredible amount of energy and excitement to the band. The cool thing about it is that you get to see two generations of musicians up there on stage.\"\n \nAlthough he may never enjoy commercial success commensurate with the critical acclaim that he's received through the years, Grushecky is satisfied with the work that he's done. \"I've been fortunate enough to be able to write good songs,\" he says. \"This record in particular, I had a lot of confidence in the songs that I was writing.\" Looking back over a career that can boast of better than a dozen great albums, Pittsburgh's favorite son concludes, \"this new record is as good as any record that I've done.\" <a href=\"https://www.last.fm/music/Joe+Grushecky\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
