{"artist":{"name":"Joey Negro","mbid":"cea6cb45-d685-4917-90bf-482b656f4cf8","url":"https://www.last.fm/music/Joey+Negro","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/00624b5612da4627b12ee99eb0b55e47.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/00624b5612da4627b12ee99eb0b55e47.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/00624b5612da4627b12ee99eb0b55e47.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/00624b5612da4627b12ee99eb0b55e47.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/00624b5612da4627b12ee99eb0b55e47.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/00624b5612da4627b12ee99eb0b55e47.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"91711","playcount":"437740"},"similar":{"artist":[{"name":"The Sunburst Band","url":"https://www.last.fm/music/The+Sunburst+Band","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f93c4eabb23e49ec92389fe1f677f218.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f93c4eabb23e49ec92389fe1f677f218.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f93c4eabb23e49ec92389fe1f677f218.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f93c4eabb23e49ec92389fe1f677f218.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f93c4eabb23e49ec92389fe1f677f218.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f93c4eabb23e49ec92389fe1f677f218.png","size":""}]},{"name":"Kings Of Tomorrow","url":"https://www.last.fm/music/Kings+Of+Tomorrow","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3839b0dd0b164c8cb288123f468d9ae9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3839b0dd0b164c8cb288123f468d9ae9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3839b0dd0b164c8cb288123f468d9ae9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3839b0dd0b164c8cb288123f468d9ae9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3839b0dd0b164c8cb288123f468d9ae9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3839b0dd0b164c8cb288123f468d9ae9.png","size":""}]},{"name":"Louie Vega","url":"https://www.last.fm/music/Louie+Vega","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4d2807f210af4fbfa673489c88194170.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4d2807f210af4fbfa673489c88194170.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4d2807f210af4fbfa673489c88194170.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4d2807f210af4fbfa673489c88194170.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4d2807f210af4fbfa673489c88194170.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4d2807f210af4fbfa673489c88194170.png","size":""}]},{"name":"Soulsearcher","url":"https://www.last.fm/music/Soulsearcher","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/612bb0f696ee44bdbca1c30f9b61f455.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/612bb0f696ee44bdbca1c30f9b61f455.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/612bb0f696ee44bdbca1c30f9b61f455.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/612bb0f696ee44bdbca1c30f9b61f455.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/612bb0f696ee44bdbca1c30f9b61f455.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/612bb0f696ee44bdbca1c30f9b61f455.png","size":""}]},{"name":"Kim English","url":"https://www.last.fm/music/Kim+English","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4b45cf9f037d4acda38b188d56f60845.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4b45cf9f037d4acda38b188d56f60845.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4b45cf9f037d4acda38b188d56f60845.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4b45cf9f037d4acda38b188d56f60845.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4b45cf9f037d4acda38b188d56f60845.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4b45cf9f037d4acda38b188d56f60845.png","size":""}]}]},"tags":{"tag":[{"name":"House","url":"https://www.last.fm/tag/House"},{"name":"dance","url":"https://www.last.fm/tag/dance"},{"name":"funky house","url":"https://www.last.fm/tag/funky+house"},{"name":"DIsco House","url":"https://www.last.fm/tag/DIsco+House"},{"name":"club","url":"https://www.last.fm/tag/club"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Joey+Negro/+wiki"}},"published":"17 Jun 2006, 19:35","summary":"Joey Negro is the most well-known pseudonym of master British DJ/producer/remixer Dave Lee. Under a plethora of other monikers including Jakatta, Akabu, Doug Willis, Raven Maize, The Sunburst Band, Sessomatto, and Z Factor, Dave was one of the first artists to incorporate disco samples in house music when he began his production career in 1988. Indeed, he was in the studio making credible and outstanding British House music when many luminaries around him were still busy getting to grips with their decks. <a href=\"https://www.last.fm/music/Joey+Negro\">Read more on Last.fm</a>","content":"Joey Negro is the most well-known pseudonym of master British DJ/producer/remixer Dave Lee. Under a plethora of other monikers including Jakatta, Akabu, Doug Willis, Raven Maize, The Sunburst Band, Sessomatto, and Z Factor, Dave was one of the first artists to incorporate disco samples in house music when he began his production career in 1988. Indeed, he was in the studio making credible and outstanding British House music when many luminaries around him were still busy getting to grips with their decks. In 2011 little has changed and Dave is widely regarded as one of the most commercially successful and in-demand artists on the global scene. \n\nA producer first and foremost, Dave uses his DJ’ing talents as a sound-bed for tweaking his musical creations to perfection. His work ethic is legendry, having been involved in well over 200 productions, countless albums and a healthy stack of hit singles. Through releasing tracks such as ‘Must Be The Music’, ‘Make A Move On Me’, ‘Can’t Get High Without You’ and Jakatta’s ‘American Dream’ and ‘My Vision’, Dave has established himself as a true professional who keeps getting better. Widely considered an expert in all things funk, soul and disco-related, Dave is also a helpful ‘consultant’ depended on by radio and TV producers worldwide. \n  \nBorn on the Isle of Wright, Dave grew up on the south coast of England during the late 70’s and early 80’s listening to local radio stations and the sounds of Earth Wind & Fire, Heatwave, Shalamar and The Jacksons. A lack of good quality music at the time encouraged Dave to seek inspiration in the record shops of London. This soon led to a job at London vinyl store Smithers & Leigh where he first heard the revered house classics ‘Jack Your Body’ and ‘I Can Feel It’, sounds that were major inspirations for him to produce his own records.\n  \nFollowing the closure of Smithers & Leigh, Dave joined Rough Trade Distribution where he was charged with setting up its dance music arm, Demix. It was here where Dave started working with the Rhythm King label, which had had a number of hits with acts like Bomb The Bass, S-Express, Cookie Crew and Beatmasters. \n \nHis experience in advising other labels led to Dave establishing his own imprint, Republic Records, in 1988. Now defunct, Republic is today remembered as the UK’s first soulful house label releasing classics such as Phase II “Reachin” and Turntable Orchestra “You’re Gonna Miss Me”. This was also home the first Dave Lee production, M.D.Emm.'s ‘Get Busy’, which reached #88 in the UK charts and #18 in the club charts. His most successful work during this time, according to Dave himself, was ‘Forever Together’, released under his Raven Maize alter ego. Dave created hype by licensing the song to NY label Quark and created a story of an ex-convict who played in a steel band in Disney Land, even using a computer-enhanced image of a friend sporting an afro as a press shot.\n  \nThe name Joey Negro came about in 1990 when Dave released “Do It Believe It’ on uber cool US cult house label Nu Groove. Not being able to think of an act name and being pressed for label copy Dave took the name from two records in a pile next to his desk – one by Pal Joey and another by J Walter Negro. “I certainly never expected that I’d still be addressed as Joey 20 years later” smiles Dave. The track was a breakthrough success and was followed by ‘Do What You Feel’, which Dave released on his second label and successor to Republic, Z Records. Virgin eventually released ‘Do What You Feel’ and the song became both a club hit and top 40 pop hit. Another Top 40 “Love Fantasy” and an album “Universe of Love” followed soon after.\n \nThroughout the 90’s and 00’s Dave continued to release a stream of his own productions on his label Z Records (as well as other choice indies JBO, Azuli and NRK). Z continues to release a single per month and draft in the best remixers to work on Dave’s music with Dennis Ferrer, Henrik Schwarz, Ame and Jimpster all having recently contributed.\n \n\n\n\n\n\nDave’s reputation as a highly-skilled producer and remixer has resulted in many chart-topping liaisons with high profile pop acts over the years. He has completed well over a hundred remixes for stars including Kelly Rowland, Mariah Carey, Royksopp, Roisin Murphy, Sugababes, Empire of The Sun, Diana Ross, Pet Shop Boys, Roy Ayers, Simply Red, and Lionel Ritchie. Dave was also behind Take That’s “Relight My Fire”, suggesting it as a cover then producing the finished result. Dave has since produced tracks for 911, Robbie Williams and Shayne Ward.\n \nHis hard work and brilliant remixes for both dance and pop artists alike led to Dave’s crowning as Best UK Remixer by both DMC/Mixmag and DJ magazine in 1992. \n \nBeing such a well known train spotter Dave has been behind over 20 compilation releases including his ‘Joey Negro In The House’ release on Defected, ‘Disco Spectrum’ 1 – 3 (BBE), ‘Jumpin’ series, “Disco (Not Disco)”, Southport Weekender Volume 1, ‘Nite:Life’ and ‘Back In The Box’ releases on NRK plus his ‘The Trip’ and ‘Lust: Art & Soul’ compilations have further spread this master’s influence. Along with record collecting friend Sean P, Dave has also compiled a number of highly regarded soul and disco compilations for his Z Records label. ‘Destination Boogie’, ‘Locked In The Vinyl Cellar’, ‘Supafunkanova’ the ‘Soul of Disco’ (1-3)  albums and the latest labour of love ‘Back Street Brit Funk’ have further cemented Dave as being one of the foremost authorities on music old and new.    \n  \nDave’s impressive discography has ensured he has remained in demand on the global DJ circuit, playing at the biggest and best venues over the world. As a DJ Dave strives to reflect this extensive love of music by playing eclectic sets, which go from rare disco thru to vocal and classic house often into more electronic techy deep sounds. \n  \nThese sets often showcase the many re-edits and updates of old and obscure tracks he’s become famous for. “I’m forever chopping up both new and old records in the studio to make them work better within my sets’ he explains. ‘I can’t help myself, I want dancers to experience the very best highs a records has to offer, even if it means I have to spend a few days in the studio re-arranging something. I couldn’t be a producer without being a DJ and certainly DJ’ing would be a whole lot less fun if I didn’t get to tweak the music I was playing out.”\n  \nAs well as being one of the most in demand dj’s around Dave has also found time to turn his much-loved Sunburst Band project into a full-fledged live band. The 7 piece band is made up of some of the best musicians around including Tony Remy, Pete Simpson and Frank Tontoh. The band continue to go from strength to strength playing sell out shows at Southport Weekender, Jazz Café, London, the legendary Ronnie Scott’s, London, the newly refurbished Band On The Wall venue, Manchester as well as international shows in Croatia, Dubai, Serbia and Austria.\n  \nLast year Dave released a new studio album as Akabu, the debut for his more deep-tech-house orientated guise. The LP titled ‘The Phuture Ain’t What It Used To Be’ received praise from the likes of Carl Craig, Josh Wink and Nic Fancuili as well as great reviews in the press, who were impressed with Dave’s ability to produce something very different to the sound he is normally associated with. 2010 also saw Dave celebrate 20 Years of Joey Negro with some special live PA shows that included all his most well-known and best loved hits from across his 20 year career. These live shows were supported by a special edition triple CD mixed by Grant Nelson and DJ Spinna and feature more exclusive tracks, remixes and edits… \n\nThings haven’t slowed down for Mr Lee in 2011. “No Sugar”, his collaboration with Gramophondzie and Shea Soul being one of the few tunes to reach the top 5 on both Beatport and Traxsource. The latest Soul of Disco comp was widely regarded as the best so far. Dave’s revamp of Muzique “Keep on Jumpin” held the number one spot on Beatport for most of August. While at the beginning on September there were 4 Joey Negro Remixes in the Traxsource top 5 - which must be a record. Unlike many producers who’ve been in the game as long, Dave certainly keeps himself constantly busy in the studio with a constant stream of high achieving singles on Z, while a fourth Sunburst Band album is also close to completion. \n  \nDave Lee, Joey Negro, Jakatta, Raven Maize, Z Factor, call him what you will, but his ability is without question and his status as one of the most gifted and hard-working individuals in world music circles is as true as ever.\n <a href=\"https://www.last.fm/music/Joey+Negro\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
