{"artist":{"name":"John Fogerty","mbid":"c3649208-0ebe-449b-b1d7-4bd6c560f109","url":"https://www.last.fm/music/John+Fogerty","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/89844515c8da404ca2df5574257495e9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/89844515c8da404ca2df5574257495e9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/89844515c8da404ca2df5574257495e9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/89844515c8da404ca2df5574257495e9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/89844515c8da404ca2df5574257495e9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/89844515c8da404ca2df5574257495e9.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"323202","playcount":"3232900"},"similar":{"artist":[{"name":"Creedence Clearwater Revival","url":"https://www.last.fm/music/Creedence+Clearwater+Revival","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8e2b97bb088b4291afc12a36a6405990.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8e2b97bb088b4291afc12a36a6405990.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8e2b97bb088b4291afc12a36a6405990.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8e2b97bb088b4291afc12a36a6405990.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8e2b97bb088b4291afc12a36a6405990.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8e2b97bb088b4291afc12a36a6405990.png","size":""}]},{"name":"John Mellencamp","url":"https://www.last.fm/music/John+Mellencamp","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fabefafa58b5439aaca6e602eaebe844.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fabefafa58b5439aaca6e602eaebe844.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fabefafa58b5439aaca6e602eaebe844.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fabefafa58b5439aaca6e602eaebe844.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fabefafa58b5439aaca6e602eaebe844.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fabefafa58b5439aaca6e602eaebe844.png","size":""}]},{"name":"The Fabulous Thunderbirds","url":"https://www.last.fm/music/The+Fabulous+Thunderbirds","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/464457e38dc04866aa268ca462972d86.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/464457e38dc04866aa268ca462972d86.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/464457e38dc04866aa268ca462972d86.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/464457e38dc04866aa268ca462972d86.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/464457e38dc04866aa268ca462972d86.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/464457e38dc04866aa268ca462972d86.png","size":""}]},{"name":"Joe Walsh","url":"https://www.last.fm/music/Joe+Walsh","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/627531606bd04365a64a49fcd32b0efc.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/627531606bd04365a64a49fcd32b0efc.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/627531606bd04365a64a49fcd32b0efc.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/627531606bd04365a64a49fcd32b0efc.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/627531606bd04365a64a49fcd32b0efc.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/627531606bd04365a64a49fcd32b0efc.png","size":""}]},{"name":"Bob Seger & The Silver Bullet Band","url":"https://www.last.fm/music/Bob+Seger+&+The+Silver+Bullet+Band","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8ad7b0b5aa5c4e94952c01789b1986b3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8ad7b0b5aa5c4e94952c01789b1986b3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8ad7b0b5aa5c4e94952c01789b1986b3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8ad7b0b5aa5c4e94952c01789b1986b3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8ad7b0b5aa5c4e94952c01789b1986b3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8ad7b0b5aa5c4e94952c01789b1986b3.png","size":""}]}]},"tags":{"tag":[{"name":"classic rock","url":"https://www.last.fm/tag/classic+rock"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"Southern Rock","url":"https://www.last.fm/tag/Southern+Rock"},{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/John+Fogerty/+wiki"}},"published":"03 Mar 2006, 20:40","summary":"John Cameron Fogerty (born May 28, 1945 in Berkeley, California, USA) is an American rock singer, songwriter, and guitarist, best known for his time with the swamp rock/roots rock band Creedence Clearwater Revival and as a solo recording artist.\n\nJohn Fogerty began a solo career, originally under the name The Blue Ridge Rangers for his 1973 LP debut. Fogerty played all of the instruments on covers of others' country music hits, such as \"Jambalaya\" (which was a Top 40 hit). <a href=\"https://www.last.fm/music/John+Fogerty\">Read more on Last.fm</a>","content":"John Cameron Fogerty (born May 28, 1945 in Berkeley, California, USA) is an American rock singer, songwriter, and guitarist, best known for his time with the swamp rock/roots rock band Creedence Clearwater Revival and as a solo recording artist.\n\nJohn Fogerty began a solo career, originally under the name The Blue Ridge Rangers for his 1973 LP debut. Fogerty played all of the instruments on covers of others' country music hits, such as \"Jambalaya\" (which was a Top 40 hit). Prior to performing country & western tunes he released a rock & roll single in late 1973, also as The Blue Ridge Rangers. The two John Fogerty penned songs were \"You Don't Owe Me\" and \"Back In The Hills\" (Fantasy F-710).\n\nIn early 1974 John Fogerty released two rock & roll tunes on a 7\"-single. The two songs were the vocal \"Comin' Down The Road\" b/w the instrumental \"Ricochet\". His second solo album John Fogerty was released in 1975. Sales were slim and legal problems delayed a followup, though it yielded \"Rockin' All Over the World\", a top 40 hit for Fogerty in North America.\n\nFogerty finished an album called Hoodoo in 1976. A single, \"You Got The Magic\" b/w \"Evil Thing\", preceded the album's release, but it performed poorly. The album, for which covers had already been printed, was rejected by Asylum Records a couple weeks before its scheduled release, and Fogerty agreed that it wasn't up to his usual high standards. Fogerty told Asylum Records to destroy the master tapes for Hoodoo sometime in the 1980s. Fogerty is something of a perfectionist, often destroying unreleased material. Fogerty says that he was unable to write music during this period of his life.\n\nFogerty's solo career re-emerged in full force with 1985's Centerfield, his first album for Warner Bros. Records (which took over co-ownership of Asylum's contract with Fogerty). Centerfield went to the top of the charts and included a top-ten hit in \"The Old Man Down The Road\"; the title track is frequently played on classic rock radio and at baseball games to this day. But that album was not without its legal snags either.\n\nTwo songs on the album, \"Zanz Kant Danz\" and \"Mr Greed\", were believed to be attacks on Fogerty's former boss at Fantasy Records, Saul Zaentz. \"Zanz Kant Danz\" was about a pig who can't dance but would \"steal your money\". When Zaentz responded with a lawsuit, Fogerty issued a revised version of \"Zanz Kant Danz\" (changing the lead character's name to Vanz). Another lawsuit claimed that \"The Old Man Down The Road\" shared the same chorus as \"Run Through The Jungle\" (a song from Fogerty's days with Creedence to which Fantasy Records had owned the publishing rights). Fogerty ultimately won his case when he proved that the two songs were wholly distinct compositions.\n\nThe followup album to Centerfield was Eye of the Zombie in 1986, which was less successful. Fogerty toured behind the album, but he refused to play any Creedence material. The album took on a darker mood, talking about a troubled society, terrorism, and pop stars selling out. For years, he refused to play material from the Zombie album. However, \"Change In The Weather\" was included in the set list for his 2009 tour. Fogerty played Creedence material again at a concert in Washington, D.C., for Vietnam veterans that took place on July 4, 1987. The show was aired on HBO. Aside from the show at the Palomino, this was the first time Fogerty had performed any Creedence Clearwater Revival songs for a large audience since 1972.\n\nFogerty traveled to Mississippi in 1990 for inspiration and visited the gravesite of blues legend Robert Johnson. He realized that Robert Johnson was the true spiritual owner of the songs Johnson had written. Fogerty decided to start making a new album and to perform his old Creedence material regularly in concert.[4][5] It was at this time visiting the Mt. Zion Missionary Baptist Church cemetery that Fogerty met Skip Henderson, a New Jersey vintage guitar dealer who had formed a nonprofit corporation The Mt. Zion Memorial Fund to honor Johnson with a memorial marker. Fogerty subsequently funded headstones for Charlie Patton, James Son Thomas, Mississippi Joe Callicott, Eugene Powell, Lonnie Pitchford and helped with financial arrangements for numerous others.[6]\n\nCreedence Clearwater Revival was inducted into the Rock and Roll Hall of Fame in 1993. John Fogerty refused to perform with his former band mates and fellow inductees Stu Cook and Doug Clifford during the musical portion of the induction ceremony. In place of the surviving members of CCR, Fogerty recruited LA session musicians on drums and bass and was also joined by Bruce Springsteen and Robbie Robertson in performing three songs; \"Who'll Stop The Rain\", \"Born On The Bayou\" and \"Green River\".\n\nFogerty returned to the commercial music industry in 1997 with Blue Moon Swamp. The layoff between Zombie and Swamp had been longer than his mid-'70s-mid-'80s break. The album was much more successful than his previous effort and won the Grammy for best rock album in 1997. A live album of the equally successful tour was released to similar acclaim and good sales.\n\nIt seemed as though Fogerty was back, but again he drifted out of the mainstream, only returning after another break in 2004. Deja Vu (All Over Again) was Fogerty’s next release. His new record contract was with DreamWorks Records, which had taken over distribution of Fogerty's Warner Bros. catalog. Rolling Stone wrote: \"The title track is Fogerty's indictment of the Iraq war as another Vietnam, a senseless squandering of American lives and power\". On the album, Fogerty squeezed 10 songs into only 34 minutes.\n\nThe sale of Fantasy Records to Concord Records in 2004 ended the 30+-year estrangement between Fogerty and his former label as the new owners took steps to restore royalty rights Fogerty gave up in order to be released from his contract with Fantasy in the mid 1970s. In September 2005, Fogerty returned to Fantasy Records. That was made possible when DreamWorks Records' non-country music unit was absorbed by Geffen Records, which dropped Fogerty but continued to distribute his earlier solo albums. The first album released under the new Fantasy contract was The Long Road Home, a compilation CD combining his Creedence hits with solo material which was issued in November 2005. A live CD and DVD concert was released the following year.\n\nFogerty’s touring schedule increased in the period after Deja Vu (All Over Again). In October 2004, Fogerty appeared on the Vote for Change tour, playing a series of concerts in American swing states. Centerfield was also played at the 2008 Republican National Convention when John McCain introduced Sarah Palin as his running mate. Fogerty's numbers were played with Bruce Springsteen and the E Street Band. Fogerty toured with John Mellencamp in the summer of 2005 and with Willie Nelson in the summer of 2006. On June 29, 2006 he played his first headlining British concert since 1972, at the Hammersmith Apollo theater in London, as part of the European leg of the tour. During that leg, he also performed in Sundsvall, Sweden, where 25,000 people came to see him perform at the town square. On Thanksgiving Day of 2006, Fogerty performed at halftime at the Miami Dolphins/Detroit Lions game as well as at the Denver Broncos/Kansas City Chiefs halftime later that evening.\n\nAlongside, Bill Withers, the Sherman Brothers, Steve Cropper and Isaac Hayes and David Porter, Fogerty was named to the Songwriters Hall of Fame in 2005.\n\nFogerty features on Jerry Lee Lewis's album \"Last Man Standing\" issued 26 September 2006, duetting on a recording of \"Travellin' Band\". He also participated in the live set follow-up \"Last Man Standing - Live\", joining Lewis for a duet of \"CC Rider\", \"Will The Circle Be Unbroken\" (also featuring Kris Kristofferson), and concluding with a performance of \"Good Golly Miss Molly\", with Lewis backing him on piano.\n\nFogerty completed his first new country and rock album in three years, Revival, which was released on October 2, 2007. Heavily promoted by the label, Revival debuted at number 14 on the U.S. Billboard 200 chart with sales about 65,000 copies in its first week. Revival was nominated for a Grammy Award for Best Rock Album of 2008 but lost to the Foo Fighters.\n\nOn February 10, 2008, he appeared with Jerry Lee Lewis and Little Richard on the Grammy Award's Show. Along with these rock icons and his regular touring band, he played his ultra-rare 1973 single \"Comin' Down The Road\" leading into Lewis and Richard's performances of \"Great Balls Of Fire,\" and \"Good Golly Miss Molly,\" respectively.\n\nOn March 16, 2008, Fogerty kicked off an Australian tour. On March 22 in Point Nepean, Australia, surprise guest Keith Urban joined Fogerty on stage, performing two songs: \"Broken Down Cowboy,\" off Fogerty's newest album Revival, and \"Cotton Fields,\" from CCR's album Willy & the Poor Boys.\n\nFogerty's current touring band includes Dave Santos on bass, Kenny Aronoff on drums, Matt Nolen on keyboards, guitar & mandolin, Hunter Perrin on guitars Billy Burnette (of Fleetwood Mac fame) on guitars, and Dan Hochhalter on fiddle, mandolin, and guitars.\n\nOn June 24, 2008, Fogerty made a return to the Royal Albert Hall, a venue he last played with CCR in 1971. It was the last concert on his 2008 European Tour. This concert was filmed (causing staging problems that annoyed some fans) and, according to his website, is to be released in early 2009.\n\nOn December 10, 2008, a Billboard article announced that besides the Royal Albert Hall DVD, Fogerty was working on recording a new album of mostly country covers. The album is a sequel to his 1973 solo debut The Blue Ridge Rangers and will be called The Blue Ridge Rangers Rides Again. It will be released on September 1, 2009 and will contain a duet with Bruce Springsteen on the 1960 Everly Brothers classic \"When Will I Be Loved?.\"[15] In addition, Don Henley and Timothy B. Schmit of The Eagles sing with Fogerty on a cover of Rick Nelson's 1972 classic \"Garden Party.\"\n\nOn April 16, 2009, Fogerty performed his hit \"Centerfield,\" from center field, at the opening day festivities of the new Yankee Stadium.[16]\n\nOn July 2,3,and 4, 2009 John Fogerty performed with the Los Angeles Philharmonic at the Hollywood Bowl. The Bowl was completely sold out. The night included a fireworks display. Although the night was billed as Fogerty with the LA Philharmonic, the LA Philharmonic began the night with music by American composers, and Fogerty and his band came on after intermission and played all of his greatest hits. Fogerty and his band only played one song with the orchestra.\n\nFrom Wikipedia, the free encyclopedia\n\n\n <a href=\"https://www.last.fm/music/John+Fogerty\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
