{"artist":{"name":"John Hiatt","mbid":"e78202c9-7717-435c-9aac-dd5ebc4e64d5","url":"https://www.last.fm/music/John+Hiatt","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0baa40bf63c64c41ae76532f8d239563.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0baa40bf63c64c41ae76532f8d239563.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0baa40bf63c64c41ae76532f8d239563.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0baa40bf63c64c41ae76532f8d239563.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0baa40bf63c64c41ae76532f8d239563.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0baa40bf63c64c41ae76532f8d239563.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"282840","playcount":"2899268"},"similar":{"artist":[{"name":"Lyle Lovett","url":"https://www.last.fm/music/Lyle+Lovett","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/04d52a301b274880a73f73ac2e47484d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/04d52a301b274880a73f73ac2e47484d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/04d52a301b274880a73f73ac2e47484d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/04d52a301b274880a73f73ac2e47484d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/04d52a301b274880a73f73ac2e47484d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/04d52a301b274880a73f73ac2e47484d.png","size":""}]},{"name":"Steve Earle","url":"https://www.last.fm/music/Steve+Earle","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/75e0740afed947758e3d4cefe70f92ab.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/75e0740afed947758e3d4cefe70f92ab.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/75e0740afed947758e3d4cefe70f92ab.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/75e0740afed947758e3d4cefe70f92ab.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/75e0740afed947758e3d4cefe70f92ab.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/75e0740afed947758e3d4cefe70f92ab.png","size":""}]},{"name":"Bonnie Raitt","url":"https://www.last.fm/music/Bonnie+Raitt","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9fcd02cfc02143f8b365d0fcbdd1042a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9fcd02cfc02143f8b365d0fcbdd1042a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9fcd02cfc02143f8b365d0fcbdd1042a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9fcd02cfc02143f8b365d0fcbdd1042a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9fcd02cfc02143f8b365d0fcbdd1042a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9fcd02cfc02143f8b365d0fcbdd1042a.png","size":""}]},{"name":"Graham Parker","url":"https://www.last.fm/music/Graham+Parker","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/057d88088fea4ee09d3d636fec8beeeb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/057d88088fea4ee09d3d636fec8beeeb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/057d88088fea4ee09d3d636fec8beeeb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/057d88088fea4ee09d3d636fec8beeeb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/057d88088fea4ee09d3d636fec8beeeb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/057d88088fea4ee09d3d636fec8beeeb.png","size":""}]},{"name":"Rosanne Cash","url":"https://www.last.fm/music/Rosanne+Cash","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8f6d89eead5344af8135853f3afa12f6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8f6d89eead5344af8135853f3afa12f6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8f6d89eead5344af8135853f3afa12f6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8f6d89eead5344af8135853f3afa12f6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8f6d89eead5344af8135853f3afa12f6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8f6d89eead5344af8135853f3afa12f6.png","size":""}]}]},"tags":{"tag":[{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"Alt-country","url":"https://www.last.fm/tag/Alt-country"},{"name":"americana","url":"https://www.last.fm/tag/americana"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/John+Hiatt/+wiki"}},"published":"26 Apr 2006, 07:21","summary":"John Hiatt (born on August 20, 1952 in Indianapolis, Indiana, U.S.) is an American blues and rock guitarist, pianist, and singer-songwriter. He has been nominated for eleven Grammy Awards. Hiatt's sales have never quite matched his reputation. His songs have been covered by a wide variety of artists such as Bonnie Raitt, Ronnie Milsap, Willie Nelson, Iggy Pop, Three Dog Night, and The Neville Brothers, yet it took him thirteen years to reach the charts himself. <a href=\"https://www.last.fm/music/John+Hiatt\">Read more on Last.fm</a>","content":"John Hiatt (born on August 20, 1952 in Indianapolis, Indiana, U.S.) is an American blues and rock guitarist, pianist, and singer-songwriter. He has been nominated for eleven Grammy Awards. Hiatt's sales have never quite matched his reputation. His songs have been covered by a wide variety of artists such as Bonnie Raitt, Ronnie Milsap, Willie Nelson, Iggy Pop, Three Dog Night, and The Neville Brothers, yet it took him thirteen years to reach the charts himself.\n\nAs well, it nearly took him that long to find his own style. Hiatt began his solo career in 1974, and over the next decade he ran through a number of different styles from rock & roll to new wave-esque pop before he finally settled on a rootsy fusion of rock, country, blues, and folk with his 1987 album 'Bring the Family'. Though the album didn't set the charts on fire, it became his first album to gain some major commercial success, and several of the songs on the record became hits for other artists, including the aforementioned Raitt and Milsap. Following its success, Hiatt became a reliable hit songwriter for other artists, and he developed a strong cult following that continued to gain strength into the mid-90s.\n\nWhile he was growing up in his hometown of Indianapolis, Indiana, Hiatt played in a number of garage bands. Initially, he was inspired by the Rolling Stones and Bob Dylan, and the music of those two artists would echo strongly throughout his work. Out of all the bar bands he played with in the late 60s, a group called The White Ducks was the one that received the most attention. Following his high-school graduation, he moved to Nashville, Tennessee at the age of 18, where he landed a job as a songwriter for Tree Publishing.\n\nFor the next several years, he wrote and performed at local clubs and hotels. Within a few years, his songs were being recorded by several different artists, including Conway Twitty, Tracy Nelson, and Three Dog Night, who took Hiatt's \"Sure as I'm Sittin' Here\" to number 16 in the summer of 1974. Eventually, his manager secured him an audition at Epic Records, and the label signed him in 1974, releasing his debut album, Hangin' Around the Observatory, later that year. Despite their critical acclaim, neither Hangin' Around the Observatory nor its 1975 follow-up Overcoats sold many copies, and he was dropped by the label. By the end of the year, Tree Publishing had let him go as well.\n\nFollowing his failure in Nashville, Hiatt moved out to California. By the summer of 1978 he had settled in Los Angeles, where began playing in clubs, opening for folk musicians including Leo Kottke. With Kottke's assistance, Hiatt hired a new manager, Denny Bruce, who helped him secure a record contract with MCA Records. Slug Line, his first record for MCA, was released in the summer of 1979. Where his first two records were straight-ahead rock & roll and folk-rock, Slug Line was in the new wave vein of angry English singer/songwriters like Elvis Costello, Graham Parker, and Joe Jackson, as if Hiatt was vying for the role of the American angry young man. The new approach earned some strong reviews, yet it failed to generate any sales. Two Bit Monsters, his second MCA album, faced the same situation. Although it was well-received critically upon its 1980 release, it made no impression on the charts, and the label dropped him.\n\nApart from working on Two Bit Monsters, Hiatt spent most of 1980 as a member of Ry Cooder's backing band, playing rhythm guitar on the Borderline album and touring with the guitarist. Hiatt stayed with Cooder throughout 1981, signing a new contract with Geffen Records by the end of the year. Produced by Tony Visconti (David Bowie, T. Rex), his Geffen debut All of A Sudden was released in 1982, followed by the Nick Lowe/Scott Matthews & Ron Nagel-produced Riding With the King in 1983. As with his previous records for Epic and MCA, neither of his first two Geffen releases sold well. By this time, Hiatt's personal life was beginning to spin out of control as he was sinking deep into alcoholism. Around the time he completed 1985's Warming Up to the Ice Age, his second wife committed suicide. Following the release of Warming Up to the Ice Age, Hiatt was dropped by Geffen. By the end of 1985, he had entered a rehabilitation program. During 1986, he remarried and signed a new deal with A&M Records.\n\nFor his A&M debut, Hiatt assembled a small band comprising his former associates Ry Cooder (guitar), Nick Lowe (bass), and Jim Keltner (drums). Recorded over the course of a handful of days, the resulting album, Bring the Family, had a direct, stripped-down rootsy sound that differed greatly from his earlier albums. Upon its summer 1987 release, Bring the Family received the best reviews of his career and, for once, the reviews began to pay off, as the album turned into a cult hit, peaking at 107 on the U.S. charts; it was his first charting album. Hiatt attempted to record a follow-up with Cooder, Lowe, and Keltner, but the musicians failed to agree on the financial terms for the sessions. Undaunted, he recorded an album with John Doe, David Lindley, and Dave Mattacks, but he scrapped the completed project, deciding that the result was too forced. Hiatt's final attempt at recording the follow-up to Bring the Family was orchestrated by veteran producer Glyn Johns, who had him record with his touring band, the Goners. Despite all of the behind-the-scenes troubles behind its recording, the follow-up album, Slow Turning, actually appeared rather quickly, appearing in the summer of 1988.\n\nSlow Turning, like Bring the Family before it, received nearly unanimous positive reviews and it was fairly well-received commercially, spending 31 weeks on the U.S. charts and peaking at 98. Within the next year, Hiatt successfully toured throughout America and Europe, strengthening his fan base along the way. Inspired by the success of Hiatt's two A&M albums, Geffen released the compilation Y' All Caught? The Ones That Got Away 1979-85 in 1989. That same year, other artists began digging through Hiatt's catalog of songs, most notably Bonnie Raitt, who covered \"Thing Called Love\" for her multi-platinum comeback album, Nick of Time.\n\nIn 1990, Hiatt returned with Stolen Moments, which was nearly as successful as Slow Turning, both critically and commercially. \"Bring Back Your Love to Me,\" an album track from Stolen Moments that was also recorded by Earl Thomas Conley, won BMI's 1991 Country Music Award. By the time \"Bring Back Your Love to Me\" won that award, it had become a standard practice for artists to cover Hiatt's songs, as artists as diverse as Bob Dylan, Ronnie Milsap, Suzy Bogguss, and Iggy Pop all covered his songs in the early '90s. In 1993, Rhino Records released Love Gets Strange: The Songs of John Hiatt, which collected many of the cover versions that were recorded during the '80s and '90s.\n\nDuring 1991, the group that recorded Bring the Family — Hiatt, Cooder, Lowe, and Keltner — re-formed as a band called Little Village, releasing their eponymous debut in early 1992. Based on the success of Bring the Family and Hiatt's A&M albums, expectations for Little Village were quite high, yet the record and its supporting tour were considered a major disappointment. Later, the individual members would agree that the band was a failure, mainly due to conflicting egos.\n\nHiatt decided to back away from the superstar nature of Little Village for his next album, 1993's Perfectly Good Guitar. Recorded in just two weeks with a backing band comprised of members of alternative rock bands School of Fish and Wire Train, the album was looser than any record since Bring the Family, but it didn't quite have the staying power of its two predecessors, spending only 11 weeks on the charts and peaking at number 47. The following year, he released his first live album, Hiatt Comes Alive at Budokan? Hiatt left A&M Records after the release of the record, signing with Capitol Records the following year.\n\nWalk On, Hiatt's first Capitol album, was recorded during his supporting tour for Perfectly Good Guitar and featured guest appearances by the Jayhawks and Bonnie Raitt. Walk On entered the charts at 48, but slipped off the charts in nine weeks, indicating that his audience had settled into a dedicated cult following. Fittingly, after 1997's Little Head quickly came and went in the marketplace, Hiatt parted ways with Capitol, and his next album, 2000's Crossing Muddy Waters was released on the established independent imprint Vanguard Records. After a second album with Vanguard, The Tiki Bar Is Open, Hiatt alligned himself with another independent label, New West, for the release of his 2003 set Beneath This Gruff Exterior. Master of Disaster, along with CD and DVD versions of Live from Austin, TX followed in 2005. \n\nSame Old Man followed in 2008; then The Open Road in 2010. <a href=\"https://www.last.fm/music/John+Hiatt\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
