{"artist":{"name":"John Holt","mbid":"38d64df7-5b7f-42ca-9d98-9541640ca84f","url":"https://www.last.fm/music/John+Holt","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9d51ce3cce72465db14a3b080da40964.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9d51ce3cce72465db14a3b080da40964.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9d51ce3cce72465db14a3b080da40964.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9d51ce3cce72465db14a3b080da40964.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9d51ce3cce72465db14a3b080da40964.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9d51ce3cce72465db14a3b080da40964.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"235040","playcount":"1625557"},"similar":{"artist":[{"name":"Gregory Isaacs","url":"https://www.last.fm/music/Gregory+Isaacs","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a5c7191002794a5e91b49995f47f48df.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a5c7191002794a5e91b49995f47f48df.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a5c7191002794a5e91b49995f47f48df.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a5c7191002794a5e91b49995f47f48df.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a5c7191002794a5e91b49995f47f48df.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a5c7191002794a5e91b49995f47f48df.png","size":""}]},{"name":"Dennis Brown","url":"https://www.last.fm/music/Dennis+Brown","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/494d02b3c8694349a258f4e7eb900a53.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/494d02b3c8694349a258f4e7eb900a53.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/494d02b3c8694349a258f4e7eb900a53.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/494d02b3c8694349a258f4e7eb900a53.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/494d02b3c8694349a258f4e7eb900a53.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/494d02b3c8694349a258f4e7eb900a53.png","size":""}]},{"name":"Delroy Wilson","url":"https://www.last.fm/music/Delroy+Wilson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/48d86fcd811e4879a323e2d5d7e61644.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/48d86fcd811e4879a323e2d5d7e61644.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/48d86fcd811e4879a323e2d5d7e61644.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/48d86fcd811e4879a323e2d5d7e61644.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/48d86fcd811e4879a323e2d5d7e61644.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/48d86fcd811e4879a323e2d5d7e61644.png","size":""}]},{"name":"Ken Boothe","url":"https://www.last.fm/music/Ken+Boothe","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5713d99b7ecf413d9c8519fbceeaf5fb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5713d99b7ecf413d9c8519fbceeaf5fb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5713d99b7ecf413d9c8519fbceeaf5fb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5713d99b7ecf413d9c8519fbceeaf5fb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5713d99b7ecf413d9c8519fbceeaf5fb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5713d99b7ecf413d9c8519fbceeaf5fb.png","size":""}]},{"name":"Marcia Griffiths","url":"https://www.last.fm/music/Marcia+Griffiths","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f9d07580e9504d9099f209054d890cb5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f9d07580e9504d9099f209054d890cb5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f9d07580e9504d9099f209054d890cb5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9d07580e9504d9099f209054d890cb5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9d07580e9504d9099f209054d890cb5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9d07580e9504d9099f209054d890cb5.png","size":""}]}]},"tags":{"tag":[{"name":"reggae","url":"https://www.last.fm/tag/reggae"},{"name":"roots reggae","url":"https://www.last.fm/tag/roots+reggae"},{"name":"rocksteady","url":"https://www.last.fm/tag/rocksteady"},{"name":"jamaica","url":"https://www.last.fm/tag/jamaica"},{"name":"roots","url":"https://www.last.fm/tag/roots"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/John+Holt/+wiki"}},"published":"09 Jul 2006, 09:15","summary":"John Kenneth Holt (born 11 July 1947 in Kingston, Jamaica; died 19 October 2014 in London, England) was a reggae singer and songwriter who first found fame as a member of the Paragons before establishing himself as a solo artist. Amongst the songs he wrote was \"The Tide Is High\" (later made famous by Blondie and also covered by Atomic Kitten).\n\nOn an island renowned for its superb vocalists and composers, John Holt remains head and shoulders above the rest as one of Jamaica's sweetest singers and enduring songwriters. <a href=\"https://www.last.fm/music/John+Holt\">Read more on Last.fm</a>","content":"John Kenneth Holt (born 11 July 1947 in Kingston, Jamaica; died 19 October 2014 in London, England) was a reggae singer and songwriter who first found fame as a member of the Paragons before establishing himself as a solo artist. Amongst the songs he wrote was \"The Tide Is High\" (later made famous by Blondie and also covered by Atomic Kitten).\n\nOn an island renowned for its superb vocalists and composers, John Holt remains head and shoulders above the rest as one of Jamaica's sweetest singers and enduring songwriters. He voiced and penned so many of the country's classics that in a way, Holt defined the island's sound. Born in the Greenwich Farm area of Kingston, Jamaica, on July 11, 1947, the young Holt took his first steps into the music business via the talent show circuit. Talent shows have always had a massive popularity in Jamaica and the top ones were initially broadcast live on radio and later on television. Many of the island's greatest artists (Gregory Isaacs amongst them) made their first appearances in talent shows, and it has proved an excellent training ground for young hopefuls. \n\nIn 1958, the 12-year-old Holt entered his first contest, run by promoter Joseph Verejohn. Over the next four years, the youngster became a staple of these shows, notching up a record-breaking 28 titles. His dulcet tones were soon familiar to a much larger audience, as a number of these contests were broadcasts of Radio Jamaica. For his final victory in 1962, Holt performed Solomon Burke's \"Just Out of Reach.\" The talented teen was quickly snapped up by producer Leslie Kong, who recorded Holt's debut single, \"Forever I'll Stay\"/\"I Cried a Tear.\" From there, the youngster began working with producer Clive Chin, debuting the partnership with \"Rum Bumper,\" a duet with Alton Ellis. \n\nMore singles followed, but none really captured the island's imagination. That all began to change in 1964 when Holt joined the vocal group the Paragons, replacing founding member Leroy Stamp. It was about this time that another founding member, Junior Menz, also departed and his place taken by Howard Barrett. The group's lineup was completed by veteran members Bob Andy and Tyrone Evans, and it was this grouping that recorded \"Good Luck and Goodbye\" for Coxsone Dodd. Ironically, this is precisely what Andy said to his bandmates soon after the single's release, as he quit the group to pursue a solo career. Now reduced to a trio, and with both Evans and Barrett holding full-time jobs, Holt was entrusted with the dual role of composer and arranger, positions for which he turned out to be ideally suited. And the timing couldn't have been more perfect. Ska was withering under the hot Jamaican sun, with rocksteady rising to take its place. Its slower tempo was perfect for vocal groups and Holt's pen seemed especially cut for the easy going beat and pop flavor that the style embraced. Soon after, the trio linked with Duke Reid, a producer never at home with ska, but the ultimate purveyor of rocksteady. \n\nBy 1968, the Paragons were Jamaica's premier vocal group, with virtually every one of their releases a hit. Although the group did record covers (notably \"Island in the Sun\"), much of their material was composed by Holt and the popularity of his songs is evident by the number of other prominent vocalists who recorded their own cover versions of them. In 1968, Holt set off on a parallel solo career, recording for producers Bunny Lee and Harry J. The following year, the Paragons returned to Dodd, where the trio continued on a successful path. 1970, however, brought an abrupt end to the group when Evans and Barrett both went to the U.S. after being awarded scholarships. Holt, however, merely picked up the pace of his solo recordings, cutting songs for a variety of different producers. His work with Dodd was particularly exemplary and boasts a slew of classics, including \"Tonight,\" \"Stranger in Love,\" and \"A Love I Can Feel.\" The latter song titled Holt's 1971 album, which compiled many of his hits with Dodd. Like a Bolt, released that same year, bundles up recordings done with Duke Reid, including the hit \"Ali Baba,\" which quickly became one of Reid's most-versioned rhythms. Prince Buster cut a number of gems with the singer, including the exquisite \"Rain From the Sky,\" while Alvin Ranglin also recorded a number of charming numbers, notably \"Son of the Wise.\" During this same time, Phil Pratt scored a hit with a re-cut, \"My Heart Is Gone,\" a song Holt initially recorded for Dodd. Arguably the best work the singer recorded in the early '70s was for Bunny Lee, including the classic \"Tonight.\" However, their biggest success was a cover of \"Stick By Me,\" deliberately arranged to take advantage of the latest dance craze, the John Crow. The song stuck to the Jamaican charts for an amazing 23 weeks and became the biggest-selling single of the year. \n\nAmidst the growing pile of hit singles was also a clutch of albums, many picked up for U.K. release by the Trojan label. 1973's Holt and Still in Chains both helped Holt establish himself as a reggae artist extraordinaire and have since been repackaged on one CD by the British label See for Miles. In 1974, though, the singer released three albums — The Further You Look, Dusty Roads, and Sings for I — that showcased his penchant for ballads. Many of the tracks were self-penned, an exception to the cover-heavy records he'd previously released. Presenting the Fabulous John Holt is also comprised of ballads, but Duke Reid slathers them in a wondrously rootsy production, while Coxsonne Dodd gave the ballads Holt cut for him a superbly earthy atmosphere on A Love I Can Feel. That same year, the singer released the Harry Mudie-produced Time Is the Master, featuring the ultimate MOR package of covers accompanied by lush string arrangements. The title-track was another smash and the album spawned a clutch of further Jamaican hits. \n\nIt was obvious to Trojan that a crossover success was in their sights. The label brought Holt to the U.K. later in 1974, and set him to work with pop producer Tony Ashfield, who had arranged the strings on Time Is the Master. The end result was the covers collection 1000 Volts of Holt, which gave Holt his first U.K. hit with \"Help Me Make It Through the Night.\" Inevitably, two follow-ups were recorded — 2000 Volts and 3000 Volts — with both these albums were later combined onto a single disc. However, apparently Britain felt one reggae lite cover was enough and Holt was unable to equal the success of \"Help Me.\" \n\nEventually, he called it a day and headed home. He announced his return with 1976's Up Park Camp, which boasts both superbly re-cut classics and equally sublime new songs. The album's title-track was a fabulous take on the Heptones' \"Get in the Groove,\" with new cultural lyrics, and set the singer on the path for dancehall success. For the rest of the decade, Holt continued making the studio rounds, working with the likes of JoJo Hookim, and most notably reuniting with Bunny Lee. 1976's Winter World of Love captures only some of the magic of this latter partnership, which produced a clutch of fine singles. However, 1977's Holt Goes Disco suggests that the singer was beginning to lose his grip on his audience. That concern grew with 1981's Children of the World and the following year's Just the Two of Us, both bland AOR sets. In many ways, Holt had painted himself into a corner. As rocksteady had shifted into reggae, the singer had no trouble in transforming his songwriting toward the new genre. But as roots had taken hold, his own penchant for pop, and particularly love songs, no longer connected with younger fans. He had edged gracefully into the realms of MOR, but with age had come rebellion. In a rather belated conversion, Holt admitted to his Rastafarian beliefs in 1983 and began growing dreadlocks. \n\nThe previous year, the singer had performed at Reggae Sunsplash to much acclaim and had seen chart success with such fare as \"If I Were a Carpenter\" and covers of the Isley Brothers' \"This Old Heart of Mine\" and Lou Rawls' \"You'll Never Find a Love of Mine,\" but at the same time, Holt was also turning his attention back to the dancehalls. His intrigue with the DJ scene dated back over a decade, when the singer had attended a King Tubby sound system dance and was blown away by U-Roy toasting over his own classic hit \"Wear You to the Ball.\" Holt immediately introduced the DJ to Duke Reid, who launched U-Roy to stardom (\"Wear You to the Ball\" was the singer's third single for Reid, and his third number one). The DJ repaid Holt by recording a number of other versions of the singer's hits. Dennis Alcapone had also versioned a number of his songs. Linking up with producer Junjo Lawes, the singer cut a number of dancehall singles across 1982, including the hit \"Fat She Fat,\" and DJ superstar Yellowman also versioned a number of Holt's classics this same year. But none of this really prepared audiences for the Police in Helicopter album. Lawes' deep roots rhythms turned out to be the perfect accompaniment for Holt's songs, from the lightest pop to the heaviest hitting roots numbers. In one fell swoop, Holt had shed his family entertainer image and reinvented himself as a cultural hero. \n\nThe following year, the singer cut the equally strong \"If You Were My Lover\" for Prince Jammy, amongst a clutch of other recordings. 1985 brought a reunion with Bunny Lee for the Pure Gold album, which while enjoyable, didn't hold a candle to Helicopter. \n\nThe next year, the singer joined forces with singer/producer Dennis Brown for the Wild Fire album. It was during this period that both Holt and Brown became involved in a plot by veteran singers to fight the DJ phenomenon by saturating the market with vocal material. Gregory Isaacs, the most prolific of the conspirators, Dennis Brown, Ken Boothe, Delroy Wilson, and many others were involved and began releasing a deluge of material. It certainly wasn't personal, and in fact, virtually all the singers involved had happily collaborated with DJs over the years and continued to do so. Holt's relationship with U-Roy wasn't unique; Isaacs, for example, had a stream of hits with Trinity, a DJ Brown had also cut a single with. The conspirators logic was that the DJs reigned supreme only because there wasn't enough vocal product on the market. They intended on changing that. The down side was, of course, that over time every one of those involved would sully their own reputations by releasing too much inferior product. And although each of these artists would occasionally record an album worthy of their own legendary status, too many of their releases were mediocre at best. \n\nHolt was no exception. However, there are a number of albums from these later years worth picking up. For holiday parties, one can't beat 1986's The John Holt Christmas Album, which is split between traditional numbers and covers of rock's festive best from the likes of Slade, Mud, John Lennon, and George Michael — bizarre, but it works. Equally effective is 1989's Why I Care, which finds Holt back in the dancehall, accompanied by producer Hugh \"Redman\" James' most militant rhythms. In 1993, the singer decided to expand his musical horizons on Reggae Hip House R&B Flavour, and while not always successful, it is certainly intriguing. 1997's All Night Long features such guest stars as Johnnie Clarke, Screwdriver, and Latisha Vining, updating old hits and a few new numbers. But perhaps the best album of the decade, New Horizon, came at its end, a solid set overseen by Roy Francis and Computer Paul. \n\nAcross the decade, Holt made numerous acclaimed appearances at Reggae Sunsplash, and the singer continues to compose, record, and perform. All that's missing is a compilation worthy of Holt's genius. The best on offer was the Trojan label's My Girl Wears a Crown, which compiles the best of the singer's recordings with the Paragons. Of his solo material, Can't Keep Us Apart bundles up 20 singles cut with Bunny Lee and their dub companions.\n\nHaving been taken ill at the One Love Festival on 16 August, Holt died on 19 October 2014 in a London hospital. <a href=\"https://www.last.fm/music/John+Holt\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
