{"artist":{"name":"John Stevens","mbid":"c471ff4a-cc06-4fa9-8fac-553fa9ed1c0f","url":"https://www.last.fm/music/John+Stevens","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6dd929f42c2b47b8c75a3b41426303e1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6dd929f42c2b47b8c75a3b41426303e1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6dd929f42c2b47b8c75a3b41426303e1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6dd929f42c2b47b8c75a3b41426303e1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6dd929f42c2b47b8c75a3b41426303e1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6dd929f42c2b47b8c75a3b41426303e1.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"14307","playcount":"78189"},"similar":{"artist":[{"name":"Rory Partin","url":"https://www.last.fm/music/Rory+Partin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/31c594cadf854291872d55ab9469765e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/31c594cadf854291872d55ab9469765e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/31c594cadf854291872d55ab9469765e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31c594cadf854291872d55ab9469765e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31c594cadf854291872d55ab9469765e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31c594cadf854291872d55ab9469765e.png","size":""}]},{"name":"Frank Sinatra, Jr.","url":"https://www.last.fm/music/Frank+Sinatra,+Jr.","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e5bd65d956ca48dbbf73a6235fcc5a7b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e5bd65d956ca48dbbf73a6235fcc5a7b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e5bd65d956ca48dbbf73a6235fcc5a7b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5bd65d956ca48dbbf73a6235fcc5a7b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5bd65d956ca48dbbf73a6235fcc5a7b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5bd65d956ca48dbbf73a6235fcc5a7b.png","size":""}]},{"name":"Matt Belsante","url":"https://www.last.fm/music/Matt+Belsante","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9408043bbf334dcd942f8d1c04c8f728.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9408043bbf334dcd942f8d1c04c8f728.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9408043bbf334dcd942f8d1c04c8f728.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9408043bbf334dcd942f8d1c04c8f728.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9408043bbf334dcd942f8d1c04c8f728.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9408043bbf334dcd942f8d1c04c8f728.png","size":""}]},{"name":"Airmen of Note","url":"https://www.last.fm/music/Airmen+of+Note","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/feab86fa3470444cc41071ea9ea7810e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/feab86fa3470444cc41071ea9ea7810e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/feab86fa3470444cc41071ea9ea7810e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/feab86fa3470444cc41071ea9ea7810e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/feab86fa3470444cc41071ea9ea7810e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/feab86fa3470444cc41071ea9ea7810e.png","size":""}]},{"name":"Frank Sinatra & Tommy Dorsey","url":"https://www.last.fm/music/Frank+Sinatra+&+Tommy+Dorsey","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/05ee38471e304cbeb1ad0b18f1a50855.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/05ee38471e304cbeb1ad0b18f1a50855.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/05ee38471e304cbeb1ad0b18f1a50855.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05ee38471e304cbeb1ad0b18f1a50855.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05ee38471e304cbeb1ad0b18f1a50855.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05ee38471e304cbeb1ad0b18f1a50855.png","size":""}]}]},"tags":{"tag":[{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"American Idol","url":"https://www.last.fm/tag/American+Idol"},{"name":"american","url":"https://www.last.fm/tag/american"},{"name":"idols","url":"https://www.last.fm/tag/idols"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/John+Stevens/+wiki"}},"published":"25 Jul 2006, 15:51","summary":"1) English drummer\n2) American classic pop singer\n3) American tuba/euphonium player/composer\n----------------------------------\n1) John William Stevens (10 June 1940 in Brentford, Middlesex - 13 September 1994 in Ealing, West London) was an English drummer. He was one of the most significant figures in early free improvisation, and a founding member of the Spontaneous Music Ensemble (SME).\n\nStevens was born in Brentford, the son of a tap dancer. He used to listen to jazz as a child <a href=\"https://www.last.fm/music/John+Stevens\">Read more on Last.fm</a>","content":"1) English drummer\n2) American classic pop singer\n3) American tuba/euphonium player/composer\n----------------------------------\n1) John William Stevens (10 June 1940 in Brentford, Middlesex - 13 September 1994 in Ealing, West London) was an English drummer. He was one of the most significant figures in early free improvisation, and a founding member of the Spontaneous Music Ensemble (SME).\n\nStevens was born in Brentford, the son of a tap dancer. He used to listen to jazz as a child, but was initially more interested in drawing and painting (mediums through which he expressed himself throughout his life). He studied at the Ealing College of Art and then started work in a design studio. He left at 19, however, to join the Royal Air Force. He studied the drums at the Royal Airforce School of Music in Uxbridge, and while there met Trevor Watts and Paul Rutherford, two musicians who became close collaborators.\n\nIn the mid-1960s, Stevens began to play in London jazz groups alongside musicians like Tubby Hayes and Ronnie Scott, and in 1965 he fronted a septet. Influenced by the free jazz he was hearing coming out of the United States by players like Ornette Coleman and Albert Ayler, his style began to move away from fairly traditional be-bop to something more experimental.\n\nIn 1966, SME was formed with Watts and Rutherford and the group moved into the Little Theatre Club in the centre of London to develop their new music. In 1967 their first album, Challenge, was released. Stevens then became interested in the music of Anton Webern, and the SME began to play generally very quiet music. Stevens also became interested in non-Western musics.\n\nThe SME went on to make a large number of records with an ever changing line-up and an ever changing number of members, but Stevens was always there, at the centre of the group's activity. He also played in a number of other groups, drumming in Watts' group Amalgam and later forming bands like Freebop and Fast Colour, for example, but the SME remained at the centre of his activities.\n\nIn the latter part of 1967, Evan Parker joined the SME and worked closely with Stevens in the group, eventually becoming one of the longest standing members. He later summed up Stevens' approach to improvising in two basic maxims: if you can't hear another musician, then you're too loud; and there is no point in group improvisation if what you are playing doesn't relate to what other members of the group are playing.\n\nStevens also devised a number of basic starting points for improvisation. These were not \"compositions\" as such, but rather a means of getting improvisational activity started, which could then go off in any direction. One of these was the so-called \"Click Piece\" which essentially asked for each player to repeatedly play a note as short as possible.\n\nStevens played alongside a large number of prominent free improvisors in the SME, including Derek Bailey, Peter Kowald and Julie Tippetts, but from the 1970s, the make-up of the SME began to settle down to a regular group of Stevens, Nigel Coombes playing violin, and Roger Smith playing guitar.\n\nFrom 1983, Stevens was involved with Community Music, an organisation through which he took his form of music making to youth clubs, mental health institutions and other unusual places. Notes taken during these sessions were later turned into a book for the Open University called Search and Reflect (1985). In the late 70s and early 80s John was a regular performer at the Bracknell Jazz Festival.\n\nThe SME continued to play, the last time being in 1994 with a group including John Butcher. Stevens died later that year.\n----------------------------------\n2) John Bassat Stevens IV (born July 28, 1987) is an American classic pop singer and was the sixth-place finalist on the third season of the television series American Idol.\n\nStevens was born in Buffalo, New York and currently resides in East Amherst, New York. He auditioned for American Idol in New York City, singing \"That's Amore\" as an impersonation of Dean Martin. After the judges asked him to sing in his normal voice, he then performed \"The Way You Look Tonight\" and was put through to the next round.\n\nStevens was a member of the fourth group of semifinalists. He finished first in the voting among his group of eight semifinalists, earning 28% of the popular vote. At 16, he was the youngest contestant ever to make the finals on American Idol.\n\nStevens' favorite singer is Frank Sinatra, to whom his vocal style has been compared. He has also earned the nickname \"Teen Martin\" because of his Dean Martin impersonation and ability to croon at such a young age. Stevens' style was not typical Idol fare, causing him to struggle with unfamiliar genres during the competition.\n\nStevens was the source of much controversy when the results of the top seven show (\"Barry Manilow Week\") were broadcast. Many considered LaToya London, Fantasia Barrino and Jennifer Hudson to be among the most talented singers of the seven, yet they all ended up in the bottom three that week. Some claimed that racism was a factor. Others maintained that vote splitting was a factor. After Hudson was voted off, Ryan Seacrest reported that Stevens told Hudson that \"it should have been me.\" Many critics of the show, from late-night talk show host Jimmy Kimmel to singer Elton John, heartily agreed, suggesting that Stevens' success only proved that American Idol viewers based their votes on what they saw instead of what they heard.\n\nApril 27th, 2004 was \"Latin Week\", a tribute to the music of Gloria Estefan. Stevens performed \"Music of My Heart\", and Simon Cowell credited Stevens with \"taking every bullet thrown at you like a man.\" Then he went on to tell the teenaged crooner that he and Latin music went together \"like chocolate ice cream and a pickled onion.\" The next day, Stevens was voted off the show, coming in sixth place despite receiving over four million votes.\n\nStevens was signed to Maverick Records and released his debut album Red on June 28, 2005. It was produced by Steve Tyrell and executive produced by David Foster. Its first week sales put it into the top 10 of the Billboard jazz charts. It has sold 18,000 copies as of March 2006. He made the decision to leave Maverick Records and is currently a student at Berklee College of Music in Boston, Massachusetts.\n----------------------------------\n3) An American tuba/euphonium player & composer, currently on the faculty of University of Wisconsin-Madison.\nSoliloQuies <a href=\"https://www.last.fm/music/John+Stevens\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
