{"artist":{"name":"Johnny Daye","mbid":"f4859026-c646-4024-9c08-d9c7f11433fb","url":"https://www.last.fm/music/Johnny+Daye","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4059b03f3f0242eea4525d58ba96ecfe.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4059b03f3f0242eea4525d58ba96ecfe.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4059b03f3f0242eea4525d58ba96ecfe.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4059b03f3f0242eea4525d58ba96ecfe.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4059b03f3f0242eea4525d58ba96ecfe.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4059b03f3f0242eea4525d58ba96ecfe.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"6733","playcount":"16149"},"similar":{"artist":[{"name":"Jeanne & The Darlings","url":"https://www.last.fm/music/Jeanne+&+The+Darlings","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"C.L. Blast","url":"https://www.last.fm/music/C.L.+Blast","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/55e53f886d101bc172970ffa3742a327.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/55e53f886d101bc172970ffa3742a327.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/55e53f886d101bc172970ffa3742a327.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/55e53f886d101bc172970ffa3742a327.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/55e53f886d101bc172970ffa3742a327.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/55e53f886d101bc172970ffa3742a327.png","size":""}]},{"name":"Judy Clay","url":"https://www.last.fm/music/Judy+Clay","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/033c4c9c32de417c872da188616859c7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/033c4c9c32de417c872da188616859c7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/033c4c9c32de417c872da188616859c7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/033c4c9c32de417c872da188616859c7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/033c4c9c32de417c872da188616859c7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/033c4c9c32de417c872da188616859c7.png","size":""}]},{"name":"Ollie & The Nightingales","url":"https://www.last.fm/music/Ollie+&+The+Nightingales","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/35f86f1d16434b14977fb97ceff7cfa3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/35f86f1d16434b14977fb97ceff7cfa3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/35f86f1d16434b14977fb97ceff7cfa3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35f86f1d16434b14977fb97ceff7cfa3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35f86f1d16434b14977fb97ceff7cfa3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35f86f1d16434b14977fb97ceff7cfa3.png","size":""}]},{"name":"Oscar Mack","url":"https://www.last.fm/music/Oscar+Mack","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d7167567acbf460ea8b891a92cb0efb8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d7167567acbf460ea8b891a92cb0efb8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d7167567acbf460ea8b891a92cb0efb8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d7167567acbf460ea8b891a92cb0efb8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d7167567acbf460ea8b891a92cb0efb8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d7167567acbf460ea8b891a92cb0efb8.png","size":""}]}]},"tags":{"tag":[{"name":"soul","url":"https://www.last.fm/tag/soul"},{"name":"stax","url":"https://www.last.fm/tag/stax"},{"name":"Blue-Eyed Soul","url":"https://www.last.fm/tag/Blue-Eyed+Soul"},{"name":"rhythm and blues","url":"https://www.last.fm/tag/rhythm+and+blues"},{"name":"pittsburgh","url":"https://www.last.fm/tag/pittsburgh"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Johnny+Daye/+wiki"}},"published":"22 Feb 2008, 22:05","summary":"Johnny Daye (John Patrick DiBucci, March 17, 1948 - May 6, 2017) was an American soul music singer from Pittsburgh, Pennsylvania who released six singles between 1965 and 1968. In 2007 he came out of retirement to sing on two tracks on Robert Peckman's first solo CD, Stirrin’ Up Bees.\n\nDaye was taken to Stax Records after being discovered in Pittsburgh by Otis Redding. He recorded the single \"What'll I Do for Satisfaction\", which was produced and co-written by Steve Cropper. <a href=\"https://www.last.fm/music/Johnny+Daye\">Read more on Last.fm</a>","content":"Johnny Daye (John Patrick DiBucci, March 17, 1948 - May 6, 2017) was an American soul music singer from Pittsburgh, Pennsylvania who released six singles between 1965 and 1968. In 2007 he came out of retirement to sing on two tracks on Robert Peckman's first solo CD, Stirrin’ Up Bees.\n\nDaye was taken to Stax Records after being discovered in Pittsburgh by Otis Redding. He recorded the single \"What'll I Do for Satisfaction\", which was produced and co-written by Steve Cropper. The song was recorded by Janet Jackson on her 1993 album, Janet, as \"What'll I Do\". His other single for Stax was \"Stay Baby Stay\". Cropper stated in the liner notes to The Complete Stax/Volt Singles 1959–1968 that \"Otis really wanted to do a lot with him. The kid was dynamite. Had Otis lived, he probably would have.\"\n\nBorn John Patrick DiBucci, he grew up in Homewood-Brushton, where in eighth grade he hooked up with a street-corner doo-wop group called The Itals, aka The Five Italians. His local idol was Jimmy Beaumont of The Skyliners, who broke out of Pittsburgh in 1959 with “Since I Don’t Have You.”\n\n“I met Johnny when we were both in ninth grade,” says Frank Czuri, who went to sing for the Igniters, Diamond Reo, The Silencers and Skyliners. “We played a summer festival together at St Bart's [in Penn Hills]. The Itals were great, managed by Ike from G.C. Murphy’s. In 1966 the Igniters did several shows with him as Daye. Foreshadowing Michael Jackson, Johnny did it all: sang his ass off, danced great and was handsome, like Bernardo in ‘West Side Story’.”\n\nWhen the Itals auditioned for Joe Rock, the famed Skyliners manager/songwriter as teenagers, he only wanted Daye. He eventually took him into Gateway recording studio, Downtown, for a session, and they emerged with “I’ll Keep On Loving You,” a 1965 single written by Rock and Johnny Jack, for Nick Cenci’s label Blue Star, which broke The Vogues’ hit “You’re The One.”\n\nFrom there, Daye did one record, “A Lot of Progress,” for Philadelphia’s Cameo-Parkway Records before Johnny Nash (later of “I Can See Clearly Now” fame) signed him to his Jomada label to record the singles “Marry Me” and “Good Time,” which became a Top 15 local hit. He played his first big local gig at Conneaut Lake Park in ’65 and in ’66, he made his debut at the Apollo Theater in New York, sharing a stage with James Brown.\n\nIt was Redding who would give him his next break. When Wilson Pickett canceled, Daye opened for the soul singer at the Penn Theater, Downtown, in 1967. Watching from the wings, Redding was impressed enough to invite him down south, where he took him on a Chitlin Circuit tour and secured him a record deal with Stax Records in Memphis. Booker T & the MG's guitarist Steve Cropper produced Daye’s 1967 single \"What'll I Do for Satisfaction,” with a cast of ace Stax musicians. The song, which got airplay in Pittsburgh, was covered by Janet Jackson years later.\n\n“I was in high school when his first Stax record came out,” recalls producer Jeff Ingersoll, who owns the McKeesport studio Mojo Boneyard. “He was going to be on Chuck Brinkman’s ‘Come Alive’ Saturday afternoon show. He came out and he was a 16-year-old white kid. I couldn’t believe it. I thought he was some old black guy.”\n\nOn Dec. 10, after a gig in Cleveland, Redding’s plane crashed, killing the soul star and most members of his band, the Bar-Kays. Early in ‘68, Daye was back in Memphis to record “Stay Baby Stay,” a song he wrote with Rock, but with Redding out of the picture, there wasn’t the same support for him at Stax.\n\n“Those recordings he made on Stax were tremendous,” says Pittsburgh singer Billy Price. “They gave him some fine deep soul songs to work with at Stax and, of course, the instrumental backing had that classic Memphis feel. He is revered by the true fanatic deep soul record collectors and writers.”\n\n“On the day he finished his last Stax single,” says Mr. Ingersoll, “Martin Luther King was shot at the same motel that he was staying. This combined with Otis Redding's death freaked him out.”\n\nIn the liner notes to “The Complete Stax/Volt Singles 1959-1968,” producer Cropper stated that \"Otis really wanted to do a lot with him. The kid was dynamite. Had Otis lived, he probably would have.”\n\n“Otis Redding loved Johnny,” says his brother Albert DiBucci. “Before that ill-fated tour, he told him, ‘When I come back, I’m going to make you star.’ ”\n\nAfter the tragedy, Rock went on to manage the Jaggerz and Daye went to California, where he did a session with Mr. Cropper and Leon Russell in the early ‘70s. The music went unreleased and he returned to Pittsburgh, basically, to get on with his life.\n\n“He was resigned to the fact that out of 100 great singers in every town, one makes it,” says Albert DiBucci. “His obvious chance was Otis Redding.”\n\nBack home, he did a variety of jobs, working at Bell Atlantic, driving a Port Authority bus, selling cars at P&W BMW and working security at One Oxford Centre and Auto Palace. Brian DiBucci, his son with his first wife Donna, was a Washington State police officer who died in the line of duty at age 30 in 1999. He has two young children from a second marriage that ended in divorce.\n\nIn 2007, 40 years after his run with Stax, Daye was lured out of retirement to sing two songs at Mojo Boneyard on Robert Peckman’s album “Stirrin’ Up Bees.” More recently, he approached Don Garvin and Robert Prince at Jeree Studios in New Brighton with lyrics he had written, and the result is a half-dozen songs that will be released at some point.\n\n“The style of the songs are the style of the songs he did with Stax,” Mr. Prince says, “because that’s what he did. He still had the voice and the feel, and he could reach the notes without straining. He wasn’t trying to update the sound like some singers do.”\n\n“His voice hadn't changed at all,” Mr. Ingersoll says. “It was like it was three days after 1968. He was never appreciated like should have been.”\nDaye, a gifted blue-eyed soul singer who never achieved the fame many believe he deserved, died May 6, 2017.\n\nDiscography\n\n1965\n\"I'll Keep on Loving You\" b/w \"One of These Days\" (Blue Star B-230)\n\"Marry Me\" b/w \"Give Me Back My Ring\" (Jomada M-600) – produced by Johnny Nash\n1966\n\"Good Time\" b/w \"I've Got Soul\" (Jomada M-603) – produced by Johnny Nash\n1967\n\"A Lot of Progress\" b/w \"You're on Top\" (Parkway P-119)\n1968\n\"What'll I Do for Satisfaction\" b/w \"I Need Somebody\" (Stax 238)\n\"Stay Baby Stay\" b/w \"I Love Love (Stax 0004)\n2007\n\"Let's Talk It Over\" b/w \"Stop and Take A Look\" (on Robert Peckman, Stirrin’Up Bees, Bonedog Records BDRCD-22)\n <a href=\"https://www.last.fm/music/Johnny+Daye\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
