{"artist":{"name":"Johnny Winter","mbid":"8300d0fa-d120-47f6-a84e-91f140c74767","url":"https://www.last.fm/music/Johnny+Winter","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/546768ae6a8c491dadb3a9dd8350a5e4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/546768ae6a8c491dadb3a9dd8350a5e4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/546768ae6a8c491dadb3a9dd8350a5e4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/546768ae6a8c491dadb3a9dd8350a5e4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/546768ae6a8c491dadb3a9dd8350a5e4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/546768ae6a8c491dadb3a9dd8350a5e4.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"375602","playcount":"3308827"},"similar":{"artist":[{"name":"John Mayall","url":"https://www.last.fm/music/John+Mayall","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e5a73bf78c7b4a4994ae5d5ee7adaf06.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e5a73bf78c7b4a4994ae5d5ee7adaf06.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e5a73bf78c7b4a4994ae5d5ee7adaf06.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5a73bf78c7b4a4994ae5d5ee7adaf06.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5a73bf78c7b4a4994ae5d5ee7adaf06.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5a73bf78c7b4a4994ae5d5ee7adaf06.png","size":""}]},{"name":"Freddie King","url":"https://www.last.fm/music/Freddie+King","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/50d8a27310b0465fb9a135005f51caca.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/50d8a27310b0465fb9a135005f51caca.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/50d8a27310b0465fb9a135005f51caca.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50d8a27310b0465fb9a135005f51caca.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50d8a27310b0465fb9a135005f51caca.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50d8a27310b0465fb9a135005f51caca.png","size":""}]},{"name":"Buddy Guy","url":"https://www.last.fm/music/Buddy+Guy","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e03c02a2013f4157ab190494caaca0e0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e03c02a2013f4157ab190494caaca0e0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e03c02a2013f4157ab190494caaca0e0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e03c02a2013f4157ab190494caaca0e0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e03c02a2013f4157ab190494caaca0e0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e03c02a2013f4157ab190494caaca0e0.png","size":""}]},{"name":"Rory Gallagher","url":"https://www.last.fm/music/Rory+Gallagher","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7655a3367818483387e404526ab4d279.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7655a3367818483387e404526ab4d279.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7655a3367818483387e404526ab4d279.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7655a3367818483387e404526ab4d279.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7655a3367818483387e404526ab4d279.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7655a3367818483387e404526ab4d279.png","size":""}]},{"name":"John Mayall & The Bluesbreakers","url":"https://www.last.fm/music/John+Mayall+&+The+Bluesbreakers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/681363b6f80440fca496c108e5696c3b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/681363b6f80440fca496c108e5696c3b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/681363b6f80440fca496c108e5696c3b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/681363b6f80440fca496c108e5696c3b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/681363b6f80440fca496c108e5696c3b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/681363b6f80440fca496c108e5696c3b.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"blues rock","url":"https://www.last.fm/tag/blues+rock"},{"name":"guitar","url":"https://www.last.fm/tag/guitar"},{"name":"classic rock","url":"https://www.last.fm/tag/classic+rock"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Johnny+Winter/+wiki"}},"published":"15 Feb 2006, 20:21","summary":"John Dawson \"Johnny\" Winter III (born February 23, 1944 died July 16, 2014) was an American blues guitarist, singer, and producer. Best known for his late 1960s and 1970s high-energy blues rock albums and live performances, Winter also produced three Grammy Award-winning albums for blues legend Muddy Waters. Since his time with Waters, Johnny Winter has recorded several Grammy-nominated blues albums and continues to tour extensively. In 1988, he was inducted into the Blues Foundation Hall of Fame and in 2003 <a href=\"https://www.last.fm/music/Johnny+Winter\">Read more on Last.fm</a>","content":"John Dawson \"Johnny\" Winter III (born February 23, 1944 died July 16, 2014) was an American blues guitarist, singer, and producer. Best known for his late 1960s and 1970s high-energy blues rock albums and live performances, Winter also produced three Grammy Award-winning albums for blues legend Muddy Waters. Since his time with Waters, Johnny Winter has recorded several Grammy-nominated blues albums and continues to tour extensively. In 1988, he was inducted into the Blues Foundation Hall of Fame and in 2003, he was ranked as 74th in Rolling Stone magazine's list of the \"100 Greatest Guitarists of All Time\", a debatable ranking based on those listed ahead of him as being more talented than Johnny.\n\nJohnny Winter, along with his brother Edgar Winter, were nurtured at an early age by their parents in musical pursuits. Both he and his brother, who were born with albinism, began performing at an early age. When he was ten-years old, Winter appeared on a local children's show, playing ukelele and singing Everly Brothers songs with his brother.\n\nHis recording career began at the age of fifteen, when his band Johnny and the Jammers released \"School Day Blues\" on a Houston record label. During this same period, he was able to see performances by classic blues artists such as Muddy Waters, B.B. King, and Bobby Bland. In the early days Winter would sometimes sit in with Roy Head and The Traits when they performed in the Beaumont, Texas area, and in 1967, Winter recorded a single with The Traits: \"Tramp\" backed with \"Parchman Farm\" (Universal Records 30496). In 1968, he released his first album The Progressive Blues Experiment, on Austin's Sonobeat Records.\n\nWinter caught his biggest break in December 1968, when Mike Bloomfield, whom he met and jammed with in Chicago, invited him to sing and play a song during a Bloomfield and Al Kooper concert at the Fillmore East in New York. As it happened, representatives of Columbia Records (which had released the Top Ten Bloomfield/Kooper Super Session album) were at the concert. Winter played and sang B.B. King's \"It's My Own Fault\" to loud applause and, within a few days, was signed to reportedly what was then the largest advance in the history of the recording industry–$600,000.\n\nWinter's first Columbia album, Johnny Winter was recorded and released in 1969. It featured the same backing musicians with whom he recorded The Progressive Blues Experiment, bassist Tommy Shannon and drummer Uncle John Turner, plus Edgar Winter on keyboards and saxophone, and (for his \"Mean Mistreater\") blues legends Willie Dixon on upright bass and Big Walter Horton on harmonica. The album featured a few selections that became Winter signature songs, including his composition \"Dallas\" (an acoustic blues, on which Winter played a steel-bodied, resonator guitar), John Lee \"Sonny Boy\" Williamson's \"Good Morning Little School Girl\", and B.B. King's \"Be Careful With A Fool\".\n\nThe album's success coincided with Imperial Records picking up The Progressive Blues Experiment for wider release. The same year, the Winter trio toured and performed at several rock festivals, including Woodstock. With brother Edgar added as a full member of the group, Winter also recorded his second album, Second Winter in Nashville in 1969. The two-record album, which only had three recorded sides (the fourth was blank), introduced a couple more staples of Winter's concerts, including Chuck Berry's \"Johnny B. Goode\" and Bob Dylan's \"Highway 61 Revisited\".\n\nIn 1984, Winter began recording for several labels, including Alligator Records and Point Blank Records, where he has focused on blues-oriented material. He continues to perform live, including festivals throughout North America and Europe. Winter has headlined such prestigious events as the New Orleans Jazz & Heritage Festival, Chicago Blues Festival, Swedish Rock Fest, Warren Haynes X-mas jam, and Europe’s Rockpalast. He also performed with the Allman Brothers at the Beacon Theater in Manhattan on the 40th anniversary of their debut. In 2007 and 2010, Winter performed at Eric Clapton’s Crossroads Guitar Festivals. Two guitar instructional DVDs have been produced by Cherry Lane Music and the Hal Leonard Corporation. The Gibson Guitar Company released the signature Johnny Winter Firebird guitar in a ceremony in Nashville with Slash presenting.\n\nIn 2004, Winter received a Grammy nomination for his I’m a Bluesman album. Backing him are guitarist Paul Nelson, bassist Scott Spray, and drummer Vito Liuzzi. Beginning in 2007, a series of live Winter albums titled the Live Bootleg Series and a live DVD have all entered the Top 10 Billboard Blues charts. In 2009, The Woodstock Experience album was released, which includes eight songs that Winter performed at the 1969 festival. Johnny Winter is signed to Megaforce Records, who will release a new studio album titled Roots on September 27, 2011. It will include Winter's interpretation of eleven early blues and rock 'n' roll classics and feature several guest artists.\n\nWinter produced three Grammy Award-winning albums by Muddy Waters, Hard Again (1977), I'm Ready (1978), and Muddy \"Mississippi\" Waters – Live (1979). Several Winter albums were also nominated for Grammy Awards. In 1980, Winter was on the cover of the first issue of Guitar World and in 1988, he was inducted into the Blues Foundation Hall of Fame. \n <a href=\"https://www.last.fm/music/Johnny+Winter\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
