{"artist":{"name":"KT Tunstall","mbid":"951d2103-9c7d-4849-ae60-88bf6aa4790b","url":"https://www.last.fm/music/KT+Tunstall","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5dbaec9dd9d5ad436367631dc678e24b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5dbaec9dd9d5ad436367631dc678e24b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5dbaec9dd9d5ad436367631dc678e24b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5dbaec9dd9d5ad436367631dc678e24b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5dbaec9dd9d5ad436367631dc678e24b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5dbaec9dd9d5ad436367631dc678e24b.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"1274026","playcount":"23028529"},"similar":{"artist":[{"name":"A Fine Frenzy","url":"https://www.last.fm/music/A+Fine+Frenzy","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7ddda4d2d86e49cf87ae21b3d398745c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7ddda4d2d86e49cf87ae21b3d398745c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7ddda4d2d86e49cf87ae21b3d398745c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7ddda4d2d86e49cf87ae21b3d398745c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7ddda4d2d86e49cf87ae21b3d398745c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7ddda4d2d86e49cf87ae21b3d398745c.png","size":""}]},{"name":"Sara Bareilles","url":"https://www.last.fm/music/Sara+Bareilles","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8b891fef7d3e43fcb420c5e6c8fb25ed.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8b891fef7d3e43fcb420c5e6c8fb25ed.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8b891fef7d3e43fcb420c5e6c8fb25ed.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8b891fef7d3e43fcb420c5e6c8fb25ed.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8b891fef7d3e43fcb420c5e6c8fb25ed.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8b891fef7d3e43fcb420c5e6c8fb25ed.png","size":""}]},{"name":"Ingrid Michaelson","url":"https://www.last.fm/music/Ingrid+Michaelson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dfe86179be7014b2f810687ae0efc765.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dfe86179be7014b2f810687ae0efc765.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dfe86179be7014b2f810687ae0efc765.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dfe86179be7014b2f810687ae0efc765.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dfe86179be7014b2f810687ae0efc765.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dfe86179be7014b2f810687ae0efc765.png","size":""}]},{"name":"Tristan Prettyman","url":"https://www.last.fm/music/Tristan+Prettyman","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b23c24544f0645278762f35488971b60.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b23c24544f0645278762f35488971b60.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b23c24544f0645278762f35488971b60.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b23c24544f0645278762f35488971b60.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b23c24544f0645278762f35488971b60.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b23c24544f0645278762f35488971b60.png","size":""}]},{"name":"Colbie Caillat","url":"https://www.last.fm/music/Colbie+Caillat","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9d4539df390f44f5b2a608472a43de15.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9d4539df390f44f5b2a608472a43de15.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9d4539df390f44f5b2a608472a43de15.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9d4539df390f44f5b2a608472a43de15.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9d4539df390f44f5b2a608472a43de15.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9d4539df390f44f5b2a608472a43de15.png","size":""}]}]},"tags":{"tag":[{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"indie","url":"https://www.last.fm/tag/indie"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/KT+Tunstall/+wiki"}},"published":"13 Feb 2006, 01:46","summary":"Kate Victoria Tunstall, better known as KT Tunstall (born 23 June 1975 in  Edinburgh, Scotland), is a Scottish singer-songwriter and guitarist. She broke into the public eye with a live solo performance of her song \"Black Horse and the Cherry Tree\" on Later... with Jools Holland. She has enjoyed commercial and critical success since, picking up three nominations before winning a BRIT Award, and a Grammy Award nomination. She is also the recipient of an Ivor Novello Award. <a href=\"https://www.last.fm/music/KT+Tunstall\">Read more on Last.fm</a>","content":"Kate Victoria Tunstall, better known as KT Tunstall (born 23 June 1975 in  Edinburgh, Scotland), is a Scottish singer-songwriter and guitarist. She broke into the public eye with a live solo performance of her song \"Black Horse and the Cherry Tree\" on Later... with Jools Holland. She has enjoyed commercial and critical success since, picking up three nominations before winning a BRIT Award, and a Grammy Award nomination. She is also the recipient of an Ivor Novello Award.\n\nRecording and performing career\n\nShe started her career in 2000. Throughout her twenties, she played in indie bands including Elia Drew and Tomoko, and focused on songwriting, as well as performing with members of the fledgling Fence Collective including work in the Skuobhie Dubh Orchestra with King Creosote, who recently supported her UK tour. She also lived with Gordon Anderson (The Beta Band and The Aliens), whom the song Funnyman, on the album Drastic Fantastic, is about. She toured with the Klezmer band Oi Va Voi, and guested on their album, Laughter Through Tears.\n\nMusic career\n\nEye to the Telescope (2004–2006)\n\nHer debut album, Eye to the Telescope, was released in late 2004. Tunstall's style of music varies from folk to pop. In Edinburgh and St Andrews, she played in a band called Red Light Stylus, which was regarded as one of the better bands to emerge from the limited Fife scene.\n\nTunstall's first appearance of note was a solo performance of her famed blues song \"Black Horse and the Cherry Tree\" on Later... with Jools Holland.[10] The performance was notable as she had only 24 hours to prepare after scheduled performer Nas cancelled. Her performance caught the eye of many viewers, although she had previously performed it on French television only some weeks before, upstaging more established acts such as The Cure, Embrace, and The Futureheads; she then went on to top the post-show poll on the website for that episode.\n\nShortly after the \"Later\" appearance, Eye to the Telescope was re-released and shot up the UK charts, eventually peaking at #3 (on its first release it had entered at #73); it was nominated for the 2005 Mercury Music Prize. It was released in the U.S. on 7 February 2006.\n\nTunstall's North American break came when American Idol contestant Katharine McPhee contacted her asking to use \"Black Horse and the Cherry Tree\" as her choice for a Billboard-themed week. At the time, the song was #79 on the Billboard charts. Tunstall had not been shy with her opinions regarding shows like Idol saying \"The major problem I have is that it's completely controlled... they're told what to say. They're told how to sing.\" She chose to license the song as she felt that \"no one on that show told Katharine McPhee to sing my song because no one knew it\" Tunstall's belief was correct—the song was suggested to McPhee by Billboard columnist and author Fred Bronson. The song immediately jumped to #23 on the Billboard charts the week following McPhee's performance. She has later said \"My status as a musician in America is pretty much cemented by Katharine McPhee, which is really interesting and funny for me because I've never been polite about how I feel about shows like that.\"\n\nKT Tunstall's Acoustic Extravaganza (2006–2007)\n\nTunstall released a new acoustic album in May 2006, KT Tunstall's Acoustic Extravaganza, which was first only available via mail order from her website. The album was re-released in stores worldwide in October 2006.\n\nTunstall sang with Scottish band Travis on their 2007 album \"The Boy With No Name\", on the track \"Under The Moonlight\", a song written by Susie Hug (late of Katydids).\n\nDrastic Fantastic (2007–2008)\n\nTunstall's third album, Drastic Fantastic, premiered on 3 September 2007 in Scotland, followed a week later on 10 September 2007 with the London release for the UK and 18 September 2007, in the US. In its first week, Drastic Fantastic reached #1 on the Scottish Album Charts, #3 on the UK Charts, and #9 on the U.S. Charts. The album's lead single \"Hold On\" was released in August 2007, debuting at #34 in the UK, before peaking at #21 in the United Kingdom. The song was also very successful in certain European nations peaking at #19 in Italy, #19 in Norway, #26 in Switzerland and #39 in Ireland. The album's second single \"Saving My Face\" was released in December 2007. The song did not make the UK Top 40 Singles Charts, but however did managed to peak at #50 on the UK Singles Charts, managing 3 weeks on the UK Charts. Despite missing the UK Top 40, the song made the Top 40 in Italy, making #23 and in Switzerland peaking at #93. The album's third single, and final worldwide single, \"If Only\" was released in March 2008, becoming the second single from the album not to make the UK Top 40, it managed #45 in audition.\n\nOn 5 October 2007 the U.S. discount department store chain Target, in association with NBC, released a special KT Tunstall Christmas EP on CD. Sounds of the Season: The KT Tunstall Holiday Collection contains six exclusive tracks:\n\n    * \"2000 Miles\"\n    * \"Christmas (Baby Please Come Home)\"\n    * \"Mele Kalikimaka (Christmas In Hawaii)\"\n    * \"Sleigh Ride\"\n    * \"Fairytale of New York\"\n    * \"Lonely This Christmas\"\n\nOn 10 December 2007 it was released in Europe through Relentless Records as a digital download only, under the title Have Yourself A Very KT Christmas.\n\nIn 2008 KT Tunstall recorded a song for the album Songs for Survival, in support of the indigenous rights organization Survival International. In a video for Survival International, she speaks of music as being a force for good, and about what she has learned about tribal people on this project. She also discusses various issues concerning our culture of consumption and greed, our relation to the earth and the importance of indigenous rights in the world today.\n\nTunstall also worked with Suzanne Vega on her 2007 album Beauty & Crime, singing backup on songs \"Zephyr and I\" and \"Frank and Ava\". It was revealed in the booklet by Vega that the two had never met during the process of making the album.\n\nTiger Suit (2009-present)\n\nOn February 11, 2010 The Daily Record reported that, \" 'KT TUNSTALL has recorded her new album in Berlin's famous Hansa studio. The studio, beside the site of the Berlin Wall, was used to make legendary albums including David Bowie's Heroes and U2's Achtung Baby. Kt said: \"I had an amazing three weeks recording in Hansa in Berlin in January and am finishing it all off in London.\" The Scots singer, who has been quiet of late, reassured fans she has been busy. She added: \"I am still very much alive and have every music-making limb and muscle working in my laboratory of fierce-new-album-ness.\" Before her album comes out, KT will be playing a stripped-down set at the Haiti fundraising gig at the Roundhouse in Camden on Thursday February 25. She hopes to jump up with her old pal Seasick Steve for a song or two. Kt added: \"My shizzle will feature some new faces and definitely some new songs, so come and have a listen and chuck some dough at a good cause.\" '\n\nAccording to her website, Tunstall has finished recording her third studio album. The album has been titled Tiger Suit. <a href=\"https://www.last.fm/music/KT+Tunstall\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
