{"artist":{"name":"Kaizers Orchestra","mbid":"2c3bac0a-5158-442f-b50b-056aae52138c","url":"https://www.last.fm/music/Kaizers+Orchestra","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/47a81128da3348da8d704219fbb045fd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/47a81128da3348da8d704219fbb045fd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/47a81128da3348da8d704219fbb045fd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/47a81128da3348da8d704219fbb045fd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/47a81128da3348da8d704219fbb045fd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/47a81128da3348da8d704219fbb045fd.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"143651","playcount":"9145226"},"similar":{"artist":[{"name":"Skambankt","url":"https://www.last.fm/music/Skambankt","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b5eec93df0e943828ca76ebcb06db9ba.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b5eec93df0e943828ca76ebcb06db9ba.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b5eec93df0e943828ca76ebcb06db9ba.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b5eec93df0e943828ca76ebcb06db9ba.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b5eec93df0e943828ca76ebcb06db9ba.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b5eec93df0e943828ca76ebcb06db9ba.png","size":""}]},{"name":"Karpe Diem","url":"https://www.last.fm/music/Karpe+Diem","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bc028ca083f042eda9ca05875c93fb88.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bc028ca083f042eda9ca05875c93fb88.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bc028ca083f042eda9ca05875c93fb88.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bc028ca083f042eda9ca05875c93fb88.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bc028ca083f042eda9ca05875c93fb88.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bc028ca083f042eda9ca05875c93fb88.png","size":""}]},{"name":"Jokke & Valentinerne","url":"https://www.last.fm/music/Jokke+&+Valentinerne","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/08f59fe8554042f6a70017ea76d6a796.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/08f59fe8554042f6a70017ea76d6a796.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/08f59fe8554042f6a70017ea76d6a796.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/08f59fe8554042f6a70017ea76d6a796.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/08f59fe8554042f6a70017ea76d6a796.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/08f59fe8554042f6a70017ea76d6a796.png","size":""}]},{"name":"Honningbarna","url":"https://www.last.fm/music/Honningbarna","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/be1ed7a974db7a2c189fd04bd1b1a7a0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/be1ed7a974db7a2c189fd04bd1b1a7a0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/be1ed7a974db7a2c189fd04bd1b1a7a0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/be1ed7a974db7a2c189fd04bd1b1a7a0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/be1ed7a974db7a2c189fd04bd1b1a7a0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/be1ed7a974db7a2c189fd04bd1b1a7a0.png","size":""}]},{"name":"vamp","url":"https://www.last.fm/music/vamp","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f4a2d207d00d419ca3bc4bebae058d38.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f4a2d207d00d419ca3bc4bebae058d38.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f4a2d207d00d419ca3bc4bebae058d38.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f4a2d207d00d419ca3bc4bebae058d38.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f4a2d207d00d419ca3bc4bebae058d38.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f4a2d207d00d419ca3bc4bebae058d38.png","size":""}]}]},"tags":{"tag":[{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"norwegian","url":"https://www.last.fm/tag/norwegian"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"alternative rock","url":"https://www.last.fm/tag/alternative+rock"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Kaizers+Orchestra/+wiki"}},"published":"10 Feb 2006, 16:16","summary":"Kaizers Orchestra is a Norwegian alternative rock group. Owing to their energetic live concerts and critically praised recordings, they are among the most popular and acclaimed musical acts in their homeland, and have also gained international renown; they are among the first Norwegian artists (outside the genre of black metal) to gain international recognition and popularity while singing in their native language. Their work spans a multitude of genres, from ompa rock and gypsy punk to surf rock and rnb. <a href=\"https://www.last.fm/music/Kaizers+Orchestra\">Read more on Last.fm</a>","content":"Kaizers Orchestra is a Norwegian alternative rock group. Owing to their energetic live concerts and critically praised recordings, they are among the most popular and acclaimed musical acts in their homeland, and have also gained international renown; they are among the first Norwegian artists (outside the genre of black metal) to gain international recognition and popularity while singing in their native language. Their work spans a multitude of genres, from ompa rock and gypsy punk to surf rock and rnb. Their lyrics, composed primarily by frontman Janove Ottesen with second guitarist Geir Zahl as the secondary contributor - concerning subject matter such as organized crime, war, underground resistance organizations and mental institutions - are often interconnected stories told through song. A distinctive symbol of Kaizers Orchestra is the gas mask worn by organist Helge Risa during performances. The band is currently on an indefinite hiatus that will last a number of years, at the very least.\n\nThe band was founded by Janove Ottesen and Geir Zahl, two childhood friends from the small town of Bryne, Rogaland, Norway. The two had earlier played in several bands together, including Blod, snått & juling, and gnom. The musical and lyrical style of Kaizers Orchestra was in part conceptualized during the active period of latter group. Despite the release of a studio album, Mys, any recognition eluded gnom. However, one song written during gnom's active period, called \"Hemmelig beskjed\", featuring a musical style the group themselves labeled \"ompa\" music, which elicited significant response from live audiences. This inspired Ottesen to compose a new song, \"Bastard\"; the song's dissonant sound and absurd storytelling lyrics, clearly inspired by Tom Waits, as well as the unusual inclusion of oil barrels as percussion, inspired them to reinvent their sound, image and name. Kaizers Orchestra was officially founded on 1 January 2000; it was initially a five-piece group that naturally evolved from gnom, with Ottesen as primary vocalist, Zahl as guitarist and secondary vocalist, drummer Rune Solheim, organist Helge Risa, and Jon Sjøen, an educated musician who had become a member of gnom after their previous bassist quit.\n\nThroughout 2000, Kaizers Orchestra held sporadic performances at various small venues in Norway, having received little to no publicity at the time. In July of that year, Ottesen and Zahl performed acoustic shows at Det Beste Stedet in Sandnes, their sets consisting of partly Blod, snått & juling, gnom and newly-written Kaizers Orchestra material. A 14-track demo was recorded, but Ottesen and Zahl grew frustrated at finding it hard to bring their vision for the band to tape. They recorded an unnamed EP in 2000, known as Gul EP (Yellow EP), featuring a recording of \"Bastard\" (which had not been recorded while gnom was active). After months of struggling, they finally signed a deal with the independent label BroilerFarm. In 2001, Terje Vinterstø (later Terje Winterstø Røthing) joined the band as their first guitarist. In the studio, co-producers Jørgen Træen and Stian Carstensen succesfully aided the group in capturing Ottesen and Zahl's vision for the band's sound, and the album was recorded in six days, \"leaving the last day for partying.\" \n\nTheir debut album, Ompa til du dør, was released on 1 September 2001, receiving high praise from critics and launching them into the national spotlight. The album would go on to win a Spellemannspris (the Norwegian equivalent of the Grammy Awards) and become the best-selling Norwegian rock album of all time. Subsequently, as bookings became more and more frequent, Kaizers Orchestra performed in nearly every part of Norway until the end of the year. Early 2002 saw the release of their second EP, Død manns tango. In the summer, they released another EP, Mann mot mann, and performed their first international live concert at the prestigious Roskilde Festival in Denmark, to much critical praise. In early 2003, they performed as part of the Eurosonic festival in the Netherlands, where they made a huge impression on both festival-goers and music business executives.\n\nOn 3 February 2003, their second studio album, Evig pint, was released. This album was cited as having a darker atmosphere, and notably included only one song featuring oil barrels, which had become a trademark for the band by then. The album did not receive the same level of critical acclaim their debut album did, nor did it sell as well. Despite this, the band went on a highly successful tour, now often including shows outside of Norway as well, helping to build an international fan base. Later in 2003, Ottesen and Zahl released a remastered version of Mys, the only official release by gnom, including a recording of \"Bastard\", despite the fact that the track had been recorded only after the band's dissolution. In the same year, Jon Sjøen would leave the group for personal reasons, with the group promptly making Øyvind Storesund, who had served as substitute for Sjøen at concerts he was unable to attend, their new bassist.\n\nIn 2004, they signed a recording contract with Universal Germany, and a majority of their backlog was re-released in European countries. By this time, the band had performed in nearly all major countries in Europe. In 2005, they released their third studio album, Maestro, which was released in certain European countries as well as Norway. The album received a majority of positive reviews, however, some were disappointed (the album received the lowest marks given from a Swedish magazine in some time) and the album failed to sell as well as the record company planned, something which the band blamed on little support and promotion from Universal Germany. Nevertheless, the Kaizers embarked on the \"Maestro Tour\", spanning over ten countries, which perpetuated into 2006.\n\nAfter the release of their first live album, Live at Vega (as well as a live DVD, Viva La Vega) in 2006, Kaizers announced that they were embarking on a one-year hiatus from performing in 2007. The \"Grand Finale Tour\" commenced in the fall of 2006, spanning more than 10 countries, culminating in four consecutive shows at Vega, Copenhagen, Denmark; the same venue in which Live at Vega and Viva La Vega were recorded. Concurrently, Kontroll på kontinentet, a book about Kaizers Orchestra and their past, present and future, chronicling their rise from obscure guitar duo to one of the biggest Norwegian music exports in some time, was released. It was written by Geir Zahl's brother Jan Zahl, and featured photos taken by their staff photographer Paal Audestad.\n\nDespite their previously announced hiatus from live performances, the band played three shows in 2007; One at their old favorite, the club Folken in Stavanger, at the Documenta 12 art expo in Germany, and the Sziget Festival in Hungary. Shortly after the Sziget concert, information was released pertaining to their next album. Their fourth studio album, Maskineri, was released on 18 February 2008. It received favorable reviews in Scandaniavian press. The supporting tour received great response and was followed up with a summer tour, with the band performing at various festivals throughout Europe. In the fall of 2008, the band released 250 Prosent, a live compilation album featuring recordings from the Maskineri Tour. Shortly thereafter, the band embarked on the 250 Prosent Tour, during which they played rare songs that they had dropped from setlists long time ago or had never really played much in the first place. Notably, very few songs from Maskineri were played at these concerts.\n\nEarly in 2009, Kaizers Orchestra released information concerning a new studio album called Våre demoner; a compilation of re-recordings of songs that had not been released for various reasons. This selection of songs spanned the band's entire career up to that point, and some songs which ultimately appeared on Våre demoner had been bootlegged by the fan community or otherwise leaked, among them the titular song \"Våre demoner\", of which a demo version was leaked. The album was released in limited quantities on 27 April 2009, followed by a subsequent mini-tour of small venues in Norway. The events of the week of the tour was captured on film by Geir Zahl, as were the recording sessions for the album.\n\nIn 2007, Ottesen composed two to three songs a day for the duration of ten days as part of a massive creative outpouring he was experiencing at that time. In the fall of 2009, basic information regarding the upcoming studio album was released, citing a 2011 release date. The band announced a Studio Tour of venues across Norway; the proceedings from these concerts were to finance the next studio album. Attendees were to be given a special edition of the new album at a later point in time. On 10 February 2010, the album's title and format were revealed; it would be a series of three albums, each a part of a trilogy known as Violeta Violeta, to be released gradually throughout 2011 and 2012.\n\nOne of the singles from Violeta Violeta Volume I, \"Hjerteknuser\", became the most successful single of the band's career, and was also the subject of a contest that allowed unsigned talent to cover the song; the prize was an opportunity to perform as a support act for the band, and have their version officially released. Volume I was released on 31 January 2011, and received a varying reception, although critics accentuated positives more than negatives. Concerts for the supporting tour incorporated abstract storytelling visuals projected onto a screen on-stage. The final concert of the tour, to be held at Oslo Spektrum on 9 April 2011, served as the band's tenth anniversary celebration. The entire performance was recorded and  released as Live i Oslo Spektrum on 11 November 2011 on CD as well as home video formats.\n\nVioleta Violeta Volume II was released on 11 November 2011; the album's first single, \"Tusen dråper regn\", was released on 31 May 2011. Around the same time, the many remixed versions of \"En for orgelet, en for meg\", a song from Volume I, were released as the En for orgelet, en for meg digital EP. On 11 August 2011, Violeta Violeta Volume II was performed, in its entirety, for the very first time at the Øya Festival in Oslo, Norway. Notably, the album features Zahl's return to the position of lead vocalist on the songs he has composed for the album; this has not occurred since the release of Evig pint (\"Stormfull vals\", featured on Våre demoner, was originally written before the release of their first album, and as such do not meet the specifics).\n\nThe promotion for the final installment of the Violeta Violeta trilogy began with \"The Kaizervirus\", an enigmatic viral marketing campaign. The first single from the album, \"Aldri vodka, Violeta\", was released in September 2012, and Violeta Violeta Volume III was released on November 2, 2012. Following several tour dates in 2013 (including their first ever concert in the UK), they have announced an indefinite hiatus from performing as a group after an extended series of concerts at the DNB Arena in Stavanger, situated in Ottesen and Zahl's home county of Rogaland. The final concert performance for the foreseeable future took place on 15 September 2013. While the group has cited that a reunion is more or less inevitable, when this will occur is unknown for now. <a href=\"https://www.last.fm/music/Kaizers+Orchestra\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
