{"artist":{"name":"Kellie Coffey","mbid":"7b8245d2-e4dc-44c4-beef-739ad26b9df9","url":"https://www.last.fm/music/Kellie+Coffey","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3ab90f5b2690405db38bf0abbf95cdbb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3ab90f5b2690405db38bf0abbf95cdbb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3ab90f5b2690405db38bf0abbf95cdbb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3ab90f5b2690405db38bf0abbf95cdbb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3ab90f5b2690405db38bf0abbf95cdbb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3ab90f5b2690405db38bf0abbf95cdbb.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"19433","playcount":"128398"},"similar":{"artist":[{"name":"Rebecca Lynn Howard","url":"https://www.last.fm/music/Rebecca+Lynn+Howard","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7a61e188abd14055b5b952fd145a3f6b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7a61e188abd14055b5b952fd145a3f6b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7a61e188abd14055b5b952fd145a3f6b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7a61e188abd14055b5b952fd145a3f6b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7a61e188abd14055b5b952fd145a3f6b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7a61e188abd14055b5b952fd145a3f6b.png","size":""}]},{"name":"Sherrié Austin","url":"https://www.last.fm/music/Sherri%C3%A9+Austin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a50b0de0d2f74f608d50e774768979ba.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a50b0de0d2f74f608d50e774768979ba.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a50b0de0d2f74f608d50e774768979ba.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a50b0de0d2f74f608d50e774768979ba.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a50b0de0d2f74f608d50e774768979ba.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a50b0de0d2f74f608d50e774768979ba.png","size":""}]},{"name":"Rachel Proctor","url":"https://www.last.fm/music/Rachel+Proctor","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ceb8597aca2c44978a852fc7c107bbce.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ceb8597aca2c44978a852fc7c107bbce.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ceb8597aca2c44978a852fc7c107bbce.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ceb8597aca2c44978a852fc7c107bbce.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ceb8597aca2c44978a852fc7c107bbce.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ceb8597aca2c44978a852fc7c107bbce.png","size":""}]},{"name":"Carolyn Dawn Johnson","url":"https://www.last.fm/music/Carolyn+Dawn+Johnson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d6b945ec01f7403eae0e60e990720d65.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d6b945ec01f7403eae0e60e990720d65.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d6b945ec01f7403eae0e60e990720d65.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d6b945ec01f7403eae0e60e990720d65.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d6b945ec01f7403eae0e60e990720d65.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d6b945ec01f7403eae0e60e990720d65.png","size":""}]},{"name":"The Kinleys","url":"https://www.last.fm/music/The+Kinleys","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/544fd7dcb7034739acb00f721a706421.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/544fd7dcb7034739acb00f721a706421.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/544fd7dcb7034739acb00f721a706421.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/544fd7dcb7034739acb00f721a706421.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/544fd7dcb7034739acb00f721a706421.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/544fd7dcb7034739acb00f721a706421.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"Kellie Coffey","url":"https://www.last.fm/tag/Kellie+Coffey"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"modern country","url":"https://www.last.fm/tag/modern+country"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Kellie+Coffey/+wiki"}},"published":"05 Jun 2007, 21:08","summary":"Growing up in Moore, Oklahoma, a small town outside of Oklahoma City, Kellie Coffey must have wished upon a pretty powerful star. She signed a publishing contract with industry giant Warner Chappell; had a record deal with BNA Records Nashville; a top 10 single; opened for Superstar Kenny Chesney on his Senorita's and Margaritas tour; a top 5 album sales debut; a top 15 2nd single; and hundreds of thousands of CDs sold. She capped all that off with <a href=\"https://www.last.fm/music/Kellie+Coffey\">Read more on Last.fm</a>","content":"Growing up in Moore, Oklahoma, a small town outside of Oklahoma City, Kellie Coffey must have wished upon a pretty powerful star. She signed a publishing contract with industry giant Warner Chappell; had a record deal with BNA Records Nashville; a top 10 single; opened for Superstar Kenny Chesney on his Senorita's and Margaritas tour; a top 5 album sales debut; a top 15 2nd single; and hundreds of thousands of CDs sold. She capped all that off with the Academy of Country Music's Top New Female Vocalist Award in 2003 and then opened for George Strait on his 2004 tour. With tour dates sharing the stage with Keith Urban, Brooks & Dunn, Montgomery Gentry, Trace Adkins, Winona Judd, Martina McBride, Lone Star, Alan Jackson.... it's been an amazing beginning to her recording career. \n\nKellie's journey to Nashville and career in Country Music has taken some unusual turns. \"All through high school and college, I led a pretty typical, Midwestern, all-American life. When I graduated from OU with a vocal performance degree, it felt like it was time to fly. My goal was to make a living as a singer. I had a friend from OU who had moved to L.A. the year before and had an extra room. So, I packed up my car and headed west. Leaving Oklahoma was very difficult for me and for my whole family, especially my mom. She was a stay at home mom. We are very close but my parents were very supportive. They always believed in me.\" Getting established in L.A. wasn't easy. To pay the bills, Kellie got a job as a singing waitress -- \"I was a much better singer than waitress. Those poor people I waited on!\" She also began writing songs. \"When I first started writing, it was because of a break-up,\" she explains. \"So all of my early songs were about love lost. Those songs helped me get through some tough times.\" The ball really started rolling after she made a demo tape that she sent around, and began getting work on recording sessions and in live shows. She sang backgrounds for Barbra Streisand's Millenium Concert, recorded songs for the Disney Theme Parks (You can still hear Kellie at Christmas time at Disneyland singing \"White Christmas\" as snow falls on Main Street and at Epcot's nightly fireworks extravaganza, Illuminations, singing \"We Go On\" and \"The Promise\"). \"I was working more and more but people kept asking me to take the country out of my voice. I'm glad I had those experiences but at certain point as an artist, I decided I wanted to be true to myself, my voice, who I was. That's where my heart was so more and more of my singing work was as a demo singer for songwriters, singing country songs.\" \n\nAbout that time, Kellie met Geoff Koch who was writing songs for several television shows, among them Walker Texas Ranger. Kellie's subtle twang helped her land a job singing and writing songs for the hit television show, a source of income that allowed her to realize her goal of making a living as a singer. Kellie was able to leave her waitress days behind. Kellie began to find her niche as a songwriter and, given her roots, it was not surprising that it was decidedly country. Nashville seemed like the next logical step. \"About four years after I moved to LA, I started making trips to Nashville, checking out the scene and trying to get a deal. I knew what I really wanted to do and once I focused on my dream, it all started to come together. Doors began to open for me.\" Her friendship with Geoff had turned romantic, and she said yes to his marriage proposal. While planning her wedding, she also doubled her efforts to get a record deal. The unlikeliest location for a country music showcase would have to be a Kosher-Chinese restaurant in Los Angeles, California, but following her invitation-only performance at Genghis Cohen, she was offered a development deal by Judy Stakee with Warner-Chappell. \"Judy has been so instrumental in my career, as a mentor and a friend. She had me co-write with JD Martin (a transplanted Nashville writer who had hits with Terri Clark and Reba) in LA. Then she started sending me to Tennessee to write with Warner Chappell's Nashville writers. \" In 2000, a demo CD was sent to all of the A&R people on Nashville's Music Row. Soon after, Kellie was signed to BNA records. Dann Huff (Faith Hill, Lone Star, Keith Urban, Rascal Flatts) was brought in to produce the CD. Kellie and Geoff got an apartment and then bought a home in Nashville. \n\nKellie's first single, \"When You Lie Next to Me\" took off at radio and her incredible run began culminating in her ACM Award and opening for George Strait on his 2004 tour. After 3 amazing years and after performing for over one million people, Kellie and BNA parted ways. For the first time in a while, Kellie had a chance to take stock of her career and life. Kellie continued to write, but put her recording career on hold to focus on her biggest dream: having a baby. On November 15, 2005, Kellie gave birth to a beautiful baby boy, Jackson Geoffrey. \n\nNow, armed with songs that reflect the trials and joys of the her career journey as well as the deepened heart that only having a child can bring, Kellie is once again pursuing her recording career. Teamed with Grammy Award winning songwriter/producer Wayne Kirkpatrick (Little Big Town) and with Judy Stakee as Executive Producer , Kellie co-wrote 11 of the 12 songs on her new CD, Walk On. The CD is available now on her website and will be available at various online CD retailers as well as download stores iTunes, Rhapsody, eMusic, Sony Connect, Napster and MusicNet by July. The video of the song \"I Would Die For That\", a song dealing with infertility and a working woman's desire to have a child, is on various sites around the internet now. The video for the title track, \"Walk On\", will be released soon. Kellie must have wished on a powerful star, her dreams continue to come true.   <a href=\"https://www.last.fm/music/Kellie+Coffey\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
