{"artist":{"name":"Kenny Rogers","mbid":"c3d14b41-a48d-488f-bfed-ce0597bb0b1f","url":"https://www.last.fm/music/Kenny+Rogers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2b6ace04b5bd42b096032776e0ecf16a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2b6ace04b5bd42b096032776e0ecf16a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2b6ace04b5bd42b096032776e0ecf16a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2b6ace04b5bd42b096032776e0ecf16a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2b6ace04b5bd42b096032776e0ecf16a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2b6ace04b5bd42b096032776e0ecf16a.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"458820","playcount":"3708925"},"similar":{"artist":[{"name":"Don Williams","url":"https://www.last.fm/music/Don+Williams","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2c0961a583f14f498922e92c0d589078.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2c0961a583f14f498922e92c0d589078.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2c0961a583f14f498922e92c0d589078.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c0961a583f14f498922e92c0d589078.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c0961a583f14f498922e92c0d589078.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c0961a583f14f498922e92c0d589078.png","size":""}]},{"name":"Anne Murray","url":"https://www.last.fm/music/Anne+Murray","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/535ec8f58f1b430f8ce070777f9d83bd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/535ec8f58f1b430f8ce070777f9d83bd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/535ec8f58f1b430f8ce070777f9d83bd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/535ec8f58f1b430f8ce070777f9d83bd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/535ec8f58f1b430f8ce070777f9d83bd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/535ec8f58f1b430f8ce070777f9d83bd.png","size":""}]},{"name":"Randy Travis","url":"https://www.last.fm/music/Randy+Travis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/745f411a3ef44671b997989f59f3cebe.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/745f411a3ef44671b997989f59f3cebe.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/745f411a3ef44671b997989f59f3cebe.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/745f411a3ef44671b997989f59f3cebe.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/745f411a3ef44671b997989f59f3cebe.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/745f411a3ef44671b997989f59f3cebe.png","size":""}]},{"name":"Alabama","url":"https://www.last.fm/music/Alabama","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5f44aad63b474bde90df895c85fc64a0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5f44aad63b474bde90df895c85fc64a0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5f44aad63b474bde90df895c85fc64a0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f44aad63b474bde90df895c85fc64a0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f44aad63b474bde90df895c85fc64a0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f44aad63b474bde90df895c85fc64a0.png","size":""}]},{"name":"Lynn Anderson","url":"https://www.last.fm/music/Lynn+Anderson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c92230dce8bc47f392765b409232ea19.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c92230dce8bc47f392765b409232ea19.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c92230dce8bc47f392765b409232ea19.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c92230dce8bc47f392765b409232ea19.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c92230dce8bc47f392765b409232ea19.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c92230dce8bc47f392765b409232ea19.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"classic country","url":"https://www.last.fm/tag/classic+country"},{"name":"kenny rogers","url":"https://www.last.fm/tag/kenny+rogers"},{"name":"male vocalists","url":"https://www.last.fm/tag/male+vocalists"},{"name":"oldies","url":"https://www.last.fm/tag/oldies"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Kenny+Rogers/+wiki"}},"published":"22 Jun 2006, 07:55","summary":"Kenneth Donald Rogers (born August 21, 1938, in Houston, Texas) is a prolific American country music singer, photographer, producer, songwriter, actor and businessman. Kenny Rogers graduated from Jefferson Davis High School in Houston.\n\nAlthough he has been very successful, charting more than 60 top 40 hit singles across various music genres and topping the country and pop album charts for more than 100 individual weeks in the United States alone, many still consider him a vastly underrated artist. <a href=\"https://www.last.fm/music/Kenny+Rogers\">Read more on Last.fm</a>","content":"Kenneth Donald Rogers (born August 21, 1938, in Houston, Texas) is a prolific American country music singer, photographer, producer, songwriter, actor and businessman. Kenny Rogers graduated from Jefferson Davis High School in Houston.\n\nAlthough he has been very successful, charting more than 60 top 40 hit singles across various music genres and topping the country and pop album charts for more than 100 individual weeks in the United States alone, many still consider him a vastly underrated artist. To his fans, he is extraordinarily popular; women in concert audiences bring him roses in unrelenting waves throughout a performance. He appeals to all age groups and still sells millions of albums.\n\nBoth his albums \"The Gambler\" and \"Kenny\" are featured in the About.com poll of \"The 200 Most Influential Country Albums Ever\".[1] He has also been voted the \"Favorite Singer of All-Time\", in a 1986 joint poll by readers of both USA Today and People.\n\nHe has received hundreds of awards for both his music and charity work. These include AMA's Grammy's, ACM's and CMA's, as well as a lifetime achievement award for a career spanning six decades in 2003\n\nMost recently, Rogers hit with his new album release, \"Water & Bridges\", an across the board hit, that peaked at #5 in the Billboard Country Albums sales charts, also charting high in the Billboard 200. The first single from the album, \"I Can't Unlove You,\" is also a hit. He is currently planning a tour of the United Kingdom, in a 2006 BBC Radio 2 interview he told DJ Steve Wright, his favorite hit of his was The Gambler.\n\nBiography\n\nBrief Overview\nHis career began in the mid-1950s, when he recorded with a doo-wop group called The Scholars. Their break up was followed by a minor solo hit called \"That Crazy Feeling\" (1958). After sales slowed down, Kenneth Rogers (as he was billed then) joined a Jazz group called The Bobby Doyle Trio. Disbanded in 1965, a 1966 jazzy rock single for Mercury called \"Here's That Rainy Day\" failed. In 1966 he joined the New Christy Minstrels. He left with fellow members Mike Settle, Terry Williams and Thelma Camacho. They formed The First Edition in 1967 (later renamed \"Kenny Rogers and The First Edition\"). They chalked up a string of hits on both the pop and country charts, including \"Ruby, Don't Take Your Love To Town\", \"Reuben James\" and \"Just Dropped In (To See What Condition My Condition Was In).\" In his First Edition days Rogers had long brown hair, an earring, and pink sunglasses. Known affectionately in retrospect as \"Hippie Kenny\", Rogers had a much smoother vocal style at the time. A thin man when the group first started, from about 1971 on he had begun to gain weight and slightly gray. The group split, and Rogers launched his solo career in 1976 and he developed a more middle of the road gravel voiced style that sold to both pop and country audiences; to date, he has charted more than 60 top 40 hit singles (including upwards of 25 #1's) and no fewer than 50 of his albums have charted. His music has also been featured in top selling movie soundtracks, such as Convoy and Urban Cowboy.\n\nAlthough in the 1990s with the emergence of Garth Brooks, it was noted that this new talent was selling records like no one else had ever in country music, Rogers was nonetheless a dominant force in mainstream music and at his height, was charting singles (and albums) which were racing up the top 40 on the pop charts around the world, songs like \"Lucille\", \"Coward Of The County\", \"The Gambler\" and \"Lady\" became favorites among many music lovers and have remained such, making Rogers one of the most popular entertainers on the touring circuit.\n\n\nThe Early Days\nAfter leaving The First Edition in 1976, after almost a decade with the group, Rogers signed a solo deal with United Artists. Although producer Larry Butler had no doubts about Kenny's talent and that he wanted to sign him, he was advised by several colleges not to sign Rogers, as he was seen as a has-been. Nevertheless, Butler and Rogers began a partnership that would run for four consecutive years.\n\nRogers first outing for his new label was \"Love Lifted Me\". The album charted and two singles \"Love Lifted Me\" and \"While The Feelings Good\" were minor hits. Later in the year Rogers issued his second album, the self-titled \"Kenny Rogers\", which first single \"Laura (What's He Got That I Ain't Got)\", was another solo hit. However, it took \"Lucille\" in 1977 to blow Rogers post-First Edition career wide open, reaching Number One in no less than 12 countries, selling over five million copies world-wide and pushing the \"Kenny Rogers\" album to #1 in the Billboard Country Album Chart. More success was to follow, including the multi-million selling album \"The Gambler\" and another international Number 1 single \"Coward Of The County\", taken from the equally successful album, \"Kenny\". In 1980, The Rogers/Butler partnership came to an end, but Butler continued to work with Kenny on later releases such as \"I Prefer The Moonlight\" in 1987 and \"If Only My Heart Had A Voice\" in 1993.\n\n\nOutside Music\nLike many other successful singers, such as Elvis Presley, he also had success as an actor. His 1982 movie \"Six Pack\" (in which he played a race-car driver) took more than $20 million at the US box office, while made-for-TV movies such as \"The Gambler,\" \"Christmas in America\" and \"Coward of the County\" (based on hit songs of his) topped ratings lists. As an entrepreneur, he collaborated with former Kentucky Fried Chicken CEO John Y. Brown, Jr. in 1991 to start up the restaurant chain, Kenny Rogers Roasters. The chicken and ribs chain, which is similar to Boston Market, was famously featured in an episode of the NBC sitcom Seinfeld, when Kramer tried to have a location of the restaurant put out of business due to its annoying red neon light. On \"Late Night with Conan O’Brien\" he could not pick his chicken out in a taste test claiming he preferred \"greasy burgers\". * Kenny Rogers has been parodied in several MADtv segments by comedian Will Sasso. He is usually portrayed (in an exaggerated manner) as a drunk, egotistical idiot. Two sketches feature Rogers in a parody of MTV's Jackass TV series; other skits show him in parodies of Punk'd and Fear Factor. In those segments, Sasso uses comically excessive amounts of foul language, slapstick violence and alcohol while in character.\n\nRogers also works with property, doing construction work and then selling the property, as well as admitting he does a lot of DIY work at his own home. He is also a very highly respected photographer having had three books of his work published.\n\nWorldwide Success\nHis success is worldwide. For example, he has played many well-attended concerts in Europe and the Far East, where he has charted numerous singles and albums from the 1970s through to the present day. New Zealand was a big stronghold during his First Edition days, being the only country to give them the acclaim they truly deserved. His 1985 greatest-hits package, \"The Kenny Rogers Story,\" reached #1 on the British country chart -- and four years later (in 1989), was still at #2. He also charted internationally during that time with a series of studio albums.\n\nIn 1983, Rogers signed to RCA for a record breaking US$20 million advance. Although, following the success of his label debut, The Bee Gees produced Eyes That See In The Dark album, some critics noted that Rogers wasn't doing as well as in previous years. Nonetheless, he was still among the worlds top stars. Between 1983 and 1990 alone he charted no less than 23 top 40 singles and 10 top 40 albums.\n\n\nSuccess in the 1990s\nIn 1990s Rogers continued to chart with singles such as Crazy In Love, If You Want To Find Love and The Greatest. From 1991 to 1994, Rogers hosted The Real West on A&E (Moved to The History Channel in 1995.). In 1994, Rogers released his \"dream\" album titled Timepiece on Atlantic Records. It consisted of 30's and 40's jazz standards; it was the type of music he performed in his early days with The Bobby Doyle Three in Houston. In 1996 he released an album Vote For Love where the public requested their favorite love songs and Kenny performed the songs (several of his own hits were in there). The album was the first for the TV shopping channel QVC's record label, onQ Music. The album (sold exclusively by QVC) was a huge success and was later issued in stores under a variety of different titles, but never titled Vote For Love.\n\nHe has been married five times. His fourth wife was the actress Marianne Gordon Rogers. His current wife is the former Wanda Miller. He has a daughter and four sons, including twins born while Rogers was 65.\n\n\nBeyond the 1990s\nIn the 21st century, Rogers was back at #1 for the first time in almost a decade with the single \"Buy Me A Rose\", making him the oldest artist in the history of country music to reach the chart summit. He also released the critically acclaimed album \"Back To The Well.\"\n\nThough Kenny didn't record new albums for a couple of years he continued to have success in many countries with more greatest hits packages, in 2004 \"42 Ultimate Hits\", which was the first hits collection to span his days with the first edition to the present, reached Number 6 in the American country charts and went gold. In 2005 \"The Very Best Of Kenny Rogers\", a double album, sold well in Europe. It was the first new solo Kenny Rogers hit's album to reach the United Kingdom for over a decade, despite many compilations there that were not true hits packages.\n\nKenny also signed with Capitol Nashville Records and had more success with the TV advertised release \"21 Number Ones\" in January 2006. Although this CD did contain 21 chart-toppers as the title claims (recorded between 1976 and the present day), this was not a complete collection of Rogers #1 singles, omitting such singles as Crazy In Love and What About Me?.\n\nA lot of his success was with Capitol from 1976 to 1983 (called United Artists/Liberty at the time). It is very rare for an artist of Rogers' age to be signed to a major label. Capitol followed \"21 Number Ones\" with Rogers' new studio album, \"Water And Bridges,\" in March 2006 on the Capitol Nashville label, the first single from the album was \"I Can't Unlove You\" which made #20 on the country charts, after spending over 6 months on the hit list, more than 50 years after he formed his first group and 38 years after his first major hit as leader of The First Edition, showing Kenny's long durance in the music world.\n\n\nSelected discography\n\nAlbums\n\nWith The First Edition\nThe First Edition (1967) \nThe First Edition's Second (1968) \nThe First Edition '69 (1969) \nRuby, Don't Take Your Love To Town (1969) \nSomething's Burning (1970) \nTell It All Brother (1970) \nTransition (1971) \nThe Ballad of Calico (1972) \nBack Roads (1972) \nRollin (1973) \nMonumental (1973) \nI'm Not Making Music For Money (1974 NZ only release with exclusive tracks) \n\nSolo\nLove Lifted Me (United Artists 1975) \nKenny Rogers (United Artists 1976) \nDaytime Friends (United Artists 1977) \nLove Or Something Like It (United Artists 1978) \nThe Gambler (United Artists 1978) \nEvery Time Two Fools Collide (Kenny Rogers and Dottie West) (United Artists 1978) \nKenny (United Artists 1979) \nClassics (Kenny Rogers and Dottie West) (United Artists 1979) \nGideon (United Artists 1980) \nChristmas (Liberty 1981) \nShare Your Love (Liberty 1981) \nLove Will Turn You Around (Liberty 1982) \nWe've Got Tonight (Liberty 1983) \nEyes That See In The Dark (RCA 1983) \nWhat About Me? (RCA 1984) \nOnce Upon A Christmas (Kenny Rogers and Dolly Parton) (RCA 1984) \nThe Heart Of The Matter (RCA 1985) \nLove Is What We Make It (Liberty 1985) (contains previously unreleased recordings from Kenny's UA/Liberty years) \nThey Don't Make Them Like They Used To (RCA 1986) \nI Prefer The Moonlight (RCA 1987) \nSomething Inside So Strong (Reprise 1989) \nChristmas In America (Reprise 1989) \nLove Is Strange (Reprise 1990) \nBack Home Again (Reprise 1991) \nIf Only My Heart Had A Voice (Giant 1993) \nTimepiece (Orchestral Sessions with David Foster) (Atlantic 1994) \nVote For Love (onQ 1996) \nThe Gift (Magnatone 1996) \nAcross My Heart (Magnatone 1997) \nChristmas From The Heart (Dreamcatcher 1998) \nShe Rides Wild Horses (Dreamcatcher 1999) \nThere You Go Again (Dreamcatcher 2000) \nLive By Request (Dreamcatcher 2001) \nBack To The Well (Dreamcatcher 2003) \nWater & Bridges (Capitol Nashville 2006) \n\nCompilations\nGreatest Hits (1971) (Kenny Rogers And The First Edition) \nTen Years Of Gold (1977, features re-recordings of First Editon hits, plus early solo hits) \nThe Kenny Rogers Singles Album (U.K release of Ten Years Of Gold with Bonus tracks, 1979) \nThe Best Of Kenny Rogers (1979) \nShine On (European Release, 1980) \nKenny Rogers' Greatest Hits (1980) \nLady (U.K release of 1980's Greatest Hits album, 1981) \nTwenty Greatest Hits (1983) \nThe Kenny Rogers Story - 20 Golden Greats (U.K release, 1985) \n60's Revisited (1980s, with the 1st edition) \nGreatest Hits (1988) \n20 Great Years (1990) \nThe Very Best of Kenny Rogers (1990) \nThe Best Of Kenny Rogers (1999) \nKenny Rogers - Collection (2000) \nThrough The Years - 20 Greatest Hits (2001) \nLegends - The Kenny Rogers and The First Edition Collection (2003) \n42 Ultimate Hits (2004) \nThe Very Best Of Kenny Rogers (2 CD set, European release, 2005) \n21 Number One Hits (2006) \nGolden Legends - Kenny Rogers (2006) \n\nBox Sets\nGreatest Hits and Finest Performances (5 L.P set) (1986) \nThrough The Years: A Retrospective (4 CD) (1999) \nTriple Treasures (3 CD Box set featuring recorings made between 1967 and 1998) (2002)  <a href=\"https://www.last.fm/music/Kenny+Rogers\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
