{"artist":{"name":"Kix","mbid":"65dcb0ac-303d-4179-ac8a-b2881357b719","url":"https://www.last.fm/music/Kix","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/76900dca521e485abf158efd3d651617.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/76900dca521e485abf158efd3d651617.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/76900dca521e485abf158efd3d651617.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76900dca521e485abf158efd3d651617.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76900dca521e485abf158efd3d651617.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76900dca521e485abf158efd3d651617.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"112541","playcount":"953993"},"similar":{"artist":[{"name":"Ratt","url":"https://www.last.fm/music/Ratt","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c6492a1ff7cf44fe89e1b3c2e24ea7b2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c6492a1ff7cf44fe89e1b3c2e24ea7b2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c6492a1ff7cf44fe89e1b3c2e24ea7b2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c6492a1ff7cf44fe89e1b3c2e24ea7b2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c6492a1ff7cf44fe89e1b3c2e24ea7b2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c6492a1ff7cf44fe89e1b3c2e24ea7b2.png","size":""}]},{"name":"Great White","url":"https://www.last.fm/music/Great+White","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0843b734a54f49c7a0cd69f22faa944d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0843b734a54f49c7a0cd69f22faa944d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0843b734a54f49c7a0cd69f22faa944d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0843b734a54f49c7a0cd69f22faa944d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0843b734a54f49c7a0cd69f22faa944d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0843b734a54f49c7a0cd69f22faa944d.png","size":""}]},{"name":"Faster Pussycat","url":"https://www.last.fm/music/Faster+Pussycat","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dcf5cfab31544227b88a307d84d90e09.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dcf5cfab31544227b88a307d84d90e09.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dcf5cfab31544227b88a307d84d90e09.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dcf5cfab31544227b88a307d84d90e09.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dcf5cfab31544227b88a307d84d90e09.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dcf5cfab31544227b88a307d84d90e09.png","size":""}]},{"name":"Bulletboys","url":"https://www.last.fm/music/Bulletboys","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/938c504f873f4d66beb387332d7a4328.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/938c504f873f4d66beb387332d7a4328.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/938c504f873f4d66beb387332d7a4328.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/938c504f873f4d66beb387332d7a4328.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/938c504f873f4d66beb387332d7a4328.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/938c504f873f4d66beb387332d7a4328.png","size":""}]},{"name":"Autograph","url":"https://www.last.fm/music/Autograph","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cf78e5eb7b224776a0e58ab040085e6a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cf78e5eb7b224776a0e58ab040085e6a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cf78e5eb7b224776a0e58ab040085e6a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf78e5eb7b224776a0e58ab040085e6a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf78e5eb7b224776a0e58ab040085e6a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf78e5eb7b224776a0e58ab040085e6a.png","size":""}]}]},"tags":{"tag":[{"name":"hard rock","url":"https://www.last.fm/tag/hard+rock"},{"name":"hair metal","url":"https://www.last.fm/tag/hair+metal"},{"name":"Glam Metal","url":"https://www.last.fm/tag/Glam+Metal"},{"name":"80s","url":"https://www.last.fm/tag/80s"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Kix/+wiki"}},"published":"04 Sep 2006, 03:34","summary":"Multiple artists exist by this name. 1) Kix is an American hard rock band, being best known for the popular singles \"Blow My Fuse\", \"Cold Blood\", and \"Don't Close Your Eyes\". Carving out a nice niche in the booming 80s glam metal movement yet being bitten on the backside hard by record company games, the guys originally called themselves \"The Shooze\" before changing that to \"The Generators\" (and, for a couple of weeks, \"The Baltimore Cocks\") before settling on \"Kix\". <a href=\"https://www.last.fm/music/Kix\">Read more on Last.fm</a>","content":"Multiple artists exist by this name. 1) Kix is an American hard rock band, being best known for the popular singles \"Blow My Fuse\", \"Cold Blood\", and \"Don't Close Your Eyes\". Carving out a nice niche in the booming 80s glam metal movement yet being bitten on the backside hard by record company games, the guys originally called themselves \"The Shooze\" before changing that to \"The Generators\" (and, for a couple of weeks, \"The Baltimore Cocks\") before settling on \"Kix\". The Baltimore-based band garnered quite a reputation for themselves as one of Maryland's most exciting live cover bands prior to signing to Atlantic Records in 1981. Led by frontman Steve Whiteman and creative mastermind/bassist Donnie Purnell, the band rounded itself out by taking in drummer Jimmy Chalfant as well as guitarists Ronnie Younkins (nicknamed \"10/10\") and Brian \"Damage\" Forsythe.\n\nThe band hit the ground running after their 1978 formation. Playing the club circuit six nights a week for three straight years or so resulted in the band cultivating a huge local fan base and finally led to a contract with the Time Warner affiliate. Releasing their self-titled debut in 1981, the band showed off a desire to mix tongue-in-cheek humor with bombastic riffs and take influence from a wide variety of past influences in hard rock, punk music, and other styles. Kix's playlists featured what were to become live favorites such as \"Atomic Bombs\", the glorious \"Yeah, Yeah, Yeah\", and \"The Kid\". To support the release, the quintet set out to hit every club up and down the East Coast. Although often viewed as a part of the booming 80s heavy music scene, the guys featured more of a brash style reminiscent of AC/DC that mixed a tough attitude with catchy hooks, carving a nice niche for themselves.\n\nStill, the guys' 1983 follow-up, titled 'Cool Kids', played up the more commercial side of the band, as shown by their collaboration with \"Hot Child in the City\" singer-songwriter Nick Gilder and move to a pop-influenced glam rock sound. Single \"Body Talk\" in particular found the group trying their hand at a dance music kind of style; rumors ran rampant that the song was written solely to appease the band's label. Said record company people were also said to have, eager to capture some steam at radio, also forced the band into shooting a horrendous video for the song which featured the band commiserating with ladies in full-on workout garb. Other songs such as \"Restless Blood\" and \"Mighty Mouth\" had a pop metal vibe with far more bite.\n\nEager to get back in the studio, Kix partnered up with Ratt producer Beau Hill (who'd also later work with Warrant and Winger) and released 'Midnite Dynamite', which the guys would call their \"self-proclaimed favorite record ever.\" The 1985 album featured a great single in \"Cold Shower\"\" and some other notable cuts such as \"Sex\" and \"Bang Bang (Balls of Fire)\". At the time, other energetic hard rock groups such as Quiet Riot had broke through in a big way, and the members of Kix wanted to step beyond mere underground acclaim to taste the big time. Nonetheless, a funny thing happened on the way to commercial success with album number three.\n\nAs the band got ready for a brief West Coast jaunt, which took them quite a ways from their East Coast home, the guys kept hearing some fishy stuff about another young, good-looking vocalist by the name of Bret Michaels. A big hoopla had started to form that this young upstart had stolen singer Steve Whiteman's stage act. Rumor became fact as the members of Kix discovered that the band Poison had, prior to relocating to California from the Harrisburg, PA area, often come out to see Kix perform live. Now local heroes in their own right, Bret Michaels and his band-mates had more than borrowed a few stage moves from the charismatic Kix lead singer as well as adopted things from several other artists. Sadly, when Kix got the opportunity to open for Poison at L.A.'s Country Club, their  fears materialized in the flesh; though having a far lighter, pop-fueled style more in the vein of energetic rock n roll than metal, the Poison line-up had incorporated Kix's whole stage act. The guys felt stunned.\n\nWeathered but not to be counted out, Kix returned to the studio in not too long, and the guys brought in hard rock veteran Tom Werman for assistance. Thankfully, the band achieved the massive commercial breakthrough that they had been hoping for. The band's fourth effort, 1988's 'Blow My Fuse', featured a monstrous hit in the power ballad \"Don't Close Your Eyes\". As the song raced up the charts, the guys began to garner the recognition that they had fought so long and so hard for. Many other excellent cuts also permeated 'Blow My Fuse', and the album itself earned serious praise from several music critics. The powerful tunes \"Cold Blood,\" \"Blow My Fuse,\" \"Red Lite, Green Lite, TNT,\" and \"No Ring Around Rosie\" all showcased the band doing what it does best.  \n\nKix finally graduated to large scale arenas. For the next year and a half, the band would open for heroes AC/DC and Aerosmith, as well as a slew of others including David Lee Roth, Ratt, and Britny Fox. KIX were on top of the world -- if only momentarily. Much larger problems were looming on the horizon. The old adage of \"more money, more problems\" had materialized itself as a stone around KIX' collective necks for years and years. The band's financial matters were now in a state of complete disarray. Now severely indebted to Atlantic Records, the band faced a painful wake up call when they realized that they hadn't made a penny off Blow My Fuse. To make matters even worse, the label had plans to shift KIX from their roster to the label's new imprint EastWest Records America. This proved to be disastrous move for the quintet as they now had to deal with a new regime to work their yet-to-be released fifth record.\n\nBy the time Hot Wire finally hit record stores in 1991, the musical climate had shifted dramatically.  \"Hair bands\" were now a thing of the past. Grunge was all the rage, making a band like KIX a laughingstock. The new trend made it virtually impossible for KIX to garner the radio support necessary for them to prosper commercially. In hindsight, Hot Wire may have proven to be the band's best sounding record ever. Bolstered by a little MTV airplay, the album's first single \"Girl Money\" showcased everything that made KIX a first-rate bar band. With double-entendre verses in the vein of classic Bon Scott-era AC/DC, great musicianship, and a hearty sense of humor to boot, the track would have probably been huge in 1989. Selling just under 200,000 units, the album came and went and KIX returned to doing what it had done all along -- hitting the road.\n\nThe band then toured the Orient and recorded a live record at the University of Maryland's Cole Field House in 1992. It would be released by Atlantic in 1993 under the uninventive moniker, KIX Live. The 12-track live album would finally fulfill the band's contractual obligation to the label. By the time KIX Live was released, founding member and guitarist Brain Forsythe had quit the band returning to the fold in 1994 in time to record Show Business, the band's ill-fated debut on CMC. Released in 1995, Show Business tanked and the band was history. After a three-year hiatus away from the music biz, Steve Whiteman re-merged in Baltimore as the singer for Funny Money, with Jimmy Chalfant to join in on drums in 2004.\n\nFor more info and to contact KIX, go to their myspace site. \nhttp://www.myspace.com/kixrox  \n\n2. Kix\nan American cereal brand introduced in 1937 by the General Mills cereal company of Golden Valley, Minnesota.  The product is an extruded expanded puffed grain cereal made with whole grain corn.  \n\nIn 1947, Kix offered a Lone Ranger atomic bomb ring in exchange for a box top and 15 cents.[3] When the red base (which served as a \"secret message compartment\") was taken off, and after a suitable period of time for dark adaptation, you could look through a small plastic lens at scintillations caused by polonium alpha particles striking a zinc sulfide screen.\n\nThe slogan \"Kid Tested, Mother Approved\" was introduced in 1978. During the 1980s, television commercials included the jingle \"Kids love Kix for what Kix has got/Moms love Kix for what Kix has not\". <a href=\"https://www.last.fm/music/Kix\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
