{"artist":{"name":"Kyle Eastwood","mbid":"75c78621-0f75-4765-bc69-5f02d8a8a850","url":"https://www.last.fm/music/Kyle+Eastwood","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8ae21124c22b43beb495f0ba1b23077e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8ae21124c22b43beb495f0ba1b23077e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8ae21124c22b43beb495f0ba1b23077e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8ae21124c22b43beb495f0ba1b23077e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8ae21124c22b43beb495f0ba1b23077e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8ae21124c22b43beb495f0ba1b23077e.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"29414","playcount":"225814"},"similar":{"artist":[{"name":"FRED NARDIN TRIO","url":"https://www.last.fm/music/FRED+NARDIN+TRIO","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Foehn Trio","url":"https://www.last.fm/music/Foehn+Trio","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Louis Hayes","url":"https://www.last.fm/music/Louis+Hayes","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9ee523dc5ae24b2fbf99bd14766cb304.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9ee523dc5ae24b2fbf99bd14766cb304.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9ee523dc5ae24b2fbf99bd14766cb304.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9ee523dc5ae24b2fbf99bd14766cb304.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9ee523dc5ae24b2fbf99bd14766cb304.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9ee523dc5ae24b2fbf99bd14766cb304.png","size":""}]},{"name":"Brian Bromberg","url":"https://www.last.fm/music/Brian+Bromberg","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/84b29cdbeb974abdabbc1f7f0261fe7f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/84b29cdbeb974abdabbc1f7f0261fe7f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/84b29cdbeb974abdabbc1f7f0261fe7f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84b29cdbeb974abdabbc1f7f0261fe7f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84b29cdbeb974abdabbc1f7f0261fe7f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84b29cdbeb974abdabbc1f7f0261fe7f.png","size":""}]},{"name":"Baptiste Trotignon","url":"https://www.last.fm/music/Baptiste+Trotignon","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/10e096433e1e4ee1bdd95db9710133f8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/10e096433e1e4ee1bdd95db9710133f8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/10e096433e1e4ee1bdd95db9710133f8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/10e096433e1e4ee1bdd95db9710133f8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/10e096433e1e4ee1bdd95db9710133f8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/10e096433e1e4ee1bdd95db9710133f8.png","size":""}]}]},"tags":{"tag":[{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"acid jazz","url":"https://www.last.fm/tag/acid+jazz"},{"name":"easy listening","url":"https://www.last.fm/tag/easy+listening"},{"name":"fusion jazz","url":"https://www.last.fm/tag/fusion+jazz"},{"name":"bass","url":"https://www.last.fm/tag/bass"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Kyle+Eastwood/+wiki"}},"published":"08 Nov 2006, 11:02","summary":"Kyle grew up in Carmel California and is the eldest son of the Hollywood star Clint Eastwood. While doing his homework Kyle remembers listening to records of jazz stars such as Duke Ellington, Count Basie and Miles Davis playing in the house. Like any child raised by enthusiastic jazz loving parents, an awareness and love of music soaks in quickly. Until he was about ten years old jazz was the only music he listened to and as far as he was concerned <a href=\"https://www.last.fm/music/Kyle+Eastwood\">Read more on Last.fm</a>","content":"Kyle grew up in Carmel California and is the eldest son of the Hollywood star Clint Eastwood. While doing his homework Kyle remembers listening to records of jazz stars such as Duke Ellington, Count Basie and Miles Davis playing in the house. Like any child raised by enthusiastic jazz loving parents, an awareness and love of music soaks in quickly. Until he was about ten years old jazz was the only music he listened to and as far as he was concerned the only music that he knew existed! Eastwood senior had been attending the Monterey Jazz Fest since it began in 1958 and when his children were born it became a yearly family outing as it was only fifteen minutes away from where they lived.\n\nBeing the son of one of the most famous men in the world gave Kyle immediate access backstage to meet huge jazz stars who were performing at that time such as Dizzy Gillespie, Stan Getz, Buddy Rich, Ella Fitzgerald, Sarah Vaughan and many more. Kyle's childhood had jazz as its soundtrack and he credits his father with introducing him to the joys of the bassline. Kyle's first memory of playing music was when Clint taught him how to play the left hand bass line of Boogie Woogie while he played the right hand solo over the top. Soon after that, Kyle started getting piano lessons and in 1982 Kyle began his entertainment career with a lead role in HONKYTONK MAN with his father playing his uncle alongside him. Kyle enrolled in UCLA and studied films but after two years realised that music and more importantly jazz was his true passion. It was only when Kyle turned eighteen that he started to dabble on the electric bass jamming with high school mates in Pebble Beach and learning Led Zeppelin and Motown basslines by ear.\n\nWith a little help from his fathers friends Kyle was influenced to pick up the double bass after having met Ray Brown and John Clayton, also spending a lot of time on set with Lenny Niehaus who wrote the score for Bird which Clint directed in honour of Charlie Parker. Through Niehaus Kyle met Buell Neidlinger, the bassist who had worked with Cecil Taylor, Ornette Coleman and The Boston Symphony Orchestra. Luckily for Kyle not only did he have the pleasure of meeting some of these great names - he was sometimes taught by them too. After years of paying his dues gigging around New York and Los Angeles Kyle finally struck a deal with SONY who released his first album FROM THERE TO HERE in 1998 which features the vocal talent of Joni Mitchell. The album is an upbeat collection of jazz standards and original music and was critically well received. Showing his ability to adapt and write for different genres Kyle has started to get back into films by writing a few scores beginning with his contribution to the Oscar winning movie MYSTIC RIVER. Recently Kyle has been living between LA, New York, London and Paris.\n\nHe has recently just finished writing a few tracks for his father's new film MILLION DOLLAR BABY which stars Hillary Swank and Morgan Freeman. At the end of August 2004 Kyle signed to one of the leading independent jazz label in the UK, CANDID Records who are responsible for bringing Jamie Cullum and Clare Teal to the nation's attention and by end of the year PARIS BLUE was released. Kyle had been working on the album while living in Paris with his own family and this album is a lot more personal with contributions from his father and his daughter Graylen Eastwood who actually wrote and recorded the introduction to the title track Paris Blue when she was only 9 years old! Now the 'fresh faced, softly spoken and remarkably humble' musician has been causing quite a stir in the London jazz scene impressing the local pundits who have branded him a 'damn fine bassist'.\n\nOctober 2006 saw the release of Kyle's second Candid album NOW. This new record, produced by Michael Stevens, features songs written and sung by Ben Cullum and the BBC British Jazz Award winning pianist Andrew McCormack. 2006 also found Kyle working on two film projects with his father, 'FLAGS OF OUR FATHERS' & 'RED SUN BLACK SAND'. <a href=\"https://www.last.fm/music/Kyle+Eastwood\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
