{"artist":{"name":"April Wine","mbid":"78761837-4b00-4935-b7be-601697900e66","url":"https://www.last.fm/music/April+Wine","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9c7e154a45e944db80df956b3603888f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9c7e154a45e944db80df956b3603888f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9c7e154a45e944db80df956b3603888f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c7e154a45e944db80df956b3603888f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c7e154a45e944db80df956b3603888f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c7e154a45e944db80df956b3603888f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"102679","playcount":"921370"},"similar":{"artist":[{"name":"Chilliwack","url":"https://www.last.fm/music/Chilliwack","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8fe03d255f7a4e9eaf520f12fdd5d5cb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8fe03d255f7a4e9eaf520f12fdd5d5cb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8fe03d255f7a4e9eaf520f12fdd5d5cb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8fe03d255f7a4e9eaf520f12fdd5d5cb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8fe03d255f7a4e9eaf520f12fdd5d5cb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8fe03d255f7a4e9eaf520f12fdd5d5cb.png","size":""}]},{"name":"Triumph","url":"https://www.last.fm/music/Triumph","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/95b571d7059c46e58975d0142e5e5d2e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/95b571d7059c46e58975d0142e5e5d2e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/95b571d7059c46e58975d0142e5e5d2e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95b571d7059c46e58975d0142e5e5d2e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95b571d7059c46e58975d0142e5e5d2e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95b571d7059c46e58975d0142e5e5d2e.png","size":""}]},{"name":"Trooper","url":"https://www.last.fm/music/Trooper","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/69586b80ac244bd6b3756f234056d380.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/69586b80ac244bd6b3756f234056d380.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/69586b80ac244bd6b3756f234056d380.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/69586b80ac244bd6b3756f234056d380.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/69586b80ac244bd6b3756f234056d380.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/69586b80ac244bd6b3756f234056d380.png","size":""}]},{"name":"Bachman-Turner Overdrive","url":"https://www.last.fm/music/Bachman-Turner+Overdrive","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0edcff0ece864baebbfe26b550cedf22.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0edcff0ece864baebbfe26b550cedf22.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0edcff0ece864baebbfe26b550cedf22.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0edcff0ece864baebbfe26b550cedf22.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0edcff0ece864baebbfe26b550cedf22.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0edcff0ece864baebbfe26b550cedf22.png","size":""}]},{"name":"Kim Mitchell","url":"https://www.last.fm/music/Kim+Mitchell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6177054997b2437d8a01324f832d5bf6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6177054997b2437d8a01324f832d5bf6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6177054997b2437d8a01324f832d5bf6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6177054997b2437d8a01324f832d5bf6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6177054997b2437d8a01324f832d5bf6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6177054997b2437d8a01324f832d5bf6.png","size":""}]}]},"tags":{"tag":[{"name":"classic rock","url":"https://www.last.fm/tag/classic+rock"},{"name":"hard rock","url":"https://www.last.fm/tag/hard+rock"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"Canadian","url":"https://www.last.fm/tag/Canadian"},{"name":"heavy metal","url":"https://www.last.fm/tag/heavy+metal"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/April+Wine/+wiki"}},"published":"30 Jun 2006, 02:18","summary":"April Wine is a Canadian hard rock band that formed in 1969. According to the group, they chose the name 'April Wine' simply because it was two words that sounded good together. Perhaps best known for their international top 40 hit \"Just Between You And Me\", an iconic power ballad that made them the very first Canadian band on MTV, April Wine has gone on to release over twenty albums and forge a live performance reputation that sees them still drawing <a href=\"https://www.last.fm/music/April+Wine\">Read more on Last.fm</a>","content":"April Wine is a Canadian hard rock band that formed in 1969. According to the group, they chose the name 'April Wine' simply because it was two words that sounded good together. Perhaps best known for their international top 40 hit \"Just Between You And Me\", an iconic power ballad that made them the very first Canadian band on MTV, April Wine has gone on to release over twenty albums and forge a live performance reputation that sees them still drawing devoted crowds across Canada and elsewhere forty years after taking their first steps into the musical spotlight.\n\n    By the spring of 1970, April Wine had relocated from Halifax to Montreal and were making a self-titled album for Aquarius Records. This first album established Myles Goodwyn as a composer with the song \"Fast Train\" receiving much airplay throughout Canada and becoming the main reason April Wine was able to record a second album. In the fall of 1971, original member Jim Henman left the band and was replaced by Montreal native Jim Clench.\n\n    Famed producer Ralph Murphy worked with the group on their second album, titled 'On Record'. Murphy's mission was to give April Wine a major international hit, and he came very close to doing just that. The album pushed the band into the North American public spotlight for the first time. You Could Have Been a Lady, originally recorded in England by Hot Chocolate, was a phenomenal hit for April Wine. This song provided the band with a #1 hit in Canada and allowed them to crack Billboard's Top 30 in the USA where it remained for 11 weeks. On Record also included another notable tune; a cover of Elton John's Bad Side Of The Moon.\n\n    Following the Gold success of the second album it was clear that April Wine had the chance to become one of Canada's most significant rock bands. Ralph Murphy would be back to produce the follow up album but there would be changes in the band. By the completion of Electric Jewels a new April Wine would emerge. This band would no longer include the Henman brothers.\n\nEarly in 1973 the two remaining members, Myles Goodwyn and Jim Clench, faced the dilemma of taking the band to the next level. After a few auditions Jerry Mercer and Gary Moffet joined the band and April Wine became a tighter, flashier band. The two new members helped to complete album number three; Electric Jewels. This album remains a fan favorite with such classic songs as Weeping Widow, Just Like That and Lady Run Lady Hide. It provides a great example of the writing talents of Goodwyn and Clench. The following spring the band hit the road with a national tour called The Electric Adventure. This tour was the first to use dramatic lighting and pyrotechnic displays as an integral part of their show, a feature that would prove to be extremely popular during their international stardom and would lend influence to various emerging artists, Garth Brooks for one.\n\nForever For Now, the band's sixth album, included a Canadian music milestone for the band; the best selling Canadian single the band ever released. Both the single, You Won't Dance With Me, as well as the album reached critical acclaim with the single reaching Gold and the album reaching Gold then Platinum in Canada.\n\nMany people consider Stand Back to be one of the band's greatest accomplishments. This album provided the hits Tonight Is A Wonderful Time To Fall In Love and I Wouldn't Want To Lose Your Love but the non-hits were even more remarkable. Songs like Cum Hear The Band, Slowpoke, Don't Push Me Around and Oowatanite helped push Stand Back to Double-Platinum status in Canada.\n\nWith the release of The Whole World's Goin' Crazy, Steve Lang had replaced Jim Clench on bass guitar. This album made April Wine the first Canadian band to achieve Platinum advance sales orders and included another April Wine classic in the ballad Like A Lover, Like A Song.\n\nForever For Now, the band's sixth album, included a Canadian music milestone for the band; the best selling Canadian single the band ever released. Both the single, You Won't Dance With Me, as well as the album reached critical acclaim with the single reaching Gold and the album reaching Gold then Platinum in Canada.\n\nFollowing the release of Live At The El Mocambo a fifth member was added to the band. Brian Greenway joined the lineup for the summer 1977 tour and gave the group some added flexibility. Brian could sing, write and play harmonica but his greatest contribution to April Wine was on guitar. Since Myles was a surprisingly skilled keyboard player it was invaluable to have a third guitar player and April Wine could now create arrangements for three guitars which would develop into the group's trademark power rock image during the following years.\n\nThe band's seventh studio album would prove to be the group’s turning point. It was the third single from First Glance that made April Wine an international success. Radio listeners in Flint Michigan made Roller a top request number. This single was eventually a Top 30 hit in the U.S.A. and First Glance became the band's first Gold record outside of Canada. Roller remained on Billboard's Hot 100 Singles chart for 11 weeks while First Glance stayed on Billboard's 200 Album chart for 11 weeks as well. 1979 proved to be a very good year for Canadian Wine indeed.\n\nMajor artists such as Rush, Journey and Styx requested that April Wine open their shows in the United States. American audiences were finally being exposed to this \"new\" band called April Wine. Canada's best kept secret was finally out in the open.\n\nIt was a confident group that recorded Harder...Faster in the summer of 1979. The album featured the hardest rock that April Wine had ever recorded. This album included such powerful songs as I Like To Rock, which American radio embraced, and Say Hello which went to the top of the charts in Canada. The popularity of these songs helped keep the album on Billboard's 200 Album charts for a whopping 40 weeks! Harder...Faster helped the group collect more Gold and Platinum awards on both sides of the border.\n\nThe first months of 1980 saw April Wine touring as Nazareth's opening act throughout the United States. In city after city promoters remarked on the powerful pairing of the bands. Most felt that the show would be a better draw if April Wine headlined. The time had finally come for April Wine to take top billing outside of Canada. A decade of hard work had finally paid off.\n\nThe group's ninth studio album, The Nature Of The Beast, became April Wine's greatest success. Released in January of 1981, the first single Just Between You and Me broke Billboard's Top 20 and remained on the their Hot 100 Singles chart for 16 weeks. The same song hit position number 11 on Billboard's Album Rock Track chart and charted for an incredible 10 weeks. Later that year the millionth copy of the album was sold in the U.S.A. and April Wine had finally attained international \"Platinum\" status. The song Crash And Burn was even featured in an NBC Movie of the Week! The album remained on Billboard's 200 Album chart for 34 weeks peaking at the 26th position. The album went on to claim more awards for the group as it collected Gold and Platinum on both sides of the border and Double Platinum in Canada.\n\nDuring the 1980's April Wine had the strongest concert repertoire ever and the demand for appearances had never been greater. They were in demand in Canada, the United Sates, England and Germany. In fact it seemed their popularity was traveling more than they were. There was the feeling that the band could tour forever.\n\nWhether writing the songs, producing them, or promoting them, Myles Goodwyn had been working against some kind of \"deadline\" for the last three years with no significant time off. He needed a break... so he took one. After a hiatus of 18 months, during which the band recorded Power Play with such cutting edge hits as Anything You Want You Got It and Enough is Enough, the band was ready to tour again. The 1982 Power Play tour was the largest tour April Wine had ever attempted. It incorporated the most elaborate stage the band had ever used. Their return to Canada, after two years away, saw them sell out shows across the country. Yes the band was welcomed home with open arms but Power Play, even though successful, did not meet with the critical international acclaim that the group's previous two albums enjoyed. Both Enough Is Enough and If You See Kay charted on Billboard's Album Rock Tracks and remained there for a number of weeks but Enough Is Enough only remained on Billboard's Hot 100 Singles chart for 8 weeks. However the album itself peaked Billboard's 200 Album chart at 37 and remained on the chart for a strong 20 weeks, still a phenomenal accomplishment, but perhaps not enough for this perfectionist band from Canada.\n\nWith the release of Animal Grace, the group's eleventh undertaking, things took a turn for the worse. This Could Be The Right One entered the charts very quickly but stalled just as abruptly. The album had taken an extremely long time to record and a rift had begun to form in the band.\n\nIn a move that seemed to symbolize the distance between Myles and the band, he and his family moved to the Bahamas. The group would get together once more for a farewell tour of Canada. The tour was a bittersweet one, with the die-hard fans realizing what lay ahead. A twelfth studio album was released that featured only two remaining members of the group; Myles and Brian. The rest had decided to go their separate ways.\n\nIn late 1988 Myles moved back to Montreal and started to receive phone calls from the United States about the possibility of a new April Wine album. The demand was there and Myles had already been talking to the other band members about a possible reunion. In July of 1992 April Wine played its first concert in 8 years to a sold out audience in the Canadian province of Manitoba. For the balance of that summer they played to sold out shows right across Canada. The band was welcomed home again!\n\nThe demand south of the border was strong as well. The band was selling out shows across the States with 20,000 people coming out to see them in San Antonio, Texas. In fact St. Louis, Missouri ended up adding a second show and the scalpers in Las Vegas were getting a high dollar for the valued tickets.\n\nIn 1992 the band consisted of Myles Goodwyn, Brian Greenway, Jerry Mercer, Jim Clench and Steve Segal. The group’s thirteenth studio album, Attitude, was released in 1993. It was their first studio release in 10 years. Attitude went Gold in Canada, driven by the hit If You Believe In Me. Segal remained with the band for the 1994 release of studio album number fourteen; “Frigate”.\n\n1995 saw Steve Segal leave April Wine. April Wine returned to their roots as a 4 piece Rock band with 2 guitars, bass and drums as they were when they first started out in 1969.\n\nFrom 1995 to 2000 April Wine continued to tour Canada and the USA doing 80-100 shows a year playing to their ever growing legions of fans.\n\nThe studio album, “Back To The Mansion” released in 2001 was April Wine's 15th studio album and first new release since 1994, and featured original members Myles Goodwyn (vocals, guitars and keyboards), Brian Greenway (guitars, vocals), Jim Clench (bass, background vocals), Jerry Mercer (drums).\n\n“April Wine Live 2003” was released in spring of 2003 and featured the band’s live\nstage show. It was recorded in Kitchener Ontario. It also featured Carl Dixon on keyboard,vocals and guitar who had joined the band for 3 tours.\n\nJune of 2004 saw April Wine travel to Sweden to be part of “Sweden Rock 2004”\nThey shared the stage with HEART, FOGHAT, UFO and many others.\n\nIn 2006 April Wine celebrated their 37th anniversary together with the release of their 16th studio album, “Roughly Speaking”. (Released November 21st 2006)\n\nJim Clench left the band in January of 2007. He was replaced by Breen LeBoeuf, a talented Bassist and Singer, and a longtime friend of Jerry and Brian. Breen brings the experience of his many years as a member of the legendary Quebec rock band “Offenbach” with him to April Wine. The fans accepted Breen right from the first show\nat Higher Ground in Burlington Vermont in February of 2007.\n\nIn November 2008, April Wine signed with ARM Entertainment of St. Paul, MN. as the April Wine’s agency in the USA. Roger Anderson and his company have been booking many shows for the band in the USA to the delight of American fans. S.L. Feldman & Associates continues to represent April Wine in Canada.\n\nLate 2008 also saw the departure of Jerry Mercer from the band. About to turn 70 years of age in April of 2009, Jerry decided to retire. Jerry had been the driving drumming force of April Wine for 35 years!\n\nBlair Mackay joined April Wine as the new drummer in January 2009. Blair has a Master of Music degree in performance, and like Breen, was accepted by the fans right from the first show, coincidentally at Higher Ground in Vermont.\n\nIn March of 2009, April Wine was inducted into the Canadian Music Industry Hall of Fame during Canadian Music Week in Toronto. They also received The Lifetime Achievement Award for being part of Canadian Music History for 40 years.\n\nOn April 18th of 2010 at the Juno Awards, April Wine will be inducted in to the Canadian Music Hall of Fame.\n\n2010 sees the band continue their hectic pace touring both the United States and Canada to acclaimed reviews. They continue to satisfy fans with a live mix of straight ahead rock n' roll and power ballads, an April Wine mainstay.\n\nIn 2010, April Wine enters into their 40th year as a band ... quite an accomplishment for any rock n' roll band!\n\n\n <a href=\"https://www.last.fm/music/April+Wine\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
