{"artist":{"name":"Leigh Jones","mbid":"dc9fe516-b40e-4c39-84a8-584edc0b9742","url":"https://www.last.fm/music/Leigh+Jones","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/40213c7ce2ce4f33809f87e1820d8e76.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/40213c7ce2ce4f33809f87e1820d8e76.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/40213c7ce2ce4f33809f87e1820d8e76.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40213c7ce2ce4f33809f87e1820d8e76.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40213c7ce2ce4f33809f87e1820d8e76.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40213c7ce2ce4f33809f87e1820d8e76.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"3182","playcount":"35730"},"similar":{"artist":[{"name":"Trina Broussard","url":"https://www.last.fm/music/Trina+Broussard","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/188d6d1245e64b30ab44cf46c7521488.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/188d6d1245e64b30ab44cf46c7521488.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/188d6d1245e64b30ab44cf46c7521488.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/188d6d1245e64b30ab44cf46c7521488.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/188d6d1245e64b30ab44cf46c7521488.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/188d6d1245e64b30ab44cf46c7521488.png","size":""}]},{"name":"Conya Doss","url":"https://www.last.fm/music/Conya+Doss","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e487b8b95da34d4d8957572a015d9868.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e487b8b95da34d4d8957572a015d9868.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e487b8b95da34d4d8957572a015d9868.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e487b8b95da34d4d8957572a015d9868.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e487b8b95da34d4d8957572a015d9868.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e487b8b95da34d4d8957572a015d9868.png","size":""}]},{"name":"Angela Johnson","url":"https://www.last.fm/music/Angela+Johnson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b56ebc321a0b402eb3a4227cf18fa06f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b56ebc321a0b402eb3a4227cf18fa06f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b56ebc321a0b402eb3a4227cf18fa06f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b56ebc321a0b402eb3a4227cf18fa06f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b56ebc321a0b402eb3a4227cf18fa06f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b56ebc321a0b402eb3a4227cf18fa06f.png","size":""}]},{"name":"Carol Riddick","url":"https://www.last.fm/music/Carol+Riddick","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/151fdd2296ad452188440e83fc47cbd3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/151fdd2296ad452188440e83fc47cbd3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/151fdd2296ad452188440e83fc47cbd3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/151fdd2296ad452188440e83fc47cbd3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/151fdd2296ad452188440e83fc47cbd3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/151fdd2296ad452188440e83fc47cbd3.png","size":""}]},{"name":"Algebra","url":"https://www.last.fm/music/Algebra","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fc8ec3719f634644bee1a35034d524fc.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fc8ec3719f634644bee1a35034d524fc.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fc8ec3719f634644bee1a35034d524fc.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fc8ec3719f634644bee1a35034d524fc.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fc8ec3719f634644bee1a35034d524fc.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fc8ec3719f634644bee1a35034d524fc.png","size":""}]}]},"tags":{"tag":[{"name":"soul","url":"https://www.last.fm/tag/soul"},{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"vocalist","url":"https://www.last.fm/tag/vocalist"},{"name":"rnb","url":"https://www.last.fm/tag/rnb"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Leigh+Jones/+wiki"}},"published":"13 Oct 2008, 02:59","summary":"Rare is the artist with the gift to so naturally convey musical artistry direct from the soul and also be a striking eyeful of beauty that shines from the inside out. With her passion for authentic bedrock styles of R&B, Jazz, Blues and Pop, Los Angeles native Leigh Jones is just the artist to make you a believer. She's already done so with luminaries that stretch from Motown Records founder Berry Gordy to former Stax Records executive Al Bell - men who have seen <a href=\"https://www.last.fm/music/Leigh+Jones\">Read more on Last.fm</a>","content":"Rare is the artist with the gift to so naturally convey musical artistry direct from the soul and also be a striking eyeful of beauty that shines from the inside out. With her passion for authentic bedrock styles of R&B, Jazz, Blues and Pop, Los Angeles native Leigh Jones is just the artist to make you a believer. She's already done so with luminaries that stretch from Motown Records founder Berry Gordy to former Stax Records executive Al Bell - men who have seen, groomed and launched the very best and are rolling up their sleeves once again to support the blooming, once in a lifetime talent possessed by Leigh Jones. \n\nLeigh Jones is making her long overdue debut with her exquisite and perfectly titled album Music in My Soul on Peak Records. Working with seasoned and knowing veterans that include manager Kerry Gordy, songwriter Bruce Fisher, music consultant Billy Meshel, and a team of songwriter friends who know the lady oh so well, Leigh Jones has slow cooked a feast of eclectic and soulful songs that speak directly from her heart and soul to yours. \n\n\"These are my songs,\" shares Leigh who also co-wrote two of the twelve numbers and made the very unusual, artistically mature decision to have a couple of other songs she wrote removed because she felt they could be done better at a later time. \"You can't place these songs with anybody else. We made every effort for me to not come across as a cookie cutter singer trying to sound like whoever is all over the radio at the moment. I'm recording music that's very me and totally different. When we came to Andi Howard at Peak, without any solicitation from Kerry or I, she picked every song that we preferred. She truly understood the best part of my artistry that I've been shooting for - my jazzier R&B oriented stuff.\" \n\nWe're talking songs from a woman who can't stay away from a hot, on-and-poppin' late night jam session as depicted in the CD's opening title track, the sexy, finger-snappin' piano rave \"Cain't Get Enough of Your Love\" and the lowdown backbeat blues of \"I'm Leavin' You.\" Leigh also traveled to Oklahoma to hang with bassist/producer Wayman Tisdale for a delicious cover of DeBarge's `80s classic \"All This Love\" then got with pop guru Walter Afanasieff for the bittersweet funk of \"Freefall.\" Pure soul just oozes from every pore of this richly gifted artist.  \n\nLeigh Jones has always known that she wanted to be a singer. And the first music she gravitated to as a child was soul music, singing the Pointer Sisters' \"American Music\" in her first grade talent show. The daughter of Gary & Annie Jones - both singers and pianists in their own right - Leigh grew up surrounded by many of L.A.'s finest session musicians and attended many of her father's gigs as a studio singer. Around the house, there was plenty of classic vocal jazz by the likes of Ella Fitzgerald, Nat \"King\" Cole and his daughter Natalie Cole that Leigh soaked up like a sponge. The gritty blues of Etta James set her soul on fire, and on the more contemporary side, Leigh also had a major thing for Rufus featuring Chaka Khan, Whitney Houston and the dynamic vocal range of Mariah Carey. Leigh brought all of these influences to the Los Angeles County High School for the Arts, where her raw talent first began to be buffed to a finer polish. \n\nInterestingly, the way the music industry works, Leigh found herself initially battling producers for the right to do the music she felt most comfortable singing. \"My first producer had me cut three songs in more of an alternative rock vein,\" she says, \"but it just didn't feel right. When he shopped them but nothing happened, I was actually relieved. But this was also the time when Britney Spears and Christina Aguilera were just coming out, so every other producer I met wanted to turn me into one of them - showing my mid-drift and dancing! I knew I had to work on myself to show who I really am. That involved me doing more of my own writing, finding the strongest part of my vocal register, as well as figuring out what I was going to wear. It's hard for people to look beyond those kinds of things.\" \n\nThings brightened considerably when her friend Lorenzo Pryor introduced her to Kerry Gordy who was looking for a fresh and unique new soul singer to work with. \"When I met with Kerry, I had no idea I was going for some kind of 'audition.' He's kind of sneaky like that. That first day in his living room I sang \"Smile\" (the Charlie Chaplin standard) a cappella. Then, with Kerry at the piano, we did Billie Holiday's 'God Bless the Child' impromptu. We've bonded ever since.\" \n\nThat bond led to them meticulously crafting the wonderful selection of songs on Music in My Soul. Among the highlights are the clever Quiet Storm-ready \"Words You Never Say\" (produced by Carl McGregor who also contributed the tight bass line) and the cautionary fable \"Same Game.\" \"I actually thought that might be too jazzy for me when I first heard it,\" Leigh confesses. \"Kerry listened to my complaint...then told me to do it anyway! As I got into it, I found that the lyrics were so dead on. I don't think women say this as often as they should. 'Look, I'm not gonna sit here and cry. You can creep on me if you want to, but I'll be doing it, too. I'm not as meek as you think I am!' I thought it was refreshing to sing a song like this with that attitude.\" \n\nPerhaps most special of all is one of the CD's earliest recordings \"Cold in L.A.,\" a song about the phoniness naive newcomers find when they come to the big city. \"That song \n\nmeans a lot to me,\" Leigh says, \"having gone through so much here myself. I grew up in L.A., so I really understood it. I don't think there has been a song that's pinpointed and told that story so well.\" The other sweet thing about that particular song is that Berry Gordy himself came out of retirement to help her complete it to perfection. \"At first he \n\nwas directing Kerry from the outside but every time we thought we'd gotten it right, he kept saying, 'You've almost got it!' Finally Kerry just said, 'Please come to the studio for just a couple of hours' because something was being lost in the translation. It turns out there was this one note he needed me to nail. Kerry had asked me about it before and I told him I couldn't do it. But when Mr. Berry Gordy asked me to do it, I got in that vocal booth and he scared it out of me on the first take! Actually it was just his presence that scared me because for all the warnings I got from people, he really was the sweetest man I've ever met.\" \n\nReflecting on the magic of Leigh Jones, Berry Gordy says, \"Throughout my career I have been blessed to discover many great musical talents. I feel Leigh Jones is destined to be on of the next big stars. She's awesome!\" Seconding that emotion, his son Kerry Gordy adds, \"Leigh Jones has that 'It' factor. She's cool, she's gorgeous and she's real. Leigh is incredibly talented - a singer's singer, a good songwriter and a producer's dream. I am privileged and proud that we are partners.\" Taking in all the accolades, Leigh humbly states, \"It's so flattering to have all these people behind me but it's also a little embarrassing. These are men who have worked with the very best. Not to take anything away from me, but sometimes it surprises me. It makes me want to work even harder.\" \n\nIt's hard to imagine Leigh Jones working any harder, as driven as she is. It's taken her quite some time to arrive at this magical time when her debut album is about to be released. To keep her chops up, she sung on rap hooks for projects by the friends of her younger brothers. And to pay the bills, she sometimes fell back on her session experience to sing for movie trailers. \"Going through the hard times really kept me in check,\" she shares, \"made me hungry. Now all I want to do is gig every night for two shows a night. I'm willing to give this all I've got because it's all I've wanted to do.\" \n\nAl Bell, who consulted with Kerry Gordy every step of the way in developing Leigh Jones and approved every final master, sums her up best: \n\n\"The two most important things I look for in an artist is that they be unique and that they have genuine, God-given talent. Leigh can deal with R&B, Pop, Jazz and Blues - and quite frankly, you would not expect that from a white female artist. Very few have been able to pull that off except maybe Bonnie Raitt...and even she could take it just so far. I really feel Leigh Jones. She's got my undivided attention. And the best is yet to come.\" <a href=\"https://www.last.fm/music/Leigh+Jones\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
