{"artist":{"name":"Leo Ku","url":"https://www.last.fm/music/+noredirect/Leo+Ku","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c0a63f6b2ef94ea2a6f8acd8c9b108d3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c0a63f6b2ef94ea2a6f8acd8c9b108d3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c0a63f6b2ef94ea2a6f8acd8c9b108d3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c0a63f6b2ef94ea2a6f8acd8c9b108d3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c0a63f6b2ef94ea2a6f8acd8c9b108d3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c0a63f6b2ef94ea2a6f8acd8c9b108d3.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"0","playcount":"0"},"similar":{"artist":[]},"tags":{"tag":[{"name":"chinese","url":"https://www.last.fm/tag/chinese"},{"name":"Hong Kong","url":"https://www.last.fm/tag/Hong+Kong"},{"name":"C-pop","url":"https://www.last.fm/tag/C-pop"},{"name":"ISF2005","url":"https://www.last.fm/tag/ISF2005"},{"name":"pop","url":"https://www.last.fm/tag/pop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/Leo+Ku/+wiki"}},"published":"30 Oct 2006, 06:44","summary":"Leo Ku Kui-Kei (Chinese: 古巨基; pinyin: Gǔ Jùjī; born 18 August 1972) is a Hong Kong Cantopop singer and actor. He was an entertainment news programme (娛樂新聞眼) presenter at TVB as well as host of the music show \"Jade Solid Gold\" in 1992 before releasing his first album (愛的解釋) in 1994 to become a Cantopop singer. He is one of the few Cantopop artists who employ the use of falsetto (假音). Because of this, many people, including David Tao, have praised this unique talent. <a href=\"https://www.last.fm/music/+noredirect/Leo+Ku\">Read more on Last.fm</a>","content":"Leo Ku Kui-Kei (Chinese: 古巨基; pinyin: Gǔ Jùjī; born 18 August 1972) is a Hong Kong Cantopop singer and actor. He was an entertainment news programme (娛樂新聞眼) presenter at TVB as well as host of the music show \"Jade Solid Gold\" in 1992 before releasing his first album (愛的解釋) in 1994 to become a Cantopop singer. He is one of the few Cantopop artists who employ the use of falsetto (假音). Because of this, many people, including David Tao, have praised this unique talent.\n\nOne of his songs \"Enjoy Yourself Tonight\" (歡樂今宵) released on 1997 earned him various musical awards most notably the Silver Male pop singer by Commercial Radio. However, his singing career was stalled in the next few years but he regained popularity in 2003, because of efforts of his current manager Paco Wong, with the release of new albums \"Games\" (遊戲 - 基) and \"Nobita\" (大雄). He has been referred to as one of the 'New Four Big Heavenly Kings' by veteran singer Alan Tam along with Hacken Lee, Andy Hui and Edmond Leung.\n\nLeo Ku's recent albums have revolved around a specific theme. The album \"Games\" was based on video games, \"Nobita\" was based on the comic books, while \"Jade Solid Gold\" is named after a popular music show of the same name. \"Nobita\" is one of Leo Ku's most successful albums ever, with 64,152 copies sold in 2004. It was the eighth best selling Cantopop album of 2004 in Hong Kong.\n\nOn April 9, 2005, a party was held for Leo Ku to celebrate the completion of Part 2 of his concert (勁歌金曲演唱會) and also to celebrate his \"Jade Solid Gold\" album reaching double Platinum (100,000 copies). Further tours were held across Malaysia, Singapore, Australia, Canada and the People's Republic of China, following the success of the Hong Kong concerts, featuring guest performances by Kary Ng and Justin Lo. A total of seventeen concerts were held. Leo Ku's \"Jade Solid Gold\" (勁歌金曲) was one of Hong Kong's top ten albums sold from December 30, 2004 to December 21, 2005.\n\nOn December 23, 2005, Leo Ku, and his management company Gold Label announced that he has sold 300,000 copies (six times Platinum) of the four albums which came out this year, with eight hit songs, including \"The Genius and the Idiot\" (天才與白痴) which stayed in first place at the karaoke charts for a total of nine weeks in a row.\n\nLeo Ku's most well known songs include \"Belated Love\" (愛得太遲), \"The Genius and the Idiot\" (天才與白痴), \"Monica\", \"Love and Honesty\" (愛與誠), \"Nobita\" (大雄), \"Killing Move\" (必殺技), \"Enjoy Yourself Tonight\" (歡樂今宵), \"Friendship Plus\" (友共情), \"Second Best\" (第二最愛) and \"Blue Skies and White Clouds\" (藍天與白雲), and most notably, \"It Seems\" (好想好想). This is the song he sings the most often on CCTV music concerts.\n\nIn Leo's recent album \"Human I Born\" is a huge hit in Hong Kong music. Within 3 days of its initial release, over 25 000 copies of the album were already sold. The CD includes 11 different songs, each showcasing a different perspective of human life. The concept of the CD was praised by many people, as it is a much different style to many CDs today where the main idea is 'love'. Also included with the CD is a 60 minute music video directed by Leo himself. It is his first time directing a movie. Leo was also able to invite his good friend and fellow singer, Vivian Chow, to take part in his movie and the music video for \"Belated love\". Leo is currently working on directing a movie. He has already thought of the concept of the movie: 89 minutes of laughter and 1 minute of sadness. Working towards his dream again, like how he has waited 11 years to have his own concert. \"Just Believe Dreams Come True\" was a saying which he employed in his concert in 2005, after the wait of 11 years. <a href=\"https://www.last.fm/music/+noredirect/Leo+Ku\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
