{"artist":{"name":"Leon Russell","mbid":"d4cc0ed5-0f76-4188-9e14-2a23ca12188a","url":"https://www.last.fm/music/Leon+Russell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/70f4f3efa1f842c68584099762dbe1fd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/70f4f3efa1f842c68584099762dbe1fd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/70f4f3efa1f842c68584099762dbe1fd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/70f4f3efa1f842c68584099762dbe1fd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/70f4f3efa1f842c68584099762dbe1fd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/70f4f3efa1f842c68584099762dbe1fd.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"146271","playcount":"1100778"},"similar":{"artist":[{"name":"Little Feat","url":"https://www.last.fm/music/Little+Feat","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e7c2c7ca8a1643d7a3651550254d92e7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e7c2c7ca8a1643d7a3651550254d92e7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e7c2c7ca8a1643d7a3651550254d92e7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e7c2c7ca8a1643d7a3651550254d92e7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e7c2c7ca8a1643d7a3651550254d92e7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e7c2c7ca8a1643d7a3651550254d92e7.png","size":""}]},{"name":"Dave Mason","url":"https://www.last.fm/music/Dave+Mason","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d3bba91869d24d799694b00dad6fdecb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d3bba91869d24d799694b00dad6fdecb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d3bba91869d24d799694b00dad6fdecb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d3bba91869d24d799694b00dad6fdecb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d3bba91869d24d799694b00dad6fdecb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d3bba91869d24d799694b00dad6fdecb.png","size":""}]},{"name":"Stephen Stills","url":"https://www.last.fm/music/Stephen+Stills","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/85fe92583483437d92d1c9fb2e99b57e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/85fe92583483437d92d1c9fb2e99b57e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/85fe92583483437d92d1c9fb2e99b57e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85fe92583483437d92d1c9fb2e99b57e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85fe92583483437d92d1c9fb2e99b57e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85fe92583483437d92d1c9fb2e99b57e.png","size":""}]},{"name":"Gregg Allman","url":"https://www.last.fm/music/Gregg+Allman","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b60b7ab527b247ce800ae71aa5fbe3a5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b60b7ab527b247ce800ae71aa5fbe3a5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b60b7ab527b247ce800ae71aa5fbe3a5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b60b7ab527b247ce800ae71aa5fbe3a5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b60b7ab527b247ce800ae71aa5fbe3a5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b60b7ab527b247ce800ae71aa5fbe3a5.png","size":""}]},{"name":"Delaney & Bonnie","url":"https://www.last.fm/music/Delaney+&+Bonnie","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/25e5c15012ae413da10a98d268b093d4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/25e5c15012ae413da10a98d268b093d4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/25e5c15012ae413da10a98d268b093d4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/25e5c15012ae413da10a98d268b093d4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/25e5c15012ae413da10a98d268b093d4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/25e5c15012ae413da10a98d268b093d4.png","size":""}]}]},"tags":{"tag":[{"name":"classic rock","url":"https://www.last.fm/tag/classic+rock"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"70s","url":"https://www.last.fm/tag/70s"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Leon+Russell/+wiki"}},"published":"01 Nov 2006, 11:14","summary":"Leon Russell (Claude Russell Bridges, April 2, 1942 - November 13, 2016) was an American musician and songwriter, who has recorded as a session musician, sideman, and maintained a solo career in music.\n\nBorn in Lawton, Oklahoma, United States, Russell began playing piano at the age of four. He attended Will Rogers High School in Tulsa, Oklahoma. Also at Will Rogers High School were Anita Bryant, who was one year older, and in the same 1959 class, David Gates. <a href=\"https://www.last.fm/music/Leon+Russell\">Read more on Last.fm</a>","content":"Leon Russell (Claude Russell Bridges, April 2, 1942 - November 13, 2016) was an American musician and songwriter, who has recorded as a session musician, sideman, and maintained a solo career in music.\n\nBorn in Lawton, Oklahoma, United States, Russell began playing piano at the age of four. He attended Will Rogers High School in Tulsa, Oklahoma. Also at Will Rogers High School were Anita Bryant, who was one year older, and in the same 1959 class, David Gates. Russell and Gates played and recorded together as the Fencement. Another student at Will Rogers during this time was Elvin Bishop, although he was a few years younger than the previously mentioned. During this time Russell was already performing at Tulsa nightclubs. After moving to Los Angeles in the late 1950s, he became a session musician, working as a pianist on the recordings of many notable 1960s musical artists. By the late 1960s, Russell diversified, becoming successful as an arranger and songwriter. By 1970, he had graduated to solo recording artist, although he never ended his previous roles within the music industry. After performing country music under the name Hank Wilson in the 1970s and 1980s, Russell had largely faded into obscurity. He re-emerged in 2010 when Elton John called on him to record an album that became The Union. The album brought renewed popularity to Russell who has since released a solo album and toured around the world.\n\nRussell was inducted into the Rock & Roll Hall of Fame on March 14, 2011. In June, 2011, Leon Russell was inducted into the Songwriters Hall of Fame.\n\nKnown as a session musician and artist in his own right, Russell has played with artists as varied as Jerry Lee Lewis, Phil Spector and The Rolling Stones. With a solo career spanning the genres of rock, blues, and gospel, Russell began his musical career at 14, lying about his age to land a gig playing backup at a Tulsa nightclub to play with Ronnie Hawkins behind Jerry Lee Lewis. Two years later, after settling in Los Angeles, he studied guitar with James Burton, and worked sessions with Dorsey Burnette and Glen Campbell.\n\nAfter becoming a part of Phil Spector's studio group, Russell played backup on many of the most popular hits of the 1960s, including The Byrds, Gary Lewis and the Playboys, and Herb Alpert. He also served as Snuff Garrett's assistant on numerous productions. Russell built his own recording studio in 1967, and recorded his first LP, Look Inside the Asylum Choir, in a collaboration with Marc Benno.\n\nHis first songwriting hit was Joe Cocker's 1970 cover of \"Delta Lady\", and Russell went on to organise Cocker's Mad Dogs and Englishmen tour. Shortly thereafter, Russell released another solo album, Leon Russell, which included the original version of the popular \"A Song for You\". Also in 1970, Russell played piano on Dave Mason's album, Alone Together (notably, on the song \"Sad and Deep as You\").\n\nDuring the 60's and 70's, Russell had a large mansion home in Tulsa near Woodward Park and was much an attraction for teenagers growing up in Tulsa. He also owned the infamous Church Recording Studio on 3rd street there, a meeting place for Russell and many friends. The Church Studio is now owned by Glen Mitchell and one-time Russell studio engineer Steve Ripley of the country band The Tractors. Russell still records there frequently.\n\nRussell also owned a large home on Grand Lake, in northeast Oklahoma. It stills stands near Dripping Springs, remodeled now, but a fond reminder of the days gone by for the now-grown kids in Oklahoma. At one time, it stood to be one of the largest homes on the lake. The home is now owned by Tulsa chiropractor and Leon Russell enthusiast Dr. F.J. Huskey. The home still contains the famous dining room table and chairs made from church pews from his Church Studio. On the property stands a private recording studio that has seen many famous names, including members of The Beatles.\n\nIn 1971, Russell appeared at George Harrison's Concert for Bangladesh (performing a memorable medley of the songs \"Jumpin' Jack Flash\" and \"Young Blood\"), after recording sessions with B.B. King, Eric Clapton, and Bob Dylan, and went on to tour with the Rolling Stones. After focusing increasingly on his solo career, his album Carney reached #2 on the charts, although the two following albums were not received as well.\n\nDuring the 70's, Russell continued to pop in occasionally and perform in Tulsa at the Paradise Club and other noted music spots around town. He surprised his fans one night performing with Flash Eddy and the Eclectics at the Paradise.\nHis 1975 album Will O'the Wisp was fairly commercially successful, as was its single \"Lady Blue\". Gailard Sartain, fondly remembered by Tulsans as Mezeppa Pompazoidi (a Saturday night movie host, joined many times by Gary Busey), did the artwork for Russell's Will 'O the Wisp LP cover.\n\nLater that year, Russell married Mary McCreary, a former member of Sly & the Family Stone's background vocal group Little Sister. The two collaborated on The Wedding Album in 1976, and Russell penned \"This Masquerade\", which earned a Grammy Award for George Benson. In 1977, Russell and McCreary reunited for another album, and in 1979 Russell worked on a collaboration with Willie Nelson. He spent the next two years touring with the New Grass Revival, and released two more albums with Paradise before the label folded. For several years, he stayed largely out of the music spotlight, releasing Anything Can Happen in 1992, and then releasing two more albums in 1998 and 1999. Russell continues to tour at the age of 71. His bassist, Jack Wessel, has been with Russell close to 25 years. His son with McCreary, Teddy Jack (named after Gary Busey's character on Sartain's show), has also toured with his dad, as well as sisters, Tina Rose and Sugaree.\nPixies vocalist Black Francis credits Russell with influencing his vocal style: \"I realize there's a certain kind of vocalizing I do that takes its cue from Leon Russell. He sang in a southern accent but it was very blown-out and exaggerated, very free and loose.\"\nhttps://en.wikipedia.org/wiki/Leon_Russell <a href=\"https://www.last.fm/music/Leon+Russell\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
