{"artist":{"name":"Leonard Bernstein","mbid":"fa39bc82-9b27-4bbb-9425-d719a72e09ac","url":"https://www.last.fm/music/Leonard+Bernstein","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a493e7cce009436db9cd0a5a71025f9e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a493e7cce009436db9cd0a5a71025f9e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a493e7cce009436db9cd0a5a71025f9e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a493e7cce009436db9cd0a5a71025f9e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a493e7cce009436db9cd0a5a71025f9e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a493e7cce009436db9cd0a5a71025f9e.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"186652","playcount":"1517841"},"similar":{"artist":[{"name":"Berliner Philharmoniker","url":"https://www.last.fm/music/Berliner+Philharmoniker","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bd3f816d99644ae3ac546d59599c738c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bd3f816d99644ae3ac546d59599c738c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bd3f816d99644ae3ac546d59599c738c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bd3f816d99644ae3ac546d59599c738c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bd3f816d99644ae3ac546d59599c738c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bd3f816d99644ae3ac546d59599c738c.png","size":""}]},{"name":"The Cleveland Orchestra","url":"https://www.last.fm/music/The+Cleveland+Orchestra","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6a1d2bc0b79c4b5f98362789408299be.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6a1d2bc0b79c4b5f98362789408299be.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6a1d2bc0b79c4b5f98362789408299be.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6a1d2bc0b79c4b5f98362789408299be.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6a1d2bc0b79c4b5f98362789408299be.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6a1d2bc0b79c4b5f98362789408299be.png","size":""}]},{"name":"Chicago Symphony Orchestra","url":"https://www.last.fm/music/Chicago+Symphony+Orchestra","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/30bee24dd3654450ba1070bf471f93cc.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/30bee24dd3654450ba1070bf471f93cc.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/30bee24dd3654450ba1070bf471f93cc.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/30bee24dd3654450ba1070bf471f93cc.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/30bee24dd3654450ba1070bf471f93cc.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/30bee24dd3654450ba1070bf471f93cc.png","size":""}]},{"name":"Gewandhausorchester Leipzig","url":"https://www.last.fm/music/Gewandhausorchester+Leipzig","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d341a35ecf2e4c34aea7703e77127bb8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d341a35ecf2e4c34aea7703e77127bb8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d341a35ecf2e4c34aea7703e77127bb8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d341a35ecf2e4c34aea7703e77127bb8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d341a35ecf2e4c34aea7703e77127bb8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d341a35ecf2e4c34aea7703e77127bb8.png","size":""}]},{"name":"Claudio Abbado","url":"https://www.last.fm/music/Claudio+Abbado","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3a2e0203d8fb4090b3a5276ee5f89c3e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3a2e0203d8fb4090b3a5276ee5f89c3e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3a2e0203d8fb4090b3a5276ee5f89c3e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a2e0203d8fb4090b3a5276ee5f89c3e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a2e0203d8fb4090b3a5276ee5f89c3e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a2e0203d8fb4090b3a5276ee5f89c3e.png","size":""}]}]},"tags":{"tag":[{"name":"Classical","url":"https://www.last.fm/tag/Classical"},{"name":"contemporary classical","url":"https://www.last.fm/tag/contemporary+classical"},{"name":"Soundtrack","url":"https://www.last.fm/tag/Soundtrack"},{"name":"composer","url":"https://www.last.fm/tag/composer"},{"name":"musical","url":"https://www.last.fm/tag/musical"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Leonard+Bernstein/+wiki"}},"published":"25 Jul 2006, 20:38","summary":"Leonard Bernstein, a unique source of creative energy in America’s music throughout his entire adult lifetime, was born in Lawrence, Massachusetts, on August 25, 1918.\n\nHe was given piano lessons as a boy and had his pre-college education at the Garrison and Boston Latin schools. Going on to Harvard University, he worked with Walter Piston, Edward Burlingame Hill, and A. Tillman Merritt, among others. By the time of his graduation, in 1939, he had made an unofficial conducting debut (his own incidental music to The Birds) <a href=\"https://www.last.fm/music/Leonard+Bernstein\">Read more on Last.fm</a>","content":"Leonard Bernstein, a unique source of creative energy in America’s music throughout his entire adult lifetime, was born in Lawrence, Massachusetts, on August 25, 1918.\n\nHe was given piano lessons as a boy and had his pre-college education at the Garrison and Boston Latin schools. Going on to Harvard University, he worked with Walter Piston, Edward Burlingame Hill, and A. Tillman Merritt, among others. By the time of his graduation, in 1939, he had made an unofficial conducting debut (his own incidental music to The Birds), and directed and performed in Marc Blitzstein’s The Cradle Will Rock. Later, at the Curtis Institute of Music in Philadelphia, he studied piano with Isabella Vengerova, conducting with Fritz Reiner, and composition with Randall Thompson. \n\nIn 1949 he became a student of the Boston Symphony’s reigning conductor, Serge Koussevitzky, at Tanglewood, and he was subsequently named his conducting assistant. \n\nBernstein’s first permanent conducting post, however, was as Assistant Conductor of the New York Philharmonic Orchestra, to which he was named in 1943. That was an important year for him both as a composer and as a conductor. Not only did he win the New York Music Critic’ Award for his first symphony, Jeremiah, but he also made his sudden and now famous debut with the Philharmonic, substituting on just a few hours’ notice for the indisposed Bruno Walter at a concert at Carnegie Hall. He won extraordinary praise, and was soon being sought as guest conductor by leading orchestras all over the world. \n\nIn the years following he served as music director of the New York City Symphony Orchestra for three seasons, from 1945 to 1947, and was head of the conducting faculty at Brandeis University from 1951 to 1956. \n\nSerge Koussevitzky had died in 1951, and Bernstein took over the orchestral and conducting departments at Tanglewood, where he continued to teach in the summer from time to time. Of great personal importance this same year was his marriage to the Chilean actress and pianist, Felicia Montealegre. \n\nIn 1957 Bernstein was invited to become Music Director of the New York Philharmonic, and from 1958 until 1969 conducted more concerts with them than anyone had ever done. Relinquishing the post after his eleven-year tenure, he accepted the lifetime title of Laureate Conductor. Two years later he led his thousandth concert with the Philharmonic, and he continued to be a frequent guest. More than half of his 400-plus recordings were made with this orchestra. \n\nHe traveled the world with his baton. He conducted in London and at the International Music Festival in Prague in 1946, and in Tel Aviv in 1947; he shared a transcontinental tour of the United States and Israel with Koussevitzky in 1951, and in 1953 became the first American ever to be invited to conduct a production at the Teatro alla Scala in Milan (Cherubini’s Medea with Maria Callas). Meanwhile, he was making almost annual tours with the New York Philharmonic, both in his years as music director and afterwards as well, ultimately playing hundreds of concerts in 70 cities throughout 35 countries. For an international tour that commemorated the United States Bicentennial in 1976 he programmed only American music and played it to sold-out houses wherever he went. \n\nHis support and promulgation of American composers is a matter of record, particularly in the case of Aaron Copland, whose close friend he had been for decades...\"half of his life,\" Bernstein remarked in an affectionate tribute on the occasion of Copland’s birthday celebration in 1975. As a young pianist he played Copland so much that he called the Piano Variations his trademark. As conductor he programmed and recorded (several of them twice) nearly all the Copland orchestral works. He devoted several of his television Young People’s Concerts to Copland and commissioned an important work, Connotations, for the opening of Philharmonic Hall (now Avery Fisher Hall) at Lincoln Center in 1962. At another birthday party, this one in 1979, Bernstein’s greeting happily and publicly acknowledged Copland as \"my first friend in New York, my master, my idol, my sage, my shrink, my guide, my counselor, my elder brother, my beloved friend.\" \n\nBernstein composed his own first large-scale work, the Jeremiah Symphony, in 1944, inspired by his Jewish heritage. It was performed in Pittsburgh for the first time, the composer conducting. His second symphony, based on a poem by W. H. Auden and called The Age of Anxiety, was first performed by Koussevitzky, with Bernstein as piano soloist, in 1949. The Boston Symphony and the Koussevitzky Foundation together commissioned his Symphony No. 3, subtitled ‘Kaddish.’ It was composed in 1963 and dedicated to the memory of John F. Kennedy. \n\nOther major compositions by Bernstein include Serenade for violin, strings, and percussion (1954); Five Anniversaries for piano solo (1964); Mass: A Theater Piece for Singers, Players, and Dancers, commissioned for the opening of the John F. Kennedy Center for Performing Arts in Washington, DC, and first produced there in 1971; Chichester Psalms for chorus, boy sopranos, and orchestra (1974); a \"political overture,\" Slava!, written in 1977 to honor Mstislav Rostropovich; Songfest, a cycle of songs for singers and orchestra (1977); Divertimento for Orchestra (1980); Missa Brevis (1988) for singers and percussion; Arias and Barcarolles for piano duet (or alternatively, chamber orchestra or string orchestra) and two singers; and Concerto for Orchestra (subtitled Jubilee Games), both works completed and first performed in 1989. \n\nBernstein’s one-act opera, Trouble in Tahiti, from 1951, was followed in 1983 by A Quiet Place, a sequel meant to be performed with it. He collaborated with choreographer Jerome Robbins in three major ballets: Fancy Free (1944) and Facsimile (1946) for American Ballet Theater; and Dybbuk for New York City Ballet. He composed the film score for the Academy Award-winning On the Waterfront (1954) and the scores for two theater works on Broadway, Peter Pan (1950) and The Lark (1955). \n\nTrained in the classical tradition but always thoroughly attuned to and communicative of the popular idiom as well, Bernstein made substantial contributions to the Broadway musical stage, beginning with On the Town in 1944 and following with Wonderful Town in 1953, Candide in 1956 (also produced by numerous opera companies), and the immensely popular West Side Story (1957), later made into an Academy Award-winning film. His Bicentennial work, 1600 Pennsylvania Avenue, was produced in Washington and on Broadway in 1976. \n\nBernstein’s eminence as a writer is based on The Joy of Music (1959), The Infinite Variety of Music (1966), Findings (1982), and their translations into nearly a score of other languages. Six lectures given at Harvard University in 1972-73 when he was Charles Eliot Norton Professor of Poetry were later collected into a book entitled The Unanswered Question. \n\nBernstein was the recipient of scores of honors besides those mentioned. The National Fellowship Award in 1985 applauded his life-long support of humanitarian causes, and he received the Gold Medal from the American Academy of Arts and Letters, to which he was elected in 1981, the MacDowell Colony’s Gold Medal, medals from the Beethoven Society and the Mahler Gesellschaft, New York City’s highest honors in the field of the arts, the Handel Medallion, a Tony Award (1969) for Distinguished Achievement in the Theater, and literally dozens of honorary degrees and awards from colleges and universities including his alma mater, Harvard (Man of the Year in 1966). He was given ceremonial keys to the cities of Oslo, Vienna, Beersheva and Bernstein, Austria among others, and high honors from many nations: Italy, Israel, Austria, Mexico, Denmark, Germany (the Great Merit Cross), England, and France (where, successively, he was created Chevalier, Officer, and Commandeur of the Legion d’Honneur), as well as UNESCO’s Silver Wand. Far from being a prophet without honor in his own country, he received Kennedy Center honors in 1980. \n\nFestivals of Bernstein’s music have been produced throughout the world, most recently at the Beethoven/Bernstein Festival in Bonn, Germany; and in London, produced jointly by the Barbican Centre and the London Symphony (of which he was honorary President since 1987). Another was produced by the Israel Philharmonic in commemoration of his debut concerts with the orchestra 30 years before. (The Israel Philharmonic also tendered him the lifetime title of Laureate Conductor in 1988). \n\nIn June 1990, Bernstein was among the first recipients of the Praemium Imperiale, an international prize created in 1988 by the Japan Art Association and awarded for lifetime achievement in the arts. Bernstein used the $100,000 prize to found the Bernstein Education Through the Arts Fund, Inc. before his death on October 14, 1990.\n\nBernstein was the father of three children: Jamie, Alexander, and Nina, and the grandfather of two: Francesca and Evan. \n\nLeonard Bernstein is published by Boosey & Hawkes.\nLeonard Bernstein's offical website is: http://www.leonardbernstein.com\n\nThis biography appears on Last.fm by kind permission of Boosey & Hawkes, Inc. <a href=\"https://www.last.fm/music/Leonard+Bernstein\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
