{"artist":{"name":"Light of the World","mbid":"dcd7a1c6-96a2-4f0b-a3c8-c79433af2cea","url":"https://www.last.fm/music/Light+of+the+World","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5a35a16b02564466ba053706fa19c5e5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5a35a16b02564466ba053706fa19c5e5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5a35a16b02564466ba053706fa19c5e5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a35a16b02564466ba053706fa19c5e5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a35a16b02564466ba053706fa19c5e5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a35a16b02564466ba053706fa19c5e5.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"11666","playcount":"55696"},"similar":{"artist":[{"name":"Beggar & Co","url":"https://www.last.fm/music/Beggar+&+Co","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/89153d5605e64128b1ed5d49e2838038.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/89153d5605e64128b1ed5d49e2838038.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/89153d5605e64128b1ed5d49e2838038.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/89153d5605e64128b1ed5d49e2838038.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/89153d5605e64128b1ed5d49e2838038.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/89153d5605e64128b1ed5d49e2838038.png","size":""}]},{"name":"Rodney Franklin","url":"https://www.last.fm/music/Rodney+Franklin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/affe40b537a6440bacb4535a9250be1e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/affe40b537a6440bacb4535a9250be1e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/affe40b537a6440bacb4535a9250be1e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/affe40b537a6440bacb4535a9250be1e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/affe40b537a6440bacb4535a9250be1e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/affe40b537a6440bacb4535a9250be1e.png","size":""}]},{"name":"Linx","url":"https://www.last.fm/music/Linx","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b05de6c5d44746de827b870cda21d2d4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b05de6c5d44746de827b870cda21d2d4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b05de6c5d44746de827b870cda21d2d4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b05de6c5d44746de827b870cda21d2d4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b05de6c5d44746de827b870cda21d2d4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b05de6c5d44746de827b870cda21d2d4.png","size":""}]},{"name":"Beggar & Co.","url":"https://www.last.fm/music/Beggar+&+Co.","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/eb000b3ec3ff4bc98a21921743686261.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/eb000b3ec3ff4bc98a21921743686261.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/eb000b3ec3ff4bc98a21921743686261.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eb000b3ec3ff4bc98a21921743686261.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eb000b3ec3ff4bc98a21921743686261.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eb000b3ec3ff4bc98a21921743686261.png","size":""}]},{"name":"Mystic Merlin","url":"https://www.last.fm/music/Mystic+Merlin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a61bd8069c5340df9a031eb30068b4b1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a61bd8069c5340df9a031eb30068b4b1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a61bd8069c5340df9a031eb30068b4b1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a61bd8069c5340df9a031eb30068b4b1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a61bd8069c5340df9a031eb30068b4b1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a61bd8069c5340df9a031eb30068b4b1.png","size":""}]}]},"tags":{"tag":[{"name":"funk","url":"https://www.last.fm/tag/funk"},{"name":"jazz funk","url":"https://www.last.fm/tag/jazz+funk"},{"name":"soul","url":"https://www.last.fm/tag/soul"},{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"london","url":"https://www.last.fm/tag/london"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Light+of+the+World/+wiki"}},"published":"31 May 2007, 05:46","summary":"\n\nFairly large Jazz Funk band with brass section from North London (UK) who had a big live following and some moderate chart success in the late 70's and early 80's. Most well known for their hits \"London Town\" and the 10 minute plus track, \"Time\". Band members Kenny Wellington, David Baptiste and Neville McKrieth also recorded as Beggar & Co throwing their two Top Forty chart hits into the LOTW repertoire. Paul Williams and Jean Paul Maunick also formed the successful splinter group Incognito during their time with Light Of The World. <a href=\"https://www.last.fm/music/Light+of+the+World\">Read more on Last.fm</a>","content":"\n\nFairly large Jazz Funk band with brass section from North London (UK) who had a big live following and some moderate chart success in the late 70's and early 80's. Most well known for their hits \"London Town\" and the 10 minute plus track, \"Time\". Band members Kenny Wellington, David Baptiste and Neville McKrieth also recorded as Beggar & Co throwing their two Top Forty chart hits into the LOTW repertoire. Paul Williams and Jean Paul Maunick also formed the successful splinter group Incognito during their time with Light Of The World.\n\nLIGHT OF THE WORLD FOUNDER MEMBERS (THE ORIGINAL BAND) AND BEGGAR & CO BIOGRAPHY. The 1999 recording from Light Of The World, 'Inner Voices' proved the band were ready for the dawn of the 21st century. Founder members of LOTW McKrieth, Wellington and Baptiste returned to compose some material, add their arrangements and produce a real follow up many years later to the 'Round Trip' album of many years earlier, and signed a recording agreement with Sanctuary Music. This being the first time that so many key members turned up for the recording of the songs. Only one invited member failed to show due to prior commitments.The production of the album was by Richard Bull and Kenny Wellington. This contractual agreement and reunion on record was brought about by Kenny Wellington after being approached by music business impressario Junior Hart during a tour of Japan along with David Baptiste whilst working with M Beat who had had recent success working on record with these guys and the mighty Jamiroquai as well other chart singles. Light Of The World began in 1974 when Breeze McKrieth approached Kenny Wellington at the famous Crackers afternoon funk session in Wardour Street, London about joining him with some friends for a rehearsal with some other young musicians at Ickburgh Road, Clapton. Kenny agreed to come along and this band became Light Of The World, inspired by the classic Kool And The Gang album Light Of Worlds. At that time, a really great way to spend a Saturday afternoon was standing around in Contempo Record Shop in Hanway Street , West London where you could hear the guys in the shop spinning the latest imports from the USA, people like Geoff Brown who also wrote great articles for Blues & Soul magazine which was housed in the same block and was connected to the shop. Kool And The Gang and The Kay Gees were a big influence on the early sound and concept behind Light Of The World with recordings like 'Swingin' and 'Midnight Groovin' being written when the band were excited by the discovery of The Kay Gees and dreamed that Kool And The Gang might come to these shores and take LOTW under their tutelage in the same way. Light Of The World dreamed that their music would be played at Lacey Lady, Hunters, Crackers and Waterloo Birds Nest, the clubs many of them had frequented around these times. Often pretending they were eighteen years old to gain entry. Now they had a chance to record their own music.These songs were written by the core band members although Kenny Wellington does not appear on the credits on this album as a writer because of a previous contract with music publisher Carlin which had to be sorted out. Light Of The World original line up were: Breeze McKrieth Guitar, Kenny Wellington Trumpet, David Baptiste Saxophone, Paul Williams Bass, Norman Walker Percussion, Roger Thomas Saxophone, Junior King Drums, Earl Appleton Keyboards, Jean Paul Maunick Guitar Everton McCalla Drums, After playing many shows in London and the home counties, arranged by then manager Brent Clarke who had spotted some potential in the band , some of the guys became dissillusioned and quit the band, with Earl Appleton leaving the UK to head for New York. Norman Walker concentrated on using his brilliant choreographic skills and went on to tour with many major artists. Junior King decided to concentrate on his martial arts, and Roger Thomas a very advanced saxophonist even at that early stage of raw development left for the world of computer technology where he has done very well. However, fortune was around the corner when Kenny Wellington was asked to attend a rehearsal in North West London by saxophonist Earl Okai and a band he was working with. Impressed by the keyboard player Peter Hinds and percussionist Chris Etienne, Kenny asked them to join Light Of The World. With this line up in place the band were offered management by record shop owner and entrepreneur Joe Williams. This was accepted and the band began rehearsing in North London on top of Joe's record shop. A regular customer at the shop and also a friend of Joe was guitarist Jean Paul Maunick aka Bluey who was also invited to join the band. By this time Everton McCalla had also become the drummer for the band. The band decided it was time to record some music. Ensign records heard this music being played in clubs by DJs like Tom Holland at Lacy Lady and offered the band a deal with the company which was run by Nigel Grainge and reknown DJ Chris Hill. The first album did reasonably well yielding some dance floor hits like 'Swingin', 'Midnight Groovin' and 'Who Are You'. Although still quite raw these tracks began to get the band noticed. However, the band were then involved in a tragic accident returning from some shows in Scotland at the end of their first national tour. The vehicle some of the band members were travelling in was struck by an articulated lorry.The band resident comedian and percussionist Chris Etienne died as a result of this tragic accident. Other members suffered differing scales of injury and were pulled from the wreckage by McKrieth and Baptiste who miraculously had escaped injury. After mourning the loss of their dear friend and brother, the much loved Chris Etienne, the band decided to carry on. A new percussionist from Manchester, Ganiyu Bello joined the band along with Nat Augustin a local trombone player which really excited Wellington and Baptiste who had been looking for such an addition for a while. The first album was also dedicated to their friend and brother Chris Etienne. The new members joined the band with recording contracts already in place after the previous hard work of the founder members. Some who had already departed the band unable to cope with long drives through the night when the band couldn't afford the luxury of a hotel room between shows. For the second album Augie Johnson of Side Effect was brought in as producer with Breeze, the original founding member of LOTW, credited as executive producer for his great contribution in the studio. The band also now had the opportunity to augment their music with some of the finest musicians in the world. People like Wayne Henderson, the great vibraphonist Victor Feldman and Bobby Lyle guested on the album with the fine vocals also of Micki Howard. Jorge Dalto also provided some brilliant string arrangements on the McKrieth penned 'I'm So Happy' a tribute song to the wisdom and words of Martin Luther King, I'ts melancholy melody creating an enchanting contrast with the positive lyrics. The arrangements of Wellington and Baptiste were now greatly enhanced by the addition of some of the finest players in the business. This in itself was to be a great learning curve for the band and resulted in the LOTW/Beggar & Co horn section being asked to play on a number of recording sessions themselves, having taken a lot of this musical education on board. The band had been busy writing with McKrieth credited on most tracks followed by considerable writing contributions from Wellington, Baptiste, Williams and Hinds. Hinds making a major contribution with the excellent Petes Crusade. Peter Hinds also produced hit records for The Chimes as well as having success as a key member of Atmosphere and the classic 'Dancing In Outer Space' and co-writing the the Incognito national hit 'Everyday' with Bluey. The album was the seminal 'Round Trip' which sold steadily for the next year and yielded the now classic recordings 'London Town' the homage to the city with Kenny Wellington and David Baptiste writing the lyrics in a small room at the back of Utopia Studios in Chalk Farm, London within an hour of being presented with the music. The album also yielded the still popular 'Time' 'I'm So Happy' and 'Pete's Crusade'. Some of thes tracks appeared also on a number of compilation albums, each of which sold over 100,000 copies. This meant the band members received a number of gold records for their contribution but more importantly placed them on record alongside bands like Kool And The Gang and Earth Wind & Fire which was great in terms of the band reaching this audience. Feeling really confident as well as creative, the band members began working on other projects in small collectives. This being inspired at the time by US bands having various alter egos like Parliament, Funkadelic and Bootsys Rubber Band. That was the original idea behind this thinking. Wellington, Baptiste and McKrieth immediately had two Top Forty national chart recordings, 'Somebody Help Me Out' and 'Mule (Chant No 2) under the name Beggar & Co which was great for everybody initially, because the Beggar & Co team simply added their name on the billing posters and the band could at last play shows in the major UK venues like Hammersmith Odeon having played there previously as support to The Players Association .\nThis incidentally and with the greatest of respect had proved to be a bit of a surprise to The Players Association as LOTW had brought the house down. Beggar & Co were also heavily featured on the Spandau Ballet album Diamonds particularly on the track Chant No 1 which reached No 2 in the national charts and again brought a lot of public acclaim and publicity. Bluey, Paul Williams and Peter Hinds recorded the classic Jazz Funk album under the name of Incognito which Bluey would take around the world and record many classic recordings to this present date. After a much acclaimed concert LOTW decided that it was financially very difficult to continue as an eight piece band with the contract that they had earlier signed and split into the three units. McKrieth Wellington and Baptiste agreed that the newer members could continue to use the LOTW name to ensure that they could secure a recording deal as a duo. Beggar & Co had to secure their release from the original contract and initially embarked on this through the courts. The success of Beggar & Co was also quite ironic, since it kind of heralded the band stripping back down to the original roots without the augmentation of Augie Johnson's brilliant all star cast and scoring their biggest selling records to date. The commercial success of Beggar & Co and the massive Incognito had somehow always eluded Light Of The World, but the timeless value of the Round Trip album would sustain the band for years to come.The dispute with the record company was eventually settled amicably and allowed the band the band to maintain their previous good relationship and goodwill with Ensign Records. LOTW released 'Check Us Out' on EMI before the remaining duo decided to make some solo recordings,with Ganiyu Bello recording a solo album produced by Lonnie Simmons. Nat Augustin signed a deal with A & M and did some work in the States with Dexter Wansell before eventually releasing a cover version of 'Too Busy Thinkin' Bout My Baby'. Wellington, Baptiste and McKrieth had released a Beggar & Co album which contained a variety of different ideas, some of which worked well. The album contained two hit singles and some jazzier tunes like 'Bahia De Palma'. In 1985 Ensign asked Wellington and McKrieth to work on remixes of 'Time' and 'London Town'. This they did adding the vocals of Phil Fearon and Galaxy to a revised version of London Town. Once again Light Of The World got back together for some promotional work and tv shows like &..39;Soul Train'. Ganiyu Ademola Bello then formed a new group known as The Team which recorded a cover of 'Wicky Wacky' and a version of 'Rock Creek Park&..39;. Following this, Nat Augustin was invited to join Kenny Wellington and Breeze McKrieth in the studio where they were working with Soul II Soul keyboard player/producer Simon Law. This resulted in the recording and release on Chrysalis of 'Keep The Dream Alive'. Kenny Wellington had met Simon Law earlier when doing some work as a session musician. The next Light Of The World collaboration was a song called'One Destination' for Cooltempo Records. This was a really small configuration of LOTW with the deal being signed by Kenny Wellington and Ganiyu Ademola Bello with Jean Paul Maunick as producer. This was short lived however as Incognito signed with Talking Loud and Gilles Peterson scoring a massive hit with 'Always There' meaning Bluey obviously had to focus his energy there. The band then followed this with various configurations releasing covers of classics like 'Got To Get Your Own' by Reuben Wilson and a cover of 'Expansions' which featured many of the original band plus Ganiyu Bello and Nat Augustin, with Stevie V and Billy Osborne involved as producers after an introduction from Kenny Wellington. After some intermittent appearances at clubs around the southern counties things had ground to a halt until Kenny Wellington was approached about recording an album with the band by record label owner Junior Hart after Kenny and David Baptiste had toured Japan with some of his artists. This resulted in what is presently the last album of new material by the band.to date 'Inner Voices' probably represents the closest thing to the natural development of the founder members of the band McKrieth, Wellington and Baptiste and the original ideals that they first had way back in Ickburgh Road, Clapton. Songs like 'City Life' and 'I Like' being the updated versions of classics like 'London Town' and 'Pete's Crusade' and the excellent 'Bahia' and 'Back 2 Back' highlighting the influence of bands like Spyro Gyra and early Kool And The Gang. Bass player Frank Felix who had been playing live with the band was also invited to join the band for this project and finally appear on record with the band after his fine contribution in place of the outstanding bassist Paul Williams. Nat Augustin who had joined the group Imagination was also invited to contribute to this album. This album kickstarted the band in terms of resuming live appearances. However gradually with old differences still to be resolved, Wellington, McKrieth, Hinds and Baptiste the only original members of the band ceased to be involved in these appearances. Since then Light Of The World and Beggar & Co have appeared with various line ups in the studio to this present day. The last studio album featuring original members McKrieth, Wellington and Baptiste was the excellent 'Inner Voices' released in 1999 with 12 new and original compostions including the popular 'Bahia' and 'I Like'. EMI have also released 'Addicted To Funk' an anthology album which charts the band ( no tracks unfortunately from the 'Inner Voices album' as EMI do not own this part of the catalogue). There are of course the major commercial contributions of Beggar & Co and Incognito as well as some work by The Team and some other more rare and by definition scarce material. The most successful of the LOTW splinter groups is undoubtably Bluey's band Incognito, having continued to make great albums consistantly for many years and highlighting some major musicians and vocalists from many different parts of the world. Currently Beggar & Co are preparing a new album and getting ready for their shows later in the year when they will appear as a ten piece unit. The current line up for these shows includes 5 members of the original Light Of The World band: Breeze McKreith, David Baptiste, Peter Hinds, Jean Paul 'Bluey' Maunick and Kenny Wellington. Everton McCalla has rejoined the band, Paul Williams currently resides in Holland and has started The Liquid Spillers recording studio which the band look forward to working in. These shows will be billed as Beggar & Co and Special Guests.Fayyaz Virji on trombone and trumpeter Kevin Robinson have also added their not inconsiderable musical abilities to the band taking the band to another level. As if this wasn't enough Orphy Robinson the vibes player and Toby Baker the keyboard wizard are also on board so these days expect to see at least a dozen musicians onstage. These days the band are fully commited to the more jazzfunk style music of their repertoire and plnning more appearances on the festival circuit.\n\n\n\nhttp://www.myspace.com/lightoftheworldmusic <a href=\"https://www.last.fm/music/Light+of+the+World\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
