{"artist":{"name":"Little Eva","mbid":"531643e6-b3ba-4c7f-9d0d-f2831dc42317","url":"https://www.last.fm/music/Little+Eva","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0362a7230f2743d6b446da109e6efd5f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0362a7230f2743d6b446da109e6efd5f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0362a7230f2743d6b446da109e6efd5f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0362a7230f2743d6b446da109e6efd5f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0362a7230f2743d6b446da109e6efd5f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0362a7230f2743d6b446da109e6efd5f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"165892","playcount":"651199"},"similar":{"artist":[{"name":"The Chiffons","url":"https://www.last.fm/music/The+Chiffons","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e5b48dd5f6444cf69da0ccf9b075bf5c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e5b48dd5f6444cf69da0ccf9b075bf5c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e5b48dd5f6444cf69da0ccf9b075bf5c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5b48dd5f6444cf69da0ccf9b075bf5c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5b48dd5f6444cf69da0ccf9b075bf5c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5b48dd5f6444cf69da0ccf9b075bf5c.png","size":""}]},{"name":"The Cookies","url":"https://www.last.fm/music/The+Cookies","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/512e93ea90b34f4bb695ac10e8fde3eb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/512e93ea90b34f4bb695ac10e8fde3eb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/512e93ea90b34f4bb695ac10e8fde3eb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/512e93ea90b34f4bb695ac10e8fde3eb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/512e93ea90b34f4bb695ac10e8fde3eb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/512e93ea90b34f4bb695ac10e8fde3eb.png","size":""}]},{"name":"The Shirelles","url":"https://www.last.fm/music/The+Shirelles","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3f6587a05ef24d42893c4ca76c8c046f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3f6587a05ef24d42893c4ca76c8c046f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3f6587a05ef24d42893c4ca76c8c046f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f6587a05ef24d42893c4ca76c8c046f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f6587a05ef24d42893c4ca76c8c046f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f6587a05ef24d42893c4ca76c8c046f.png","size":""}]},{"name":"Bobby Vee","url":"https://www.last.fm/music/Bobby+Vee","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3325df228bfc47339c983b41ea172d36.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3325df228bfc47339c983b41ea172d36.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3325df228bfc47339c983b41ea172d36.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3325df228bfc47339c983b41ea172d36.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3325df228bfc47339c983b41ea172d36.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3325df228bfc47339c983b41ea172d36.png","size":""}]},{"name":"The Crystals","url":"https://www.last.fm/music/The+Crystals","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a3abaaaeeaa84f83a8d96b40ce91338e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a3abaaaeeaa84f83a8d96b40ce91338e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a3abaaaeeaa84f83a8d96b40ce91338e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a3abaaaeeaa84f83a8d96b40ce91338e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a3abaaaeeaa84f83a8d96b40ce91338e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a3abaaaeeaa84f83a8d96b40ce91338e.png","size":""}]}]},"tags":{"tag":[{"name":"60s","url":"https://www.last.fm/tag/60s"},{"name":"oldies","url":"https://www.last.fm/tag/oldies"},{"name":"soul","url":"https://www.last.fm/tag/soul"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Little+Eva/+wiki"}},"published":"26 Nov 2006, 23:00","summary":"Eva Narcissus Boyd (June 29, 1943 – April 10, 2003), known by the stage name of Little Eva, was an American pop singer.\n\nBorn in Belhaven, North Carolina, she moved to the Brighton Beach section of Brooklyn, New York, at a young age.  Although some sources claim that her stage name was inspired by a character from the novel Uncle Tom's Cabin, she stated in an interview that she was named after her aunt, which prompted her family to call her \"Little Eva. <a href=\"https://www.last.fm/music/Little+Eva\">Read more on Last.fm</a>","content":"Eva Narcissus Boyd (June 29, 1943 – April 10, 2003), known by the stage name of Little Eva, was an American pop singer.\n\nBorn in Belhaven, North Carolina, she moved to the Brighton Beach section of Brooklyn, New York, at a young age.  Although some sources claim that her stage name was inspired by a character from the novel Uncle Tom's Cabin, she stated in an interview that she was named after her aunt, which prompted her family to call her \"Little Eva.\" As a teenager, she worked as a maid and earned extra money as a babysitter for songwriters Carole King and Gerry Goffin. It is often claimed that Goffin and King were amused by Boyd's particular dancing style, so they wrote \"The Loco-Motion\" for her and had her record it as a demo (the record was intended for Dee Dee Sharp).\n\nHowever, as King said in an interview with NPR and in her \"One to One\" concert video, they knew she could sing when they met her, and it would be just a matter of time before they would have her record songs they wrote, the most successful being \"The Loco-Motion.\"\n\nMusic producer Don Kirshner of Dimension Records was impressed by the song and Boyd's voice and had it released. The song reached #1 in the United States in 1962. It sold over one million copies, and was awarded a gold disc. After the success of \"The Loco-Motion,\" Boyd was stereotyped as a dance-craze singer and was given limited material.\n\nThe same year, Goffin and King wrote \"He Hit Me (And It Felt Like A Kiss)\" (performed by the Crystals) after discovering that Boyd was being regularly beaten by her boyfriend. When they inquired why she tolerated such treatment, Eva replied without batting an eyelid that her boyfriend's actions were motivated by his love for her.\n\nPhil Spector's arrangement of the song was ominous and ambiguous.\n\nIt was a brutal song, as any attempt to justify such violence must be, and Spector's arrangement only amplified its savagery, framing Barbara Alston's lone vocal amid a sea of caustic strings and funereal drums, while the backing vocals almost trilled their own belief that the boy had done nothing wrong. In more ironic hands (and a more understanding age), 'He Hit Me' might have passed at least as satire. But Spector showed no sign of appreciating that, nor did he feel any need to. No less than the song's writers, he was not preaching, he was merely documenting.\n\nBoyd's other single recordings were \"Keep Your Hands Off My Baby,\" \"Let's Turkey Trot,\" and a remake of the Bing Crosby standard \"Swinging on a Star,\" recorded with Big Dee Irwin (though Boyd was not credited on the label). Boyd also recorded the song \"Makin' With the Magilla\" for an episode of the 1964 Hanna-Barbera cartoon series The Magilla Gorilla Show.\n\nShe continued to tour and record throughout the sixties, but her commercial potential plummeted after 1964. She retired from the music industry in 1971. She never owned the rights to her recordings. Although the prevailing rumor in the 1970s was that she had received only $50 for \"The Loco-Motion,\" it seems $50 was actually her weekly salary at the time she made her records (an increase of $15 from what Goffin and King had been paying her as nanny). Penniless, she returned with her three young children to North Carolina, where they lived in obscurity.\n\nInterviewed in 1988 after the success of the Kylie Minogue cover version of \"The Loco-Motion\", Boyd stated that she did not like the new version; however its then-current popularity allowed her to make a comeback in show business.\n\nShe returned to live performing with other artists of her era on the cabaret and oldies circuits. She also occasionally recorded new songs.\n\nThe only existing footage of Little Eva performing \"Loco-Motion\" is a small clip from the ABC sixties live show Shindig! where she sang a short version of the clip along with the famous dance steps. She also sang \"Let's Turkey Trot\" and the Exciters' song \"I Want You to Be My Boy\" in the same episode. This TV show was one of her final performances until 1988, when she began performing in concerts with Bobby Vee and other singers. In a 1991 Richard Nader concert, she performed \"Loco-Motion\" and \"Keep Your Hands Off My Baby\". The concert was partially documented on videotape, albeit of marginal quality.\n\nShe continued performing until she was diagnosed with cervical cancer in October 2001. She died on April 10, 2003 in Kinston, North Carolina, at the age of 59, and is buried in a small cemetery in Belhaven, North Carolina. Her gravesite was sparsely marked until July 2008, when a report by WRAL-TV of Raleigh, North Carolina highlighted deteriorating conditions at the cemetery and efforts by the city of Belhaven to have it restored. A simple white cross had marked the site until a new gravestone was unveiled in November of that year. Her new grey gravestone has the image of a steam locomotive prominently engraved on the front and the epitaph reads: \"Singing with the Angels\".\n\nEva's eldest daughter, Dorothea, died April 6, 2013, from heart failure.\n\n\"The Loco-Motion\" is a 1962 pop song written by American songwriters Gerry Goffin and Carole King. \"The Loco-Motion\" was originally written for Dee Dee Sharp, but Sharp turned the song down. The song is notable for appearing in the American Top 5 three times, each time in a different decade: in 1962 by the American pop singer Little Eva,(U.S. No. 1); in 1974 by the American band Grand Funk Railroad (U.S. No. 1); and finally in 1988 by the Australian singer Kylie Minogue (U.S. No. 3).\n\nThe song is a popular and enduring example of the dance-song genre: much of the lyrics are devoted to a description of the dance itself, usually performed as a type of line dance. However, the song came before the dance.\n\n\"The Loco-Motion\" was also the second song to reach No. 1 by two different musical acts. The earlier song to do this was \"Go Away Little Girl\", also written by Goffin and King. It is one of only nine songs to achieve this feat.[5]\n\nKing and Goffin wrote \"The Loco-Motion\" in hopes to have it recorded by Dee Dee Sharp, who had a smash hit with \"Mashed Potato Time\". Sharp passed on the song leaving the opportunity open for Eva Boyd, who had recorded the demo.\n\nBoyd's version was released, and her name was changed to Little Eva. Boyd was actually Carole King's babysitter, having been introduced to King and King's husband Gerry Goffin by The Cookies, a local girl group who would also record for the songwriters.\n\n\"The Loco-Motion\" was the first release by the new Dimension Records company, whose releases were mostly penned and produced by Goffin and King. There are two common versions of the song in circulation; one includes handclaps during the verses; the other has no handclaps. King performed the backup vocals in the recording.\n\n\nIn the United States, \"The Loco-Motion\" was the sixth most successful single of 1962, according to Billboard. It was also the third most successful single of 1962 in South Africa.\n\nIn March 1965, Little Eva sang the song on the ABC-TV series Shindig!, and this is the only known video of her singing this song. A cover version of the song was recorded quickly by British girl group The Vernons Girls and scored the chart the same week as the Little Eva version. The Vernons Girls' version stalled at No. 47 in the UK, while the Little Eva version reached No. 2 on the UK charts. It re-entered the chart some 10 years later and almost became a top 10 again, peaking at No. 11. The Little Eva version of the song was later featured in the David Lynch film Inland Empire (2006). \"The Loco-Motion\" is ranked No. 359 on Rolling Stone magazine's list of \"The 500 Greatest Songs of All Time\".\n\nThe widely believed story of how the song \"The Loco-Motion\" came to be is that Carole King was playing music at home and Eva Boyd was doing some chores and started dancing to it; the dance The Loco-Motion was born. However, this is not true. Eva Boyd was introduced to Goffin and King and they realized she had a good singing voice, so they had her record \"The Loco-Motion\". Carole King stated this during an interview on National Public Radio (NPR) shortly after Little Eva died.\n\nAs the song came before the dance, there was no dance when the song was originally written. When the song became a smash hit, Eva Boyd ended up having to create a dance to go along with the song. Carole King stated this in her \"One to One\" concert video. In live performances of the song, Little Eva can be seen doing her version of the dance.\n\nAnother bit of the conventional lore is that she had received only $50 for \"The Loco-Motion\". However, although she never owned the rights to her recordings, it seems $50 was actually her weekly salary during the years she was making records (an increase of $15 from what Goffin and King had been paying her as nanny). In 1971, she moved to South Carolina and lived in obscurity on menial jobs and welfare, until being rediscovered in 1987. She died of cervical cancer in 2003.\n\n <a href=\"https://www.last.fm/music/Little+Eva\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
