{"artist":{"name":"Little Junior Parker","mbid":"79bd0f86-95f0-4e2b-806f-7d78640cf683","url":"https://www.last.fm/music/+noredirect/Little+Junior+Parker","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5e70062d37e444298e707cb04a6457ff.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5e70062d37e444298e707cb04a6457ff.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5e70062d37e444298e707cb04a6457ff.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5e70062d37e444298e707cb04a6457ff.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5e70062d37e444298e707cb04a6457ff.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5e70062d37e444298e707cb04a6457ff.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"0","playcount":"0"},"similar":{"artist":[]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"rhythm and blues","url":"https://www.last.fm/tag/rhythm+and+blues"},{"name":"GT FASTBACK","url":"https://www.last.fm/tag/GT+FASTBACK"},{"name":"good ole homely country folk playing banjo yodeling","url":"https://www.last.fm/tag/good+ole+homely+country+folk+playing+banjo+yodeling"},{"name":"country","url":"https://www.last.fm/tag/country"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/Little+Junior+Parker/+wiki"}},"published":"05 Mar 2009, 14:26","summary":"Junior Parker, also known as Little Junior Parker or \"Mr Blues\" (May 27, 1932[2]–November 18, 1971) was a successful and influential Memphis blues singer and musician. He is best remembered for his unique voice which has been described as \"honeyed,\" and \"velvet-smooth\". He was posthumously inducted into the Blues Hall of Fame in 2001.\n\n\nJunior Parker was born in either Clarksdale, Mississippi or West Memphis, Arkansas as Herman Parker, Jr. He sang in gospel groups as a child <a href=\"https://www.last.fm/music/+noredirect/Little+Junior+Parker\">Read more on Last.fm</a>","content":"Junior Parker, also known as Little Junior Parker or \"Mr Blues\" (May 27, 1932[2]–November 18, 1971) was a successful and influential Memphis blues singer and musician. He is best remembered for his unique voice which has been described as \"honeyed,\" and \"velvet-smooth\". He was posthumously inducted into the Blues Hall of Fame in 2001.\n\n\nJunior Parker was born in either Clarksdale, Mississippi or West Memphis, Arkansas as Herman Parker, Jr. He sang in gospel groups as a child, and played on the various blues circuits beginning in his teenage years. His biggest influence as a harmonica player was Sonny Boy Williamson, with whom he worked before moving on to work for Howlin' Wolf in 1949. Around 1950 he was a member of Memphis's ad hoc group, the Beale Streeters, with Bobby 'Blue' Bland and B.B. King.\n\nIn 1951 he formed his own band, the Blue Flames, with guitarist Auburn 'Pat' Hare. Parker was discovered in 1952 by Ike Turner, who signed him to Modern Records. He put out one single on this record label, \"You're My Angel.\" This brought him to the attention of Sam Phillips, and he and his band signed onto Sun Records in 1953. There they produced three successful songs: \"Feelin' Good\" (which reached # 5 on the Billboard R&B charts), \"Love My Baby,\" and \"Mystery Train\" ,with Floyd Murphy (Matt \"Guitar\" Murphy's brother) on guitar, later covered by Elvis Presley. For Presley's version of \"Mystery Train\", Scotty Moore borrowed the guitar riff from Parker's \"Love My Baby\".\n\nLater in 1953, Parker toured with Bobby Bland and Johnny Ace, and also joined Duke Records. Parker and Bland headed the highly successful Blues Consolidated Revue, which became a staple part of the southern blues circuit. He continued to have a string of hits on the R&B chart, including the smooth \"Next Time You See Me\" (1957); re-makes of Roosevelt Sykes' songs, \"Sweet Home Chicago\" (1958) and \"Driving Wheel\" (1961); Guitar Slim's \"The Things That I Used to Do\" (1963); Don Robey's \"Mother-in-Law Blues\" (1956); and his own \"Stand by Me.\" (1961)\n\nHis success was limited after he left the Duke label in 1966. He recorded for various labels, including Mercury, Blue Rock, Minit, and Capitol.\n\nParker died on November 18, 1971, aged 39, in Blue Island, IL  during surgery for a brain tumor.\n\nTributes\nOn his 1974 album ...Explores Your Mind, Al Green dedicated his original version of the song \"Take Me To The River\" to Parker, who he describes as \"a cousin of mine who's gone on, and we'd kinda like to carry on in his name.\"\n\n <a href=\"https://www.last.fm/music/+noredirect/Little+Junior+Parker\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
