{"artist":{"name":"Livio Minafra","url":"https://www.last.fm/music/Livio+Minafra","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/95317d74fa664b4ea19edf3e5e47bad7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/95317d74fa664b4ea19edf3e5e47bad7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/95317d74fa664b4ea19edf3e5e47bad7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95317d74fa664b4ea19edf3e5e47bad7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95317d74fa664b4ea19edf3e5e47bad7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95317d74fa664b4ea19edf3e5e47bad7.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"168","playcount":"1576"},"similar":{"artist":[{"name":"Pino Minafra","url":"https://www.last.fm/music/Pino+Minafra","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d9e5461b82f449fc8c7c51f08a7917ca.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d9e5461b82f449fc8c7c51f08a7917ca.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d9e5461b82f449fc8c7c51f08a7917ca.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d9e5461b82f449fc8c7c51f08a7917ca.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d9e5461b82f449fc8c7c51f08a7917ca.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d9e5461b82f449fc8c7c51f08a7917ca.png","size":""}]},{"name":"salis and baron","url":"https://www.last.fm/music/salis+and+baron","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Gabriele Mirabassi","url":"https://www.last.fm/music/Gabriele+Mirabassi","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6dbfe25090ed42a78528511d7cff29c2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6dbfe25090ed42a78528511d7cff29c2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6dbfe25090ed42a78528511d7cff29c2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6dbfe25090ed42a78528511d7cff29c2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6dbfe25090ed42a78528511d7cff29c2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6dbfe25090ed42a78528511d7cff29c2.png","size":""}]},{"name":"Lydian Sound Orchestra","url":"https://www.last.fm/music/Lydian+Sound+Orchestra","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/39f64fc90cdf4dd5965459b66cda507a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/39f64fc90cdf4dd5965459b66cda507a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/39f64fc90cdf4dd5965459b66cda507a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/39f64fc90cdf4dd5965459b66cda507a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/39f64fc90cdf4dd5965459b66cda507a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/39f64fc90cdf4dd5965459b66cda507a.png","size":""}]},{"name":"Rosario Giuliani","url":"https://www.last.fm/music/Rosario+Giuliani","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1da965b056a24fcbb09077f01250a1b8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1da965b056a24fcbb09077f01250a1b8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1da965b056a24fcbb09077f01250a1b8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1da965b056a24fcbb09077f01250a1b8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1da965b056a24fcbb09077f01250a1b8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1da965b056a24fcbb09077f01250a1b8.png","size":""}]}]},"tags":{"tag":[{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"piano jazz","url":"https://www.last.fm/tag/piano+jazz"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Livio+Minafra/+wiki"}},"published":"16 Nov 2008, 19:38","summary":"Livio Minafra was born in 1982 in the land of Bari. At the age of 10, he began studying piano with Professor Francesco de Santis and in October 2004 he finally graduated from the “Niccolò Piccinni” Conservatory in Bari after completing his studies with Professor Valfrido Ferrari. In 2007, he also got the Diplome in Jazz - arrangements and composition, with a thesis on Cecil Taylor.\nSince 2001, he has been a member of his father’s sextet, the Pino Minafra Sud Ensemble, both as a pianist and as a composer. <a href=\"https://www.last.fm/music/Livio+Minafra\">Read more on Last.fm</a>","content":"Livio Minafra was born in 1982 in the land of Bari. At the age of 10, he began studying piano with Professor Francesco de Santis and in October 2004 he finally graduated from the “Niccolò Piccinni” Conservatory in Bari after completing his studies with Professor Valfrido Ferrari. In 2007, he also got the Diplome in Jazz - arrangements and composition, with a thesis on Cecil Taylor.\nSince 2001, he has been a member of his father’s sextet, the Pino Minafra Sud Ensemble, both as a pianist and as a composer. With the Sud Ensemble, he has played extensively in Italy, Germany, Japan, France, Holland, Spain, Austria, Portugal, as well as in Macedonia.\nIn 2002, he and his father Pino wrote and performed some music compositions inspired by the character of the famous puppet Pinocchio; such piece of work had been commissioned by the American choreographer Karole Armitage (who also worked as a choreographer in the videos of the superstar Madonna) for the Dutch theatre company Introdans.\nIn 2003 he joined Canto General, a music ensemble including V. Curci, R. Ottaviano, P. Minafra, F. Mezzina and V. Mazzone and whose name was inspired by Pablo Neruda’s epic poem. Since its birth this ensemble has been committed to taking part in political and trade union demonstrations, peace demonstrations and any other events related to social and civil issues (Father Alex Zanotelli and the Combonian Missionaries, Gay Pride 2003, Gravina-Altamura Peace March 2003, Marzabotto, etc.). With Canto General, in 2007, in a project dedicated to South Africa, he realized a cd called Viva la black – Ogun Records (Uk) – with guests Louis Moholo, Keith and Julie Tippetts. This cd won for the Italian review “Musica e dischi” as the best cd realized in 2007. Canto General has also met Emanuele Parrini and Ernst Rejseger in a project dedicated to the Taranta phenomenon.\nFrom 2003 to 2007, though turning his hands to the accordion, he took part in the Municipale Balcanica from Terlizzi, a music ensemble that has given 200 concerts in Italy, in Germany, in France, in Bulgaria realizing in 2005 “Fòua”, the first CD of the Municipale Balcanica. In October 2006 they met in Ancona the famous Kocani Orchestra in a project called ‘Tra sponde’ with guests P. Minafra and R. Ottaviano and arrangements by Livio Minafra.\nOn the contrary “La dolcezza del Grido” is the title of his own first cd, a piano solo recording of all original compositions, was released in 2003 by Leo Records, the prestigious record label based in London and producing “Music for the Inquiring Mind and the Passionate Heart”. This piece of work has already received wide recognition. Just to make a few examples, this recording was chosen by the American journalist Steve Koenig for jazzhouse.org among the top ten CDs of 2003; it was recommended by the Slovenian journalist Bogdan Benigar as one of the best CDs for students to the local Student Radio Station in Lubijana; it was placed by the Greek Tzaz Magazine among the top ten CDs of 2004 in its annual referendum. Moreover, the Japanese Jazz Critique Magazine considered him to be one among the best talented musicians of the New Jazz Generation in 2004. In January 2005 he was voted by seventy critics from all over Italy as the 4th among the best new national talented musicians in the annual referendum (better known as “Top Jazz”) held by the Italian “Musica Jazz” Magazine. In 2006, by ranking fifth, he was reconfirmed as one of the top ten Italian new talents. In solo piano he played in Germany, Japan, Italy, French, Slovenia, Portugal, Bulgaria, Serbia..\nIn 2005 he released “Terronia”, the latest CD of Pino Minafra’s Sud Ensemble (with the female choir “Faraualla”, the poet Vittorino Curci and the Meridiana Multijazz Orchestra as guests), produced by the German recording label Enja. With “Terronia” and the Pino Minafra Sud Ensemble he has won the important prize “Top Jazz 2005” with the Italian Magazine Musica Jazz as the best cd and the best group of the year.\nIn 2006 he won the “Award for Best Soundtrack” at the Independent Short Film Festival taking place in Inveruno (Milan) and called “Corti e liberi”. The soundtrack had been composed for the short film “La via dell’arte” (“The Way of Art”) by Pierluigi Ferrandina, featuring Alberto Rubini among others. In the same year he also received the “Musica News International Award” from the Italian magazine “Musica News”, issued by the Calabria Jazz Centre. Consequently his name was added to the list of winners of the previous editions: Trilok Gurtu, Amina Myers, Tiziana Ghiglioni, Paolo Fresu, Stefano Bollani, Al di Meola.\nIn 2007 he created with his father Pino the MinAfric Orchestra playing in Italy and French. With this orchestra he played also with Louis Moholo, Keith and Julie Tippetts in Grenoble and Paris (Fr) and Sant'Anna Arresi (It).\nIn 2008 he composed the “Concerto a colori, for unprepared piano and orchestra“ played the 19th and 21th July in Bari by the Orchestra Sinfonica della Provincia di Bari. Conductor: Massimiliano Caporale. Arrangements: Livio Minafra and Bruno Tommaso. Piano, accordeon and improvvisation: Livio Minafra.\nIn the same year he realized with Enja Records (De) his second piano solo La fiamma e il cristallo with some new compositions of his. This cd includes liner notes by M° Marcello Abbado, M° Giorgio Gaslini and Fabrizio Ciccarelli. <a href=\"https://www.last.fm/music/Livio+Minafra\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
