{"artist":{"name":"Lorna","mbid":"a82012e4-bd1b-4eea-9d52-059c36a5049b","url":"https://www.last.fm/music/Lorna","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3f890dae8c954cc889fc40508b947065.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3f890dae8c954cc889fc40508b947065.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3f890dae8c954cc889fc40508b947065.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f890dae8c954cc889fc40508b947065.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f890dae8c954cc889fc40508b947065.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f890dae8c954cc889fc40508b947065.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"30274","playcount":"155423"},"similar":{"artist":[{"name":"Daddy Yankee","url":"https://www.last.fm/music/Daddy+Yankee","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7c53caa2a181d93c788560ab959e2732.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7c53caa2a181d93c788560ab959e2732.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7c53caa2a181d93c788560ab959e2732.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c53caa2a181d93c788560ab959e2732.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c53caa2a181d93c788560ab959e2732.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c53caa2a181d93c788560ab959e2732.png","size":""}]},{"name":"Las Ketchup","url":"https://www.last.fm/music/Las+Ketchup","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/25a17741645c4c25a61e98b03d95e9b6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/25a17741645c4c25a61e98b03d95e9b6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/25a17741645c4c25a61e98b03d95e9b6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/25a17741645c4c25a61e98b03d95e9b6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/25a17741645c4c25a61e98b03d95e9b6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/25a17741645c4c25a61e98b03d95e9b6.png","size":""}]},{"name":"Don Omar","url":"https://www.last.fm/music/Don+Omar","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/64b6c4f59cc94f018dac70bc6eaf202a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/64b6c4f59cc94f018dac70bc6eaf202a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/64b6c4f59cc94f018dac70bc6eaf202a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/64b6c4f59cc94f018dac70bc6eaf202a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/64b6c4f59cc94f018dac70bc6eaf202a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/64b6c4f59cc94f018dac70bc6eaf202a.png","size":""}]},{"name":"Pitbull","url":"https://www.last.fm/music/Pitbull","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/15b4b8e056d03db52f3efd1765b2b41c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/15b4b8e056d03db52f3efd1765b2b41c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/15b4b8e056d03db52f3efd1765b2b41c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/15b4b8e056d03db52f3efd1765b2b41c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/15b4b8e056d03db52f3efd1765b2b41c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/15b4b8e056d03db52f3efd1765b2b41c.png","size":""}]},{"name":"Nicky Jam","url":"https://www.last.fm/music/Nicky+Jam","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ec4accab972a4274c2e9fb84f6486548.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ec4accab972a4274c2e9fb84f6486548.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ec4accab972a4274c2e9fb84f6486548.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec4accab972a4274c2e9fb84f6486548.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec4accab972a4274c2e9fb84f6486548.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec4accab972a4274c2e9fb84f6486548.png","size":""}]}]},"tags":{"tag":[{"name":"Reggaeton","url":"https://www.last.fm/tag/Reggaeton"},{"name":"indie","url":"https://www.last.fm/tag/indie"},{"name":"dream pop","url":"https://www.last.fm/tag/dream+pop"},{"name":"spanish","url":"https://www.last.fm/tag/spanish"},{"name":"latin","url":"https://www.last.fm/tag/latin"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Lorna/+wiki"}},"published":"12 Feb 2007, 01:28","summary":"There are three artists named Lorna \n\n1) A studio project from England featuring Mark Rolfe, Sharon Cohen-Rolfe, Matt Harrison, Andy Bullock and Paul Skinner.   Signed to the US label Words On Music.\n\n2) A female rapper and reggaeton artist from Panama\n\n3) A Konkani language playback singer from Goa, India\n\n4) A Greek female singer from the nineties.\n\n1) Lorna was originally formed as a studio project in 1997 by Nottingham, England songwriter Mark Rolfe, gradually expanding over the years to a quartet. <a href=\"https://www.last.fm/music/Lorna\">Read more on Last.fm</a>","content":"There are three artists named Lorna \n\n1) A studio project from England featuring Mark Rolfe, Sharon Cohen-Rolfe, Matt Harrison, Andy Bullock and Paul Skinner.   Signed to the US label Words On Music.\n\n2) A female rapper and reggaeton artist from Panama\n\n3) A Konkani language playback singer from Goa, India\n\n4) A Greek female singer from the nineties.\n\n1) Lorna was originally formed as a studio project in 1997 by Nottingham, England songwriter Mark Rolfe, gradually expanding over the years to a quartet. Lorna’s songs are conceived, written, and produced by the band in their own studio Stars of Winnetka, with the assistance from various collaborators and an eclectic and wide range of instrumentation. Studio work is Lorna’s forte — Rolfe has a deep-rooted understanding and knowledge of conventional music theory as well as orchestration, and singer Sharon Cohen has spent years of academic and self-study of Music Production and Technology. Also on board for both studio and live work is bassist and vocalist Andy Bullock, who has worked with Rolfe in various musical projects on and off for many years. Matt Harrison completes the core of Lorna’s studio and songwriting team, contributing his classical knowledge and affection for electronic experimentation.\n\nLorna released their first CD-EP Never Grow Old in March 2001 on Nottingham independent label Intromit Records. Seduced and intrigued by the release, the head of Heavenly Recordings (Jeff Barrett) immediately signed Lorna to a publishing deal through EMI Music in 2001. The next two years were spent recording over 40 new tracks.\n\nMore experimentation, inspiration, and collaboration — including work with members of Six By Seven, Spiritualized, and Echoboy — led to a 7” vinyl release in 2001 through the Spanish label Becalmed Records. The single received critical acclaim and worldwide airplay. “Piano and guitar notes fall like teardrops. This is imagined memory where Brian Wilson invites Slowdive to work with him.”\n\nIn 2003, Lorna completed their first proper album, This Time, Each Year — a collection of fourteen new songs. The album was released in December 2003 by the Spanish label Pause Music. It received immense critical acclaim, and by January 2004 This Time, Each Year was already marked for Album Of The Year by many Spanish radio stations. The band took on a full promotional tour of Spain to astounding success including slots of national daytime TV and radio and playing capacity shows at cities including Madrid and Valencia. Following the European release of This Time, Each Year, Lorna signed with US based label Hybrid Electric Records in early 2004 to release the album in the US and Canada.\n\nIn late November 2004 Lorna released The December EP on their own label, Winnetka Records. This release was a strictly limited edition, handmade CD-EP of five original and traditional holiday songs in which the band donated 100% of all sales directly to a small number of volunteer-run animal shelters and rescue homes throughout the United Kingdom.\n\nIn January 2005 Lorna signed to Words On Music for the worldwide release of their second album, Static Patterns and Souvenirs. The album showcases eleven new songs that use Scottish pop, postrock, Americana, and dream pop as signposts. Lorna invigorates each of these genres by injecting a complex yet seamless array of instrumentation, both traditional (pedal steel, classical guitar, flute, vibraphone, viola, banjo, French horn, flugelhorn, harmonica, mandola) and experimental (theremin, found noises, electronics). This orchestration serves as an innovative anchor to the compelling melodies sung, often in tandum, by Mark Rolfe, Sharon Cohen, and James Allen. Repeated listens are rewarded with newfound orchestral discoveries throughout these stunning musical arrangements.\n\nLorna have performed with Neil Halstead (Mojave 3), Evan Dando, Mark Gardner (Ride), American Analog Set, Midlake, and Pernice Brothers. The band toured Spain in 2004 and toured the US West Coast in August 2005.\n\n2) Lorna Zarina Aponte (born 1983 in Panama), better known simply as Lorna, is a female rapper and reggaeton artist, best known for her song \"Papi Chulo (Te Traigo el Mmmm)\". This song got wide spread popularity in US and Europe (Reaching No. 1 in French music charts) but also saw enormous success in countries like Turkey and especially in Pakistan. \n\nAt the age of 13, Lorna decided that she wanted to become a singer and solo artist and so she went to searching for - and found - a music producer and DJ who was willing to record a song with her on vocals. With help from this producer, she entered a talent competition for new singers organised in Panama City, which she won. This gave Lorna the opportunity to record a single. Soon after she was working with El Chombo, a renowned producer in Panama.\n\nThe Bilbao Fraud Incident:  In 2005 Aponte was scheduled to appear at a festival in Bilbao called Zorrozaurre, but instead of her, the record company sent one of her backing singers, claiming that Lorna had decided to take a sabbatical due to health related issues. The backing singer also gave interviews under the impression of being Lorna Aponte. Rumours of her death started soon to appear.\n\n(Source: Wikipedia [12 feb 2007])\n\nBut she didn't die of drug abuse as some newspapers reported but has taken - as she has called it - a Sabbatical leave.\nIn 2008 she published her first album \"La Mami Chula - Mas sexy que nunca\" containing 12 songs. Those songs are similar to those she became famous for: mainly Reggaeton dance music.\nBut she also recorded some singles which show her as a more serious artist. The song \"Ya no pienso en llorar\" decries the abuse of women and the song \"Paola\" treats the harm by use of drugs.\n\n3) Lorna Cordeiro popularly known as Lorna, is a popular Konkani language singer and tiatrist from the state of Goa, India.\n\nLorna was born in Mumbai on 9 August 1946 to Cecelia Cordeiro and Theophilus Cordeiro and was brought up there. She belongs to the Goan Catholic community, a prominent Christian community in Bombay. Lorna used to love music from her childhood and particularly she liked singing Konkani songs\n\nSource: (http://en.wikipedia.org/wiki/Lorna,_Goa) <a href=\"https://www.last.fm/music/Lorna\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
