{"artist":{"name":"Lot Lorien","mbid":"9e7cf65a-587e-423b-a648-5c2fc6e8ae90","url":"https://www.last.fm/music/Lot+Lorien","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/01f44c55955b4dc6af9b52e66e1206c4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/01f44c55955b4dc6af9b52e66e1206c4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/01f44c55955b4dc6af9b52e66e1206c4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/01f44c55955b4dc6af9b52e66e1206c4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/01f44c55955b4dc6af9b52e66e1206c4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/01f44c55955b4dc6af9b52e66e1206c4.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"1804","playcount":"24170"},"similar":{"artist":[{"name":"Neli Andreeva","url":"https://www.last.fm/music/Neli+Andreeva","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/14c36383210b49c889ebd5f9e0cc0198.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/14c36383210b49c889ebd5f9e0cc0198.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/14c36383210b49c889ebd5f9e0cc0198.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/14c36383210b49c889ebd5f9e0cc0198.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/14c36383210b49c889ebd5f9e0cc0198.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/14c36383210b49c889ebd5f9e0cc0198.png","size":""}]},{"name":"Belegzija","url":"https://www.last.fm/music/Belegzija","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0f6cefccd1b07448db69ef9eb3a59fa2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0f6cefccd1b07448db69ef9eb3a59fa2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0f6cefccd1b07448db69ef9eb3a59fa2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0f6cefccd1b07448db69ef9eb3a59fa2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0f6cefccd1b07448db69ef9eb3a59fa2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0f6cefccd1b07448db69ef9eb3a59fa2.png","size":""}]},{"name":"Izvor","url":"https://www.last.fm/music/Izvor","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b542b8550adc4f74bc134d7c9e0abaa4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b542b8550adc4f74bc134d7c9e0abaa4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b542b8550adc4f74bc134d7c9e0abaa4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b542b8550adc4f74bc134d7c9e0abaa4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b542b8550adc4f74bc134d7c9e0abaa4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b542b8550adc4f74bc134d7c9e0abaa4.png","size":""}]},{"name":"Pavle Aksentijević i Grupa Zapis","url":"https://www.last.fm/music/Pavle+Aksentijevi%C4%87+i+Grupa+Zapis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/21b282f9810e4b21812a7313c62272d3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/21b282f9810e4b21812a7313c62272d3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/21b282f9810e4b21812a7313c62272d3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21b282f9810e4b21812a7313c62272d3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21b282f9810e4b21812a7313c62272d3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21b282f9810e4b21812a7313c62272d3.png","size":""}]},{"name":"Angele Dimovski","url":"https://www.last.fm/music/Angele+Dimovski","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/153c4a1da61bfbbeef4ebe1608fd9784.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/153c4a1da61bfbbeef4ebe1608fd9784.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/153c4a1da61bfbbeef4ebe1608fd9784.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/153c4a1da61bfbbeef4ebe1608fd9784.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/153c4a1da61bfbbeef4ebe1608fd9784.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/153c4a1da61bfbbeef4ebe1608fd9784.png","size":""}]}]},"tags":{"tag":[{"name":"bulgarian","url":"https://www.last.fm/tag/bulgarian"},{"name":"balkan","url":"https://www.last.fm/tag/balkan"},{"name":"ethno","url":"https://www.last.fm/tag/ethno"},{"name":"folk","url":"https://www.last.fm/tag/folk"},{"name":"world fusion","url":"https://www.last.fm/tag/world+fusion"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Lot+Lorien/+wiki"}},"published":"13 Jan 2007, 04:16","summary":"The musical formation \"Lot-Lorien\" is Bulgarian world-fusion/ethnic-crossover band that rapidly gaining popularity worldwide. The band came into existence in 1997, and have continually developed a sound that is without equivalence anywhere. The music style is very hard to describe; it is an original sound, combining elements of world fusion based on Bulgarian folklore, traditional Celtic and other folk music, progressive rock, pop, and new age. The <a href=\"https://www.last.fm/music/Lot+Lorien\">Read more on Last.fm</a>","content":"The musical formation \"Lot-Lorien\" is Bulgarian world-fusion/ethnic-crossover band that rapidly gaining popularity worldwide. The band came into existence in 1997, and have continually developed a sound that is without equivalence anywhere. The music style is very hard to describe; it is an original sound, combining elements of world fusion based on Bulgarian folklore, traditional Celtic and other folk music, progressive rock, pop, and new age. The sound is made all the more impressive by its members weaving together standard and non-standard instrumentation, such as electro-acoustic guitar and bass, violin, female vocal, drums, percussion, glockenspiel, tapan, djembe, darbouka and others.\n\nЛот Лориен е българска музикална формация съчетаваща по модерен начинтрадициите на българския и чуждестранен фолклор, класическата музика с модерните течения в джаза и прогресив-рока.\n   Музикалните критици определят стила й като етно-джаз/уърлд-фюжън, а самата група може да се похвали с доста разнородна фенска маса - като се започне от любителите на джаз, блус, класика и фолклор, и се стигне до прогресив рок, фолк и хеви метъл. Както самите музиканти споделят, те са запалени почитатели на английския писател Джон Р. Р. Толкин и неговото творчество за Средната Земя (Властелинът на Пръстените, Хобит, Силмарилион и др.) и оттам взаимстват името на групата - Лотлориен е вълшебното горско царство на елфите Галадрими, където времето сякаш е спряло и всеки попаднал там пътник забравя за грижите си и надвисналите заплахи. Така и Лот Лориен (решават името да се изписва разделено) се опитват да създават музика, която рисува приказни картини и кара слушателя да се откъсне от проблемите на ежедневието.\n   Групата е създадена през 1996 година от Кирил Георгиев, Златомир Вълчев и Петър Павлов, като първоначално носи името Alien Shore, a стиловата ориентация клони най-вече към прогресив-рок. След това започват експерименти със стила и състава: по това време към групата се присъединява Бора Петкова, а в един момент групата наброява 9 човека - барабани, бас, две китари, две вокалистки, двама клавиристи и виолончело (Нели Ганчева, която е част от групата в първите и сериозни изяви в България). През 1998 година в групата идва Галина Койчева и така е формиран окончателния състав, с който започват и първите сериозни изяви на Лот Лориен. По същото време и Александър Кинов идва в групата - отначало като фен, техник и неофициален член, а по-късно като неразделна част от Лот Лориен - звукорежисьор, а по-късно и клавирист. В течение на времето се оформят специфичните звучене и стил, значителна роля, за които имат композитора на групата Кирил Георгиев и малко необичайната комбинация на инструменти - китара, цигулка и нежен женски глас съжителстващи успешно със синтезатор, бас китара и барабани, както и фолклорни инструменти като тъпан, дарбука, табла, джембе, тамбура и др. Ръчно изработени от групата уникални инструменти също намират място в творбите на формацията.\n   През 2000 година групата започва да излиза зад граница, където получава много топъл прием от местната публика и организатори. След множество успешния изяви и няколко демозаписа, част от които стигат и до национален ефир, най-после идва времето и на първия албум - \"Източен Вятър\". Той е записан през лятото на 2002 година в студио Балкантон с легендарния тонрежисьор Деян Тимнев. В албума като гост музикант в една композиция участва и прочутата млада оперна певица Ина Кънчева. Албумът е записан за американската компания Falcata-Galia Recordings, а по-късно става възможно и неговото разпространение в България.\n   Следват още изяви и създаването на нови композиции. В началото Лот Лориен са силно повлияни от класическата музика и английския фолклор и звучат по-камерно, но постепенно в стила и звученето все повече навлизат влияния от джаза, прогресив рока и особено много българския фолклор. Така през 2003 година започва едно от най-интересните сътрудничества за групата - с големия музикант Теодосий Спасов. Първият резултат от това сътрудничество е участието във фестивала \"Mobimak Balkan Square 2003\" в Охрид/Македония, където авторските композиции на Лот Лориен, преаранжирани с участието на гениалния кавалджия, пожънват голям успех. Концертът е записан и по-късно част от него е издадена под името \"Во живо одь Охридь\" - второто заглавие в дискографията на групата.\n   През 2003 година се случва още едно интересно нещо - Лот Лориен стават член на IOV (присъединена към UNESCO, организация свързана с националния фолклор и изкуството).\n   Постепенно групата започва все по-често да излиза зад граница, представяйки успешно авторските си композиции, както и собствените си преработки по български фолклорни мотиви.\n   В края на 2005 година е сложено началото на един амбициозен проект с работно заглавие \"Лот Лориен и приятели\". Музикантите закупуват професионална апаратура и изграждат домашно студио в собственото си репетиционно помещение, което им дава творческа свобода за експерименти и възможността да канят различни музиканти. В края на 2006 година вече е налице албум от 12 композиции, записан и смесен в студиото на групата - в него вземат гост участие различни музиканти с които Лот Лориен са се срещали и работили в България и чужбина: Роман Столяр (Русия) - флейта, Латиф Болат (Турция/САЩ) - вокал, Николай Йорданов - флейта, Драгни Драгнев - гайда и кавал, Петя Драгнева - фолклорно пеене, Марияна и Диляна Цветанови - цигулка, Кристиян Неделчев - гъдулка, Снажен Ковачев - вокал, 84 годишния Киро Диков от село Бродилово. Използвани са текстове на Георги Константинов и Рей Гонзалес. В началото на 2007 година албума е издаден под името \"Лот Лориен\". Едно от най-интересните сътрудничества в него е песента \"Балада за изгубеното\", която се ражда в студиото покрай импровизациите с няколко идеи и постепенно бива надграждана с много инструменти, включително струнно трио, гайда, табла (за пръв път използвана в композиция на групата), а \"черешката на тортата\" се оказва дългогодишният приятел на групата Латиф Болат - известен турски композитор и музикант, живеещ в САЩ и нашумял покрай работата си с Джордж Лукас по саундтрака на \"Младият Индиана Джоунс\". Латиф и вокалистката на групата, Бора, създават интересен мултиезичен вокален диалог - българският текст е на Любен Каравелов, а турският-от средновековния поет Юнуш Емре, също така в началото и края на песента има напеви от турска народна песен. Логично - песента става една от отличените в конкурса за междукултурен диалог на Euromedcafe \"Other songs\" (проведен под егидата на дирекция за външни отношения към Европейската комисия, Евросредиземноморска фондация за междукултурен диалог \"Ана Линд\" и Фондационе Медитеранео).\n   През 2007 година Лот Лориен решават да се включат в инициативата \"Не сте сами\", посветена на оказване морална покрепа на пленените в Либия български медицински сестри (китаристът на групата, Кирил е живял няколко години в Либия заедно с майка си, която също е работила там като медицинска сестра). Освен серията концерти които изнасят във връзка с инициативата, Лот Лориен, с подкрепата на Стефан Софиянски и Съюза на Свободните Демократи издават специален тираж от албума \"Лот Лориен\" - всички членове на Европейския Парламент получават диск от този тираж.\n   2008 година е белязана от няколко концерта в България, създаване на няколко нови композиции, а в края и групата отбелязва своя 10 годишен юбилей с грандиозен концерт във Варненската Опера, в който музикантите представят нови композиции и такива от цялото си творчество и освен това създават концептуална мултимедия и специално осветление за всяка песен. Аудио и видеоматериали от този концерт ще бъдат използвани в юбилейно ДВД което ще включва видеоматериали, интервюта, както и архивни кадри на групата.\n   През 2009 година Лот Лориен продължават с работата по създаване и аранжиране на песни за следващия си албум. Освен това имат няколко участия, едно от които е на престижния фестивал Spirit of Burgas, който още с второто си издание затвърди мястото си сред 10-те най-добри летни фестивала в Европа. \n\n  <a href=\"https://www.last.fm/music/Lot+Lorien\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
