{"artist":{"name":"Louis Prima","mbid":"b5997eef-2516-491a-a10e-5cee842bbcdc","url":"https://www.last.fm/music/Louis+Prima","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/eb9f7793c64a4dce983aca94d49a638d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/eb9f7793c64a4dce983aca94d49a638d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/eb9f7793c64a4dce983aca94d49a638d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eb9f7793c64a4dce983aca94d49a638d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eb9f7793c64a4dce983aca94d49a638d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eb9f7793c64a4dce983aca94d49a638d.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"390102","playcount":"2981219"},"similar":{"artist":[{"name":"Louis Jordan and His Tympany Five","url":"https://www.last.fm/music/Louis+Jordan+and+His+Tympany+Five","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d31cfc3dfc904f63b66d06ee50579202.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d31cfc3dfc904f63b66d06ee50579202.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d31cfc3dfc904f63b66d06ee50579202.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d31cfc3dfc904f63b66d06ee50579202.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d31cfc3dfc904f63b66d06ee50579202.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d31cfc3dfc904f63b66d06ee50579202.png","size":""}]},{"name":"Keely Smith","url":"https://www.last.fm/music/Keely+Smith","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d0caf609221442a6b146ca8474f0841b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d0caf609221442a6b146ca8474f0841b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d0caf609221442a6b146ca8474f0841b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d0caf609221442a6b146ca8474f0841b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d0caf609221442a6b146ca8474f0841b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d0caf609221442a6b146ca8474f0841b.png","size":""}]},{"name":"The Andrews Sisters","url":"https://www.last.fm/music/The+Andrews+Sisters","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ed9feeb4d8434e6bb7111a53855b855f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ed9feeb4d8434e6bb7111a53855b855f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ed9feeb4d8434e6bb7111a53855b855f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed9feeb4d8434e6bb7111a53855b855f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed9feeb4d8434e6bb7111a53855b855f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed9feeb4d8434e6bb7111a53855b855f.png","size":""}]},{"name":"Fred Astaire","url":"https://www.last.fm/music/Fred+Astaire","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3d3e19aa1e6d4a61a81f219be1daad60.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3d3e19aa1e6d4a61a81f219be1daad60.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3d3e19aa1e6d4a61a81f219be1daad60.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d3e19aa1e6d4a61a81f219be1daad60.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d3e19aa1e6d4a61a81f219be1daad60.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d3e19aa1e6d4a61a81f219be1daad60.png","size":""}]},{"name":"Dean Martin","url":"https://www.last.fm/music/Dean+Martin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/44d557bbaaa84c3c98ebe83893c088c6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/44d557bbaaa84c3c98ebe83893c088c6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/44d557bbaaa84c3c98ebe83893c088c6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44d557bbaaa84c3c98ebe83893c088c6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44d557bbaaa84c3c98ebe83893c088c6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44d557bbaaa84c3c98ebe83893c088c6.png","size":""}]}]},"tags":{"tag":[{"name":"swing","url":"https://www.last.fm/tag/swing"},{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"Big Band","url":"https://www.last.fm/tag/Big+Band"},{"name":"lounge","url":"https://www.last.fm/tag/lounge"},{"name":"jazz vocal","url":"https://www.last.fm/tag/jazz+vocal"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Louis+Prima/+wiki"}},"published":"09 Aug 2006, 14:38","summary":"Louis Prima (December 7, 1910 - August 24, 1978) was born into a musical family in New Orleans. His family emigrated from Sicily, Italy, and after a brief stay in Argentina settled in the United States. Prima studied violin for several years as a child. His older brother Leon was a well regarded local bandleader. Prima was proud of his heritage, and made a point of letting the audience know at every performance that he was Italian-American and from New Orleans. <a href=\"https://www.last.fm/music/Louis+Prima\">Read more on Last.fm</a>","content":"Louis Prima (December 7, 1910 - August 24, 1978) was born into a musical family in New Orleans. His family emigrated from Sicily, Italy, and after a brief stay in Argentina settled in the United States. Prima studied violin for several years as a child. His older brother Leon was a well regarded local bandleader. Prima was proud of his heritage, and made a point of letting the audience know at every performance that he was Italian-American and from New Orleans. His singing and playing showed that he absorbed many of the same influences as his fellow Crescent City musician, Louis Armstrong, particularly in his hoarse voice and scat singing.\n\nIn his youth, Prima played trumpet with Irving Fazola, his brother's band, and the pit band of the Saenger Theater. In 1933 he began his busy recording career, as part of the David Rose orchestra at station WGN, Chicago; he was also part of the small recording group The Hotcha Trio, with Rose on piano and Norman Gast on violin. In 1934 Prima moved to New York, working regularly on 52nd Street with old New Orleans friends like Eddie Miller (tenor sax and clarinet) and George Brunies (trombone), and also new acquaintances like Pee Wee Russell (clarinet). Prima's informal jazz group was known as Louis Prima and His New Orleans Gang, and this band recorded prolifically for Brunswick through 1936, and then for Vocalion and Decca.\n\nPrima's 1936 composition, \"Sing Sing Sing\", which he had released with the New Orleans Gang in March, 1936 as a Brunswick 78, Brunswick 7628, with \"It's Been So Long\" as the B side, became one of his biggest hits and one of the most covered standards of the swing era; Benny Goodman's performance of the song at Carnegie Hall with a featured performance by Gene Krupa on drums has become iconic.\n\nLouis Prima and His Band\nPrima moved to Los Angeles to headline at the Famous Door nightclub. He appeared in several Hollywood movies, including a featured performance with Bing Crosby in the 1936 film Rhythm on the Range. Prima and his Dixieland Gang continued to play club dates across the nation, including a 1939 stint at New York's Hickory House.\n\nBig bands were big business then, and Prima apparently bowed to pressure from booking agents and formed a conventional big band in 1940. He exploited a distinctive, shuffling beat (which he called \"Gleeby Rhythm\"); this trademark Prima shuffle remained part of his repertoire for two decades. Prima sang most of the band vocals, with Lily Ann Carol as the \"girl singer.\" Prima's high-powered drummer at this time was Jimmy Vincent, an energetic teenager who remained with the Prima band for many years.\n\nIn 1947 he added singer Cathy Ricciardi, who recorded under the name Cathy Allen. She was succeeded in 1949 by Keely Smith (who was to become his fourth wife), and the band concentrated on novelty songs like \"Civilization (Bongo Bongo Bongo)\" and \"All Right, Louis, Drop the Gun.\" Prima's big band continued into the early 1950s, with a series of novelty recordings supervised (sometimes heavy-handedly) by record producer Mitch Miller.\n\nVegas years\n\nThe popularity of the big-band sound started to wane, and Prima began losing money, just as he needed it to support the pregnant Smith. Prima found work with Smith in small venues all over the East Coast. Eventually he called up his friend Bill Miller, who was then entertainment director of The Sahara nightclub and casino in Las Vegas, and asked for a job. His friend Cab Calloway warned him against the cramped Sahara lounge, but the financial pressure was too great. Prima telephoned saxophonist Sam Butera and instructed him to pick up a few musicians and go to Las Vegas in time for Prima's debut.\n\nPrima acknowledged his new musicians for the opening-night crowd, and spontaneously asked Butera what the name of the band was. Butera ad-libbed, \"The Witnesses!\" From then on, Sam Butera and the Witnesses backed Prima and Smith on stage and records.\n\nPrima and Smith worked hard throughout the 1950s, performing multiple shows a night and finishing at 6 a.m. Their efforts were rewarded with a resurgence in their popularity, and they were at least partly responsible for making the lounge at The Sahara a hotspot. On stage, Prima insisted on Smith adopting a humorless, poker-faced character that would play straight to Prima's zany ad libs. Smith actually had a fine sense of comedy that is often audible on the team's recordings; no matter how much the incorrigible Prima tried to disrupt her vocals, Smith would often come back with a funny remark of her own.\n\nLouis Prima and Keely Smith were very much the model for Sonny & Cher: the exuberant Italian musician and the serious, exotic female singer, Smith and Cher both being of Cherokee descent (although Cher's heritage is primarily Armenian). Similarly, echoes of the stage banter between Prima and Butera would be heard years later in the early performances of the E Street Band and the interplay between Bruce Springsteen and Clarence Clemons.\n\nIn 1959, Prima and Smith won the Grammy Award for Best Performance by a Vocal Group or Chorus for \"That Old Black Magic.\"\n\nIn 1956 the Prima ensemble performed at the Sahara Hotel and Casino to record tracks for the album The Wildest!. It was an attempt by Capitol Records to capture the essence of the Vegas act. Over the next nine years, Prima and Smith raised two children, while he made scores of records, owned racehorses, appeared on television, and even opened a golf course. They outgrew the lounge and were promoted to the big room. They appeared in a few quickie musical films, including Senior Prom and Hey Boy! Hey Girl! Prima co-produced the feature Twist All Night, in which his band also appeared.\n\nDuring this whirlwind of activity, according to Smith, the couple drifted farther and farther apart. One night, he refused to conduct for one of Smith's performances, delegating to Butera instead. A few days later they were in court, petitioning for divorce.\n\nLater years\n\nFollowing the divorce, he began dating Gia Maione. Maione was a long-time fan of Prima's, was already familiar with all the arrangements to his songs, and even kept a signed photo of him in her purse. She eventually became Prima's fifth and final wife, and was with the band right up until 1975. By this point, the band was putting out a markedly different and more contemporary sound, with electric organs and synthesizers, even dabbling in progressive rock.\n\nIn 1967 Prima's distinctive voice and jazzy delivery landed him a role in Walt Disney's animated feature The Jungle Book, as the raucous orangutan King Louie. He performed the hit song \"I Wanna Be Like You\" on the soundtrack, leading to the recording of two albums with Phil Harris: The Jungle Book and More Jungle Book, on Disneyland Records. He can also be heard on the soundtrack of another cartoon feature, The Man Called Flintstone.\n\nHe suffered a mild heart attack in 1973. In 1975, following headaches and episodes of memory loss, Louis Prima sought medical attention, and found out he had a stem brain tumor. He suffered a cerebral hemorrhage and went into a coma following surgery to remove the tumor. He never recovered, and died three years later, having been moved back to New Orleans. He was buried in Metairie Cemetery in New Orleans; his gray marble crypt is topped by a figure of Gabriel, the trumpeter-angel. The inscription on the crypt's door quote the lyrics from one of his hits: \"When the end comes, I know, they'll all say 'just a gigolo' as life goes on without me. Lovingly, your little family...\"\n\n <a href=\"https://www.last.fm/music/Louis+Prima\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
