{"artist":{"name":"Luis Alberto Spinetta","mbid":"78b8c4c6-d329-4b01-98ed-02b183fe0bf8","url":"https://www.last.fm/music/Luis+Alberto+Spinetta","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a7900eb5346e442ebb69e8bf2e2d2d44.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a7900eb5346e442ebb69e8bf2e2d2d44.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a7900eb5346e442ebb69e8bf2e2d2d44.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a7900eb5346e442ebb69e8bf2e2d2d44.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a7900eb5346e442ebb69e8bf2e2d2d44.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a7900eb5346e442ebb69e8bf2e2d2d44.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"69090","playcount":"1783308"},"similar":{"artist":[{"name":"Spinetta Jade","url":"https://www.last.fm/music/Spinetta+Jade","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/287ee4a5527f4542b69e1e5ee0269cc8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/287ee4a5527f4542b69e1e5ee0269cc8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/287ee4a5527f4542b69e1e5ee0269cc8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/287ee4a5527f4542b69e1e5ee0269cc8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/287ee4a5527f4542b69e1e5ee0269cc8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/287ee4a5527f4542b69e1e5ee0269cc8.png","size":""}]},{"name":"Invisible","url":"https://www.last.fm/music/Invisible","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ba2ba4ee48bc4cb88be194382cb8b6b4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ba2ba4ee48bc4cb88be194382cb8b6b4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ba2ba4ee48bc4cb88be194382cb8b6b4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba2ba4ee48bc4cb88be194382cb8b6b4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba2ba4ee48bc4cb88be194382cb8b6b4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba2ba4ee48bc4cb88be194382cb8b6b4.png","size":""}]},{"name":"Spinetta y los Socios del Desierto","url":"https://www.last.fm/music/Spinetta+y+los+Socios+del+Desierto","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ce38b4b4d3a74d1d9aa03d4464904301.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ce38b4b4d3a74d1d9aa03d4464904301.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ce38b4b4d3a74d1d9aa03d4464904301.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ce38b4b4d3a74d1d9aa03d4464904301.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ce38b4b4d3a74d1d9aa03d4464904301.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ce38b4b4d3a74d1d9aa03d4464904301.png","size":""}]},{"name":"Pescado Rabioso","url":"https://www.last.fm/music/Pescado+Rabioso","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f17f8214cf8848a0b019ec3f5555ea8d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f17f8214cf8848a0b019ec3f5555ea8d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f17f8214cf8848a0b019ec3f5555ea8d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f17f8214cf8848a0b019ec3f5555ea8d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f17f8214cf8848a0b019ec3f5555ea8d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f17f8214cf8848a0b019ec3f5555ea8d.png","size":""}]},{"name":"Charly García","url":"https://www.last.fm/music/Charly+Garc%C3%ADa","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c624afe53f4e48c09dee1e8522c768a3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c624afe53f4e48c09dee1e8522c768a3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c624afe53f4e48c09dee1e8522c768a3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c624afe53f4e48c09dee1e8522c768a3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c624afe53f4e48c09dee1e8522c768a3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c624afe53f4e48c09dee1e8522c768a3.png","size":""}]}]},"tags":{"tag":[{"name":"Rock Argentino","url":"https://www.last.fm/tag/Rock+Argentino"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"argentina","url":"https://www.last.fm/tag/argentina"},{"name":"Spinetta","url":"https://www.last.fm/tag/Spinetta"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Luis+Alberto+Spinetta/+wiki"}},"published":"01 Aug 2006, 00:59","summary":"Luis Alberto Spinetta, also known as El Flaco Spinetta (January 23, 1950 -  February 8, 2012), was an Argentine musician. He was one of the most influential rock musicians of Latin America, and together with Charly García is considered the father of Argentinean rock. He was born in Buenos Aires, Argentina, in the residential neighbourhood of Belgrano. Since he was a kid he listened to all kinds of music: folklore and tango, and a little bit later, rock. <a href=\"https://www.last.fm/music/Luis+Alberto+Spinetta\">Read more on Last.fm</a>","content":"Luis Alberto Spinetta, also known as El Flaco Spinetta (January 23, 1950 -  February 8, 2012), was an Argentine musician. He was one of the most influential rock musicians of Latin America, and together with Charly García is considered the father of Argentinean rock. He was born in Buenos Aires, Argentina, in the residential neighbourhood of Belgrano. Since he was a kid he listened to all kinds of music: folklore and tango, and a little bit later, rock. As with almost every other rocker of his generation, The Beatles would change his life. In 1967, in the midst of a repressive political climate, he formed a band called Almendra with school mates.\n\nContrasting with the backwards and authoritarian government of General Juan Carlos Onganía, Argentina and specially Buenos Aires were undergoing a cultural blossoming, based on new art expressions; the new generation, the sons of the middle class, was immersed in an effervescence that would not reappear in Argentina until 1983. Spinetta was part and later an exponent of that blossoming and rebellious youth that would express itself both through the arms and the arts. Spinetta devoted fully to the latter path, although he briefly became involved with left-wing political movements.\n\nIt was 1969 and his band, Almendra, recorded their first album. The band started recording and playing intensely and it became successful almost overnight. Almendra composed its own songs and the lyrics were in Spanish (something radically new). The subtlety and beauty of their sound would be one of the milestones (maybe the first) of Argentine rock. After two albums that enjoyed radio diffusion and deserved fame, the band split. Spinetta composed and recorded a new solo album, but an inadequate environment (he would later say that the mood of Argentine rock and rockers of those times were too \"heavy\" and negative for him) and the vast changes that success effected on his life made him leave the country.\n\nAfter a lengthy stay in Europe, he returned to Argentina and formed a new band: Pescado Rabioso. It was destined to be as mythical as Almendra. With a far more powerful sound and expressing the tension in the streets of an increasingly violent Argentina, Pescado recorded its first album in 1972. It was both a continuation of the creative stream of Spinetta and a drastic change in the style of his music and lyrics. The band recorded a second album; although a third one carried its name, Pescado was by then dissolved; Artaud, recorded in 1973 and mostly a solo album by Spinetta, was a major breakthrough. Partly based on the writings of Antonin Artaud, Spinetta exorcised many of the demons of his past in this album. This process would open the door to a new era in his music.\n\nIn 1974 he formed a new band, Invisible. With his new band he recorded three albums; Invisible I, Durazno Sangrando (together with Artaud, hailed as his best album ever), and El Jardín De Los Presentes. With Invisible, he left the powerful and rough sound of Pescado; the new tunes were more harmonic, soft and mellow, yet his work remained essential and revolutionary. Following this line, he embarked on a solo project, A 18' del Sol, after dissolving Invisible in 1976-77. By then, ten years later after starting his career, his style had became a delicate amalgam of old and new; the old pop and (proto) heavy rock had merged with various elements of jazz and bossa nova. That unique flavour would become his style during the next half decade.\n\nAfter recording and editing a failed album in the United States in 1979 (the only album that Spinetta lamented ever doing), with lyrics in English and destined to the US market, Spinetta returns to Argentina and starts a prolific era: he would record two albums with a short-lived Almendra Revival (one with original songs and the other live), and embark on a new project: Spinetta Jade.\n\nSpinetta Jade would prove to be a successful and innovative band; Spinetta was joined by some of the greatest Argentinan musicians of those and all times to help him build the new sound he was building since Invisible. The product: a blend of jazz and rock that was unseen in Argentina and that escaped the boom of symphonic rock that reached both the world and Argentina in the early 1980s. These four albums, Alma de Diamante (1980), Los Niños que Escriben en el Cielo (1981), Bajo Belgrano (a homage to the neighbourhood where he grew up, 1983) and the unforgettable Madre en Años Luz (1984), represent a defined style as well as the footprints of Spinetta´s evolution. Towards the last two albums, the sound became a little bit more \"pop\", and embedded with electronic elements (samplers and synthesisers with \"artificial\" textures). Something worth remarking: the overpowering influence and fame of Spinetta in the Argentinian rock world was only equalled by that of Charly García. Many fans and critics shared the feeling that the two musicians represented antagonistic styles and values. To show otherwise, Spinetta and Charly (with their respective bands at the moment, Jade and Serú Giran) joined efforts and gave what was probably the most important show in the history of Argentine Rock.\n\nDissolving Spinetta Jade in 1984, Spinetta shortly engaged in an album to be made together with Charly; yet, this would-be mythical work was abandoned. Of this interrupted work, two songs remained: \"Rezo por Vos\" and \"Total Interferencia\".\n\nBy 1982, Spinetta had restarted his solo projects, and from then on would never leave them. Kamikaze (1982) puts together a number of previously unreleased songs (one gem is a very old song he composed in 1965 called \"Barro Tal Vez\"). In Mondo Di Cromo (1983) Spinetta prefigures the style of his solo projects during the second half of the 1980s. His new production, from 1986 to 1993, would include four solo albums (Privé (1986), Téster de Violencia (1988), Don Lucero (1989), Pelusón of Milk (1991)), a joint album with Fito Páez, another giant of Rock Nacional (Sólo la la la (1986)), and the soundtrack of the movie \"Fuego Gris\" (named after the film, 1993). It is hard to describe this collection of wide albums with a single adjective. The style, the sound, the themes that Spinetta picks and uses with the dexterity of a veteran musician are broad enough to encompass rock, pop, some tango, jazz and bossa; they all sound 1980s like; they all sound Argentinian and reflect the difficult years of the new democracy (1983 onwards) and the contemporary thought about Argentina that is being made. Hope and failure, they are covered with the Porteño melancholy maybe more than Spinetta´s previous work.\n\nAfter a long silence, produced mainly by Spinetta´s conflicts with the recording companies, he finally opens a new period in his music with his new band: Spinetta y los Socios del Desierto. Three years (1997-1999) and four albums later, Spinetta had created yet another legend in Argentinian rock. Two studio albums, the double Socios del Desierto (1997) and Los Ojos (1999) would bring along a new sound, much more dry and 1990s sounding. The band made an MTV Unplugged, Estrelicia (1998), that because of its softness and acoustic nature, wildly contrasts with their live album, San Cristóforo (1998). As Spinetta said at the beginning of the first concert, \"Fans de lo acústico, abstenerse\" (\"Fans of acoustic music, refrain\"). The speed and roughness of the sound recalls Pescado´s sound. Also, in 1998, Spinetta chose the featured songs and artwork of a Greatest Hits album called Elija y Gane, edited the same year.\n\nThe band dissolved quietly towards the end of 1999. Spinetta started a solo era that spawns until the present. Silver Sorgo (2001), Obras en Vivo (2002), a live album, and Para Los Árboles (2003) combine maturity with boldness. The changing and mostly tragic landscape of current Argentina powerfully affects the background of these works. In them, Spinetta has showed that his creative flame is anywhere but near of being extinguished.\n\nOn 23 December 2011 he published on the Twitter account of his son Dante that he was facing lung cancer. He died on February 8, 2012 in his native Argentina, at the age of 62. His ashes were scattered in the waters of the Río de la Plata, according to his last wish, next to the Memory Park built to remember the desaparecidos of the National Reorganization Process.\n <a href=\"https://www.last.fm/music/Luis+Alberto+Spinetta\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
