{"artist":{"name":"Ashes To Ashes","mbid":"9653afd0-27af-40ff-ad60-caf1b79b18c5","url":"https://www.last.fm/music/Ashes+To+Ashes","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/816cd8b3ad60486387c319b5a3ea9e52.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/816cd8b3ad60486387c319b5a3ea9e52.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/816cd8b3ad60486387c319b5a3ea9e52.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/816cd8b3ad60486387c319b5a3ea9e52.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/816cd8b3ad60486387c319b5a3ea9e52.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/816cd8b3ad60486387c319b5a3ea9e52.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"3274","playcount":"28004"},"similar":{"artist":[{"name":"Taleteller","url":"https://www.last.fm/music/Taleteller","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/eb0f6c6e29cc475dc760eb748717bcaa.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/eb0f6c6e29cc475dc760eb748717bcaa.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/eb0f6c6e29cc475dc760eb748717bcaa.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eb0f6c6e29cc475dc760eb748717bcaa.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eb0f6c6e29cc475dc760eb748717bcaa.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eb0f6c6e29cc475dc760eb748717bcaa.png","size":""}]},{"name":"Black Daffodils","url":"https://www.last.fm/music/Black+Daffodils","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/29ff42467c6e44bf985e2dbf01653eaa.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/29ff42467c6e44bf985e2dbf01653eaa.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/29ff42467c6e44bf985e2dbf01653eaa.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29ff42467c6e44bf985e2dbf01653eaa.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29ff42467c6e44bf985e2dbf01653eaa.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29ff42467c6e44bf985e2dbf01653eaa.png","size":""}]},{"name":"Catafalque","url":"https://www.last.fm/music/Catafalque","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/16095b56d3754f1192d85c66f53fbc2c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/16095b56d3754f1192d85c66f53fbc2c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/16095b56d3754f1192d85c66f53fbc2c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/16095b56d3754f1192d85c66f53fbc2c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/16095b56d3754f1192d85c66f53fbc2c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/16095b56d3754f1192d85c66f53fbc2c.png","size":""}]},{"name":"Dimlight","url":"https://www.last.fm/music/Dimlight","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/de242f19683d4f45a511c106d8162f87.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/de242f19683d4f45a511c106d8162f87.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/de242f19683d4f45a511c106d8162f87.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/de242f19683d4f45a511c106d8162f87.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/de242f19683d4f45a511c106d8162f87.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/de242f19683d4f45a511c106d8162f87.png","size":""}]},{"name":"The Legion of Hetheria","url":"https://www.last.fm/music/The+Legion+of+Hetheria","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bc04cf3597544ae8ba3b75d0d413b577.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bc04cf3597544ae8ba3b75d0d413b577.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bc04cf3597544ae8ba3b75d0d413b577.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bc04cf3597544ae8ba3b75d0d413b577.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bc04cf3597544ae8ba3b75d0d413b577.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bc04cf3597544ae8ba3b75d0d413b577.png","size":""}]}]},"tags":{"tag":[{"name":"doom metal","url":"https://www.last.fm/tag/doom+metal"},{"name":"symphonic metal","url":"https://www.last.fm/tag/symphonic+metal"},{"name":"alternative metal","url":"https://www.last.fm/tag/alternative+metal"},{"name":"death metal","url":"https://www.last.fm/tag/death+metal"},{"name":"Gothic Metal","url":"https://www.last.fm/tag/Gothic+Metal"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Ashes+To+Ashes/+wiki"}},"published":"01 May 2007, 22:59","summary":"There are at least 3 artists known as Ashes to Ashes:\n\n1) Ashes to Ashes was formed in 1992 by Michael Stenberg (guitar), Björn Luna (bass), Kristian Johansen (drums) and T. Foshaug AKA Strange Gentle (vocals). The first recordings of the band were 4 songs done in October the same year and together with 2 more tracks recorded in December '93 the band shorthly thereafter released their first demo; \"Between the devil and the deep blue sea\". Two of the songs; \"Castle in the air\" and \"Cat's eye\" (Sacrilege) <a href=\"https://www.last.fm/music/Ashes+To+Ashes\">Read more on Last.fm</a>","content":"There are at least 3 artists known as Ashes to Ashes:\n\n1) Ashes to Ashes was formed in 1992 by Michael Stenberg (guitar), Björn Luna (bass), Kristian Johansen (drums) and T. Foshaug AKA Strange Gentle (vocals). The first recordings of the band were 4 songs done in October the same year and together with 2 more tracks recorded in December '93 the band shorthly thereafter released their first demo; \"Between the devil and the deep blue sea\". Two of the songs; \"Castle in the air\" and \"Cat's eye\" (Sacrilege), was re-arranged and re-written, and later appeared on Shapes of Spirits.\n\n\nIn February '95 the band once again entered the studio to record their second demo; \"Temples of ice\". The demo consisted of 3 tracks. Two of the tracks more or less appeared on Shapes of Spirits. The intro.; \"Glory lies ahead\" became the title track for Shapes of Spirits and the song; \"The mourning\", who was originally a guitar based song, was later re-arranged for piano. The last track; \"Despair\", had a really addictive riff which the band used at the end/fade-out of the title track for Cardinal VII. Both the aforementioned demos were made in 500 copies and sold out quite rapidly. Both demos received airplay in Norway and both were at some point the most requested at a local radio station in Oslo.\n\n\nLater in '95 a new singer, Bjorn Torbo, was recruited and the band continued rehearsing and writing. One of those songs were; \"Dying Room\" which also appeared on Shapes of Spirits. The verses on the original version was carried by piano and bass. Apart from that, the song pretty much ended up like it was originally. The band also did their first live performances that year. From late '96 to autumn '97, half of the group were busy with military services and the band was forced to take a most unwanted break.\n\n\nThe band regrouped in the spring of '98 and in the fall they began planning their self financed debut album, \"Shapes of Spirits\". An album intended for promotional use only. In addition to re-arranging and re-writing older material, they wrote new tracks like; \"Gabriel\", \"Divide & Conquer\" and \"Ad Infinitum\". With the completion of these songs the band took huge steps forward and the musical direction of the band was determined. Ashes to Ashes had found their identity as a band. Only weeks before the band entered the studio they recruited their new singer; Kenneth Brastad, after several auditions during the fall of '98 and Jan/Feb of '99. The recording and mixing took place at Gordon Studio with engineer Thomas Sörlie (Nocturnal Breed, 1349 +++) in the spring of '99. The basic tracks (rythm guitar, bass and drums) were recorded live, and the band used 40 hours, all in all, to complete the recording and mixing of the album. The mastering were done by Tom Kvälsvoll at Strype Audio in the fall of '99 and after some delay at the record plant, the CD was finally ready to be distributed in January '00.\n\n\nThe final result was an innovative and diverse blend of musical elements and included everything from classical music to heavy metal, with a strong focus and feel of the epic, atmosphere and haunting melodies. The album recieved airplay in such places as Nova Scotia and Indonesia and recieved excellent reviews in magazines and webzines worldwide. Check some of them out in the reviews section. Public demands for the CD were actually so big that a second and third pressing of the album had to be made. As you read this, there are only a couple of hundreds left of the fourth pressing. Not bad at all for something that was intended for the press and record companys alone. Keep in mind that the band had no distribution network and only one small vendor carried the album, who actually sold just a few copies, which made the achievement even bigger. The band received several offers from record companies but declined for a number of reasons. High spirited by the outstanding support from the underground, Michael Stenberg with partner in crime Björn Luna continued writing for a second album. The band wanted to maintain and develope their distinct and epic sound but also go for a more direct approach.\n\n\nThe band recorded demo's for; \"New world obscure\", \"Dualism\" and the title track \"Cardinal VII\" in the autumn of 2000 with engineer Per Amundsen, who also later engineered the album. This demo was sent to DVS Records and a record deal was secured after some months of negotiating. In October the guys parted ways with Kristian Johansen and started looking for a new drummer towards the spring of 2001, when the first recordings for the album began. The guys got in touch with Cato Bekkevold (ex- Red Harvest, currently with Sirius)who played on half of the drumtracks on the album. The arrangements and basic tracks were completed before the band entered EarAttack Studios for the recordings. They still wanted to have a new and fresh approach to the songs and keep some of the live feeling from their previous album. An example is the guitar solo in \"Truth on scaffold\", on which they used the first take. It was just a jam over the rhythm guitars while the engineer happened to roll the tape. Actually, most of the bass and guitars on the final version, are just the first and second takes. Ronny Kaasa was recruited as the new drummer in September and he did his half of the drumtracks before the mixing was completed the same month. The mastering were once again done by Tom Kvälsvoll at Strype Audio in October 2001.\n\n\nWith \"Cardinal VII\" the band has taken a overall more \"in your face\" approach and direction. There are more uptempo songs but there are also heavy grinding stuff like \"Truth on scaffold\" and a 'doom mixed with classical music and Gregorian singing'(!) number like \"Sic transit gloria mundi\". Classical music is even more present this time around. Lyrically the album is loosely based around the seven deadly sins. It's safe to say that Cardinal VII contains more of everything compared to \"Shapes of Spirits\". Ashes to Ashes still has managed to keep their identity intact and flawlessly combines different musical styles without ever coming across as inconsistent.\n\n\nThe band has recently recruited Zilla (Hagalaz Runedance, Paradigma) as their keyboardplayer and rehearsals for upcoming livedates this autumn has begun.\n\nOslo, June 9th, 2002 \n\n2) Ashes to Ashes was also an English Thrash band featuring ex-Treason vocalist John Seaton, they released  one self-titled 3-track demo in the early 90's then disapeared\n\n3) Ashes To Ashes is an alternative Metal band founded in Genova, Italy in 2010 by Marta Vassall (pianist/vocalist), Paolo Schiavi (lead guitarist) and Paolo Di Lorenzo (drummer).\n <a href=\"https://www.last.fm/music/Ashes+To+Ashes\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
