{"artist":{"name":"Mannheim Steamroller","mbid":"922a18b1-0aba-4868-8f38-2aa4f324fe16","url":"https://www.last.fm/music/Mannheim+Steamroller","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/35116ad22bf74907c9fe6826e6282426.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/35116ad22bf74907c9fe6826e6282426.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/35116ad22bf74907c9fe6826e6282426.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35116ad22bf74907c9fe6826e6282426.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35116ad22bf74907c9fe6826e6282426.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35116ad22bf74907c9fe6826e6282426.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"253457","playcount":"2622083"},"similar":{"artist":[{"name":"Trans-Siberian Orchestra","url":"https://www.last.fm/music/Trans-Siberian+Orchestra","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a1969b3da1814639ac1d9b5a49f93c39.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a1969b3da1814639ac1d9b5a49f93c39.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a1969b3da1814639ac1d9b5a49f93c39.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a1969b3da1814639ac1d9b5a49f93c39.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a1969b3da1814639ac1d9b5a49f93c39.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a1969b3da1814639ac1d9b5a49f93c39.png","size":""}]},{"name":"Jim Brickman","url":"https://www.last.fm/music/Jim+Brickman","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/929576fe50324bbe90348269058e7cc5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/929576fe50324bbe90348269058e7cc5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/929576fe50324bbe90348269058e7cc5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/929576fe50324bbe90348269058e7cc5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/929576fe50324bbe90348269058e7cc5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/929576fe50324bbe90348269058e7cc5.png","size":""}]},{"name":"Bing Crosby","url":"https://www.last.fm/music/Bing+Crosby","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/88a8a2245baf4a0d9f0f1a393c07754a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/88a8a2245baf4a0d9f0f1a393c07754a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/88a8a2245baf4a0d9f0f1a393c07754a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/88a8a2245baf4a0d9f0f1a393c07754a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/88a8a2245baf4a0d9f0f1a393c07754a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/88a8a2245baf4a0d9f0f1a393c07754a.png","size":""}]},{"name":"Vince Guaraldi Trio","url":"https://www.last.fm/music/Vince+Guaraldi+Trio","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e59c1f4cb9d640df9c67c468e70161bd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e59c1f4cb9d640df9c67c468e70161bd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e59c1f4cb9d640df9c67c468e70161bd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e59c1f4cb9d640df9c67c468e70161bd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e59c1f4cb9d640df9c67c468e70161bd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e59c1f4cb9d640df9c67c468e70161bd.png","size":""}]},{"name":"George Winston","url":"https://www.last.fm/music/George+Winston","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/314c2f3e5b864376bd36a80453594ccb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/314c2f3e5b864376bd36a80453594ccb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/314c2f3e5b864376bd36a80453594ccb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/314c2f3e5b864376bd36a80453594ccb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/314c2f3e5b864376bd36a80453594ccb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/314c2f3e5b864376bd36a80453594ccb.png","size":""}]}]},"tags":{"tag":[{"name":"instrumental","url":"https://www.last.fm/tag/instrumental"},{"name":"new age","url":"https://www.last.fm/tag/new+age"},{"name":"christmas","url":"https://www.last.fm/tag/christmas"},{"name":"Classical","url":"https://www.last.fm/tag/Classical"},{"name":"ambient","url":"https://www.last.fm/tag/ambient"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Mannheim+Steamroller/+wiki"}},"published":"04 Sep 2006, 17:58","summary":"Mannheim Steamroller actually began as an alias for record producer/composer Chip Davis. Before the fame of Steamroller, Davis had been best known for creating the country music character \"C.W. McCall\" (of \"Convoy\" fame) for his friend Bill Fries. And even before Davis \"made\" McCall a star, he produced an unusual album of classical music performed entirely by Davis and musical collaborator Jackson Berkey, using electric bass and synthesizers. Since no major label would handle its distribution <a href=\"https://www.last.fm/music/Mannheim+Steamroller\">Read more on Last.fm</a>","content":"Mannheim Steamroller actually began as an alias for record producer/composer Chip Davis. Before the fame of Steamroller, Davis had been best known for creating the country music character \"C.W. McCall\" (of \"Convoy\" fame) for his friend Bill Fries. And even before Davis \"made\" McCall a star, he produced an unusual album of classical music performed entirely by Davis and musical collaborator Jackson Berkey, using electric bass and synthesizers. Since no major label would handle its distribution, Davis founded his own music label, American Gramaphone (a play on the classical record label Deutsche Grammophon), to release the album. The result, Fresh Aire, was released in 1975 under the pseudonym Mannheim Steamroller, in the hopes of the album being a best seller. Fresh Aire II was subsequently released in 1977 and Fresh Aire III was released in 1979.\n\nMannheim Steamroller quickly grew into a full band, with Davis on drums, Berkey on keyboards, and Eric Hansen on bass and lute. Berkey's wife Almeda joined them onstage as another keyboardist. The London Symphony Orchestra appears on Fresh Aire V, Fresh Aire VI, and Fresh Aire 8.\n\nLater, Davis collaborated with guitarist/composer Mason Williams for a remake of the 1968 instrumental \"Classical Gas\", which used the original arrangement.\n\nBut it was beginning in 1984 that Steamroller found its greatest fame. Davis released his first holiday album, Mannheim Steamroller Christmas, featuring modern contemporary interpretations of Yuletide favorites. This was followed by A Fresh Aire Christmas (1988) and Christmas in the Aire (1995). Steamroller had now become one of the most requested Christmas music artists of all time. By the end of 1997, they had released a live album of Christmas music, Mannheim Steamroller Christmas Live. 2001 saw the release of another Christmas album, Christmas Extraordinaire.\n\nSteamroller had also developed a full-length theatrical motion picture based on their Christmas albums, but the plans fell through. Instead, the following year, they collaborated with Olivia Newton-John for yet another Christmas album, a mostly spoken-word recording called The Christmas Angel: A Family Story. In 2003 they released a CD entitled Halloween. Their latest Christmas album, Christmas Celebration, was released in 2004.\n\nIn addition to their Fresh Aire and Christmas collections, Steamroller has released an album of Disney music (1999's Mannheim Steamroller Meets the Mouse), one celebrating his American heritage (2003's American Spirit, which reunited Chip Davis with C.W. McCall and featured a remake of \"Convoy\"), and an album \"Yellowstone\" mixing prior Davis compositions and classical pieces by Ottorino Respighi.\n\nThe current lineup of the band is: Chip Davis (drums and percussion), Jackson Berkey (keyboards), Almeda Berkey (keyboards), Roxanne Layton (percussion and woodwinds), Ron Cooley (guitar and bass), Arnie Roth (strings), and Chuck Pennington (orchestra conductor).\n\n\nThe alias of composer Chip Davis, Mannheim Steamroller was among the pioneers of neo-classical electronic music, emerging as one of the driving forces behind the new age phenomenon. Born in Sylvania, OH, Davis' father was a high school music teacher, while his mother was a trombonist with Phil Spitalny's All Girl Orchestra. His grandmother was his first music teacher, giving the child his initial piano lessons at the age of four; two years later, Davis composed his first piece, a four-part chorale written in honor of his dog. He later joined a boys' choir as well, and while attending the University of Michigan, played bassoon in the school's concert band. Upon graduating in 1969, Davis was tapped to tour with the Norman Luboff Choir; after five years with the group, performing everything from pop to classical, he returned to Sylvania to teach music at the local junior high school, often adapting classical standards to contemporary harmonies and rhythms for student consumption. \n\n Davis later left teaching, arranging and conducting an Omaha, NB production of Hair before accepting a job writing advertising jingles. With co-worker Bill Fries, he created the enormously popular C.W. McCall character, later the figure behind the chart-topping hit \"Convoy.\" As the McCall craze went into high gear, however, Davis returned to the classical adaptations he'd first composed as a teacher, and soon entered the studio to begin recording what he dubbed \"18th century classical rock\" -- classical music performed on electric bass and synthesizers. He titled the resulting album Fresh Aire, and when no label would touch it, he founded his own company, American Gramaphone, in 1974, creating a fictitious band named Mannheim Steamroller to better promote the project. Davis initially marketed Fresh Aire to stereo show rooms, where his state-of-the-art sound proved ideal for demonstrating home stereo equipment; the LP became a smash hit among audiophiles, and a series of popular Fresh Aire sequels followed in the years to come. \n\n In 1984, Davis issued Mannheim Steamroller Christmas, which shocked onlookers by selling over five million copies on the strength of a Top 40 Adult Contemporary rendition of \"Deck the Halls.\" It was followed four years later by A Fresh Aire Christmas, another unqualified hit. The environment informed 1986's Saving the Wildlife, the soundtrack to a PBS special, and was followed three years later by Yellowstone: The Music of Nature, which raised over half a million dollars for the National Parks Service. Although in the early '90s Davis began recording under his own name for the first time, he also maintained the Mannheim Steamroller guise for a series of seasonal recordings, among them 1995's Christmas in the Aire, 1997's Christmas Live and 1998's Christmas Angel: A Family Story. 1999's two-disc 25 Years celebrated Mannheim Steamroller's silver anniversary. Continuing with their Fresh Aire series, volume eight was released in mid-2000. The albums Romantic Melodies and American Spirit came in 2003. ~ Jason Ankeny, Rovi\n <a href=\"https://www.last.fm/music/Mannheim+Steamroller\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
