{"artist":{"name":"Margaret Becker","mbid":"ed20b805-2e45-4ccb-838d-56cfb3947a4c","url":"https://www.last.fm/music/Margaret+Becker","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/253cb1d83c634677bb90ff9fe03591a3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/253cb1d83c634677bb90ff9fe03591a3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/253cb1d83c634677bb90ff9fe03591a3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/253cb1d83c634677bb90ff9fe03591a3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/253cb1d83c634677bb90ff9fe03591a3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/253cb1d83c634677bb90ff9fe03591a3.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"14432","playcount":"105566"},"similar":{"artist":[{"name":"Susan Ashton","url":"https://www.last.fm/music/Susan+Ashton","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cbbb74147bdb45de8d120c4e74637737.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cbbb74147bdb45de8d120c4e74637737.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cbbb74147bdb45de8d120c4e74637737.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cbbb74147bdb45de8d120c4e74637737.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cbbb74147bdb45de8d120c4e74637737.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cbbb74147bdb45de8d120c4e74637737.png","size":""}]},{"name":"Out Of The Grey","url":"https://www.last.fm/music/Out+Of+The+Grey","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/411be0fd6fd94fdba94c0491fee6f7b2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/411be0fd6fd94fdba94c0491fee6f7b2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/411be0fd6fd94fdba94c0491fee6f7b2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/411be0fd6fd94fdba94c0491fee6f7b2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/411be0fd6fd94fdba94c0491fee6f7b2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/411be0fd6fd94fdba94c0491fee6f7b2.png","size":""}]},{"name":"David Meece","url":"https://www.last.fm/music/David+Meece","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/56311377dc7f40d5925bf79d89e6f2de.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/56311377dc7f40d5925bf79d89e6f2de.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/56311377dc7f40d5925bf79d89e6f2de.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56311377dc7f40d5925bf79d89e6f2de.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56311377dc7f40d5925bf79d89e6f2de.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56311377dc7f40d5925bf79d89e6f2de.png","size":""}]},{"name":"Cindy Morgan","url":"https://www.last.fm/music/Cindy+Morgan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d055057b08bd4ba49f38135986123bac.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d055057b08bd4ba49f38135986123bac.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d055057b08bd4ba49f38135986123bac.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d055057b08bd4ba49f38135986123bac.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d055057b08bd4ba49f38135986123bac.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d055057b08bd4ba49f38135986123bac.png","size":""}]},{"name":"Wayne Watson","url":"https://www.last.fm/music/Wayne+Watson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d335c42c2e0744418ac9d654e4b6918d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d335c42c2e0744418ac9d654e4b6918d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d335c42c2e0744418ac9d654e4b6918d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d335c42c2e0744418ac9d654e4b6918d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d335c42c2e0744418ac9d654e4b6918d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d335c42c2e0744418ac9d654e4b6918d.png","size":""}]}]},"tags":{"tag":[{"name":"christian","url":"https://www.last.fm/tag/christian"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"christian pop","url":"https://www.last.fm/tag/christian+pop"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"easy listening","url":"https://www.last.fm/tag/easy+listening"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Margaret+Becker/+wiki"}},"published":"10 May 2007, 00:16","summary":"Margaret has been a singer-songwriter since 1987, with twenty number one singles, four Grammy Nominations, four Dove Awards, seven Songwriter of the Year awards, countless tours around the world and two books to her credit. Other Dreams have fared well. From her first number one single as a producer on another artist, Kelly Minter, This Is My Offering, to the successful launch of her own publishing company (Modernm –with placements on EMI, Provident, and Word), Becker has shown that chasing dreams can last a lifetime. <a href=\"https://www.last.fm/music/Margaret+Becker\">Read more on Last.fm</a>","content":"Margaret has been a singer-songwriter since 1987, with twenty number one singles, four Grammy Nominations, four Dove Awards, seven Songwriter of the Year awards, countless tours around the world and two books to her credit. Other Dreams have fared well. From her first number one single as a producer on another artist, Kelly Minter, This Is My Offering, to the successful launch of her own publishing company (Modernm –with placements on EMI, Provident, and Word), Becker has shown that chasing dreams can last a lifetime.\n\nMargaret Becker, an award-winning artist and the recipient of Europe's 2003 Lumiére du Monde Award for public service, equips the poets. The dreamers. The thinkers. She works to bring people together locally to fashion inspiration that changes humanity globally. Dubbed an iconoclast, a lightning rod and an anomaly, Margaret has spent her career encouraging and empowering persons seeking to work creatively to make a difference in the world. Though most came to know her through her music, it has been through the expanded opportunities of speaking, book writing and teaching that have allowed Margaret to continue to grow in her career as a leader.\n\nSharpening her role as a communicator, Margaret has spent the last few years expanding her emphasis as a keynote event speaker and workshop facilitator. She illustrates through her leadership the power of art to drive people toward deeper Christian faith, service and creativity. With vivacious personality and an exhorting manner, Margaret effectively calls people to greater awareness of themselves, but also regarding global concerns, such as the pandemic problem of AIDS and global poverty.\n\n\"A key element of what good art is to me is its ability to change people, to move them toward doing something they wouldn't normally do,\" she says. And that's what she hopes to achieve, for herself and those she encounters.\n\nShe started out as a recording artist, spending the preponderance of her career with EMI's Sparrow Records. Across 10 albums—and still counting—she's accumulated four Dove Awards, four Grammy nominations and 20 No. 1 radio hits. She's been named songwriter of the year by American Songwriter magazine, the same honor she's received seven times from the performance rights organization SESAC. Every honor is a cherished one for this prolific songwriter who sings with an enviable voice and fashions a presence that's at once humble and captivating.\n\nBut helping people achieve fulfilling lives drives her, and Margaret's leadership here is remarkable. She has dedicated herself, as a mentor and record producer, to leading young artists toward creative excellence. Further, Margaret has worked as a guest lecturer on the arts to the Gospel Music Association's Academy of Arts and serves on the boards of the Sparrow Foundation and of the East Nashville Center for the Creative Arts. She's the author of three books— the elegant memoir With New Eyes (Harvest House-1999), Growing Up Together (Harvest House-2000), and Braving the Elements: (RandomHouse/Waterbrook Press, 2004), which describes living from one personal gifts, outward. She's been tapped as a lecturer to university students, pastors, business leaders and congregations.\n\nAn entrepreneur, Margaret established her music publishing company, Modernm, in 2003, where Margaret's career also reached an unprecedented crescendo. For her extensive global advocacy work, the Convocation of Episcopal Churches in Europe awarded her the first-ever Lumiére du Monde Award. The phrase is French for \"light of the world,\" and the trophy honors a public figure using their platform to help make the world a better place. The Convocation recognized Margaret as one who communicates peace and justice hand-in-hand with her message of God's mercy. She's spoken out against apartheid in South Africa, railed against violence in Northern Ireland and pitched for decent and affordable housing in the United States, eventually linking arms with organizations like Compassion International and Habitat for Humanity.\n\nSince 1993 she's partnered with World Vision, a Seattle-based global relief agency, traveling to Third World countries to see firsthand the organization's work, then tirelessly serving as its spokesperson to thousands. While advocating individual child sponsorships, Margaret's worked extensively to promote World Vision's 30 Hour Famine, a program aimed at raising the consciousness of young people to the issue of poverty. Her involvement helped propel the program's participation level 400 percent during the first three years of her endorsement. She's recently invested still further in World Vision, embracing its Hope Child Initiative, a program coming alongside African children affected by the HIV/AIDS, and serves as a liaison to DATA (Debt, Trade, Aids, Africa) for grappling with the HIV/AID pandemic. Her efforts include meeting with Senator Bill Frist (R-TN) regarding AIDS and has worked to encourage President Bush to release the assistance he promised to Africa in 2003.\n\nMargaret recently conceived and launched on behalf of World Vision the Orange Fund, which is a fund that collects and distributes both money and resources to the areas most in need and least funded in the African AIDS crisis.\n\nHaving lived so much of her professional and spiritual life in public view, Margaret has gained unique credibility now enabling her to be a guide in people's lives.\n\nLike a lush tree where people rest on the strength of mature branches and find shelter under its broad leaves, it's Margaret's desire to help people find what they need from that nurturing place.\n\n\"To empower and encourage people.\" It's what she deems her life mission. And it seems that here, in her continuation of 17 years as a venerable public figure, she is doing just that. <a href=\"https://www.last.fm/music/Margaret+Becker\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
