{"artist":{"name":"Martin Denny","mbid":"186edc09-db32-4d4f-ba71-eed418630c83","url":"https://www.last.fm/music/Martin+Denny","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ff89d6912a6d4654ad4e29307a37c932.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ff89d6912a6d4654ad4e29307a37c932.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ff89d6912a6d4654ad4e29307a37c932.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ff89d6912a6d4654ad4e29307a37c932.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ff89d6912a6d4654ad4e29307a37c932.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ff89d6912a6d4654ad4e29307a37c932.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"106985","playcount":"1183060"},"similar":{"artist":[{"name":"Les Baxter","url":"https://www.last.fm/music/Les+Baxter","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8c226840443c437bbfb483c7282c3066.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8c226840443c437bbfb483c7282c3066.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8c226840443c437bbfb483c7282c3066.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8c226840443c437bbfb483c7282c3066.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8c226840443c437bbfb483c7282c3066.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8c226840443c437bbfb483c7282c3066.png","size":""}]},{"name":"Arthur Lyman","url":"https://www.last.fm/music/Arthur+Lyman","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/13d7860528234f27a4cb39170f37735e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/13d7860528234f27a4cb39170f37735e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/13d7860528234f27a4cb39170f37735e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/13d7860528234f27a4cb39170f37735e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/13d7860528234f27a4cb39170f37735e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/13d7860528234f27a4cb39170f37735e.png","size":""}]},{"name":"Esquivel","url":"https://www.last.fm/music/Esquivel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/68fabaa4ea7247f19f83bbddcc6fd29a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/68fabaa4ea7247f19f83bbddcc6fd29a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/68fabaa4ea7247f19f83bbddcc6fd29a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/68fabaa4ea7247f19f83bbddcc6fd29a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/68fabaa4ea7247f19f83bbddcc6fd29a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/68fabaa4ea7247f19f83bbddcc6fd29a.png","size":""}]},{"name":"Enoch Light","url":"https://www.last.fm/music/Enoch+Light","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/31298f3531594fb2800030f8262e24a6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/31298f3531594fb2800030f8262e24a6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/31298f3531594fb2800030f8262e24a6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31298f3531594fb2800030f8262e24a6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31298f3531594fb2800030f8262e24a6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31298f3531594fb2800030f8262e24a6.png","size":""}]},{"name":"Leroy Holmes","url":"https://www.last.fm/music/Leroy+Holmes","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/914f12ee2bc1d56bc458ff2770386ec1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/914f12ee2bc1d56bc458ff2770386ec1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/914f12ee2bc1d56bc458ff2770386ec1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/914f12ee2bc1d56bc458ff2770386ec1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/914f12ee2bc1d56bc458ff2770386ec1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/914f12ee2bc1d56bc458ff2770386ec1.png","size":""}]}]},"tags":{"tag":[{"name":"exotica","url":"https://www.last.fm/tag/exotica"},{"name":"lounge","url":"https://www.last.fm/tag/lounge"},{"name":"easy listening","url":"https://www.last.fm/tag/easy+listening"},{"name":"space age pop","url":"https://www.last.fm/tag/space+age+pop"},{"name":"tiki","url":"https://www.last.fm/tag/tiki"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Martin+Denny/+wiki"}},"published":"29 Mar 2006, 16:02","summary":"Martin Denny (born April 10, 1911 in New York City, NY, United States - died March 2, 2005 in Honolulu, Hawaii) was an American musician. He was universally known as the founder and reigning king of exotica music, a type of big band music with Latin rhythms and overtones of Pacific Ocean culture that is largely scorned by critics but was extremely popular in the 1950s and 1960s.\n \nMartin Denny's breakthrough album, Exotica, Denny described the music his combo plays as \"window dressing, a background\". <a href=\"https://www.last.fm/music/Martin+Denny\">Read more on Last.fm</a>","content":"Martin Denny (born April 10, 1911 in New York City, NY, United States - died March 2, 2005 in Honolulu, Hawaii) was an American musician. He was universally known as the founder and reigning king of exotica music, a type of big band music with Latin rhythms and overtones of Pacific Ocean culture that is largely scorned by critics but was extremely popular in the 1950s and 1960s.\n \nMartin Denny's breakthrough album, Exotica, Denny described the music his combo plays as \"window dressing, a background\". It is the perfect complement to the exotic setting of Hawaii. \"A lot of what I'm doing\", he stated in Incredibly Strange Music Volume 1, \"is just window dressing familiar tunes. I can take a tune like \"Flamingo\" and give it a tropical feel, in my style. In my arrangement of a Japanese farewell song, \"Sayonara\", I include a Japanese three stringed instrument, the shamisen. We distinguished each song by a different ethnic instrument, usually on top of a semi-jazz or Latin beat. Even though it remained familiar, each song would take on a strange, exotic character.\" Denny built a collection of strange and exotic instruments with the help of several airline friends. They would bring Denny back these instruments and he would build arrangements around them. His music was a combination of ethnic styles: South Pacific, the Orient and Latin rhythms. It is the music a lot of people believed came from the islands: a musical fantasy created by Denny.\n\nDuring an engagement at the Shell Bar, Denny discovered what would become his trademark and the birth of \"Exotica\". The bar had a very exotic setting: a little pool of water right outside the bandstand, rocks and palm trees growing around, very quiet and relaxed. As the group played at night, Denny became aware of bullfrogs croaking. The croaking blended with the music and when the band stopped, so did the frogs. Denny thought this to be a coincidence, but when he tried the tune again later, the same thing happened. This time, his bandmates began doing all sorts of tropical bird calls as a gag. The band thought it quite amusing, but nothing more than a joke. The next day, though, someone approached Denny and asked if he would do the arrangement with the birds and frogs. While at first he thought it was ridiculous, the more Denny thought about it, the more it made sense. At rehearsal, he had the band do \"Quiet Village\" with each doing a birdcall spaced apart.. Denny did the frog part on a grooved cylinder and the whole thing became incorporated into the arrangement. It caught on like wildfire and everyone wanted to hear \"Quiet Village\".\n\nThe seminal Exotica album was recorded in December of 1956, and released in 1957. In 1958, Dick Clark hosted Denny on American Bandstand. \"Quiet Village\" reached #2 on Billboard's charts in 1959 with the Exotica album reaching #1. He rode the charts of Cashbox and Variety also. Denny had as many as three or four albums on the charts simultaneously during his career. He also had national hits with \"A Taste of Honey\", \"The Enchanted Sea\", and \"Ebb Tide\".\n\nHe died in his home in Hawai'i Kai, Honolulu, on March 2nd, 2005, at the age of 93.\n\n\n\n(2) Martin Denny was born April 10, 1911 in New York City. A child prodigy, at age ten he studied piano under Lester Spitz and Isadore Gorn. For four years he toured South America with the Don Dean Orchestra, followed by a 43-month stint in the U.S. Air Force during World War II. Following his December 1945 discharge, Denny settled in Los Angeles, studying piano, composition, and orchestration at the Los Angeles Conservatory of Music. In early 1954 he relocated to Hawaii, contracting to appear at the Honolulu club Don the Beachcomber's. The following year Denny formed his own group, originally consisting of vibist Arthur Lyman, bassist John Kramer, and percussionist Augie Colón. In 1956, while appearing at steel and shipping magnate Henry Kaiser's Shell Bar -- a club inside the open-air Oahu resort Hawaiian Village, complete with a small pond adjacent to the stage -- the combo realized that the croaking of nearby bullfrogs blended perfectly with their tropical musical approach. On a lark, Colón also began imitating bird calls on-stage, much to the delight of the audience. Denny soon began incorporating South Pacific and Far East instruments into his arrangements as well, and by the time he recorded his Liberty Records debut, 1957's Exotica, his singular sound was firmly in place. \n\n The release of Exotica proved perfectly timed -- as the '50s drew to a close, tiki culture was all the rage in mainland America, with Hawaiian shirts a fashion trend and tiki torches a staple of backyard parties. Moreover, the evolution from mono to stereo recording and playback had taken root, and with its bird whistles, jungle calls, and far-flung instruments, the many distinctive components of Denny's sound were ideal for channel separation. Originally composed by Les Baxter, the instrumental \"Quiet Village\" was a massive success, earning Denny and his group an appearance on TV's American Bandstand, and the accompanying Exotica LP topped the Billboard charts. But ironically, even as his music came to embody Hawaiian culture and its mythical allure, Denny himself was no longer a fixture of the island musical culture -- after a bitter contract dispute with Kaiser, he brought his group stateside, and they made their first mainland appearance at the 1957 Pebble Beach Crosby Open golf tournament party. Soon after, Kaiser lured Lyman back to Hawaii to assume Denny's vacated spot headlining the Shell Bar; Denny replaced him with Julius Wechter. Likewise, Kramer was later replaced by Harvey Ragsdale, and a second percussionist, Harold Chang, was also added the lineup. \n\n For many listeners, the exotica craze proved short-lived, and Denny never again matched the success of \"Quiet Village,\" although subsequent singles including \"A Taste of Honey,\" \"The Enchanted Sea\" and \"Ebb Tide\" did find some favor on the pop charts. For connoisseurs, however, the story certainly does not end there. Denny continued making records in his trademark style throughout the '60s, many of them housed in eye-popping sleeves featuring model Sandy Warner, who was such a ubiquitous presence that she was even dubbed \"The Exotica Girl.\" (Warner eventually recorded her own LP, Fair and Warmer, with Denny himself authoring the liner notes.) While his interests in African and Pacific Rim musical traditions yielded concept records like Afro-Desia and Sayonara, other efforts turned towards more conventional easy listening, which Liberty dubbed his \"honey\" sound. For the most part, however, Denny remained a restless innovator. For Primitiva, he recorded using a number of gongs, drums, and odd brass instruments acquired from a Buddhist mountaintop temple in Burma by friend and filmmaker John Sturges, on location to shoot the Frank Sinatra vehicle None But the Brave. (According to legend, the instruments were then carried down the mountain by a procession of Buddhist monks.) For 1969's Exotic Moog, his Liberty swan song, Denny even embraced electronics, much to the chagrin of his dwindling fan base. \n\n With his recording career largely behind him, Denny maintained a busy touring schedule throughout the '70s and into the following decade. In 1985 he announced his retirement, settling in Hawaii with his longtime wife June, but three years later he grew restless, reuniting with Lyman, Colón, Chang, and adding bassist Archie Grant to return for a series of sold-out club dates. A Japanese tour yielded the live recording Exotica: The Best of Martin Denny. As the new decade began, he was the recipient of the Hawaiian Association of Music's Hoku Award for lifetime achievement; the honor coincided with the beginnings of an exotica/space age pop revival, and virtually overnight Denny's vintage LPs began disappearing from used record stores. He was also the subject a major CD reissue campaign on the Scamp label. Now a music icon for a new generation, Denny again returned to the road, making live appearances even into the 2000s. His last concert was held in Hawaii on February 13, 2005 at a benefit to aid tsunami victims. Just three weeks later on March 3, 2005 Martin Denny, icon and innovator, passed away at the age of 93. ~ Jason Ankeny, Rovi\n <a href=\"https://www.last.fm/music/Martin+Denny\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
