{"artist":{"name":"Matisyahu","mbid":"e8993e9d-9313-4447-ad23-791459a3790d","url":"https://www.last.fm/music/Matisyahu","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0e59e4596dc74cc1a75e1d8701dbd612.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0e59e4596dc74cc1a75e1d8701dbd612.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0e59e4596dc74cc1a75e1d8701dbd612.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0e59e4596dc74cc1a75e1d8701dbd612.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0e59e4596dc74cc1a75e1d8701dbd612.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0e59e4596dc74cc1a75e1d8701dbd612.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"784153","playcount":"18889727"},"similar":{"artist":[{"name":"SOJA","url":"https://www.last.fm/music/SOJA","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7bb27d845f59422faf17b963b7efd7f6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7bb27d845f59422faf17b963b7efd7f6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7bb27d845f59422faf17b963b7efd7f6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7bb27d845f59422faf17b963b7efd7f6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7bb27d845f59422faf17b963b7efd7f6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7bb27d845f59422faf17b963b7efd7f6.png","size":""}]},{"name":"Rebelution","url":"https://www.last.fm/music/Rebelution","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fa0317643b3248e78f3c4db36721031e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fa0317643b3248e78f3c4db36721031e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fa0317643b3248e78f3c4db36721031e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa0317643b3248e78f3c4db36721031e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa0317643b3248e78f3c4db36721031e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa0317643b3248e78f3c4db36721031e.png","size":""}]},{"name":"Damian Marley","url":"https://www.last.fm/music/Damian+Marley","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e138c40416ee4672c6b839f55f990f85.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e138c40416ee4672c6b839f55f990f85.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e138c40416ee4672c6b839f55f990f85.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e138c40416ee4672c6b839f55f990f85.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e138c40416ee4672c6b839f55f990f85.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e138c40416ee4672c6b839f55f990f85.png","size":""}]},{"name":"Gentleman","url":"https://www.last.fm/music/Gentleman","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b323c40a990e423e9c622a18fd7ed18a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b323c40a990e423e9c622a18fd7ed18a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b323c40a990e423e9c622a18fd7ed18a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b323c40a990e423e9c622a18fd7ed18a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b323c40a990e423e9c622a18fd7ed18a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b323c40a990e423e9c622a18fd7ed18a.png","size":""}]},{"name":"Ziggy Marley","url":"https://www.last.fm/music/Ziggy+Marley","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/78fdfa9d7e424ea792717f2a83d98287.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/78fdfa9d7e424ea792717f2a83d98287.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/78fdfa9d7e424ea792717f2a83d98287.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/78fdfa9d7e424ea792717f2a83d98287.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/78fdfa9d7e424ea792717f2a83d98287.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/78fdfa9d7e424ea792717f2a83d98287.png","size":""}]}]},"tags":{"tag":[{"name":"reggae","url":"https://www.last.fm/tag/reggae"},{"name":"jewish","url":"https://www.last.fm/tag/jewish"},{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"hasidic reggae","url":"https://www.last.fm/tag/hasidic+reggae"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Matisyahu/+wiki"}},"published":"13 Feb 2006, 16:36","summary":"Matisyahu (\"Gift of God\"), Hebrew stagename for Matthew Paul Miller ⋆ 30 June 1979 in West Chester, Pennsylvania, is a spiritually minded American-Jewish singer, beatboxer, singjay and songwriter. He grew up in White Plains, New York. His music is an interplay between reggae, rock, hip-hop, and reggae fusion. His debute studioalbum Shake Off the Dust... Arise was released 2004 and his latest, Akeda 2014. Well-known songs are King Without A Crown, One Day and Happy Hanukkah. <a href=\"https://www.last.fm/music/Matisyahu\">Read more on Last.fm</a>","content":"Matisyahu (\"Gift of God\"), Hebrew stagename for Matthew Paul Miller ⋆ 30 June 1979 in West Chester, Pennsylvania, is a spiritually minded American-Jewish singer, beatboxer, singjay and songwriter. He grew up in White Plains, New York. His music is an interplay between reggae, rock, hip-hop, and reggae fusion. His debute studioalbum Shake Off the Dust... Arise was released 2004 and his latest, Akeda 2014. Well-known songs are King Without A Crown, One Day and Happy Hanukkah. He sings mostly in English, more rarely in  Hebrew and Yiddish. He had an Hasidic appearance until 2011.\n\nKnown for blending traditional Jewish themes with Reggae, rock and hip hop sounds, Matisyahu is most recognizable for being an orthodox Jew and writing a number of songs based on his faith and beliefs. Since 2004, he has released four studio albums as well as one live album, two remix CDs and one DVD featuring a live concert, and a number of interviews. Through his short career, Matisyahu has teamed up with some of the biggest names in reggae production including Bill Laswell and duo Sly & Robbie. The Tel Aviv'n  Songfacts states several tracks of his fourth studio album, Spark Seeker, were recorded in Tel Aviv, Israel.\n\nSince his debut, Matisyahu has received positive reviews from both rock and reggae outlets. Most recently, he was named Top Reggae Artist of 2006 by Billboard as well as being named a spokesperson for Kenneth Cole.\n\nMatthew Miller was born in West Chester, Pennsylvania, USA on June 30th 1979, corresponding to the Jewish date of the 5th of Tamuz 5740. Shortly after his birth, the Miller family moved to Berkeley, CA and eventually settled in White Plains, NY. Growing up, Matisyahu's parents sent him to Hebrew School a couple of times a week, but like many kids, he resisted the additional school hours and was frequently threatened with expulsion for disrupting the lessons.\n\nBy the age of 14, Matthew Miller slid comfortably into the laid-back lifestyle of a teenage hippie. Having fallen in with the \"Dead-Head\" crowd, he grew dreadlocks and wore his Birkenstocks all winter long. He played his bongos in the lunchroom and learned how to beat-box in the back of class. By 11th grade, despite his carefree days, Matisyahu couldn't ignore the void in his life. After nearly burning down his chemistry class, he knew his mission must begin immediately. He decided to set off on a camping trip in Colorado. Away from his suburban life in White Plains, Matisyahu had the opportunity to take an introspective look at himself and contemplate his environment. It was there in the awe-inspiring landscape of the Rocky Mountains, that Matisyahu had an eye-opening realization: there is a God.\n\nAfter Colorado, his spiritual curiosity piqued and Matisyahu took his first trip to Israel. There, for the first time in his life, he felt a connection to the God he discovered in Colorado. Israel was a major turning point. Matisyahu relished the time he spent there, praying, exploring, and dancing in Jerusalem. In every nook he encountered, his dormant Jewish identity stirred into consciousness.\n\nLeaving Israel proved to be a difficult transition. Once back in White Plains, Matisyahu didn't know how to maintain his new connection with Judaism. Feeling dejected, he fatefully dropped out of high school and began following Phish on a national tour. On the road, Matisyahu thought seriously about his life, his music, and his thirst for Judaism.\n\nAfter a few months, burnt out and broke, he returned home. By this time his parents insisted that Matisyahu go and \"straighten\" himself out at a wilderness school in Bend, Oregon. The school encouraged artistic pursuits and Matisyahu took advantage of this time to delve further into his music. He studied up on reggae and hip-hop. He attended a weekly open-mic where he rapped, sang, beat-boxed, and did almost anything he could to stay creatively charged. It was then that he started to develop the unique reggae-hip hop sound for which he would one day become known.\n\nAfter 2 years in the \"sticks,\" the 19-year old Matisyahu returned to New York a changed man. He moved to the city to attend The New School where he continued honing his musical craft, and also dabbled in the theater. During this time, he happened on the Carlebach Shul, a synagogue on the Upper West Side, well known for its hippie-friendly vibe and exuberant singing. This encounter further fueled his soul-fire, turning him on to the mystical power of song in Hasidic Judaism. Now, instead of beat boxing in the back of the classroom, he was leaving the classroom to pray on the school's roof. (Religious or not, this guy ain't made for the classrooms.)\n\nWhile studying at New School, Matisyahu wrote a play entitled \"Echad\" (One). The play was about a boy who meets a Hasidic rabbi in Washington Square Park and through him becomes religious. Shortly after the play's performance, Matisyahu's life strangely imitated his art. Indeed, years after the initial sparks were lit, Matisyahu met a Lubavitcher rabbi in the park, spurring his transformation from Matthew to Matisyahu.\n\nA person who was once skeptical of authority and rules, Matisyahu began to explore and eventually fully take on the Lubavitch Hasidic lifestyle. He thrived on the discipline and structure of Judaism, making every attempt to abide by Jewish Law. The Chabad-Lubavitch philosophy proved to be a powerful guide for Matisyahu. It surrounded him with the spiritual dialogue and intellectual challenge he had been seeking for the past decade. The turmoil and frustration of his search subsided, and now, 2 years later, Matisyahu lives in Crown Heights, splitting his time between the stage and his yeshiva.\n\nDrawing from the sounds of Bob Marley, Shlomo Carlebach, Buju Banton, and Sizzla, yet remaining wholly original, Matisyahu's performance is an uplifting, powerful experience for all in his presence. Even the most pessimistic in his audience is inspired by his ability to so honestly convey such a delicate topic as faith/spirituality. It is his dedication to his belief and openness to others that compels one to respect his artistry and message. It's in that fleeting moment when our skepticism melts and our souls open up, that Matisyahu enters with his booming sound of faith.\n\nhttp://www.matisyahuworld.com/ <a href=\"https://www.last.fm/music/Matisyahu\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
