{"artist":{"name":"Maurice Chevalier","mbid":"e0371cd0-a5f8-420e-be17-bd980adc7393","url":"https://www.last.fm/music/Maurice+Chevalier","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/07e0da24e39f435e85f71930819ba1ce.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/07e0da24e39f435e85f71930819ba1ce.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/07e0da24e39f435e85f71930819ba1ce.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/07e0da24e39f435e85f71930819ba1ce.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/07e0da24e39f435e85f71930819ba1ce.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/07e0da24e39f435e85f71930819ba1ce.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"66577","playcount":"301052"},"similar":{"artist":[{"name":"Jean Sablon","url":"https://www.last.fm/music/Jean+Sablon","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3d96ee73083a4eebbdd515d7828bc323.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3d96ee73083a4eebbdd515d7828bc323.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3d96ee73083a4eebbdd515d7828bc323.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d96ee73083a4eebbdd515d7828bc323.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d96ee73083a4eebbdd515d7828bc323.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d96ee73083a4eebbdd515d7828bc323.png","size":""}]},{"name":"Charles Trenet","url":"https://www.last.fm/music/Charles+Trenet","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a693fa912ee04a72a411a424c39e7e7d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a693fa912ee04a72a411a424c39e7e7d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a693fa912ee04a72a411a424c39e7e7d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a693fa912ee04a72a411a424c39e7e7d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a693fa912ee04a72a411a424c39e7e7d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a693fa912ee04a72a411a424c39e7e7d.png","size":""}]},{"name":"Fréhel","url":"https://www.last.fm/music/Fr%C3%A9hel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9dc8735209be42edc231ab9cd4a2f2d0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9dc8735209be42edc231ab9cd4a2f2d0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9dc8735209be42edc231ab9cd4a2f2d0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9dc8735209be42edc231ab9cd4a2f2d0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9dc8735209be42edc231ab9cd4a2f2d0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9dc8735209be42edc231ab9cd4a2f2d0.png","size":""}]},{"name":"Tino Rossi","url":"https://www.last.fm/music/Tino+Rossi","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ed09d11bfd234222bffb1313db47f660.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ed09d11bfd234222bffb1313db47f660.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ed09d11bfd234222bffb1313db47f660.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed09d11bfd234222bffb1313db47f660.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed09d11bfd234222bffb1313db47f660.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed09d11bfd234222bffb1313db47f660.png","size":""}]},{"name":"Luis Mariano","url":"https://www.last.fm/music/Luis+Mariano","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e43d136b1e834a48961d973e04d7e0a5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e43d136b1e834a48961d973e04d7e0a5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e43d136b1e834a48961d973e04d7e0a5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e43d136b1e834a48961d973e04d7e0a5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e43d136b1e834a48961d973e04d7e0a5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e43d136b1e834a48961d973e04d7e0a5.png","size":""}]}]},"tags":{"tag":[{"name":"french","url":"https://www.last.fm/tag/french"},{"name":"chanson","url":"https://www.last.fm/tag/chanson"},{"name":"cabaret","url":"https://www.last.fm/tag/cabaret"},{"name":"oldies","url":"https://www.last.fm/tag/oldies"},{"name":"chanson francaise","url":"https://www.last.fm/tag/chanson+francaise"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Maurice+Chevalier/+wiki"}},"published":"18 Jul 2006, 14:57","summary":"Maurice Auguste Chevalier (September 12, 1888 – January 1, 1972) was a French actor, singer and entertainer. He is perhaps best known for his signature songs, including Louise, Mimi, Valentine, and Thank Heaven for Little Girls and for his films, including The Love Parade and The Big Pond. His trademark attire was a boater hat, which he always wore on stage with a tuxedo.\n\nChevalier was born in Paris. He made his name as a star of musical comedy <a href=\"https://www.last.fm/music/Maurice+Chevalier\">Read more on Last.fm</a>","content":"Maurice Auguste Chevalier (September 12, 1888 – January 1, 1972) was a French actor, singer and entertainer. He is perhaps best known for his signature songs, including Louise, Mimi, Valentine, and Thank Heaven for Little Girls and for his films, including The Love Parade and The Big Pond. His trademark attire was a boater hat, which he always wore on stage with a tuxedo.\n\nChevalier was born in Paris. He made his name as a star of musical comedy, appearing in public as a singer and dancer at an early age before working in four menial jobs as a teenager. In 1909, he became the partner of the biggest female star in France at the time, Fréhel. Although their relationship was brief, she secured him his first major engagement, as a mimic and a singer in l'Alcazar in Marseille, for which he received critical acclaim by French theatre critics. In 1917, he discovered jazz and ragtime and went to London, where he found new success at the Palace Theatre.\n\nAfter this, he toured the United States, where he met the American composers George Gershwin and Irving Berlin and brought Dédé to Broadway in 1922. He also developed an interest in acting, and had success in the operetta Dédé. When talkies arrived, he went to Hollywood in 1928, where he played his first American role in Innocents of Paris. In 1930, he was nominated for the Academy Award for Best Actor for his roles in The Love Parade (1929) and The Big Pond (1930), which secured his first big American hit, Livin' in the Sunlight, Lovin' in the Moonlight.\n\nIn 1957, he appeared in Love in the Afternoon, which was his first Hollywood film in more than 20 years. In the early 1960s, he made eight films, including Can-Can in 1960 and Fanny the following year. In 1970 he made his final contribution to the film industry where he sang the title song of the Disney film The Aristocats. He died in Paris, on January 1, 1972, aged 83.\n\n\nHe was born in Paris, France in 1888. His father was a house painter. His mother was of Belgian descent. Maurice made his name as a star of musical comedy, appearing in public as a singer and dancer at an early age.\n\nIt was in 1901 that he first began in show business at the age of 13. He was singing at a cafe for free when a well-known member of the theatre saw him and suggested that he try out for a local musical. He did so, and got the part. Chevalier got a name as an imitator and singer. His act in l' Alcazar in Marseille was so succesful he made a triumphant rearrival in Paris.\n\nIn 1909 he became the partner of the biggest female star in France at the time, Fréhel. However, due to her alcohol and drug addiction their liason ended in 1911. Chevalier then started a relationship with the 23 year old Mistinguett at the Folies Bergére; they would eventually play out a very public romance.\n[edit]\n\nWorld War I\n\nChevalier fulfilled his army service in 1913 and therefore couldn't escape the draft when in 1914 World War I broke out. He was shot in the back in the first weeks of combat and taken as war prisoner in Germany for two years. In 1916 he managed to escape due to Minstinguett's numerous relations.\n\nIn 1917 he became a star in le Casino de Paris and played before a public of English soldiers and Americans. He discovered jazz and ragtime and started thinking about touring in the United States. In prison camp he studied English and therefore had a certain advantage, compared with other French artists. He went to London where he met a new succes, even if he still sang in French.\n\n\nHollywood\n\nAfter the war Chevalier went back to Paris and created several famous songs who are still known this day, such as \"Valentine\" (1924). He played in a few pictures and made a huge impression in the operette, \"Dédé\". Here he met the American composers George Gerschwin and Irving Berlin and brought \"Dédé\" to Broadway in 1922. It was not a succes due to a mental breakdown.  A sad Chevalier returned to France where he tried to commit suicide in 1924, because of this failure. The same year he met Yvonne Vallée, a young dancer, who became his wife in 1927.\n\nWhen sound made it's entree in the film world, Chevalier returned to Hollywood in 1928 and this time he became very succesful. He signed a contract with Paramount and played his first American role in \"Innocents of Paris\". In 1930 Chevalier was nominated for the Academy Award for Best Actor, for two roles: The Love Parade and The Big Pond. He collaborated much with film director Ernst Lubitsch.\n\nIn 1934 he played in the operette La Veuve Joyeuse, one of his most well known films. He became one of the several big stars in Hollywood, very rare for French artists in these days. In 1935 he signed for MGM and returned to France later that year.\n\nIn 1937 he divorced from his wife and married with the dancer Nita Raya. He encountered several other succesful performances such as his revue \"Paris en Joie\" in the Casino de Paris. A year later he performed in \"Amours de Paris]]. His songs remained big hits, such as \"Prosper\" (1935), \"Ma Pomme\" (1936) and \"Ça fait d'excellents français\" (1939)\n\n\nWorld War II\n\nDuring World War I Chevalier kept performing for audiences, even German militaries. He admired Henri Pètain, who led the collaborating Vichy regime during the war. (It must be stated that many Frenchmen at that time admired Pétain for his victories in World War I.) He moved to Cannes where he and his jewish wife, Nita Raya, lived and from where he kept giving several performances.\n\nIn 1941 he performed a new revue in the Casino de Paris: \"Bonjour Paris\", which was another smash succes. Songs like \"Ça sent si bon la France\" and \"La Chanson du maçon\" became other new hits. The nazis asked Chevalier if he wanted to perform in Berlin and sing for the collaborating radio station Radio-Paris. He refused, but did give several performances in front of prisoners of war in Germany where he succeded in liberating 10 people in exchange.\n\nIn 1942 he returned to Bocca, near Cannes, but returned to the French capital city in september. In 1944 when the Allied forces freed France, Chevalier was accused of collaboration. Even though these claims were disputed and he was formally acquitted of these charges, the English speaking press remained very hostile and even refused to give him a visa for several years.\n[edit]\n\nAfter the War\n\nIn his own country, however, he was still very popular. In 1946 he divorced from Nita Raya and starting writing his memoires, who would be further completed over the years. He started to paint and collect things and acted in Le Silence est d' Or (1946) by René Clair. He still toured throughout the United States and other parts of the world and returned to France in 1948.\n\nIn 1949 he performed in Stockholm on a communist benefit against nuclear arms. (In 1944 he had already participated to a communist defilé in Paris). Anti-communist witch hunts in the US made him therefore persona non grata in this country during the early fifties.\n\nIn 1952 he bought a large proporty in Marnes-La-Coquette, Paris and named it \"La Louque\", as a hommage to his mother's nickname. He started a new relationship in 1952 with Janie Michels, a young divorced mother with three children. Being a painter herself she encouraged Chevalier's artistic hobby.\n\nIn 1954 Chevalier was welcomed back in the United States. His American success reappeared thanks to the film Ariane (1957) with Audrey Hepburn and Gary Cooper, by Billy Wilder. He rediscovered his popularity with new audiences, appearing in the movie musical, Gigi (1958) with Leslie Caron and Hermione Gingold, with whom he shared the song \"I Remember It Well\", and several Walt Disney films. The great success of Gigi prompted Hollywood to give him an Honorary Academy Award that same year for his lifetime achievements in the field of entertainment.\n\nAfter this he continued to perform in public and met celebrities such as Brigitte Bardot and Dwight Eisenhower.\n\nFinal Years\n\nChevalier continued to work up until very old age with impressive energy and enthusiasm. In the early sixties he toured thru the United States and between 1960 and 1963 he made eight films. When he returned to France he was invited by president Charles de Gaulle for a meal.\n\nIn 1965, at the age of 77 he made another world tour and visited again the US and other countries like South Africa. In 1967 he toured in Latin America, again the US, Europe and Canada.\n\nIn 1968, on October 1st, he announced his official farewell tour. Tired but nonetheless still able to entertain people he stopped twenty days later.\n\nIn 1970, he sang the title song of the Disney film The Aristocats. During a tour in the US he decided to stay there. However in December 1971 he got ill and had to be brought to the hospital.\n\nMaurice Chevalier died on January 1, 1972, aged 83, and was interred in the cemetery of Marnes la Coquette in Hauts-de-Seine, France. <a href=\"https://www.last.fm/music/Maurice+Chevalier\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
