{"artist":{"name":"Michael Whalen","mbid":"fdd978e6-6ced-4985-81c7-84db3ac7ce0b","url":"https://www.last.fm/music/Michael+Whalen","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/93db90c7b411483da22b3a1df5b8fe74.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/93db90c7b411483da22b3a1df5b8fe74.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/93db90c7b411483da22b3a1df5b8fe74.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/93db90c7b411483da22b3a1df5b8fe74.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/93db90c7b411483da22b3a1df5b8fe74.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/93db90c7b411483da22b3a1df5b8fe74.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"84991","playcount":"578379"},"similar":{"artist":[{"name":"Patrick O'Hearn","url":"https://www.last.fm/music/Patrick+O%27Hearn","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bb05a81535ed4deecdd7fa04cde0f450.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bb05a81535ed4deecdd7fa04cde0f450.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bb05a81535ed4deecdd7fa04cde0f450.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb05a81535ed4deecdd7fa04cde0f450.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb05a81535ed4deecdd7fa04cde0f450.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb05a81535ed4deecdd7fa04cde0f450.png","size":""}]},{"name":"Asian Zen Spa Music Meditation","url":"https://www.last.fm/music/Asian+Zen+Spa+Music+Meditation","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/96e4c4779c5a4878c8f9f27781ba1054.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/96e4c4779c5a4878c8f9f27781ba1054.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/96e4c4779c5a4878c8f9f27781ba1054.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/96e4c4779c5a4878c8f9f27781ba1054.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/96e4c4779c5a4878c8f9f27781ba1054.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/96e4c4779c5a4878c8f9f27781ba1054.png","size":""}]},{"name":"2002","url":"https://www.last.fm/music/2002","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/47422050e6864bf4b95db9479ebb8c74.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/47422050e6864bf4b95db9479ebb8c74.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/47422050e6864bf4b95db9479ebb8c74.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/47422050e6864bf4b95db9479ebb8c74.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/47422050e6864bf4b95db9479ebb8c74.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/47422050e6864bf4b95db9479ebb8c74.png","size":""}]},{"name":"Liquid Mind","url":"https://www.last.fm/music/Liquid+Mind","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f9f28840eb924aaa836e36551d00aa41.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f9f28840eb924aaa836e36551d00aa41.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f9f28840eb924aaa836e36551d00aa41.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9f28840eb924aaa836e36551d00aa41.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9f28840eb924aaa836e36551d00aa41.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9f28840eb924aaa836e36551d00aa41.png","size":""}]},{"name":"Michael Gettel","url":"https://www.last.fm/music/Michael+Gettel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/836af8065ffb486b98af8e2ee7143767.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/836af8065ffb486b98af8e2ee7143767.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/836af8065ffb486b98af8e2ee7143767.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/836af8065ffb486b98af8e2ee7143767.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/836af8065ffb486b98af8e2ee7143767.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/836af8065ffb486b98af8e2ee7143767.png","size":""}]}]},"tags":{"tag":[{"name":"new age","url":"https://www.last.fm/tag/new+age"},{"name":"piano","url":"https://www.last.fm/tag/piano"},{"name":"ambient","url":"https://www.last.fm/tag/ambient"},{"name":"contemporary classical","url":"https://www.last.fm/tag/contemporary+classical"},{"name":"Michael Whalen","url":"https://www.last.fm/tag/Michael+Whalen"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Michael+Whalen/+wiki"}},"published":"07 Feb 2008, 22:49","summary":"While you probably haven't heard Michael's music on the radio, you've undoubtedly heard his work in one of the literally thousands of commercials he scored for clients like Apple, Coca-Cola, Disney and Nike. But he's not just a composer-for-hire: Michael is also building a significant discography -- 22 CDs to date -- as a solo recording artist, working in pop, jazz, classical, electronic and those fascinating, unclassifiable spaces in between. Released in January of 2009 <a href=\"https://www.last.fm/music/Michael+Whalen\">Read more on Last.fm</a>","content":"While you probably haven't heard Michael's music on the radio, you've undoubtedly heard his work in one of the literally thousands of commercials he scored for clients like Apple, Coca-Cola, Disney and Nike. But he's not just a composer-for-hire: Michael is also building a significant discography -- 22 CDs to date -- as a solo recording artist, working in pop, jazz, classical, electronic and those fascinating, unclassifiable spaces in between. Released in January of 2009, “The Tree of Life” (Spout/MWM), is a free download of ambient compositions inspired by the awe-inspiring visits that he has made to the Redwood forests of central California. Also coming in 2009, “The Road of Ghosts”, a recording where Michael’s ambient, film scoring and classical voices meet together on the same project at the same time along with one new element - the boy can sing! Stay tuned for this one. Also coming, “Dancing in Black and White” - a collection of Michael’s best solo piano recordings. \n\nMichael manages to draw extraordinary performances from a wide range of artists who have joined him on his recording projects. On “Songs Without Words”, an album he produced for Windham Hill, Michael convinced several major songwriters and film/theatre composers to step out from behind the scenes and re-interpret their own work as instrumental solo-piano pieces. The resulting collection boasted a line-up of magical, one-of-a-kind tracks from such legends as Stephen Sondheim, Brian Wilson, Carole King, film composers Howard Shore and Michael Kamen, songwriter-to-the-stars Diane Warren and über-producer David Foster. It was a daunting task to assemble all this heavyweight talent for a single record, but that's business as usual for Michael, who can calmly juggle several amazing works-in-progress at once. Michael's fertile imagination and inquisitive mind are in full effect 24/7. He's not so much an impressively busy man as an artist possessed. It's been that way ever since the day a very young Michael Whalen walked into a movie theatre with his father, and then and there found his calling. \n\nAs he explains, \"The musical turning point of my life was hearing John Williams' 1972 score to “The Cowboys” [one of the last of John Wayne's last films, directed by Mark Rydell]. Even after so many years, I watch that movie with reverence and awe. Writing music for a genre like a western can be so full of cliches. His approach was so fresh while being true to the spirit and the needs of the film. The excitement and the themes of the movie made me listen to film music in a new way and piqued my interest -- even when I was just seven years old! At that moment, I decided I really had to do something that was involved with music and film. After hearing The Cowboys, all the great scores of the 1960's, 70s and 80s solidified my growing interest in this music into a passion.\" \n\nHe channeled his enthusiasm for music into hard work. During summer breaks from high school, Michael interned at suburban D.C. recording studios and found spots on sessions, sometimes in front of a mike as a player, other times behind the board. To finance his own basement studio as a college student, he \"started writing music for local commercials in Washington D.C. Eventually it occurred to me that working in television, film and advertising could be an area where I wouldn't have to limit the stylistic scope of my music and maybe I could start applying my love of film music into a career.\" By 1989, Michael had already come back in New York City with several dozen National commercials under his belt and had started a thriving business of his own. \n\nKey to Michael's success has been his love of collaboration - with his fellow performers, filmmakers and the assorted creative thinkers who get involved in his projects. Film/television composer's task, he knows, is to embellish someone else's vision while trying to create something musically he can call his own. For Michael, \"Scoring is about trust and relationships…The process of going back and forth with a client is about communication. Sometimes clients come to the studio and we run cues and get feedback on the spot. I enjoy that the most, and I think that clients enjoy the process of being 'hands on' with me.\" \n\nCollaboration is also essential to the more personal projects Michael is developing: his albums, his classical composing, and, especially, his boundary-pushing Music in the Dark series. A live event that he first produced in New York City in 2003, Music in the Dark is an improvised performance by Michael of acoustic and electronic music to accompany newly commissioned silent film shorts. The next installment is scheduled for June 2009. This is movie scoring at its most adventurous, a duet in real time between sound and image. Coming in 2009, Michael’s string of solo concert performances will continue. Michael also goes back to school as an adjunct professor at CCNY (City College of New York) and New York University. Does this guy sleep? \n\nBut, as we said before, you probably know him already. It's Michael Whalen's music that often keeps you glued to your television set. That causes your heart to swell in a darkened movie theater. That draws you closer to the radio. Our world moves to his melodies...Stay tuned for much, much more. <a href=\"https://www.last.fm/music/Michael+Whalen\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
