{"artist":{"name":"Atreyu","mbid":"17e137fb-59e5-4fd7-af48-afc34995396c","url":"https://www.last.fm/music/Atreyu","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ca00550e83854d97a7158e6cabb143b5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ca00550e83854d97a7158e6cabb143b5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ca00550e83854d97a7158e6cabb143b5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ca00550e83854d97a7158e6cabb143b5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ca00550e83854d97a7158e6cabb143b5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ca00550e83854d97a7158e6cabb143b5.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"1004325","playcount":"36700293"},"similar":{"artist":[{"name":"All That Remains","url":"https://www.last.fm/music/All+That+Remains","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5daea21b9ae108a365f3660ad67ef64d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5daea21b9ae108a365f3660ad67ef64d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5daea21b9ae108a365f3660ad67ef64d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5daea21b9ae108a365f3660ad67ef64d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5daea21b9ae108a365f3660ad67ef64d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5daea21b9ae108a365f3660ad67ef64d.png","size":""}]},{"name":"As I Lay Dying","url":"https://www.last.fm/music/As+I+Lay+Dying","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/69e76d9aec534dc589c0e276684c94dc.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/69e76d9aec534dc589c0e276684c94dc.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/69e76d9aec534dc589c0e276684c94dc.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/69e76d9aec534dc589c0e276684c94dc.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/69e76d9aec534dc589c0e276684c94dc.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/69e76d9aec534dc589c0e276684c94dc.png","size":""}]},{"name":"36 Crazyfists","url":"https://www.last.fm/music/36+Crazyfists","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/61fcd6da1c774b89b1806ec16e053538.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/61fcd6da1c774b89b1806ec16e053538.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/61fcd6da1c774b89b1806ec16e053538.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/61fcd6da1c774b89b1806ec16e053538.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/61fcd6da1c774b89b1806ec16e053538.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/61fcd6da1c774b89b1806ec16e053538.png","size":""}]},{"name":"Haste the Day","url":"https://www.last.fm/music/Haste+the+Day","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/27e8a5b541ea41bcafb4acfb006edb7c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/27e8a5b541ea41bcafb4acfb006edb7c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/27e8a5b541ea41bcafb4acfb006edb7c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/27e8a5b541ea41bcafb4acfb006edb7c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/27e8a5b541ea41bcafb4acfb006edb7c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/27e8a5b541ea41bcafb4acfb006edb7c.png","size":""}]},{"name":"Still Remains","url":"https://www.last.fm/music/Still+Remains","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b8e8fac91a339d56e27f1c70be36bb4d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b8e8fac91a339d56e27f1c70be36bb4d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b8e8fac91a339d56e27f1c70be36bb4d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8e8fac91a339d56e27f1c70be36bb4d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8e8fac91a339d56e27f1c70be36bb4d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8e8fac91a339d56e27f1c70be36bb4d.png","size":""}]}]},"tags":{"tag":[{"name":"metalcore","url":"https://www.last.fm/tag/metalcore"},{"name":"hardcore","url":"https://www.last.fm/tag/hardcore"},{"name":"metal","url":"https://www.last.fm/tag/metal"},{"name":"screamo","url":"https://www.last.fm/tag/screamo"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Atreyu/+wiki"}},"published":"12 Feb 2006, 16:12","summary":"Atreyu is a five-piece metalcore band from Orange County, California, United States that formed in 1998 and went on hiatus in 2011. They have since reformed in 2014 with preparations for a new album and resumed touring. The band consists of vocalist Alex Varkatzas, guitarists Dan Jacobs and Travis Miguel, bassist Marc McKnight and drummer and vocalist Brandon Saller. The band was originally named \"Retribution\" but, when they found out that another band from Hemet <a href=\"https://www.last.fm/music/Atreyu\">Read more on Last.fm</a>","content":"Atreyu is a five-piece metalcore band from Orange County, California, United States that formed in 1998 and went on hiatus in 2011. They have since reformed in 2014 with preparations for a new album and resumed touring. The band consists of vocalist Alex Varkatzas, guitarists Dan Jacobs and Travis Miguel, bassist Marc McKnight and drummer and vocalist Brandon Saller. The band was originally named \"Retribution\" but, when they found out that another band from Hemet, California had been using the name, they changed their name to Atreyu,\" after the character from the fantasy movie The Neverending Story (by Michael Ende) .\n\nHistory\n\nEarly Years\n\nAtreyu formed in sunny, bright Orange County, California back in 1998, originally under the name Retribution, but then changed their name to Atreyu, a fictional character from The Neverending Story because the band members at that time deemed the name more fitting to the band, and the fact that a band from Hemet, California had already taken the name.\n\nAtreyu's independent EP release, Visions was released somewhere between 1998 and 1999, and was sold at their live performances. Their second release, Fractures in the Facade of Your Porcelain Beauty was a short EP released by underground label Tribunal Records and featured tracks that would be re-worked in later releases. Atreyu signed with Victory Records in 2001, and their most critically acclaimed works would be to come from these releases.\n\nSuicide Notes and Butterfly Kisses\n\nIn 2001, Atreyu signed with Victory Records, who were famous for signing young, upstart metalcore bands and making them successful. In 2002, Atreyu released their first full-length release, Suicide Notes and Butterfly Kisses. The album was a smash-hit among critics and metalcore fans worldwide. The band's aggressive, raw riffs mixed with Alex Varkatzas's mind-blowing throat-led screams made the album a success. The band also introduced another singer, Brandon Saller, the drummer, who would become more prolific in their later releases, but in this album, his parts were most confined to choruses, and only in certain songs at that.\n\nCommercial Success (The Curse, A Death-Grip on Yesterday)\n\nAtreyu's second album, The Curse, was a radical departure from Suicide Notes and Butterfly Kisses, as the album had slightly more singing, and focused a lot more on song structure and deep, dark lyrics.. The album also had somewhat of a metal vibe, that only increased due to the song titles, lyrical subjects, and Victory Records' multitude of successful metalcore acts that came from that label. Despite Victory's history of metal bands, Atreyu still remained distant from anything emo and had much more of a dark and gothic feel.\n\nIn 2006, Atreyu released their third full-length LP, entitled A Death-Grip on Yesterday that helped further Atreyu's move towards the mainstream. The album was another musical change for Atreyu, yet remained too heavy for radio play, despite the hits Ex's And Oh's and The Theft. The album focused a bit more on a good balance of Brandon Saller's melodic singing vocals and Varkatzas's aggressive screaming, although Varkatzas' can be heard exploring a more melodic side of vocals. The album was met with positive reviews though, as IGN called the album \"A brief but potent hissy fit.\" [3]\n\nLead Sails Paper Anchor\n\nIn early 2007, Atreyu signed a record deal with Hollywood Records, and began to prepare their next album, Lead Sails Paper Anchor. The rumor was that Atreyu would continue in the more mainstream path A Death-Grip on Yesterday had taken them on account of the success of the short EP. In early 2007, Atreyu released a jigsaw puzzle on their website of sorts, as the goal was to put all the audio clips of their new single, Becoming the Bull into correct order, forming the whole song. The album leaked a few days before it's release, and in matter of no time, reviews came out that criticized the album, as the album itself features very little of Atreyu's once prolific, trademark screaming, in favor for more singing as a whole.  In 2009, they added Richmond, Indiana guitar player Craig Isaacs to the line-up because they felt it would re-connect them with their hardcore roots.\n\nTouring\n\nIn 2006, they went on tour with Every Time I Die, Chiodos, and From First to Last. They kicked From First To Last off of The World Championship Tour because the band's lead singer could not perform with them due to vocal nodules. From First To Last wanted to stay on the tour and Chiodos front man Craig Owens offered to fill in on vocals but Atreyu insisted that they could not stay on the tour. They also were on the Ozzfest 2006 second stage alongside Black Label Society, Norma Jean, Bad Acid Trip, Between The Buried And Me, Walls of Jericho, Full Blown Chaos, The Red Chord. As well as Taste Of Chaos 2006 with Deftones, As I Lay Dying, Dredg, Funeral For A Friend, Thrice, Silverstein, Story Of The Year, Thursday, Greeley Estates, The Receiving End Of Sirens, Millionaire, Adair, Broke, The Smashup, Pellican, Street Drum Corps, The Confession. They were featured on the Family Values Tour 2007 with Korn, Evanescence, Flyleaf, Trivium, Hellyeah and Neurosonic. After Family values, They were invited by Linkin Park to accompany them on the Projekt Revolution Tour, 2008 along with: Armor For Sleep, 10 Years, Hawthorn Heights, Street Drum Corps, Ashes Divide, The Bravery, Chris Cornell, and Linkin Park. They will embark on a Full US and EU tour carrying them into winter.\n\nAtreyu's fifth studio album, Congregation of the Damned, was released on October 27, 2009. The album, which was produced by Bob Marlette (Ozzy Osbourne, Airbourne) and mixed by Rich Costey (System of a Down, Rage Against the Machine), was said to be \"darker\" and \"heavier\" than the band's previous albums. Prior to release, the album was expected to contain heavier tracks such as \"You Were the King, Now You're Unconscious\" and \"Bleeding Is a Luxury,\" as well as slower songs such as \"Wait for You.\" According to lead singer Alex Varkatzas, the record is a \"mix of everything we've ever done. For every song that's more melodic or rock-driven there's a total shitkicker, and I think that's what makes us a well-rounded band.\"\n\nThe band started a co-headlining tour with Hollywood Undead, Escape The Fate and The Sleeping in October, and as promotion of album have debuted songs like \"Bleeding Is A Luxury\" at K-Rockathon 14 in New York State Fairgrounds, Syracuse, NY., and \"Gallows\". Atreyu has also promoted their new album in many other ways. For example, 5 webisodes, between September 1 to October 20 every two weeks, have been released advertising the album. They describe the album to \"Make more sense than the other ones because they finally realize what they are\".\nCongregation of The Damned debuted at #18 on the Billboard 200, selling 27,412 copies on its first week.\n\n2011:\nKerrang! posted:\n\nAtreyu have revealed that they have gone on hiatus. However, don't think that the Orange County metallers are breaking up.\n\nAn official statement from the band reads as follows:\n\n\"Hey all. You have asked, so here goes. Atreyu is taking a long, long break after 11 years of rocking. We aren't breaking up but we aren't writing recording or touring for a while. Simply taking a break to recharge and focus on different parts of our lives. Much love.\"\n\n\"All of us have other projects we are excited about and urge you to check them out if you miss us too much.\"\n\n\"Thanks to everyone who has supported us and given us a reason to exist over the past 11yrs. We hope to see you again 1 day. Until next time...\"\n\n2012:\nAtreyu drummer Brandon Saller has been busy with his project Hell Or Highwater, which released their debut LP Begin Again in August of 2011. Vocalist Alex Varkatzas has a project called I Am War with Bleeding Through vocalist Brandan Schieppati and are currently in the studio tracking material for their debut. Guitarist Travis Miguel has a project called Fake Figures with former Scars of Tomorrow bassist Bob Bradley and Hotwire vocalist Rus Martin, they released their debut EP Hail The Sycophants in December of 2011. \n\n2014:\nOn July 1, 2014, the band updated their Facebook page confirming the end of their hiatus and their plan to record new music and tour. They also made a new official website:\n\n\"Atreyu is pleased to announce we are making new music together and have plans to resume playing live again, starting with our main stage appearance at Aftershock on Sunday September 14th, 2014. \n\nThis is for the fans, this is for us, and this is for the music. \n\nLONG LIVE ATREYU\"\n\nBand members\n\nBrandon Saller - drums, vocals (1998-present)\nAlex Varkatzas - vocals (1998-present)\nDan Jacobs - guitar (1998-present)\nTravis Miguel - guitar (2001-present)\nCraig Isaacs - guitar, backup vocals (2009-present)\nMarc McKnight - bass, backup vocals (2002-present)\n\nFormer members\n\nChris Thompson — bass (2001–2003)\nKyle Stanley — bass (1998–2001)\nBryan O'Donnell — bass (1998)\n <a href=\"https://www.last.fm/music/Atreyu\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
