{"artist":{"name":"Mike Bloomfield","mbid":"1be2e508-905c-4d90-9bf2-7ab55f78b3e6","url":"https://www.last.fm/music/Mike+Bloomfield","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5a5bfca6e4464846c8153bb4067bcb6a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5a5bfca6e4464846c8153bb4067bcb6a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5a5bfca6e4464846c8153bb4067bcb6a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a5bfca6e4464846c8153bb4067bcb6a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a5bfca6e4464846c8153bb4067bcb6a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a5bfca6e4464846c8153bb4067bcb6a.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"54814","playcount":"348156"},"similar":{"artist":[{"name":"Pee Wee Crayton","url":"https://www.last.fm/music/Pee+Wee+Crayton","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7b7d9a7c919202952c2c3ccdba14c54a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7b7d9a7c919202952c2c3ccdba14c54a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7b7d9a7c919202952c2c3ccdba14c54a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b7d9a7c919202952c2c3ccdba14c54a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b7d9a7c919202952c2c3ccdba14c54a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b7d9a7c919202952c2c3ccdba14c54a.png","size":""}]},{"name":"Danny Gatton","url":"https://www.last.fm/music/Danny+Gatton","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6aa9556cd6bb48b0bd0cd96ce9c3e8ea.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6aa9556cd6bb48b0bd0cd96ce9c3e8ea.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6aa9556cd6bb48b0bd0cd96ce9c3e8ea.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6aa9556cd6bb48b0bd0cd96ce9c3e8ea.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6aa9556cd6bb48b0bd0cd96ce9c3e8ea.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6aa9556cd6bb48b0bd0cd96ce9c3e8ea.png","size":""}]},{"name":"Jimmy Dawkins","url":"https://www.last.fm/music/Jimmy+Dawkins","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ecd5d6a7414b41e7b4d1424effe8f065.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ecd5d6a7414b41e7b4d1424effe8f065.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ecd5d6a7414b41e7b4d1424effe8f065.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ecd5d6a7414b41e7b4d1424effe8f065.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ecd5d6a7414b41e7b4d1424effe8f065.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ecd5d6a7414b41e7b4d1424effe8f065.png","size":""}]},{"name":"The Paul Butterfield Blues Band","url":"https://www.last.fm/music/The+Paul+Butterfield+Blues+Band","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2e6b69c9516049c884af514a09f79bf7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2e6b69c9516049c884af514a09f79bf7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2e6b69c9516049c884af514a09f79bf7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2e6b69c9516049c884af514a09f79bf7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2e6b69c9516049c884af514a09f79bf7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2e6b69c9516049c884af514a09f79bf7.png","size":""}]},{"name":"Roy Buchanan","url":"https://www.last.fm/music/Roy+Buchanan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f5fc8feef64c442e87171cf7a2854db5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f5fc8feef64c442e87171cf7a2854db5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f5fc8feef64c442e87171cf7a2854db5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f5fc8feef64c442e87171cf7a2854db5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f5fc8feef64c442e87171cf7a2854db5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f5fc8feef64c442e87171cf7a2854db5.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"blues rock","url":"https://www.last.fm/tag/blues+rock"},{"name":"Chicago Blues","url":"https://www.last.fm/tag/Chicago+Blues"},{"name":"guitar","url":"https://www.last.fm/tag/guitar"},{"name":"classic rock","url":"https://www.last.fm/tag/classic+rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Mike+Bloomfield/+wiki"}},"published":"23 Nov 2007, 16:19","summary":"Michael Bernard Bloomfield was born July 28, 1943, in Chicago, Illinois. An indifferent student and self-described social outcast, Bloomfield immersed himself in the multi- cultural music world that existed in Chicago in the 1950s.\n\nHe got his first guitar at age 13. Initially attracted to the roots-rock sound of Elvis Presley and Scotty Moore, Bloomfield soon discovered the electrified big-city blues music indigenous to Chicago. At the age of 14 <a href=\"https://www.last.fm/music/Mike+Bloomfield\">Read more on Last.fm</a>","content":"Michael Bernard Bloomfield was born July 28, 1943, in Chicago, Illinois. An indifferent student and self-described social outcast, Bloomfield immersed himself in the multi- cultural music world that existed in Chicago in the 1950s.\n\nHe got his first guitar at age 13. Initially attracted to the roots-rock sound of Elvis Presley and Scotty Moore, Bloomfield soon discovered the electrified big-city blues music indigenous to Chicago. At the age of 14 the exuberant guitar wunderkind began to visit the blues clubs on Chicago’s South Side with friend Roy Ruby in search of his new heroes: players such as Muddy Waters, Otis Spann, Howling Wolf, and Magic Sam. Not content with viewing the scene from the audience, Bloomfield was known to leap onto the stage, asking if he could sit in as he simultaneously plugged in his guitar and began playing riffs.\n\nBloomfield was quickly accepted on the South Side, as much for his ability as for the audiences' appreciation of the novelty of seeing a young white player in a part of town where few whites were seen. Bloomfield soon discovered a group of like-minded outcasts. Young white players such as Paul Butterfield, Nick Gravenites, Charlie Musselwhite, and Elvin Bishop were also establishing themselves as fans who could hold their own with established bluesmen, many of whom were old enough to be their fathers.\n\nIn addition to playing with the established stars of the day, Bloomfield began to search out older, forgotten bluesmen, playing and recording with Sleepy John Estes, Yank Rachell, Little Brother Montgomery and Big Joe Williams, among others. By this time he was managing a Chicago folk music club, the Fickle Pickle, and often hired older acoustic blues players for the Tuesday night blues sessions. Big Joe Williams memorialized those times in the song \"Pick A Pickle\" with the line \"You know Mike Bloomfield...will always treat you right...come to the Pickle, every Tuesday night.\" Bloomfield’s relationship with Big Joe Williams is documented in \"Me And Big Joe,\" a moving short story detailing Bloomfield’s adventures on the road with Williams.\n\nBloomfield's guitar work as a session player caught the ear of legendary CBS producer and talent scout John Hammond, Sr., who flew to Chicago and immediately signed him to a recording contract. However CBS was unsure of exactly how to promote their new artist, declining to release any of the tracks recorded by Bloomfield's band, which included harp player Charlie Musselwhite.\n\nWith a contract but not much else, Bloomfield returned to playing clubs around Chicago until he was approached by Paul Rothchild, the producer of the Paul Butterfield Blues Band albums. Bloomfield was recruited to play slide guitar and piano on early recordings (later released as The Lost Elektra Sessions) which were rejected for not fully capturing the sound of the band. Although more competitors than friends (\"I knew Paul [and I] was scared of him\" remembered Mike), the addition of Bloomfield to the Butterfield Band provided Paul Butterfield with a musician of equal caliber -- Paul and Michael inspired and challenged each other as they traded riffs and musical ideas, one establishing a pattern and the other following it, extending it, and handing it back.\n\nIn between recording sessions with the Butterfield Band, Bloomfield backed up Bob Dylan on the classic Highway 61 Revisited album, and appeared with him at the Newport Folk Music Festival in 1965 when Dylan stunned the purist folk music crowd by playing electric rock-and-roll. Declining an offer from Dylan to join his touring band, Bloomfield and the Butter Band returned to the studio; with the addition of pianist Mark Naftalin they finally captured their live sound on vinyl.\n\nThe first two Butterfield Blues Band albums, the Dylan sessions, and the live appearances by the Butterfield Band firmly established Bloomfield as one of the most talented and influential guitar players in America. The second album featured the Bloomfield composition \"East-West\" which ushered in an era of long instrumental psychedelic improvisations.\n\nBloomfield left the Butterfield Blues Band in early 1967 ostensibly to give original guitarist Elvin Bishop, in Mike's words, \"a little space.\" Undoubtedly he had also become uncomfortable with Paul Butterfield's position as bandleader and was anxious to lead his own band.\n\nThat band, The Electric Flag, included Bloomfield's old friends from Chicago, organist Barry Goldberg and singer/songwriter Nick Gravenites, as well as bass player Harvey Brooks and drummer Buddy Miles. The band was well received at its official debut at the Monterey Pop Festival but quickly fell apart due to drugs, egos, and poor management.\n\nBloomfield, weary of the road, suffering from insomnia, and uncomfortable in the role of guitar superstar, returned to San Francisco to score movies, produce other artists, and play studio sessions. One of those sessions was a day of jamming in the studio with keyboardist Al Kooper, who had previously worked with Bloomfield on the 1965 Dylan sessions.\n\nSuper Session, the resultant release, with Bloomfield on side one and guitarist Stephen Stills on side two, once again thrust Bloomfield into the spotlight. Kooper's production and the improvisational nature of the recording session captured the quintessential Bloomfield sound: the fast flurries of notes, the incredible string bending, the precise attack, and his masterful use of tension and release.\n\nAlthough Super Session was the most successful recording of his career, Bloomfield considered it to be a scam, more of an excuse to sell records than a pursuit of musical goals. After a follow-up live album, he \"retired\" to San Francisco and lowered his visibility.\n\nIn the seventies Bloomfield played gigs in the San Francisco area and infrequently toured as Bloomfield And Friends, a group which usually included Mark Naftalin and Nick Gravenites. Bloomfield also occasionally helped out friends by lending his name to recording projects and business propositions, such as the ill-fated Electric Flag reunion in 1974 and the KGB album in 1976. In the mid-seventies Bloomfield recorded a number of albums with a more traditional blues focus for smaller record labels. He also recorded an instructional album of various blues styles for Guitar Player magazine.\n\nBy the late seventies Bloomfield's continuing drug and health problems caused erratic behavior and missed gigs, alienating a number of his old associates. Bloomfield continued playing with other musicians, including Dave Shorey and Jonathan Cramer. In the summer of 1980 he toured Italy with classical guitarist Woody Harris and cellist Maggie Edmondson. On November 15, 1980, Bloomfield joined Bob Dylan on stage at the Warfield Theater in San Francisco and jammed on \"Like A Rolling Stone,\" the song they had recorded together 15 years earlier.\n\nMichael Bloomfield was found dead in his car of a drug overdose in San Francisco, California on February 15, 1981. <a href=\"https://www.last.fm/music/Mike+Bloomfield\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
