{"artist":{"name":"Mississippi John Hurt","mbid":"802484e0-90de-4611-9fa4-f5ef0c7727b6","url":"https://www.last.fm/music/Mississippi+John+Hurt","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e780a5f336464e7a943990250582b93e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e780a5f336464e7a943990250582b93e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e780a5f336464e7a943990250582b93e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e780a5f336464e7a943990250582b93e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e780a5f336464e7a943990250582b93e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e780a5f336464e7a943990250582b93e.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"194700","playcount":"2119385"},"similar":{"artist":[{"name":"Mississippi Fred McDowell","url":"https://www.last.fm/music/Mississippi+Fred+McDowell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5507042d8dc44176a59b06858ae9ad3d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5507042d8dc44176a59b06858ae9ad3d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5507042d8dc44176a59b06858ae9ad3d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5507042d8dc44176a59b06858ae9ad3d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5507042d8dc44176a59b06858ae9ad3d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5507042d8dc44176a59b06858ae9ad3d.png","size":""}]},{"name":"Blind Willie McTell","url":"https://www.last.fm/music/Blind+Willie+McTell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2a57dd2de0344a648af8d53642786646.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2a57dd2de0344a648af8d53642786646.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2a57dd2de0344a648af8d53642786646.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a57dd2de0344a648af8d53642786646.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a57dd2de0344a648af8d53642786646.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a57dd2de0344a648af8d53642786646.png","size":""}]},{"name":"Skip James","url":"https://www.last.fm/music/Skip+James","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e0bb2966a4b744bb85b2d6499c64f5cf.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e0bb2966a4b744bb85b2d6499c64f5cf.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e0bb2966a4b744bb85b2d6499c64f5cf.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0bb2966a4b744bb85b2d6499c64f5cf.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0bb2966a4b744bb85b2d6499c64f5cf.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0bb2966a4b744bb85b2d6499c64f5cf.png","size":""}]},{"name":"Big Bill Broonzy","url":"https://www.last.fm/music/Big+Bill+Broonzy","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/85df90b3835e4c439aea7bf725bfb312.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/85df90b3835e4c439aea7bf725bfb312.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/85df90b3835e4c439aea7bf725bfb312.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85df90b3835e4c439aea7bf725bfb312.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85df90b3835e4c439aea7bf725bfb312.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85df90b3835e4c439aea7bf725bfb312.png","size":""}]},{"name":"Reverend Gary Davis","url":"https://www.last.fm/music/Reverend+Gary+Davis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/62a4b43ee89d4899b3c882050ccc6aa0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/62a4b43ee89d4899b3c882050ccc6aa0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/62a4b43ee89d4899b3c882050ccc6aa0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/62a4b43ee89d4899b3c882050ccc6aa0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/62a4b43ee89d4899b3c882050ccc6aa0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/62a4b43ee89d4899b3c882050ccc6aa0.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"delta blues","url":"https://www.last.fm/tag/delta+blues"},{"name":"folk","url":"https://www.last.fm/tag/folk"},{"name":"Classic Blues","url":"https://www.last.fm/tag/Classic+Blues"},{"name":"acoustic","url":"https://www.last.fm/tag/acoustic"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Mississippi+John+Hurt/+wiki"}},"published":"15 Feb 2006, 07:14","summary":"John Smith Hurt, better known as Mississippi John Hurt (July 3, 1893 or March 8, 1892 - November 2, 1966) was an American country blues singer and guitarist.\n\nRaised in Avalon, Mississippi, Hurt taught himself how to play the guitar around age nine. Singing to a melodious finger-picked accompaniment, he began to play local dances and parties while working as a sharecropper. He first recorded for Okeh Records in 1928, but these were commercial failures. <a href=\"https://www.last.fm/music/Mississippi+John+Hurt\">Read more on Last.fm</a>","content":"John Smith Hurt, better known as Mississippi John Hurt (July 3, 1893 or March 8, 1892 - November 2, 1966) was an American country blues singer and guitarist.\n\nRaised in Avalon, Mississippi, Hurt taught himself how to play the guitar around age nine. Singing to a melodious finger-picked accompaniment, he began to play local dances and parties while working as a sharecropper. He first recorded for Okeh Records in 1928, but these were commercial failures. Hurt then drifted out of the recording scene, and he continued his work as a farmer. Tom Hoskins, a blues enthusiast, would be the first to locate Hurt in 1963. He convinced Hurt to relocate to Washington, D.C., where he was recorded by the Library of Congress in 1964. This rediscovery helped further the American folk music revival, which had led to the rediscovery of many other bluesmen of Hurt's era. Hurt entered the same university and coffeehouse concert circuit as his contemporaries, as well as other Delta blues musicians brought out of retirement. As well as playing concerts, he recorded several studio albums for Vanguard Records.\n\nBorn John Smith Hurt in Teoc, Carroll County, Mississippi (there is confusion about his date of birth, but the grave marker mentions March 8, 1892) and raised in Avalon, Mississippi, he learned to play guitar at age nine. He was completely self-taught, stealthily playing the guitar of a friend of his mother's, who often stayed at the Hurt home while courting a lady who lived near by. His style was not reminiscent of any other style being played at the time; it was the way Hurt \"thought the guitar should sound\". He spent much of his youth playing old time music for friends and dances, earning a living as a farmhand into the 1920s. His fast, highly syncopated style of playing made his music adept for dancing. On occasion, a medicine show would come through the area; Hurt recalls being wanted by one of them. \"One of them wanted me, but I said no because I just never wanted to get away from home.\" In 1923 he partnered with the fiddle player Willie Narmour as a substitute for his regular partner Shell Smith.\n\nWhen Narmour got a chance to record for Okeh Records as a prize for winning first place in a 1928 fiddle contest, he recommended Hurt to Okeh Records producer Tommy Rockwell. After auditioning \"Monday Morning Blues\" at his home, he took part in two recording sessions, in Memphis and New York City (see Discography below). While in Memphis, Hurt recalled seeing \"many, many blues singers ... Lonnie Johnson, Blind Lemon Jefferson, Bessie Smith, and lots, lots more.\" Hurt described his first recording session as such:\n... a great big hall with only the three of us in it: me, the man [Rockwell], and the engineer. It was really something. I sat on a chair, and they pushed the microphone right up to my mouth and told me that I couldn't move after they had found the right position. I had to keep my head absolutely still. Oh, I was nervous, and my neck was sore for days after.\nHurt attempted further negotiations with Okeh to record again, but after the commercial failure of the resulting records, and Okeh Records going out of business during the Great Depression, Hurt returned to Avalon and obscurity, working as a sharecropper and playing local parties and dances.\n\nAfter Hurt's renditions of \"Frankie\" and \"Spike Driver Blues\" were included in The Anthology of American Folk Music in 1952, and an Australian man discovered a copy of \"Avalon Blues\", there became increased interest in finding Hurt himself. In 1963, a folk musicologist, Tom Hoskins, supervised by Richard Spottswood, was able to locate Hurt near Avalon, Mississippi using the lyrics of \"Avalon Blues\":\nAvalon, my home town, always on my mind/Avalon, my home town.\nWhile in Avalon, Hoskins convinced an apprehensive Hurt to perform several songs for him, to ensure that he was genuine. Hoskins was convinced, and seeing that Hurt's guitar playing skills were still intact, Hoskins encouraged him to move to Washington, D.C., and begin performing on a wider stage. His performance at the 1964 Newport Folk Festival saw his star rise amongst the new folk revival audience. Before his death he played extensively in colleges, concert halls, coffee houses and also on The Tonight Show Starring Johnny Carson, as well as recording three further albums for Vanguard Records. Much of his repertoire was recorded for the Library of Congress, also. His fans particularly liked the ragtime songs \"Salty Dog\" and \"Candy Man\", and the blues ballads \"Spike Driver Blues\" (a variant of \"John Henry\") and \"Frankie\".\nHurt incorporated a fast, pick-less, syncopated fingerpicking style that he taught himself. He was influenced by very few people; but did recall an elderly, unrecorded, blues singer from that area, Rufus Hanks, who played twelve-string guitar and harmonica. He also recalled listening to the country singer Jimmie Rodgers. On occasion, Hurt would use an open tuning and a slide, as he did in his arrangement of \"The Ballad of Casey Jones\".\nHurt's influence spanned several music genres including blues, country, bluegrass, folk and contemporary rock and roll. A soft-spoken man, his nature was reflected in the work, which consisted of a mellow mix of country, blues and old time music.\nMaterial recorded by Hurt has been re-released by many record labels over the years (see discography); and his influence has extended over many generations of guitarists. Songs recorded by Hurt have been covered by Bob Dylan, Jerry Garcia, Beck, Doc Watson, John McCutcheon, Taj Mahal, Bruce Cockburn, David Johansen, Bill Morrissey and Gillian Welch.\nHurt died on November 2nd, 1966, of a heart attack in Grenada, Mississippi.\n\nThere is now a memorial in Avalon, Mississippi for Mississippi John Hurt. It is parallel to RR2, the rural road on which he grew up.\nAmerican singer-songwriter Tom Paxton, who met Hurt and played on the same bill as him at the Gaslight in Greenwich Village around 1963, wrote and recorded a song about him in 1977 entitled \"Did You Hear John Hurt?\" Paxton still frequently plays this song at his live performances.\nThe first track of John Fahey's 1968 solo acoustic guitar album Requia is entitled \"Requiem For John Hurt\". Fahey's posthumous live album The Great Santa Barbara Oil Slick also features a version of the piece, there entitled \"Requiem For Mississippi John Hurt\".\nBritish folk/blues artist Wizz Jones recorded a tribute song called \"Mississippi John\" for his 1977 album Magical Flight.\n\n <a href=\"https://www.last.fm/music/Mississippi+John+Hurt\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
