{"artist":{"name":"Mitch Ryder","mbid":"b1d8fd63-45b2-4f13-a369-78b0a91eb7d3","url":"https://www.last.fm/music/Mitch+Ryder","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0e7e94c676894ab9aa7fe829bbf3b80f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0e7e94c676894ab9aa7fe829bbf3b80f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0e7e94c676894ab9aa7fe829bbf3b80f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0e7e94c676894ab9aa7fe829bbf3b80f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0e7e94c676894ab9aa7fe829bbf3b80f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0e7e94c676894ab9aa7fe829bbf3b80f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"30967","playcount":"110351"},"similar":{"artist":[{"name":"The J. Geils Band","url":"https://www.last.fm/music/The+J.+Geils+Band","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c837bfd9e51c43588c72907054d0d091.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c837bfd9e51c43588c72907054d0d091.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c837bfd9e51c43588c72907054d0d091.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c837bfd9e51c43588c72907054d0d091.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c837bfd9e51c43588c72907054d0d091.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c837bfd9e51c43588c72907054d0d091.png","size":""}]},{"name":"Eric Burdon","url":"https://www.last.fm/music/Eric+Burdon","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0fbc074afad5484daa7c379cd1cdc9ac.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0fbc074afad5484daa7c379cd1cdc9ac.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0fbc074afad5484daa7c379cd1cdc9ac.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0fbc074afad5484daa7c379cd1cdc9ac.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0fbc074afad5484daa7c379cd1cdc9ac.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0fbc074afad5484daa7c379cd1cdc9ac.png","size":""}]},{"name":"Southside Johnny & The Asbury Jukes","url":"https://www.last.fm/music/Southside+Johnny+&+The+Asbury+Jukes","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ddf2abf6f56344729c543d149e3d9da5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ddf2abf6f56344729c543d149e3d9da5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ddf2abf6f56344729c543d149e3d9da5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ddf2abf6f56344729c543d149e3d9da5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ddf2abf6f56344729c543d149e3d9da5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ddf2abf6f56344729c543d149e3d9da5.png","size":""}]},{"name":"The Grass Roots","url":"https://www.last.fm/music/The+Grass+Roots","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a323456f8ffa43808bcfc8f495ff311a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a323456f8ffa43808bcfc8f495ff311a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a323456f8ffa43808bcfc8f495ff311a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a323456f8ffa43808bcfc8f495ff311a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a323456f8ffa43808bcfc8f495ff311a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a323456f8ffa43808bcfc8f495ff311a.png","size":""}]},{"name":"Paul Revere & The Raiders","url":"https://www.last.fm/music/Paul+Revere+&+The+Raiders","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e68078b5fc674c4ba0943e5a250c6355.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e68078b5fc674c4ba0943e5a250c6355.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e68078b5fc674c4ba0943e5a250c6355.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e68078b5fc674c4ba0943e5a250c6355.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e68078b5fc674c4ba0943e5a250c6355.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e68078b5fc674c4ba0943e5a250c6355.png","size":""}]}]},"tags":{"tag":[{"name":"classic rock","url":"https://www.last.fm/tag/classic+rock"},{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"60s","url":"https://www.last.fm/tag/60s"},{"name":"70s","url":"https://www.last.fm/tag/70s"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Mitch+Ryder/+wiki"}},"published":"28 Jan 2008, 17:09","summary":"High octane, turbo, high performance, super charged MITCH RYDER & The Detroit Wheels didn't need to hail from the Motor City for those adjectives to be tossed their way, but it was certainly appropriate that they called Motown home. It was Mitch and The Wheels who served as the musical bridge between the Motown soul factory and the high energy, take no prisoners rock 'n' roll that would roar out of Detroit via Iggy & The Stooges, MC5, Ted Nugent and Bob Seger. <a href=\"https://www.last.fm/music/Mitch+Ryder\">Read more on Last.fm</a>","content":"High octane, turbo, high performance, super charged MITCH RYDER & The Detroit Wheels didn't need to hail from the Motor City for those adjectives to be tossed their way, but it was certainly appropriate that they called Motown home. It was Mitch and The Wheels who served as the musical bridge between the Motown soul factory and the high energy, take no prisoners rock 'n' roll that would roar out of Detroit via Iggy & The Stooges, MC5, Ted Nugent and Bob Seger. With Ryder, it wasn't attitude or public outrage or politics that generated the charge you could simply hear it in the music. \n\nRyder hit during the mid-'60s when AM radio was going through a golden era courtesy of Motown, Stax, the British Invasion, Aretha, JB, and any number of garage band one-hit wonders. But no one on the radio then could match Mitch and company for pure visceral excitement, no one else could make the hair stand up on the back of your neck and a wild-eyed gleam creep into your eyes because you just know that SOMETHING WAS GOING TO HAPPEN. The explosive quality was there from the very start. Listen to the way the chords introducing \"Jenny Take A Ride\" are chomping at the bit to swoop down into the double-time mid-section, or how John Badanjek's thundering bass drum trigger's the ecstatic roll that kicks off \"Devil With A Blue Dress On\". And the Wheels must have known what they had witness the confidence-even cockiness-of telegraphing their punch forever on \"Little Latin Lupe Lu\", building expectations to fever pitch before hammering down the riff with Jim McCarty's lead lick trailing behind. And nailing it big time. One punch, KO, Mike Tyson-style. The records worked because they perfectly captured the kinetic frenzy of the live performances that had been the group's stock in trade since they first joined forces in Detroit early in 1964. \n\nBorn William Levise, Jr., Ryder was performing as Billy Lee in a high school band called Tempest before turning heads in a black Detroit soul club called the Village. At 17, he was skilled enough to record an R&B single (\"That's The Way It's Going To Be/Fool For You\") for the Detroit gospel label Carrie in 1962 and to start making gigs fronting The Peps, a black vocal trio. Levise was appearing with The Peps at the Village early in 1964 when he ran across a group that included McCarty, bassist Earl Elliot, and Badanjek. Together with rhythm guitarist Joe Kubert, they joined forces as Billy Lee & The Rivieras and by mid-summer had attracted a fanatical local following that caught the ear of Motor City DJ Bob Prince. \n\nPrince began booking Lee & The Rivieras as an opening act at a club/casino north of Detroit, but their live performances were so potent that the unrecorded group was soon headlining over major Motown artists. Prince then arranged for The Rivieras to record a tape in Badanjek's basement, and that demo brought 4 Seasons producer Bob Crewe to a Detroit performance where The Rivieras opened for The Dave Clark Five. They torched the hometown audience for 90 minutes, Crewe was hooked, and in February, 1965, the five Detroit teenagers relocated to New York City and bided their time for a few months playing Greenwich Village clubs for survival money. The name was the first to go (a conflict with The Rivieras who recorded \"California Sun\"), hence the legendary story of Lee/Levise flipping through the Manhattan phone directory and coming across the name Mitch Ryder. The Rivieras became The Detroit Wheels and album cover photos of the band on top of oil cans or surrounded by discarded tires punched the automotive image home. \n\nWhat followed was a wild two-year ride trough the starmaking machinery of the record industry that brought them fame but no fortune and tore the group apart in the process. Not that the first Mitch Ryder & The Detroit Wheels single, \"I Need Help\", exactly set the charts afire. That waited until late 1965 when \"Jenny Take A Ride!\" climbed to #10 as The Wheels welded Chuck Willis' \"C.C. Rider\" to Little Richard's \"Jenny, Jenny\", and cannily tossed in an advertisement for their live show along the way (check how the backing vocals change to \"See Mitch Ryder\" during the second verse). \"Little Latin Lupe Lu\" cemented their commercial appeal when it reached #17 and set the general outline of the band's most popular sound- an R&B standard or two revved up, Wheels-style, with Mitch's peerless soul shouting ripping away over the top. That approach bordered on becoming a formula, particularly after \"Break Out\", the first attempt at a bigger, brassier sound, only made it to #62 and the ballad \"Takin' All I Can Get\" barely cracked the Top 100.\n\n Late in 1966, the \"Devil With A Blue Dress On\" & \"Good Golly Miss Molly\" medleys exploded over the airwaves and indelibly stamped the high energy Mitch Ryder & The Detroit Wheels sound on anyone within an earshot as they hit #4 on the charts. Which was a shame, really, because the albums kept showing other dimensions of Ryder's skills as an interpretive singer. Certainly, tracks like \"Shakin With Linda\", \"Shake A Tail Feather\", \"Just A Little Bit\", and \"Sticks And Stones\", fits The Wheels mold to a tee. But, \"I Like It Like That\" spotlighted Ryder's ability to tone down for the kind of slow-drag, New Orleans R&B that emphasized his smooth delivery and immaculate phrasing. And he showed real signs as a midnight rambler songwriter on \"I Had It Made\" (musically, a thinly veiled re-write of James Brown's \"Out Of Sight\") and the intriguing \"Baby Jane\", which sounds like a bizarre but happening cross of Sir Douglas Quintet and Velvet Underground. Early in 1967, prototypical, riff-rockin \"Sock It To Me-Baby!\" became Ryder's final Top 10 single, despite being banned on several stations for being too sexually suggestive.\n\n The brassy \"Too Many Fishes In The Sea\" & \"Three Little Fishes\" reverted to the medley formula, but it was the final chart entry (at #24) for Mitch Ryder & The Detroit Wheels because Crewe's long running Svengali notions of (ahem) putting The Wheels in motion back to Detroit and working with Ryder as a solo artist were finally bearing fruit. After a final single (the first credited to Mitch alone), pairing the syncopated \"Joy\" with the hard-riffing \"I'd Rather Go To Jail\", Crewe packed Ryder off to Las Vegas with a big band in tow. Crewe had big plans- wretchedly excessive plans since the What Now My Love album released in mid-1967 may be the most god-awful piece of overblown dreck ever associated with a major artist. Divorced from the power drive of The Wheels, swamped by saccharine strings and pompous pretense (poetry by Rod McKuen and music by Jaques Brel on a Mitch Ryder album, for Chrissakes), the fact that Ryder somehow got the title track up to #30 might rank as the most amazing feat of his singing career. It was the final straw- Ryder bailed out of his contract with Crewe, who promptly milked the last bit of mileage he could by slapping horn tracks over the R&B tunes The Wheels had covered and putting out the Mitch Ryder Sings The Hits album.\n\n Instead of immediately returning to Detroit, Ryder took a down-home detour to Memphis to record The Detroit-Memphis Experiment album with Stax luminaries Booker T. & The MGs and The Memphis Horns for Dot.Liner notes containing phrases like \"After being raped by the music machine that represents that heaven-on-earth , New York b/w Los Angeles\" and \"Mitch Ryder is the sole creation of William Levise, Jr.\", left little doubt about his feelings over the Crewe experience. It was the only time Ryder recorded with a bona-fide soul band, \"Liberty\" shows it was a two way exchange- Ryder's Detroit bred rock 'n' roll energy goosed the musicians just as their innate funkiness moved Ryder's singing in new directions.\n\nBut fine, fine music didn't spell commercial success, and Ryder returned home to a reunion with The Wheels drummer John Badanjek in the short-lived super-group Detroit, which lasted just long enough to record one monster of a heavy-duty rock 'n' roll album in 1971. \"Long Neck Goose\" updated the classic Wheels sound as Ryder digs into the tune with a ferocious glee (listen to the screams he hurls off as the song fades) but the climatic moment was \"Rock N' Roll\" (here in its rarely heard 45 mix), kicked off by a mountainous guitar riff while Badanjek bounced a cow-bell off your skull at regular intervals. It was so powerful a performance that Lou Reed was quoted as saying that was how the song was supposed to sound, and proved it by recruiting guitarist Steve Hunter for his Rock N Roll Animal phase after Detroit disintegrated.\n\nAn embittered Ryder left the active performing scene then, heading to Denver and working a day job for 5 years and honing his songwriting skills at night. After returning to Detroit, he formed a band and released the confessional, autobiographical How I Spent My Vacation and then Naked But Not Dead on his own Seeds and Stems label. That helped trigger a resurgence of European interest in Ryder and he released several additional albums- Live Talkies, Got Change For A Million, and Smart Ass -in the early '80s on the German Line label. He came back to a major American label for the John Cougar Mellencamp- produced Never Kick A sleeping Dog in 1983, highlighted by a world-weary, gritty version of Prince's \"When You Were Mine\" that cut the original and all others to shreds. Single tracks- \"Bow Wow Wow Wow\" for Was Not Was and a satirical take on Oliver North called \"Good Golly Ask Ollie\" - are his only other domestic releases since then. It would be a mistake to consign Mitch Ryder solely to the past- he's shown too much resilience to be counted out. \n\nHe is currently enjoying another surge in European popularity and continues to revisit for live performances. There's certainly nothing nostalgic about the charged music here- no one, but no one, ever kicked out the rockin' R&B jams better than Mitch Ryder & The Detroit Wheels. The tragedy is that mismanagement, and show biz machinations sidetracked a great band and- the financial inequity aside- quite possibly prevented Mitch Ryder from tapping his full potential as a singer. But all these problems can't erase the indelible rush of The Detroit Wheels shifting into over-drive with that imitable, fiery voice flying over the top. \n\nOfficial Website: Mitch Ryder <a href=\"https://www.last.fm/music/Mitch+Ryder\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
