{"artist":{"name":"Moon Mullican","mbid":"da009937-d372-4ba9-833f-02c89a9b1f1d","url":"https://www.last.fm/music/Moon+Mullican","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cda04df677e04bd99efdc170ee296737.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cda04df677e04bd99efdc170ee296737.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cda04df677e04bd99efdc170ee296737.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cda04df677e04bd99efdc170ee296737.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cda04df677e04bd99efdc170ee296737.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cda04df677e04bd99efdc170ee296737.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"6835","playcount":"37545"},"similar":{"artist":[{"name":"Hank Penny","url":"https://www.last.fm/music/Hank+Penny","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d52191e0e8d24b3f92934f833adceb2f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d52191e0e8d24b3f92934f833adceb2f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d52191e0e8d24b3f92934f833adceb2f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d52191e0e8d24b3f92934f833adceb2f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d52191e0e8d24b3f92934f833adceb2f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d52191e0e8d24b3f92934f833adceb2f.png","size":""}]},{"name":"Cowboy Copas","url":"https://www.last.fm/music/Cowboy+Copas","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8787f6548c9c4905b27715fa779e306b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8787f6548c9c4905b27715fa779e306b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8787f6548c9c4905b27715fa779e306b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8787f6548c9c4905b27715fa779e306b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8787f6548c9c4905b27715fa779e306b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8787f6548c9c4905b27715fa779e306b.png","size":""}]},{"name":"Spade Cooley","url":"https://www.last.fm/music/Spade+Cooley","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/21474689dc5949a0b92947275d3d45cf.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/21474689dc5949a0b92947275d3d45cf.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/21474689dc5949a0b92947275d3d45cf.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21474689dc5949a0b92947275d3d45cf.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21474689dc5949a0b92947275d3d45cf.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21474689dc5949a0b92947275d3d45cf.png","size":""}]},{"name":"Hawkshaw Hawkins","url":"https://www.last.fm/music/Hawkshaw+Hawkins","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7c34f868776e4708bf2e500221232864.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7c34f868776e4708bf2e500221232864.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7c34f868776e4708bf2e500221232864.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c34f868776e4708bf2e500221232864.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c34f868776e4708bf2e500221232864.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c34f868776e4708bf2e500221232864.png","size":""}]},{"name":"Al Dexter","url":"https://www.last.fm/music/Al+Dexter","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/56876c6f192e411da758672efb234833.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/56876c6f192e411da758672efb234833.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/56876c6f192e411da758672efb234833.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56876c6f192e411da758672efb234833.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56876c6f192e411da758672efb234833.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56876c6f192e411da758672efb234833.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"western swing","url":"https://www.last.fm/tag/western+swing"},{"name":"hillbilly boogie","url":"https://www.last.fm/tag/hillbilly+boogie"},{"name":"classic country","url":"https://www.last.fm/tag/classic+country"},{"name":"rockabilly","url":"https://www.last.fm/tag/rockabilly"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Moon+Mullican/+wiki"}},"published":"01 Nov 2006, 02:25","summary":"Aubrey Wilson Mullican (March 29, 1909 – January 1, 1967), known as Moon Mullican, was an American country and western singer, songwriter, and pianist. However, he also sang and played jazz, rock 'n' roll and the blues. He was associated with the hillbilly boogie style which greatly influenced rockabilly; Jerry Lee Lewis cited him as a major influence on his own singing and piano playing.\nMullican once stated, \"We gotta play music that'll make them goddamn beer bottles bounce on the table\". <a href=\"https://www.last.fm/music/Moon+Mullican\">Read more on Last.fm</a>","content":"Aubrey Wilson Mullican (March 29, 1909 – January 1, 1967), known as Moon Mullican, was an American country and western singer, songwriter, and pianist. However, he also sang and played jazz, rock 'n' roll and the blues. He was associated with the hillbilly boogie style which greatly influenced rockabilly; Jerry Lee Lewis cited him as a major influence on his own singing and piano playing.\nMullican once stated, \"We gotta play music that'll make them goddamn beer bottles bounce on the table\".\n\nMoon was born to Oscar Luther Mullican (1876–1961) and his first wife, Virginia Jordan Mullican (1880–1915), near Corrigan, Polk County, Texas. They were a farming family of Scottish, Irish and Eastern European descent. Moon was a descendant of the Mullikins of Maryland. His Scots-Irish immigrant ancestor, James Mullikin, was born in Scotland, arriving in Maryland in 1630–1640 via Northern Ireland. His paternal grandfather was Pvt. Wilson G. Mullican, who fought with the 6th Mississippi Infantry, CSA, at the Battle of Shiloh. Moon's parents, stepmother and grandparents are all buried in Stryker Cemetery, Polk County, Texas.\nMullican's mother died when he was six years old. His father soon married Callie.\nAs a child, Mullican began playing the organ, which his religious father had purchased in order to better sing hymns at church. However, Moon had befriended one of the black sharecroppers on the farm, a guitarist named Joe Jones, who introduced him to the country blues. His religious family did not always approve, and he was torn between religion and secular music. After making his mark as a local piano player, he left home at 16, and headed to Houston, where he began playing piano and singing in local clubs. His career choice was to be a singer or a preacher, and he chose the former.\n\nBy the 1930s, Mullican had earned the nickname \"Moon\", either short for \"moonshine\" or from his all-night performances (sources differ). His earliest influences were popular blues artists of the day such as Bessie Smith, Blind Lemon Jefferson and Leroy Carr, together with country musicians including Jimmie Rodgers and Bob Wills. In 1936, he covered Cab Calloway's \"Georgia Pine\" and also sung his own compositions \"Ain't You Kinda Sorry\" and \"Swing Baby Swing\" for Leon Selph's Western swing band, The Blue Ridge Playboys. He also played and recorded with Cliff Bruner's Texas Wanderers, the Sunshine Boys, and Jimmie Davis. By the end of the 1930s, he had also become a popular vocalist with a warm, deep, vocal delivery.\nIn the early 1940s, he returned to the Texas Wanderers as lead singer and pianist, sang on the hits \"Truck Driver's Blues\" and \"I'll Keep On Loving You\". However, he also made records with others including an excellent rendition of Irving Berlin's \"Blue Skies\", the blues ballad \"Sundown Blues\", an excellent jazz/blues/gospel hybrid \"Lay me down beside my darling\" and \"Pipeliner Blues\" (a song that he would return to many a time). His style at this time was very similar to rock 'n' roll. Many would not have recognised him as a country artist.\nAs well as writing his own original blues songs, Moon also covered many of the African American blues of his time. These included the Leroy Carr/Tampa Red blues \"Mean mistreater\", Papa Charlie McCoy's \"Too long\", Ollie Shepard's \"Kangaroo blues\" and Georgia South's \"New falling rain blues\".\nIn 1945, he put together his own band, the Showboys, who quickly became one of the most popular outfits in the Texas/Louisiana area with a mix of country music, Western swing, and Mullican's wild piano playing and singing. Although their style was highly eclectic and included country ballads, some of their music clearly foreshadowed what would later be called rock and roll. In 1946, Mullican made his first recordings as band leader, for King Records in Cincinnati. His first hit was \"New Jole Blon\" in 1947 (later recorded by Doug Kershaw), followed by the ballad \"Sweeter Than the Flowers\" in 1948. As well as the hits, he recorded many memorable and excellent songs in many styles showing a versatility that would not be seen until Jerry Lee Lewis and Elvis Presley would surface. A typical Mullican session would see him sing a country ballad one minute and then a saxophone driven blues the next. Record labels often did not know what to do with this side of his music and what he was doing would one day be called rock 'n' roll.\nDuring the late 1940s, Mullican influenced many other country artists. He had defined a style of country balladeering not hinted at in his 1930s work. This style of music influenced Jim Reeves (a band member for a while), Hank Williams (who named Moon as a favorite artist), Hank Snow, Bill Haley, Elvis Presley, and especially Jerry Lee Lewis, who covered many of Mullican's songs. It was in the realm of hillbilly boogie, however, that Mullican had his greatest influence. Many of his songs, such as \"Pipeliners Blues\", \"Hey! Mister Cotton-Picker\" and \"Cherokee Boogie\" (his biggest hit, in 1951) directly foreshadowed the style adopted by Haley and later rock'n'rollers. Moon also influenced Irish country and blues singer Patrick Wall, and also US rockabilly / Western swing band Cornell Hurd, who both did tribute CDs to mark Mullican's 100th birthday in 2009.\nAmong the other songs, he recorded were the Hank Williams-style \"It's a Sin to Love You Like I Do\", the clever anti-war \"When a Soldier Knocks and Finds Nobody Home\", the bluesy ballad \"There's a Chill on the Hill Tonight\", the Piedmont-style blues \"Triflin' Woman Blues\" and the gospel anthem \"Bye and Bye\". He also ventured into pop with \"Mona Lisa\" and covered blues standards like Lead Belly's \"Goodnight Irene\", and Memphis Minnie's \"What's the Matter With the Mill\". Some songs, like \"The Leaves Mustn't Fall\" and \"A Crushed Red Rose\", were semi-autobiographical. He had many top 10 hits in this time including the No. 1 \"I'll Sail My Ship Alone\" as well as \"Sweeter than the Flowers\", \"Cherokee Boogie\" and many \"Jole Blon\" derivatives. He is also believed to have co-written \"Jambalaya\", made famous by Hank Williams, but which could not be credited to him because of his contract with King Records.\nBy the end of the 1940s, he found a national audience from its radio broadcasts. With the advent of rock 'n' roll, Mullican's style of music came to the fore. He responded with his famous classic \"7 Nights to Rock\" as well as \"Moon's Rock\" and many more. He became a member of the Grand Ole Opry in 1951.\nIn 1958, he was signed by Owen Bradley to Coral Records, and recorded an album called \"Moon Over Mullican\" which showed he could also do swing akin to Sinatra well. He is also believed to have jammed on-stage with Buddy Holly around this time.\nIn the early 1960s, Mullican was a largely forgotten figure nationally, but based himself in Texas and carried on gigging and recording for the Starday and Spar labels. The decade saw him record country songs like \"I'll Pour the Wine\" and \"Love Don't Have a Guarantee\", together with less notable oddities including \"I Ain't No Beatle, But I Wanna Hold Your Hand\". One of his last records, \"Love That Might Have Been\", was excellent and should have been the start of a whole new stage in the singer’s career. However, Moon had a heart condition, although he continued to perform regularly. On New Year's Eve 1966, he suffered a heart attack in Beaumont, Texas, and died early in the morning on January 1, 1967. He and his wife, Eunice, who survived him (she died in 1973), had no children.\nMoon's epitaph is the name of one of his many hits, \"I'll Sail My Ship Alone\".\nIn 1976, he was posthumously inducted into the Nashville Songwriters Hall of Fame. There have been many posthumous compilations of his music, on various labels including Ace and Bear Family. <a href=\"https://www.last.fm/music/Moon+Mullican\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
