{"artist":{"name":"Axe","mbid":"e0b0c9f6-1499-4b35-9242-331059ce6419","url":"https://www.last.fm/music/Axe","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e0045271b8ee4241adb103b7d754dbe0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e0045271b8ee4241adb103b7d754dbe0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e0045271b8ee4241adb103b7d754dbe0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0045271b8ee4241adb103b7d754dbe0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0045271b8ee4241adb103b7d754dbe0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0045271b8ee4241adb103b7d754dbe0.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"13914","playcount":"142138"},"similar":{"artist":[{"name":"Y&T","url":"https://www.last.fm/music/Y&T","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ca634af3436a43c2b7ab2f65c8b33f44.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ca634af3436a43c2b7ab2f65c8b33f44.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ca634af3436a43c2b7ab2f65c8b33f44.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ca634af3436a43c2b7ab2f65c8b33f44.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ca634af3436a43c2b7ab2f65c8b33f44.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ca634af3436a43c2b7ab2f65c8b33f44.png","size":""}]},{"name":"April Wine","url":"https://www.last.fm/music/April+Wine","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9c7e154a45e944db80df956b3603888f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9c7e154a45e944db80df956b3603888f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9c7e154a45e944db80df956b3603888f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c7e154a45e944db80df956b3603888f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c7e154a45e944db80df956b3603888f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c7e154a45e944db80df956b3603888f.png","size":""}]},{"name":"Black 'N Blue","url":"https://www.last.fm/music/Black+%27N+Blue","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/85fa2d9dc84143359b3ab3b0cc8c9328.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/85fa2d9dc84143359b3ab3b0cc8c9328.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/85fa2d9dc84143359b3ab3b0cc8c9328.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85fa2d9dc84143359b3ab3b0cc8c9328.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85fa2d9dc84143359b3ab3b0cc8c9328.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85fa2d9dc84143359b3ab3b0cc8c9328.png","size":""}]},{"name":"Helix","url":"https://www.last.fm/music/Helix","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/06877bbd63d64ae4b39801e8b3fe4168.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/06877bbd63d64ae4b39801e8b3fe4168.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/06877bbd63d64ae4b39801e8b3fe4168.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06877bbd63d64ae4b39801e8b3fe4168.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06877bbd63d64ae4b39801e8b3fe4168.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06877bbd63d64ae4b39801e8b3fe4168.png","size":""}]},{"name":"FM","url":"https://www.last.fm/music/FM","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f245abe8820e40edbbe2797d10b04630.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f245abe8820e40edbbe2797d10b04630.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f245abe8820e40edbbe2797d10b04630.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f245abe8820e40edbbe2797d10b04630.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f245abe8820e40edbbe2797d10b04630.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f245abe8820e40edbbe2797d10b04630.png","size":""}]}]},"tags":{"tag":[{"name":"hard rock","url":"https://www.last.fm/tag/hard+rock"},{"name":"Psychedelic Rock","url":"https://www.last.fm/tag/Psychedelic+Rock"},{"name":"AOR","url":"https://www.last.fm/tag/AOR"},{"name":"heavy metal","url":"https://www.last.fm/tag/heavy+metal"},{"name":"Acid Rock","url":"https://www.last.fm/tag/Acid+Rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Axe/+wiki"}},"published":"29 Sep 2006, 09:47","summary":"There are at least 4 other artists/bands with the name Axe:\n\n1. A rapper from Jacksonville, Florida, United States\n2. A heavy metal music band from the United Kingdom\n3. A rock band from Kathmandu, Nepal\n4. A psychedelic rock band from the United Kingdom\n\n1) Previously known as Babyface (1978) and Alien (1979) with a line up of vocalist Edgar Riley, guitarist Bobby Barth, bassist Mike Turpin and drummer Teddy Mueller, the group adopted the new title of Axe in 1979 when the band added second guitarist Mike Osbourne. <a href=\"https://www.last.fm/music/Axe\">Read more on Last.fm</a>","content":"There are at least 4 other artists/bands with the name Axe:\n\n1. A rapper from Jacksonville, Florida, United States\n2. A heavy metal music band from the United Kingdom\n3. A rock band from Kathmandu, Nepal\n4. A psychedelic rock band from the United Kingdom\n\n1) Previously known as Babyface (1978) and Alien (1979) with a line up of vocalist Edgar Riley, guitarist Bobby Barth, bassist Mike Turpin and drummer Teddy Mueller, the group adopted the new title of Axe in 1979 when the band added second guitarist Mike Osbourne. Signing with major label MCA Records, Axe released their self-titled debut in 1979 and immediately gained attention with a melodic Rock sound comprising heavy guitars mixed with keyboards.by ex-members of Babyface. Band leader Bobby Barth had first picked up a guitar in 1965, encouraged by his father who was already an accomplished player, although Bobby's first interest had been in the drums. As a drummer Barth had made his first public appearance in 1963, but wouldn't play in front of an audience in his new vocation until 1967 at a college gig in Colorado. Barth claims to have no recollections of the bands whose singles he played on early in his professional career, although does recall that his first vinyl appearance was covering a Rolling Stones song, before later forming Babyface.\n\nFollowing Axe with 1980's Living On The Edge the group switched labels to Atco in 1982 for third album Offering, an album that included the hit anthem Rock n' Roll Party In The Streets and a cover of Montrose's I Got The Fire. The album marked the addition of new bassist Wayne Hauer to the ranks and AXE got to tour with the likes of the Scorpions, Judas Priest, Ozzy Osbourne and ZZ Top. The band also played in Britain during 1983 opening for Iron Maiden.\n\nFollowing the arrival of the band's fourth album Nemesis and touring with Mötley Crüe in 1984, AXE were dealt a fatal blow when guitarist Michael Osbourne was killed in an auto crash in which a badly injured Bobby Barth was lucky enough to escape with his life. The band, however, promptly dissolved following the tragedy.\n\nBarth, once recovered, joined Blackfoot, replacing the seasoned Ken Hensley for the 1984 album Vertical Smiles and subsequent touring. The tenure was short lived however and Barth subsequently released a well crafted solo album Two Hearts, One Beat on Atco Records in 1986. In an attempt in 1989 at reforming AXE, including UFO drummer Andy Parker, was made but petered out, with Barth going to Australia in order to work with ex-Rose Tattoo frontman Angry Anderson.\n\nUpon his return to America in 1991 the Denver, Colorado based Caught in the Act came to his attention and, persuaded to take the band under his wing, Barth set to work producing demos. The ensuing debut album, which was eventually released on the Swedish Empire label and featuring covers of two AXE classics, Silent Soldiers and Steal Another Fantasy. Barth has continued to work with the group on a second record, although Caught in the Act has since had to revert to the C.I.T.A. handle due to the existence of a Dutch Boy band with prior claim to the name.\n\nDue to Barth's connections with the Japanese label Zero and German company MTM Music Bobby felt there was sufficient interest in AXE to make a renewed effort to put the group back together, albeit with a slightly revised line-up, and the release of a brand new album, aptly titled Five.\n\nThe reformed 1997 line up was comprised of former Frank Zappa vocalist Bob Harris, Barth on guitars, Edgar Riley on keyboards and original drummer Teddy Mueller plus bassist Blake Eberhard. Blake is one of Colorado's premier studio and live bassists. He joined Axe after being hired by Barth for several recording sessions, and added the new dimension of fretless bass and slap-bass style to the Axe sound. Edgar Riley's son Edgar Riley Junior guests on backing vocals. In the interim period between the band's split and the reformation, Edgar Riley had worked with Frank Zappa and had also played with several unidentified bands in the Southern states of America and Teddy Mueller had got involved in the publishing industry.\n\nA brand new AXE album, Axe (Twenty Years From Home) was released in September 1997 featuring re-recorded versions of choice tracks from each of the first four AXE albums, plus two from the recently released V record. For their 2000 album The Crown the group inducted new personnel guitarist Danny Masters and drummer Christian Teele. Masters had previously issued solo albums Electric Babylon and Till The Moon Goes Away. AXE would release a limited edition mini album Live In America 1981 to commemorate their European 2001 tour dates. The same year would find Barth gaining production credits with Denver's BLISTER 66.\n\nBarth is also a member of Southern Rockers Red Rock Roosters releasing an album Attitude Is Everything in 1998. During 2003 Bob Harris re-emerged fronting the Edge of Forever project, an eighties Rock styled venture in union with keyboard player Alessandro Del Vecchio, bassist Christian Grillo and the Sleek, Gotthard and U.D.O. credited guitarist Igor Gianola.\n\n2) From Northampton, UK act AXE were one of the most obscure acts in the field of psychedelic rock and hard rock of the late 60's.\n\nThey made a handful of acetate copies of an album in 1969, named \"Music\" in the original version (or \"Axe Music\" if alternate sources are correct; and also released as \"Live & Studio\"), and in more recent years a live concert with the band performing cover versions of various tunes have emerged as a CD named \"Live 1969\".\n\nThe line-up consisted of Vivienne (Countess Vivienne according to some sources) on vocals, A. Barford (guitars). R. Hilliard (acoustic guitar), M. Nobbs (bass), S. Gordon (drums, percussion).\n\nCD:\n1(A) \tLIVE & STUDIO \t(Kissing Spell KSCD 9579) \t199?\n \n\n3) A New Wave of British Heavy Metal band who recorded the song S.S. Giro for Neat Records, but later became better known as fist.\n\n4) A Nepali Rock & Roll Band named 'Axe'. <a href=\"https://www.last.fm/music/Axe\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
