{"artist":{"name":"Mudhoney","mbid":"e675295a-1efe-4247-aa3b-53b78d0cdffc","url":"https://www.last.fm/music/Mudhoney","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7b6b98e93ecb4699a3c01e40730b0ab3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7b6b98e93ecb4699a3c01e40730b0ab3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7b6b98e93ecb4699a3c01e40730b0ab3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b6b98e93ecb4699a3c01e40730b0ab3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b6b98e93ecb4699a3c01e40730b0ab3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b6b98e93ecb4699a3c01e40730b0ab3.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"507035","playcount":"6355079"},"similar":{"artist":[{"name":"Green River","url":"https://www.last.fm/music/Green+River","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5f2bfa6bcf8149faaa4d77f9d7fab84d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5f2bfa6bcf8149faaa4d77f9d7fab84d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5f2bfa6bcf8149faaa4d77f9d7fab84d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f2bfa6bcf8149faaa4d77f9d7fab84d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f2bfa6bcf8149faaa4d77f9d7fab84d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f2bfa6bcf8149faaa4d77f9d7fab84d.png","size":""}]},{"name":"Tad","url":"https://www.last.fm/music/Tad","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/57894680da4a44df9859ccac430f717b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/57894680da4a44df9859ccac430f717b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/57894680da4a44df9859ccac430f717b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/57894680da4a44df9859ccac430f717b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/57894680da4a44df9859ccac430f717b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/57894680da4a44df9859ccac430f717b.png","size":""}]},{"name":"Screaming Trees","url":"https://www.last.fm/music/Screaming+Trees","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8e82a2918f1d48f7b60756b4bfaeff12.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8e82a2918f1d48f7b60756b4bfaeff12.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8e82a2918f1d48f7b60756b4bfaeff12.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8e82a2918f1d48f7b60756b4bfaeff12.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8e82a2918f1d48f7b60756b4bfaeff12.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8e82a2918f1d48f7b60756b4bfaeff12.png","size":""}]},{"name":"Love Battery","url":"https://www.last.fm/music/Love+Battery","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/949da1ed789e47908f17f7614933b3ce.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/949da1ed789e47908f17f7614933b3ce.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/949da1ed789e47908f17f7614933b3ce.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/949da1ed789e47908f17f7614933b3ce.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/949da1ed789e47908f17f7614933b3ce.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/949da1ed789e47908f17f7614933b3ce.png","size":""}]},{"name":"Mother Love Bone","url":"https://www.last.fm/music/Mother+Love+Bone","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/85549a47e456412d8cd1b430ee9f947e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/85549a47e456412d8cd1b430ee9f947e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/85549a47e456412d8cd1b430ee9f947e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85549a47e456412d8cd1b430ee9f947e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85549a47e456412d8cd1b430ee9f947e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85549a47e456412d8cd1b430ee9f947e.png","size":""}]}]},"tags":{"tag":[{"name":"Grunge","url":"https://www.last.fm/tag/Grunge"},{"name":"alternative rock","url":"https://www.last.fm/tag/alternative+rock"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"},{"name":"seattle","url":"https://www.last.fm/tag/seattle"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Mudhoney/+wiki"}},"published":"11 Feb 2006, 04:11","summary":"Mudhoney is a Grunge band. Formed in Seattle, Washington, USA, in 1988 following the demise of Green River, Mudhoney's members are vocalist and rhythm guitarist Mark Arm, lead guitarist Steve Turner, bassist Guy Maddison, and drummer Dan Peters. Original bassist Matt Lukin left the band in 1999 but briefly returned in 2000 to complete touring obligations. Mudhoney's early releases on Sub Pop; the \"Touch Me I'm Sick\" single and the Superfuzz Bigmuff EP; were influential in the Seattle music scene <a href=\"https://www.last.fm/music/Mudhoney\">Read more on Last.fm</a>","content":"Mudhoney is a Grunge band. Formed in Seattle, Washington, USA, in 1988 following the demise of Green River, Mudhoney's members are vocalist and rhythm guitarist Mark Arm, lead guitarist Steve Turner, bassist Guy Maddison, and drummer Dan Peters. Original bassist Matt Lukin left the band in 1999 but briefly returned in 2000 to complete touring obligations. Mudhoney's early releases on Sub Pop; the \"Touch Me I'm Sick\" single and the Superfuzz Bigmuff EP; were influential in the Seattle music scene, and helped inspire the dirty, high-distortion sound that would characterize grunge. Mudhoney were also notable for their mixing of heavy blues rock and punk rock. Although they have found little commercial success during their long career, which has yielded eight studio albums, they nonetheless inspired many grunge and alternative rock musicians, most notably Kurt Cobain of Nirvana.\n    \nLineup:\n* Mark Arm - vocals, guitar\n* Steve Turner - Guitar\n* Dan Peters - drums\n* Matt Lukin - bass (1988-1999, 2000-2001)\n* Wayne Kramer - bass (2000)\n* Guy Maddison - bass (2001-present)\n* Steve Dukich - bass (2001)\n\n\nBand history\n\nMr. Epp and the Calculations\n\nThe very beginnings of Mudhoney start out in Bellevue, Washington, a suburb of Seattle. While at Bellevue Christian High School, Mark McLaughlin (later known as Mark Arm) and some friends started Mr. Epp and the Calculations, a band named after a math teacher of his. The band was more a joke band than a real band; their first \"show\" was in class singing Marvin Gaye's \"Got to Give It Up\" and using rolled up maps as guitars because they couldn't play real instruments. \"Mr. Epp\" finally played their first show three years after they formed in 1981. Around this time Mark Arm and a friend of his, Steve Turner formed a more serious yet still humorous band, Limp Richerds. Mr. Epp appeared on KZAM-AM radio and were introduced being called \"the worst band in the world\". They played their last show on February 3, 1984 with Malfunkshun at the Metropolis in Seattle.\n\nGreen River\n\nGreen River was formed in 1984 when Mark Arm and Steve Turner pulled together and recruited Alex Vincent, who had previously played with Turner in Spluii Numa. Looking for a bass player the band asked Jeff Ament to join their band. Ament had recently arrived in Seattle with his band Deranged Diction who had come out of Montana. Another one of Turner's former bandmates, Stone Gossard, also decided to play with them. Steve Turner left the band after the recording of Come on Down due to his distaste in the heavy metal leanings of the band. He was replaced by another Derranged Diction member, Bruce Fairweather. After recording two EPs and a full-length album, the band decided to call it quits in 1987. Gossard, Ament, and Fairweather went on to join Mother Love Bone. Following lead singer, Andrew Wood's death, Gossard and Ament went on to form Pearl Jam and Fairweather joined Love Battery. Arm reunited with Steve Turner to form Mudhoney.\n\nSub Pop (1988–1991)\n\nSteve Turner wanted to start a band that actually rehearsed before they played. He and Mark Arm began working on some music along with Bundle of Hiss drummer Dan Peters. The trio decided that Matt Lukin, who had recently left Melvins, should join them as the bassist. They named themselves Mudhoney after a Russ Meyer film that none of the band members had actually seen.\nMudhoney's partial success led to a number of other Seattle bands, such as Soundgarden, Nirvana, and Tad, gaining some recognition. In the early '90s, Sub Pop was not making very much money. As a result, many of its bands left the label to search for backing by major labels. Mudhoney decided to stay and they released their second album, Every Good Boy Deserves Fudge in 1991. However, after this album was released they were offered a deal with Reprise Records and they left Sub Pop Records to join their new major label in 1992.\n\nReprise (1992–1999)\n\nAs grunge was becoming more mainstream, Mudhoney shifted away from their early grungy music sound. Many of the bands that they were friends with (Nirvana and Pearl Jam) were having huge success and gaining popularity worldwide. Their first album on Reprise was Piece of Cake, which was an album that sounded much more like garage rock than grunge. Despite the fact that the band had signed on to a major label, they still kept their quirkiness and non-careerist attitude with them.\n\nIn 1995, when grunge was in its last days in the mainstream, Mudhoney decided to go back to the sound that they used to have. With their album My Brother the Cow they managed to mix both their early heavy dirge songs and some of their more punk rock songs on the same album. The song \"Into Your Shtik\" is said to be a song which bashes Courtney Love, saying that she should blow her head off too like her husband Kurt Cobain. The album is a fan favorite and is considered one of their finest albums. Two years later they released Tomorrow Hit Today. The album showed that Mudhoney still had their garage rock roots in them as well as including new blues rock type songs.\n\nIn 1996, Mudhoney appeared in the comedy movie Black Sheep, starring Chris Farley and David Spade. Mudhoney was shown playing at an MTV concert and then speaking with Farley backstage.\n\nAfter a few years of touring, Reprise decided to release Mudhoney from their label. One of the reasons was Mudhoney's record sales had reached a career low despite the fact their live shows were drawing more people than ever before. Subsequently, bassist Matt Lukin called it quits, saying that he didn't like touring. The band released March to Fuzz, a retrospective compilation of songs from throughout their career. Many fans thought that the band was going to stop playing music altogether, although they did play a few shows around the Northwest area.\n\nReturn to Sub Pop (1999— )\n\nThese shows were doing so well that Mudhoney decided to resurrect their careers. They found permanent bassist Guy Maddison (of Monroe's Fur, Lubricated Goat) who had played with Mark Arm in one of his many side projects, Bloodloss. After Arm and Turner spent time with their side project, The Monkeywrench, the band recorded and released Since We've Become Translucent in 2002. In late 2005, the band opened Pearl Jam's South American tour, with concerts in Santiago de Chile, Buenos Aires, Porto Alegre, Curitiba, São Paulo and Rio de Janeiro. In March of 2006, the band released the well received LP, Under a Billion Suns. The band has promoted the album by touring in Europe and the U.S. with bands such as Jennifer Gentle, The Holy Soul and Comets on Fire. <a href=\"https://www.last.fm/music/Mudhoney\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
