{"artist":{"name":"Mustafa Sandal","mbid":"9e956eda-5766-4d13-848d-e6fd6d83ea8b","url":"https://www.last.fm/music/Mustafa+Sandal","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/43d0eca8f3de49d5aa7394177c4f86de.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/43d0eca8f3de49d5aa7394177c4f86de.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/43d0eca8f3de49d5aa7394177c4f86de.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43d0eca8f3de49d5aa7394177c4f86de.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43d0eca8f3de49d5aa7394177c4f86de.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43d0eca8f3de49d5aa7394177c4f86de.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"78582","playcount":"790584"},"similar":{"artist":[{"name":"Tarkan","url":"https://www.last.fm/music/Tarkan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dec9a27a5d5348740e3dcb5aee012af1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dec9a27a5d5348740e3dcb5aee012af1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dec9a27a5d5348740e3dcb5aee012af1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dec9a27a5d5348740e3dcb5aee012af1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dec9a27a5d5348740e3dcb5aee012af1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dec9a27a5d5348740e3dcb5aee012af1.png","size":""}]},{"name":"Kenan Doğulu","url":"https://www.last.fm/music/Kenan+Do%C4%9Fulu","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3e4a52cb884b4c8586d269d5a15c59f7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3e4a52cb884b4c8586d269d5a15c59f7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3e4a52cb884b4c8586d269d5a15c59f7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e4a52cb884b4c8586d269d5a15c59f7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e4a52cb884b4c8586d269d5a15c59f7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e4a52cb884b4c8586d269d5a15c59f7.png","size":""}]},{"name":"Murat Boz","url":"https://www.last.fm/music/Murat+Boz","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/355293e1a506829e6e6eb61ccbe9a527.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/355293e1a506829e6e6eb61ccbe9a527.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/355293e1a506829e6e6eb61ccbe9a527.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/355293e1a506829e6e6eb61ccbe9a527.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/355293e1a506829e6e6eb61ccbe9a527.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/355293e1a506829e6e6eb61ccbe9a527.png","size":""}]},{"name":"Hande Yener","url":"https://www.last.fm/music/Hande+Yener","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/03a52189fa284ce3b178dce3ae5ea681.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/03a52189fa284ce3b178dce3ae5ea681.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/03a52189fa284ce3b178dce3ae5ea681.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/03a52189fa284ce3b178dce3ae5ea681.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/03a52189fa284ce3b178dce3ae5ea681.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/03a52189fa284ce3b178dce3ae5ea681.png","size":""}]},{"name":"Murat Dalkılıç","url":"https://www.last.fm/music/Murat+Dalk%C4%B1l%C4%B1%C3%A7","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e2d5cf3c95ea4b85cb61e8fe72e73bc0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e2d5cf3c95ea4b85cb61e8fe72e73bc0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e2d5cf3c95ea4b85cb61e8fe72e73bc0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e2d5cf3c95ea4b85cb61e8fe72e73bc0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e2d5cf3c95ea4b85cb61e8fe72e73bc0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e2d5cf3c95ea4b85cb61e8fe72e73bc0.png","size":""}]}]},"tags":{"tag":[{"name":"turkish","url":"https://www.last.fm/tag/turkish"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"Turkish Pop","url":"https://www.last.fm/tag/Turkish+Pop"},{"name":"arabic","url":"https://www.last.fm/tag/arabic"},{"name":"male vocalists","url":"https://www.last.fm/tag/male+vocalists"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Mustafa+Sandal/+wiki"}},"published":"15 Feb 2006, 23:55","summary":"Mustafa Sandal, born January 11, 1970, commonly known as Musti, is a famous Turkish pop singer. He is fluent in English, Turkish, Italian and French. He emerged in the early 1990s with the revival of Turkish pop music and is the most successful pop singer in Turkey. Sandal is famous in Europe for his songs \"Moonlight\", \"Araba\", \"All My Life\", \"İsyankar\" and \"İndir\".\n\nSandal released his debut album \"Suç Bende\" in 1994. It sold 1.7 million copies and became the greatest selling album of the year with a landslide victory. <a href=\"https://www.last.fm/music/Mustafa+Sandal\">Read more on Last.fm</a>","content":"Mustafa Sandal, born January 11, 1970, commonly known as Musti, is a famous Turkish pop singer. He is fluent in English, Turkish, Italian and French. He emerged in the early 1990s with the revival of Turkish pop music and is the most successful pop singer in Turkey. Sandal is famous in Europe for his songs \"Moonlight\", \"Araba\", \"All My Life\", \"İsyankar\" and \"İndir\".\n\nSandal released his debut album \"Suç Bende\" in 1994. It sold 1.7 million copies and became the greatest selling album of the year with a landslide victory. During this time, Sandal gave 140 concerts throughout Turkey as well as thirty concerts in Europe. Sandal was interested in working with all areas of music; he wanted to not only be a singer, but also a songwriter and producer. In 1995, Sandal helped write songs and produce Turkish pop singer Sibel Alaş's album \"Adam\" (\"Man\"). The album was successful and sold 400000 copies. In 1996, Sandal moved to London to isolate himself from fans while preparing his next album. Later that year, he released his second album \"Gölgede Aynı\" and it sold 3.5 million copies. After the outstanding popularity of this album, he performed 140 concerts throughout Turkey. The third music video of the album for the song \"Bir Anda\" used tie-clip techniques which were a first for Turkish fans. Sandal also produced Turkish pop singer İzel's album \"Emanet\" (\"Possesion\") later that year. Sandal's third album Detay was the first album released from his newly established record label YADA Productions. In 2000, after the success of Tarkan, Sandal signed a contract with Sony Music France and released a compilation album titled Araba. Later that year, Sandal released his fourth album \"Akışına Bırak\" but had dissapointing sales. However, the duet with Natalia for the song \"Hatırla Beni,\" originally a Greek/Egyptian song called \"ELEOS\" sung by Angela Dimitriou and Amr Diab became very successful and a concert tour of Turkey followed.\n\nIn 2001, Prestij Müzik, the parent company of Musti's YADA Productions, was bankrupted and Sandal signed into Erol Köse Productions. In 2002, Musti released his fifth studio album Kop which contained the 2002 hit \"Pazara Kadar\" (\"Until Sunday\"/\"Until the Market\") as well as releasing his first promotional single for the song \"Kopmam Lazım\" with Turkish phone service Telsim. In 2003, Musti released his first Maxi Single (EP/Hybrid Album) titled Maxi Sandal 2003 / Moonlight which included a Turkish/Greek duet of the Greek folk song \"Anaveis Foties\" as well as releasing his first European single \"Aya Benzer\" 2003. Sandal also wanted to release English songs in his next album Seven but due to conflicts with producer Erol Köse he released the album under a Universal label. In 2004, Sandal released his second European single Araba 2004 along with a second version of Seven titled Seven New Version with little success.\n\nLater in 2004, Sandal released his second Maxi Single titled İste (\"Want\") which contained his 2004 hit İsyankar (\"Rebellious\"). The song was believed by some to be a remake of a song by Punjabi MC. Musti later performed the song with Punjabi MC in 2005. On January 10th, 2005, Musti released his third single İsyankar in Europe and later won a Gold Record for high sales in Germany. The song reached the top 20 of several European countries peaking at number four in Switzerland. Later that year, Musti later released a third version of the Seven album titled Seven Reloaded. After dissapointing sales, Musti announced that he was taking a career break. During this time, Musti worked on three commercials for Muhabbet Kart (\"Chat Card\"), a new promotion provided by Türkcell. Musti also started giving concerts throughout Turkey. During one concert, he said \"Bu yaz çok sessiz geçti. Yine iş bize duştu\" (\"This summer has been too quiet. It is again my responsibility to make the hits\"). Suddenly, Musti started singing his Yamalı Tövbeler (\"Patched Repentances\") song. Unfortunately, Yamalı Tövbeler sold poorly and caused more tension between Musti and Erol Köse. Musti's contract was transferred to Seyhan Müzik. In 2006, Musti started to appear on Doğuş Otomobil's safe driving commercials shown here. It was also announced on his official website that his 1996 hit \"Araba\" would be translated and put into Shakira's next album.\n\nMusti originally announced that his new album would be released in December, 2006. In 2007, the new Musti FM radio on his official website confirmed that his album had been delayed to April 23rd, 2007, May 19th, and later to its official release date of June 13th, 2007. In May, Musti invited Emina Türkcan to İstanbul and showed her three tracks he had written for her in his new album. By the time she was listening to the third song she was in tears. To promote his album, Musti starred in three commercials for Muhabbet Kart with his grandfather, famous percussionist Hüseyin İleri. Musti also explained in an interview that his grandfather raised him during his childhood and gave him motivation and interest towards music. In an interview with Turkish entertainment show Canlı Canlı, Musti admitted that he is again in a relationship with Emina Türkcan (*now happily married). Later in June, Seyhan Müzik announced that the Devamı Var album sold 200,000 copies in its first week and has reached number one in all music store listings in western areas of Turkey.\n\nDevamı Var is the sixth studio album by the Turkish pop singer Mustafa Sandal. The original release date for this album was December 2006 but was later pushed to April 23rd, May 19th, and June 8th, 2007. Two weeks before the release, an instrumental version of the song \"Çoban\" (\"Shepard\") was available on Mustafa Sandal's official website. The official release date for the album was June 13th, 2007. The album features Turkish pop singer İzel, in the song \"Dayan\" (\"Survive\"). \"Melek Yüzlüm\" (\"My angel face\") has been confirmed to be the song in which Emina Türkcan was in tears. The song \"Kim Bilir Kim\" (\"Who is going to know\") was originally released in an early album of Turkish pop singer Ajda Pekkan. The song \"Farketmez\" (\"It doesn't matter\") is a remake of the 2005 World Music Award winning hit \"Bastanak\" by Lebanese pop singer Elissa. \"Herkes Mecbur\" (\"Necessary to everyone\") is a remake of the song \"Fatet Sineen\" by Elissa. Devamı Var was released onto the iTunes Store on July 11th, 2007. <a href=\"https://www.last.fm/music/Mustafa+Sandal\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
