{"artist":{"name":"Mylène Farmer","mbid":"18b23026-ed29-445a-9bb4-4e86598ab5a9","url":"https://www.last.fm/music/+noredirect/Myl%C3%A8ne+Farmer","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c268e16e48c84f4104ee2169e97feb55.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c268e16e48c84f4104ee2169e97feb55.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c268e16e48c84f4104ee2169e97feb55.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c268e16e48c84f4104ee2169e97feb55.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c268e16e48c84f4104ee2169e97feb55.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c268e16e48c84f4104ee2169e97feb55.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"275160","playcount":"13030880"},"similar":{"artist":[{"name":"Alizée","url":"https://www.last.fm/music/Aliz%C3%A9e","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/50f63c7445c54d5181eba3b0f102ceab.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/50f63c7445c54d5181eba3b0f102ceab.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/50f63c7445c54d5181eba3b0f102ceab.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50f63c7445c54d5181eba3b0f102ceab.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50f63c7445c54d5181eba3b0f102ceab.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50f63c7445c54d5181eba3b0f102ceab.png","size":""}]},{"name":"Zazie","url":"https://www.last.fm/music/Zazie","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6cfc27d218424261c2430744bb7f45e3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6cfc27d218424261c2430744bb7f45e3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6cfc27d218424261c2430744bb7f45e3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cfc27d218424261c2430744bb7f45e3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cfc27d218424261c2430744bb7f45e3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cfc27d218424261c2430744bb7f45e3.png","size":""}]},{"name":"Najoua Belyzel","url":"https://www.last.fm/music/Najoua+Belyzel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7bda8a6b929e4fcbcf1ddce50374b069.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7bda8a6b929e4fcbcf1ddce50374b069.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7bda8a6b929e4fcbcf1ddce50374b069.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7bda8a6b929e4fcbcf1ddce50374b069.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7bda8a6b929e4fcbcf1ddce50374b069.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7bda8a6b929e4fcbcf1ddce50374b069.png","size":""}]},{"name":"Ysa Ferrer","url":"https://www.last.fm/music/Ysa+Ferrer","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fa9de4d7a29b461389cb3271e7a9d802.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fa9de4d7a29b461389cb3271e7a9d802.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fa9de4d7a29b461389cb3271e7a9d802.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa9de4d7a29b461389cb3271e7a9d802.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa9de4d7a29b461389cb3271e7a9d802.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa9de4d7a29b461389cb3271e7a9d802.png","size":""}]},{"name":"Jenifer","url":"https://www.last.fm/music/Jenifer","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/20c96c7881fb44cead37af22c95f05e4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/20c96c7881fb44cead37af22c95f05e4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/20c96c7881fb44cead37af22c95f05e4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/20c96c7881fb44cead37af22c95f05e4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/20c96c7881fb44cead37af22c95f05e4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/20c96c7881fb44cead37af22c95f05e4.png","size":""}]}]},"tags":{"tag":[{"name":"french","url":"https://www.last.fm/tag/french"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"french pop","url":"https://www.last.fm/tag/french+pop"},{"name":"chanson francaise","url":"https://www.last.fm/tag/chanson+francaise"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/Myl%C3%A8ne+Farmer/+wiki"}},"published":"11 Feb 2006, 15:20","summary":"Mylène Farmer is a Canadian born French singer, songwriter, occasional actress, and author.\n\nFarmer was born Mylène Gautier on 12th September 1961 in Pierrefonds, Quebec, a suburb (now borough) of Montreal. Her parents had moved from France in the late 1950s as Farmer's father, Max, pursued an engineering contract on a dam. Her family returned to France when she was eight, settling in the Parisian suburb of Ville d'Avray. In her teenage years, Farmer was passionate about horse-riding <a href=\"https://www.last.fm/music/+noredirect/Myl%C3%A8ne+Farmer\">Read more on Last.fm</a>","content":"Mylène Farmer is a Canadian born French singer, songwriter, occasional actress, and author.\n\nFarmer was born Mylène Gautier on 12th September 1961 in Pierrefonds, Quebec, a suburb (now borough) of Montreal. Her parents had moved from France in the late 1950s as Farmer's father, Max, pursued an engineering contract on a dam. Her family returned to France when she was eight, settling in the Parisian suburb of Ville d'Avray. In her teenage years, Farmer was passionate about horse-riding, qualifying as a riding instructor at the equestrian centre in Saumur. At seventeen, however, she discovered acting and she abandoned the stables to take a three-year course at the Cours Florent, a drama school in Paris. Changing her name to Mylène Farmer as a tribute to her idol, 1930s Hollywood actress Frances Farmer, she began to earn a living as a model, appearing in several television advertisements.\n\nIn 1984, Farmer met Laurent Boutonnat, a young film student also enrolled in Cours Florent, when she replied to a newspaper ad for an actress for a small film he was working on. Farmer and Boutonnat became friends and forged a creative partnership, writing and producing the music. Boutonnat, whose ambition was to become a film director, was the force behind Mylène’s videos. Much of Farmer's fame and success can be attributed to elaborate and theatrical music videos which are seen as short films.\n\nFarmer gained fame with songs featuring shocking yet poetic lyrics, and explicit music videos: \"Maman a tort\" was about the love of a young girl for her female hospital nurse. \"Pourvu qu' elles soient douces\" contains hints of sodomy; the video, set in the eighteenth century, featured a caning. \"Libertine\" is said to feature the first full frontal nudity appearance by a singer on a major music video. \"Que mon cœur lâche\" was about love with condoms in the age of AIDS; the video for the song features a scene in which God tells Jesus he won't send him to Earth again because the last time \"it was a disaster\".\n\nBoutonnat teamed up with the young songwriter Jérôme Dahan, and the pair wrote Farmer's first hit, \"Maman a tort\" a single which went to the top of the French charts in March 1984. The video cost the modest sum of 5,000 FR but caused a stir in the music world. Boutonnat cast Farmer as a provocative Lolita figure, and the singer cultivated the image in her early career, especially on her début album, “Cendres de lune”. This album, released in January 1986, proved to be a big success selling a million copies.\n\n\"Libertine\", the first single from the album released in March 1986, set the tone for the Farmer style. Farmer’s sensual and romantic lyrics (which she writes herself) are very much inspired by the great figures of nineteenth-century literature and set to sophisticated melodies written by Laurent Boutonnat. Boutonnat also took charge of directing Farmer’s videos, imposing his distinctive style on them. The video which accompanied “Libertine”, for instance, is heavily charged with 18th century eroticism (conjuring up images of the film Barry Lyndon and the novels of the Marquis de Sade). Farmer, lit only in the glow of soft candlelight, is shrouded in an aura of mystery and sexual ambiguity. (This mysterious erotic ambience would continue to be the singer’s trademark throughout the rest of her career, infusing the following videos “Tristana” and “Sans contrefaçon”). \n\nIn 1988, Boutonnat and Farmer began their second album, Ainsi soit je... (a play on the French expression \"ainsi soit-il\", meaning \"amen\"). This album is infused with the same erotic atmosphere, and feature songs inspired by Farmer’s favourite authors, among them the French romantic poet Baudelaire and the American horror writer Edgar Allan Poe. Musically it has a melancholy and sad tone, and deals with death, suicide, madness with gloomy and desperate texts. Sexual ambiguity, sodomy ,and provocation are also tackled. The album sold 1.8 million copies on the back of the million-selling hits \"Sans contrefaçon\" and \"Pourvu qu'elles soient douces\", the latter being her first number-one single. At the time it was the best-selling album ever by a female artist in France.\n\nIn spite of all her drama courses Farmer still found it difficult to overcome her natural shyness and perform in front of an audience. It was only after much hesitation that the singer finally agreed to do a live concert in 1989. After singing at a small venue in St Etienne, as a kind of test run, Farmer finally arrived in Paris to perform at the Palais des Sports where fans packed the auditorium out for a whole week in May. Farmer wasted no time in overcoming her stage fright and even appeared to enjoy performing on stage. She followed the Paris concerts with an extensive tour which included fifty-two dates throughout France and Europe. A live album as well as the film of the concert was released at the end of the year, titled “En concert”.\n\nFarmer's stage shows, together with her wacky appearance and piercing vocals, soon began to attract an increasing number of fans. Meanwhile she continued to surround herself with an air of mystery, refusing to give interviews or to appear in the media - but this only served to excite fans’ curiosity about the reclusive star.\n\nBy the turn of the decade Farmer was a full blown superstar in France, but it wasn't until the release of her third album, L'Autre..., and the lead single \"Désenchantée\" that she became iconic. \"Désenchantée\" was a phenomenon in French pop music, striking a universal chord with its political lyrics. The song debuted at number twelve before going to number one and went on to become the best selling French single of all time (both in country and around the globe), according to Guinness Book of World Records. Likewise, its parent album L'Autre... was a great success in terms of chart and sales (number one for twenty weeks), becoming the best-selling album throughout the singer's career and the third best-selling album of all time in France selling more than two million copies. Lyrically it re-uses the old themes dear to the singer: death, religion, social revolt, despair, sexuality and madness are tackled in the various songs. The album was also supported by the hits \"Regrets\", (a duet with French recording-star Jean-Louis Murat) and \"Je T'Aime Mélancolie\", (accompanied by a video in which Farmer is portrayed as a professional boxer) which received play all around Europe. The video clip of the third single “Beyond My Control” was banned because it was considered to be too violent and shocking for viewers. After this success, a special compilation album featuring dance remixes of her hits was released in November 1992 .\n\nIn the winter of 1992-93 Mylène Farmer set off for Slovakia with Laurent Boutonnat to star in his first feature film “Giorgino”. The pair spent five months, trudging through the snow and working under difficult conditions, Mylène throwing herself body and soul into her role as a young autistic. \n\nUnfortunately when “Giorgino” hit the cinema screens on October 4 1994, it proved to be a spectacular flop. The high budget film, which had cost over 80 million francs, returned only 1 and a half million francs at the box office. Fans who had flocked to see Mylène Farmer in concert were definitely not queuing to see their music idol at the cinema and due to the almost total lack of interest the film was taken off Paris screens after only a three-week run.\n\nAfter this cinematic failure, Mylène left France and moved to Los Angeles for a while. During her time in California, Farmer began writing her fourth studio album “Anamorphosée” a change of pace. The album had a more rock oriented instrumentation while remaining a pure pop album in its core. All lyrics were written once more by Farmer herself and for the first time she also wrote the music for the song “Tomber 7 Fois”. The album was launched by \"XXL\" a mid-tempo pop-rock song with blasting electric guitars. Its video was directed by Marcus Nispel and features Mylène strapped to the front of a moving train. The single became her first to debut at #1. The Anamorphosée album debuted at #2 and sold half a million copies in 3 months. The album continued to sell well with the release of \"California\", a jazzy pop-ballad bolstered with bass guitar, and \"Rêver\", which helped the album reach #1 in January 1997 - 16 months after its release. \n\nAfter the release of her new album, Mylène then returned to her touring activities, performing three spectacular shows at the massive Bercy Stadium (May 28 and 29 and June 1). She then set off upon an extensive tour of France. But the tour was cut short after an accident in Lyon on June 15, when the singer fell at the end of the concert and broke her wrist. Mylène bounded back on stage in November, however, continuing her hectic schedule right up until another series of hugely popular shows at Bercy in the spring of 1997. A live album was recorded from this tour and was released under the name “Live à Bercy”. In May  a musical video of the concert was also realized, first on VHS and in 1999 on DVD.\n\nFarmer returned in the spring 1999 with her 5th studio album “Innamoramento”. The album for which Mylène penned all the lyrics herself and wrote the music for 5 of the 13 tracks - remained true to the singer’s successful hit-making formula. It went straight to the top of the French charts and went on to sell more than 1,200,000 copies. The lyrics contain many references to literary writers and painters, they deal with the singer's anxieties, such as pain, unhappy love, sexuality and the passage of the time. But as the album's title suggests, love is the central theme of the latter. The album is slower and with less rock sonorities than “Anamorphosée”. The sound is more techno-pop and intimate\n\nThe lead single “L'Âme-Stram-Gram” was a futuristic up-tempo techno-ballad with erotic lyrics accompanied by a Chinese-themed video in which Farmer commits suicide to save her twin. The video for the second single, \"Je Te Rends Ton Amour\", sparked controversy because of its religious blasphemy and was condemned by the catholic church and banned by many networks. The screenplay was written by Mylène Farmer and uses a lot of symbolisms, bringing together aestheticism, shock images and deep themes. Farmer's record company released a video single, which became the highest selling release of that kind in France.\n\nIn late 1999, Farmer embarked on her third concert tour, the “Mylenium Tour”, which set the record for highest grossing tour by a non-English speaking artist. More than 450,000 people attended the concert series that cost more than 120 million euro. It featured a grandiose stage, a very impressive entry and an overwhelming and perfect end, comparable to that of the 1989 tour. During the tour, Farmer released the album's third and fourth singles: \"Souviens-Toi Du Jour\" and \"Optimistique-Moi\" which became the biggest hits from the album.\n\nAfter Innamoramento, the last single off the album, she recorded \"L'Histoire D'Une Fée, C'est...\" for the animated film Rugrats in Paris: The Movie. Her third live album and DVD called “Mylenium Tour” along with \"Dessine-Moi Un Mouton\" (the promotional single for the live CD of the show) was also released in several formats (VHS, DVD, collector’s CD and LP)\n\nIn 2000, Farmer and Laurent Boutonnat began looking for a young female singer for their new project. They found Alizée, a contestant on the French television show Graines de stars. Farmer and Boutonnat wrote and produced Alizée's albums “Gourmandises” and “Mes courants électriques”. Her hit \"Moi... Lolita\" reached the top of the charts and Alizée became the most successful French singer that year. In 2001 IFOP announced Farmer as top earning French entertainer of the year thanks to her writing, recording, and producing credits of Alizée's music, which earned 10.4 million euro. Alizée's image was crafted by Farmer and Boutonnat, she was allowed a few interviews at no more than 20 minutes and a limited number of promotional appearances. In 2005 Alizée parted with the duo. Her unsuccessful third album was released in December 2007.\n\nAt the end of 2001, and seventeen years into her career, Universal issued Farmer's first greatest hits collection: “Les Mots”, whose title track and lead single featured a duet with Seal. It was released as a double disc in France, with the first CD containing all of her older hits in remastered versions. A collector’s edition (with three CDs) was also released among with the the European version (one CD). Les Mots was the #1 selling album of 2001 and 2002, and remains the best selling compilation album in France with more than 1.5 million sold. It also included the new tracks and singles, \"C'est Une Belle Journée\" and \"Pardonne-Moi\"\n\nIn December 2004, Farmer held a conference announcing her new album “Avant Que L'Ombre...”, the lead single \"Fuck Them All\", as well as a special 13-night concert engagement at the Palais Omnisports de Paris-Bercy in January 2006.  The album came out in April 2005 featuring a more soft sound which mixes electronic sounds with acoustic. Lirycally all her key themes can be found here: death, spirituality but also love and sex. Mylène Farmer wrote all the lyrics and Laurent Boutonnat the music and the production. This era featured no further promotion, and marked a new level of reclusivity for the star, who stated only \"what I have to say is in my music\", still the record sold nearly a million copies.\n\nShe returned to the stage in January 2006 for 13 dates in Paris-Bercy, beginning on the 13th and concluding 29 January. In explaining, the decision to perform only at Bercy, Farmer stated she could not tour due to the complexity of the sets for the performances which were literally untransportable. The concerts themselves were a triumph. All of the 13 dates were sold out quickly. Aesthetically they were dominated by red and black, they featured a giant gate, a big platform in the shape of a cross at the middle of the stadium, an impressive entrance with Mylène coming to the scene from the air, a stunning curtain of rain and a moving bridge. A live album and concert DVD, “Avant Que L'Ombre... à Bercy” were released in December 2006. Within months, the DVD became the best selling music DVD in France.\n\nFarmer recorded a single with electronic musician Moby, \"Slipping Away (Crier la vie)\", released in September 2006, which became her fourth number one single in France.\n\nIn March of 2008, Universal France confirmed Farmer would release her seventh studio album near the end of 2008, and embark on her fifth concert tour the following year, including two shows at the Stade de France. The record's lead single, \"Dégénération\", debuted at radio 19 June, with the cinematic video following 13 July. The song became Farmer's 5th #1 single. The album, released in stores on 25 August, and available for download as early as 20 August, followed suit debuting at #1 with over 100,000 copies sold in its first week. The electronic-driven “Point De Suture” was somewhat of a departure from Farmer's previous work, featuring less ballads, and more upbeat, synth-driven pop songs including \"C'est Dans L'Air\" and \"Sextonik\" (a kinky ode to sex toys). Still, the album also sported Farmer's signature sophisticated lyrics channeling Baudelaire on \"Paradise Inanime\", and referencing mortality and loss on the title track. The album's second single, \"Appelle Mon Numéro\", was released 3 November, also hitting #1, giving her the record for most #1 singles in France for any artist. The third single was J’Avais Au Moins…\". Many fans were disappointed and thought it was a bad choice. Despite that, the single went straight to #1 on the singles chart, becoming the singer's seventh number one single in France, which is to date the new record. The new single will be the upbeat C'est Dans L'air, a fan favourite.\n\nFarmer's fifth tour begins 2 May, 2009, in Nice.\n <a href=\"https://www.last.fm/music/+noredirect/Myl%C3%A8ne+Farmer\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
