{"artist":{"name":"Mötley Crüe","mbid":"26f07661-e115-471d-a930-206f5c89d17c","url":"https://www.last.fm/music/+noredirect/M%C3%B6tley+Cr%C3%BCe","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/95047baa0d7b42dcbc132279cbfca01e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/95047baa0d7b42dcbc132279cbfca01e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/95047baa0d7b42dcbc132279cbfca01e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95047baa0d7b42dcbc132279cbfca01e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95047baa0d7b42dcbc132279cbfca01e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95047baa0d7b42dcbc132279cbfca01e.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"996378","playcount":"27898637"},"similar":{"artist":[{"name":"Poison","url":"https://www.last.fm/music/Poison","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5d7e3e58fdf24683b21e36b4860ce1ee.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5d7e3e58fdf24683b21e36b4860ce1ee.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5d7e3e58fdf24683b21e36b4860ce1ee.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5d7e3e58fdf24683b21e36b4860ce1ee.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5d7e3e58fdf24683b21e36b4860ce1ee.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5d7e3e58fdf24683b21e36b4860ce1ee.png","size":""}]},{"name":"Ratt","url":"https://www.last.fm/music/Ratt","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c6492a1ff7cf44fe89e1b3c2e24ea7b2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c6492a1ff7cf44fe89e1b3c2e24ea7b2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c6492a1ff7cf44fe89e1b3c2e24ea7b2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c6492a1ff7cf44fe89e1b3c2e24ea7b2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c6492a1ff7cf44fe89e1b3c2e24ea7b2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c6492a1ff7cf44fe89e1b3c2e24ea7b2.png","size":""}]},{"name":"Skid Row","url":"https://www.last.fm/music/Skid+Row","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f657d9222ca54141c1e1dbdb1579e663.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f657d9222ca54141c1e1dbdb1579e663.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f657d9222ca54141c1e1dbdb1579e663.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f657d9222ca54141c1e1dbdb1579e663.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f657d9222ca54141c1e1dbdb1579e663.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f657d9222ca54141c1e1dbdb1579e663.png","size":""}]},{"name":"Cinderella","url":"https://www.last.fm/music/Cinderella","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/05637c91dd974c77a9e75c0ae9af5e35.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/05637c91dd974c77a9e75c0ae9af5e35.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/05637c91dd974c77a9e75c0ae9af5e35.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05637c91dd974c77a9e75c0ae9af5e35.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05637c91dd974c77a9e75c0ae9af5e35.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05637c91dd974c77a9e75c0ae9af5e35.png","size":""}]},{"name":"Vince Neil","url":"https://www.last.fm/music/Vince+Neil","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0537b085da8749e8a21edf742b521366.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0537b085da8749e8a21edf742b521366.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0537b085da8749e8a21edf742b521366.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0537b085da8749e8a21edf742b521366.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0537b085da8749e8a21edf742b521366.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0537b085da8749e8a21edf742b521366.png","size":""}]}]},"tags":{"tag":[{"name":"hard rock","url":"https://www.last.fm/tag/hard+rock"},{"name":"heavy metal","url":"https://www.last.fm/tag/heavy+metal"},{"name":"hair metal","url":"https://www.last.fm/tag/hair+metal"},{"name":"80s","url":"https://www.last.fm/tag/80s"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/M%C3%B6tley+Cr%C3%BCe/+wiki"}},"published":"17 Feb 2006, 12:13","summary":"Mötley Crüe was an American heavy metal band formed in Los Angeles, California on January 17, 1981. The group was founded by bass guitarist Nikki Sixx and drummer Tommy Lee, lead singer Vince Neil and lead guitarist Mick Mars. Mötley Crüe has sold more than 100 million records worldwide, including 25 million albums in the United States, making them one of the best-selling bands of all time.\n\nThe members of the band have often been noted for their hedonistic lifestyles and the persona they maintained. <a href=\"https://www.last.fm/music/+noredirect/M%C3%B6tley+Cr%C3%BCe\">Read more on Last.fm</a>","content":"Mötley Crüe was an American heavy metal band formed in Los Angeles, California on January 17, 1981. The group was founded by bass guitarist Nikki Sixx and drummer Tommy Lee, lead singer Vince Neil and lead guitarist Mick Mars. Mötley Crüe has sold more than 100 million records worldwide, including 25 million albums in the United States, making them one of the best-selling bands of all time.\n\nThe members of the band have often been noted for their hedonistic lifestyles and the persona they maintained. Following its hard rock and heavy metal origins, with the third album Theatre of Pain (1985) the band joined the first wave of glam metal. Their final studio album, Saints of Los Angeles, was released on June 24, 2008. Their final show took place on New Year's Eve, December 31, 2015, and was filmed for a theatrical and Blu-ray release in 2016.\n\nThe band members have often been noted for their hard-living lifestyles; all members have had numerous brushes with the law, have spent time in jail, have suffered long addictions to alcohol and drugs, have had countless escapades with women, and are heavily tattooed. Their ninth studio album entitled Saints of Los Angeles was released on June 24, 2008, while a film adaptation of their best-selling autobiography The Dirt is due to be released in 2011.\n\nMötley Crüe was formed on January 17, 1981, when bass guitarist Nikki Sixx left the band London and began rehearsing with drummer Tommy Lee and vocalist/guitarist Greg Leon. Lee had worked previously with Leon in a band called Suite 19 and the trio practiced together for some time with Leon eventually deciding not to continue. The bassist and drummer then began a search for new members. Sixx and Lee soon met guitarist Bob \"Mick Mars\" Deal. Mars was quickly auditioned and subsequently hired by Sixx and Lee. The newly formed band did not yet have a name. While trying to find a suitable name, Mars remembered an incident which occurred when he was playing with a band called White Horse, when one of the other band members called the group \"a motley looking crew.\" He had remembered the phrase and later copied it down as Mottley Cru-. After modifying the spelling slightly, \"Mötley Crüe\" was eventually selected as the band's name, with the stylistic decision to add the two sets of umlauts supposedly inspired by the German beer Löwenbräu, which the members were drinking at the time. The group was still in need of a singer. Lee had known Vince Neil from their high school days at Royal Oak H.S. in Covina and the two had performed in different bands on the garage-band circuit. On seeing him perform with the band Rock Candy at the Starwood in Hollywood, Mars suggested Mötley Crüe hire Neil. At first, Neil refused the offer. However, as the other members of Rock Candy became involved in outside projects, Neil grew anxious to try something else. When Lee made one final appeal to audition, Neil accepted and was hired.\n\nThe band soon met their first manager, Allan Coffman, \"the thirty-eight-year-old brother-in-law of Mick’s driver friend Stick\". The band's first release was the single \"Stick to Your Guns/Toast of the Town,\" which was released on their own label, Leathür Records, which had a pressing & distribution deal with Greenworld Distribution in Torrance. In November 1981, their debut album Too Fast for Love was self-produced and released on Leathür, selling 20,000 copies. Coffman's assistant Eric Greif set up a tour of Canada, while Coffman and Greif used Mötley Crüe's success in the Los Angeles club scene to negotiate with several record labels, eventually signing a recording contract with Elektra Records in late spring 1982. At Elektra's insistence, the debut album was then re-mixed by producer Roy Thomas Baker and re-released on August 20, 1982, two months after its Canadian WEA release using the original Leathür mixes, to coincide with the tour.\n\nDuring the \"Crüesing Through Canada Tour '82,\" there were several widely-publicized incidents. First, the band was arrested and then released at Edmonton International Airport for wearing their spiked stage wardrobe (considered \"dangerous weapons\") through Customs and for Neil arriving with a small carry-on filled with porn magazines (considered \"indecent material\"); both were staged PR stunts. Customs eventually had the confiscated items destroyed. Second, while playing Scandals Disco in Edmonton, a spurious \"bomb threat\" against the band made the front page of the Edmonton Journal (June 9, 1982); assistant band manager Greif and Lee were interviewed. This too ended up being a staged PR stunt perpetrated by Greif. Lastly, Lee threw a television set from the upper story window of the Sheraton Caravan Hotel. Canadian rock magazine Music Express noted that the band was \"banned for life\" from the city. Despite the tour ending prematurely in financial disaster, it was the basis for the band's first international press.\n\nIn 1983, the band changed management from Coffman to Doug Thaler and Doc McGhee. McGhee is best known for managing Bon Jovi and later Kiss (starting with their reunion tour in 1996). Greif subsequently sued all parties in a Los Angeles Superior Court action that dragged on for several years, and coincidentally later re-surfaced as manager of Sixx's former band, London. Coffman himself was sued by several investors to whom he had sold \"stock in the band\", including Michigan-based Bill Larson. Coffman eventually declared bankruptcy, as he had mortgaged his home at least three times to cover band expenses.\n\nAfter playing the US Festival, and with the aid of the new medium of MTV, the band found rapid success in the United States. The band members were as well known for their backstage groupie antics, outrageous clothing, extreme high-heeled boots, heavy make-up, and seemingly endless abuse of alcohol and drugs as for their recordings. Their mixture of heavy metal and glam rock stylings produced several best-selling albums during the 1980s, including Shout at the Devil (September 26, 1983), Theatre of Pain (June 21, 1985), and Girls, Girls, Girls (May 15, 1987), which showcased their love of motorcycles, whiskey and strip clubs, and which told tales of substance abuse, sexual escapades, and general decadence.\n\nThe band members have also had their share of scrapes with the law and life. In 1984, Neil was driving home from a liquor store when he was in a head-on collision; his passenger, Hanoi Rocks drummer Nicholas \"Razzle\" Dingley, was killed. Neil, charged with a DUI and vehicular manslaughter, was sentenced to 30 days in jail (though he only served 18 days). The band would later release box sets entitled \"Music to Crash Your Car To\".\n\nOn December 21, 1987, Sixx suffered a near-fatal heroin overdose. He was declared legally dead on the way to the hospital, but the medic, who was a Crüe fan, revived Sixx by giving him two shots of adrenaline to the heart, bringing him back to life. His two minutes in death were the inspiration for the song \"Kickstart My Heart\", which peaked at #16 on the Mainstream U.S. chart, and which was featured on the 1989 album Dr. Feelgood. From 1986 to 1987, Sixx kept a daily diary of his heroin addiction and eventually entered rehab in January 1988. In 2006, Sixx published his diaries as a best selling novel: The Heroin Diaries: A Year in the Life of a Shattered Rock Star, and in 2007 Sixx's side project band Sixx: A.M. released The Heroin Diaries Soundtrack as a musical parallel to the novel.\n\nTheir decadent lifestyles almost shattered the band, until managers Thaler and McGhee pulled an intervention, and refused to allow the band to tour in Europe, fearing that \"some [of them] would come back in body bags\". Shortly after, all the band members except for Mars underwent drug rehabilitation; Mars cleaned up on his own.\n\nAfter finding sobriety in 1989, Mötley Crüe reached its peak popularity with the release of their fifth album, the Bob Rock-produced Dr. Feelgood, on September 1, 1989. On October 14 of that year, it became a No. 1 album and stayed on the charts for 109 weeks after its release. The band members each stated in interviews that, due in no small part to their collective push for sobriety, Dr. Feelgood was their most solid album musically to that point, and indeed, it was their best selling album to date. The title track and Kickstart My Heart were both nominated for Grammys in the Best Hard Rock Category.  The band did find some success at the American Music Awards, as Dr. Feelgood was nominated twice for Favorite Hard Rock/Metal Award, losing once to Guns N' Roses' Appetite for Destruction, but winning the following year, beating out Aerosmith's Pump and Poison's Flesh And Blood. Mötley Crüe was also nominated twice for Favorite Hard Rock/Metal Artist.\n\nIn 1989, Doc McGhee was fired after breaking several promises that he made to the band in relation to the Moscow Music Peace Festival including giving his other band, Bon Jovi, advantages with slot placement. Doug Thaler then soldiered on as sole band manager.\n\nOn October 14, 1991, the band's sixth album, Decade of Decadence, a compilation, was released. It peaked at #2 on the Billboard 200 album chart. It was reportedly designed as \"just something for the fans\" while the band worked on the next \"all-new\" album. Years of Turmoil: 1992–2003\n\nAfter Decade was released, Neil left the band in February 1992, at a time when other bands in the '80s glam metal scene (Ratt, Stryper, White Lion, Europe & Britny Fox) also broke up. Poison also fired guitarist C.C. Deville around this same time. A controversy exists to this day over whether Neil was fired or quit. Sixx has long maintained that Neil quit the band. However, Neil disputes this and insists that he was fired. Neil was replaced by John Corabi (formerly of Angora and The Scream). Mötley Crüe's commercial success waned throughout the 1990s, although their self-titled March 1994 release made the Billboard top ten (#7). Thaler would manage the band alone until 1994, at which time the band did a mass-firing when their album, Mötley Crüe, failed to meet commercial expectations.\n\nThe band reunited in 1997, after their current manager, Allen Kovac, and Neil's manager, Bert Stein, set up a meeting between Neil, Lee, and Sixx. Agreeing to \"leave their egos at the door,\" the band released Generation Swine. Although it debuted at #4, and in spite of a live performance at the American Music Awards, the album was a commercial failure, due in part to the band's label's lack of support (Elektra Records). The band soon left Elektra and created their own label, Mötley Records.\n\nIn 1998, Mötley Crüe's contractual ties with Elektra Records had expired, putting the band in total control of their future. This included the ownership of the masters of all its albums. In announcing the end of their relationship with Elektra Records, the band became one of the few groups in history to own and control their publishing and catalog of recorded masters. In 1999, the band re-released all their albums, dubbed as Crücial Crüe. The limited-edition digital re-masters included demos and previously unreleased tracks.\n\nIn 1999, Lee put his role in the band on hold to pursue a solo career due to increasing tension with frontman Neil. He was replaced by Randy Castillo, who drummed on several Ozzy Osbourne albums. Randy died of cancer on March 26, 2002. No replacement had been named, which sent the band into a hiatus following a 2000 tour in support of their studio release, New Tattoo. New Tattoo charted at #41 and sold less than 200,000 copies. Former Hole Drummer Samantha Maloney filled in on the tour to promote New Tattoo. The Salt Lake City performance of the tour is featured on the DVD Lewd, Crüed & Tattooed.\n\nWithin the following six years, Sixx played in the bands 58 and Brides of Destruction, while Lee formed Methods of Mayhem and performed as a solo artist. Neil continued touring on an annual basis as a solo artist, singing mostly Mötley Crüe songs. Mars, who suffers from a rare hereditary form of arthritis called ankylosing spondylitis, went into seclusion in 2001.\n\nA 2001 autobiography entitled The Dirt packaged the band as \"the world's most notorious rock band\". The book made the top ten on the New York Times best-seller list and spent ten weeks there.\n[edit] Reunion and new album: 2004–present\n\nA promoter in England, Mags Revell, started the ball rolling for Mötley Crüe's reunion when he started a promotion that basically revealed how fans wanted the band to reunite. After meeting with management several times, in September 2004, Sixx announced that he and Neil had returned to the studio and had begun recording new material. In December 2004, the four original members announced a reunion tour which began February 14, 2005, in San Juan, Puerto Rico. The band's latest compilation album, Red, White & Crüe, was released in February 2005. It features the band members' favorite original songs plus three new tracks, \"If I Die Tomorrow\", \"Sick Love Song\" (co-written by Sixx and James Michael), and a cover of The Rolling Stones' classic \"Street Fighting Man\". A small controversy was caused when it was suggested that neither Tommy nor Mick played on the new tracks (duties were supposedly handled by Vandals drummer Josh Freese and ex-Beautiful Creatures guitarist DJ Ashba). However, a VH1 documentary of the band reuniting would later show that Lee did indeed play on some of the tracks. The Japanese release of Red, White & Crüe includes an extra new track titled \"I'm a Liar (and That's the Truth)\". Red, White & Crüe charted at #6 and has since gone platinum.\n\nIn 2006, Mötley Crüe went on the Route of All Evil Tour, co-headlining with Aerosmith. This was another well-attended tour following the \"Carnival of Sins\" tour of 2005. In June 2007, Mötley Crüe set out on a small European tour. A lawsuit was recently filed by Neil, Mars, and Sixx against Carl Stubner, Lee's manager. The three sued him for contracting for Lee to appear on two unsuccessful reality shows the band claim hurt its image. It was reported on Motley.com that the lawsuit has been settled.\n\nOn June 11, 2008, the band and manager Burt Stein filed suit against each other. Stein was Vince Neil's personal manager and also, according to the band and rival manager Allen Kovac, served as the band's manager at one time. The band and Kovac sued in Los Angeles County Superior Court, claiming Stein was not entitled to a cut of Motley Crue's earnings. Stein sued the same day in Nashville's federal court, saying he was entitled to 1.875 percent of what the band makes. Other litigation between the parties also ensued in Nevada. In July 2009, lawyers for both sides announced that the disputes had been \"amicably resolved\" through a \"global settlement.\"\n\nMötley Crüe's ninth studio album, titled Saints of Los Angeles, was released in Japan on June 17, 2008, and in America on June 24, 2008. The album was originally titled \"The Dirt\", as it was loosely based on the band's autobiography of the same name, but the title was later changed. Saints of Los Angeles features the band's original lineup.\n\nMötley Crüe had announced that the movie The Dirt, based on the book written by Mötley Crüe and Neil Strauss, might be released in 2009. However, as of September 2009, the Internet Movie Database (IMDb) lists 2011 as the probable release date. This is still subject to change, particularly because the \"status\" of the movie was listed as \"unknown\" in April 2009 (the date of IMDb's last update to \"The Dirt\")[12]. Rumors about the cast of characters in this movie include Christopher Walken as the famous rock and roll star Ozzy Osbourne and Val Kilmer as David Lee Roth.\n\niTunes picked \"Saints Of Los Angeles\" in their \"Best of 2008\" in the Rock category as the number one song; the song was also nominated for a Grammy Award in the \"Best Hard Rock Performance\" category.\n\nThe track \"Saints of Los Angeles\" was released in the music game series Rock Band as downloadable content the day the single was released.\n\nThe band headlined the Download Festival in Donington Park (June 12-14, 2009), playing on the second stage on Friday night.\n\nThe band made a guest appearance in the season finale of \"Bones\" on May 14, 2009, entitled \"The End In The Beginning\", performing the classic song \"Dr. Feelgood\".\n\nMötley Crüe headlined \"Crue Fest 2\", which ran from July to September 2009. Supporting them were Godsmack, Theory of a Deadman, Drowning Pool, and Charm City Devils. In addition to performing a set featuring material from Saints of Los Angeles, the band also celebrated the 20th anniversary of Dr. Feelgood by performing the album in its entirety on each night of the tour.\n[edit] Related work\n\nIn 2005, Mötley Crüe was involved in an animation-comedy spoof Disaster! which was written by Paul Benson and Matt Sullivan and which was used as the introduction film to concerts on their Carnival of Sins tour.\n\nLegacy:\nActs such as Papa Roach, Buckcherry, Adelitas Way, Linkin Park, Marilyn Manson, Nine Inch Nails, Moby, Murderdolls, Backyard Babies, Private Line, Slipknot, The Living End, Belladonna, Mana, Hardcore Superstar, and Vains of Jenna have all cited Mötley Crüe as an influence in recent years, most notably for Too Fast for Love and Shout at the Devil. Disturbed drummer Mike Wengren has also cited Tommy Lee as an influence to his drumming. Mötley Crüe's early look in music videos has also been parodied by a variety of artists such as Bowling for Soup, Beck, Red Hot Chili Peppers, New Order, Aerosmith and the Backstreet Boys.\n\nThe band has been featured on a number of VH1 countdown shows, \"Dr. Feelgood\" was ranked the #7 Greatest Air Guitar Song, \"Live Wire\" was ranked the #17 Greatest Metal Song Of All Time, and \"Home Sweet Home\" was ranked the #12 Greatest Power Ballad Of All Time. Mötley Crüe was featured several times on VH1's 100 Most Metal Moments, the highest spot being #3. VH1 included the Tommy Lee sex tapes, The Dirt, and Ozzy Osbourne's and Nikki Sixx's pee. all featured in the countdown. Mötley Crüe has also been one of the many bands featured on VH1's Behind the Music. The band was also ranked #19 on VH1's list of the most popular hard rock bands. Mötley Crüe was also ranked tenth on MTV's list \"Top 10 Heavy Metal Bands of All-Time.\"\n\nBuilding on the popularity and the desire of fans to see The Crüe between World tours, a wide variety of tribute acts who celebrate and pay homage to the different eras and albums over the years has developed. Red Hot, a tribute from L.A., captures the look and feel of the Shout at the Devil era with black and red leathers. Theatre of Pain captures the spandex and lipstick attitude of the album of the same name. And Carnival of Sins rounds out the tributes with a rendition of the current Crüe image that brings to mind the crüdeness of the Mötley moniker. The band even has an all-female version from New York City, Girls Girls Girls, who cover all eras of the band's music without emulating the look of any specific Crüe era.\n\nBand members:\n    * Vince Neil - lead vocals, harmonica, occasional guitar (1981–1992, 1997–present)\n    * Mick Mars - lead & rhythm guitars (1981–present)\n    * Nikki Sixx - bass, backing vocals (1981–present)\n    * Tommy Lee - drums, percussion, piano, backing vocals (1981–1999, 2004–present)\n\n[edit] Former members\n\n    * John Corabi - lead vocals, rhythm guitar (1992–1997)\n    * Randy Castillo - drums, percussion (1999–2002)\n    * Samantha Maloney - drums, percussion (2002–2004)\n\n[edit] Discography\nMain article: Mötley Crüe discography\n\n    * Too Fast for Love (1981)\n    * Shout at the Devil (1983)\n    * Theatre of Pain (1985)\n    * Girls, Girls, Girls (1987)\n    * Dr. Feelgood (1989)\n    * Decade of Decadence (1991)\n    * Mötley Crüe (1994)\n    * Generation Swine (1997)\n    * New Tattoo (2000)\n    * Saints of Los Angeles (2008)\n\nTours:\n\n    * Anywhere, USA - Northern California Tour (1981)\n    * Too Fast For Love Tour (1981-1982)\n    * Crüesing Through Canada (1982)\n    * Mötley Crüe World Tour (1983-1984)\n    * Welcome To The Theatre Of Pain Tour (1985-1986)\n    * Girls, Girls, Girls World Tour 87/88 (1987)\n    * Moscow Music Peace Festival (1989)\n    * Dr. Feelgood World Tour '89 - '90 (1989-1990)\n    * Monsters Of Rock Tour 1991 (1991)\n    * Anywhere There's Electricity Tour Of The Americas 1994 (1994)\n    * Anywhere There's Electricity Japan Tour (1994)\n    * Live Swine Listening Party (1997)\n    * Mötley Crüe vs. The Earth Tour (1997)\n    * Greatest Hits Tour (1998-1999)\n    * Maximum Rock Tour (1999)\n    * Welcome To The Freekshow Tour (1999)\n    * Maximum Rock 2000 Tour (with Megadeth - 2000)\n    * New Tattoo Japan Tour 2000 (2000)\n    * Red, White & Crüe Tour 2005...Better Live Than Dead (2005)\n    * Carnival Of Sins Tour (2005-2006)\n    * Route of All Evil Tour (with Aerosmith - 2006)\n    * Mötley Crüe Tour 2007 (2007)\n    * Crüe Fest (with Buckcherry, Papa Roach, Sixx: A.M. and Trapt - 2008)\n    * Saints Of Los Angeles World Tour (2008)\n    * Saints Of Los Angeles Tour (2009)\n    * Saints of Los Angeles European Tour (2009)\n    * Crüe Fest 2 (2009)\n <a href=\"https://www.last.fm/music/+noredirect/M%C3%B6tley+Cr%C3%BCe\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
