{"artist":{"name":"Nana Mouskouri","mbid":"09b8609a-ca39-4f34-a2f6-5b81afc2c32d","url":"https://www.last.fm/music/Nana+Mouskouri","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cdc1a389c1a44c39b071cc077b5b8f3c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cdc1a389c1a44c39b071cc077b5b8f3c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cdc1a389c1a44c39b071cc077b5b8f3c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cdc1a389c1a44c39b071cc077b5b8f3c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cdc1a389c1a44c39b071cc077b5b8f3c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cdc1a389c1a44c39b071cc077b5b8f3c.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"108611","playcount":"1052178"},"similar":{"artist":[{"name":"Mireille Mathieu","url":"https://www.last.fm/music/Mireille+Mathieu","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b6682175f7884b1686ca293b76a38160.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b6682175f7884b1686ca293b76a38160.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b6682175f7884b1686ca293b76a38160.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6682175f7884b1686ca293b76a38160.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6682175f7884b1686ca293b76a38160.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6682175f7884b1686ca293b76a38160.png","size":""}]},{"name":"Sylvie Vartan","url":"https://www.last.fm/music/Sylvie+Vartan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5dd1bcd63e3044808bcbaf1ed15505e3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5dd1bcd63e3044808bcbaf1ed15505e3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5dd1bcd63e3044808bcbaf1ed15505e3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5dd1bcd63e3044808bcbaf1ed15505e3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5dd1bcd63e3044808bcbaf1ed15505e3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5dd1bcd63e3044808bcbaf1ed15505e3.png","size":""}]},{"name":"Vicky Leandros","url":"https://www.last.fm/music/Vicky+Leandros","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ce78e3d7c0d24b35b5efdd3548faea65.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ce78e3d7c0d24b35b5efdd3548faea65.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ce78e3d7c0d24b35b5efdd3548faea65.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ce78e3d7c0d24b35b5efdd3548faea65.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ce78e3d7c0d24b35b5efdd3548faea65.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ce78e3d7c0d24b35b5efdd3548faea65.png","size":""}]},{"name":"Isabelle Boulay","url":"https://www.last.fm/music/Isabelle+Boulay","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cba7c523203648319046500a5bb09c10.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cba7c523203648319046500a5bb09c10.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cba7c523203648319046500a5bb09c10.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cba7c523203648319046500a5bb09c10.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cba7c523203648319046500a5bb09c10.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cba7c523203648319046500a5bb09c10.png","size":""}]},{"name":"Barbra Streisand","url":"https://www.last.fm/music/Barbra+Streisand","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8d59e0d52493487da34fd21ef24e854e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8d59e0d52493487da34fd21ef24e854e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8d59e0d52493487da34fd21ef24e854e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8d59e0d52493487da34fd21ef24e854e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8d59e0d52493487da34fd21ef24e854e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8d59e0d52493487da34fd21ef24e854e.png","size":""}]}]},"tags":{"tag":[{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"Greek","url":"https://www.last.fm/tag/Greek"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"french","url":"https://www.last.fm/tag/french"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Nana+Mouskouri/+wiki"}},"published":"12 Mar 2006, 16:14","summary":"Nana Mouskouri (Greek: Νάνα Μούσχουρη, born Ioanna Mouskouri at October 13, 1934, in Chania, Crete, Greece) is a Greek singer and politician. She was known as Nana to her friends and family as a child. She is the world's highest-selling female recording artist, having sold over 300 million albums in fifteen languages, including Greek, French, English, Spanish, Italian, German, Latin, and Portuguese, over 450 albums. She is France's number one selling artist. <a href=\"https://www.last.fm/music/Nana+Mouskouri\">Read more on Last.fm</a>","content":"Nana Mouskouri (Greek: Νάνα Μούσχουρη, born Ioanna Mouskouri at October 13, 1934, in Chania, Crete, Greece) is a Greek singer and politician. She was known as Nana to her friends and family as a child. She is the world's highest-selling female recording artist, having sold over 300 million albums in fifteen languages, including Greek, French, English, Spanish, Italian, German, Latin, and Portuguese, over 450 albums. She is France's number one selling artist. She is noted for her trademark black-rimmed eyeglasses and her songs of melancholy, longing, and sentimental musings upon love, for which the emotion of her voice is exceptionally suited. Mouskouri has recorded from the 1960s into the new millennium. She has tailored releases to specific international markets with tremendous success, having acquired more than 230 gold and platinum albums worldwide.\n\nMouskouri's family lived in Canée, Crete, where her father, Constantin, worked as a film projectionist in a local cinema. Her mother, Alice also worked in the same local cinema as an usherette. When Mouskouri was three, Constantin moved the family to Athens. Mouskouri's family worked extremely hard in order to send Nana and her elder sister, Jenny, to the prestigious Athens Conservatoire. Mouskouri had displayed exceptional musical talent from the age of 6. However her sister, Jenny, appeared to be more the more gifted of the two. In fact Mouskouri only had one 'working' vocal chord (rather than the normal two). This a rare condition gives her voice its particularly original timbre.\n\nMouskouri's childhood was colored by the Nazi occupation of Greece. Her father became part of the Nazi resistance movement in Athens. Mouskouri began singing lessons at age 12. Despite the flaw in her vocal cords, Mouskouri took singing lessons regularly. During the Nazi German occupation, her family no longer had the financial means to pay for her singing lessons. But her teacher saw that she had a certain talent and continued to give her lessons free of charge. As a child, she listened to radio broadcasts of American jazz singers such as Frank Sinatra, Ella Fitzgerald, and Billie Holiday as well as French chanson stars like Edith Piaf.\nIn 1950, she was accepted at the Conservatoire. She studied classical music with an emphasis on singing opera. The young Mouskouri committed herself into classical music studies with a passion, perfecting her vocals with extraordinary self-discipline as well as taking piano and harmony classes. After 8 years at the Conservatoire, Mouskouri was encouraged by her friends to experiment with jazz music. She soon began singing with her friends' jazz group at night and they even managed to get a radio slot. However, when Mouskouri's Conservatory professor found out about Mouskouri's involvement with a genre of music that he considered to be absolutely worthless, he flew into a fury and prevented her from sitting her end of year exams. Consequently, the Conservatoire expelled her. Mouskouri's dreams of becoming an opera singer were dashed.\n\nMouskouri left the Conservatoire and began performing at the Zaki club in Athens. She began singing jazz in nightclubs with a bias on Ella Fitzgerald repertory. It was at the Zaki in 1958 that Mouskouri met the famous Greek composer Manos Hadjidakis. Hadjidakis was immensely impressed by Nana’s original voice and immediately offered to write songs for her. He became her mentor. In 1959 Mouskouri performed Hadjidakis' Kapou Iparchi Agapi Mou (co-written with poet Nikos Gatsos) at the inaugural Greek Song Festival. The song won first prize, and Mouskouri began to be noticed. At the 1960 Greek Song Festival, she performed two more Hadjidakis compositions, Timoria and Kiparissaki. Both these songs tied for first prize. Mouskouri soon ventured further and participated at the Mediterranean Song Festival, held in Barcelona where she performed Kostas Yannidis' composition Xypna Agapi Mou. The song won first prize. Her wins attracted interest from several international record companies. Mouskouri wound up signed a recording contract with the Paris-based Philips-Fontana axis.\n\nIn 1961, Mouskouri performed the soundtrack of a German documentary about Greece. This resulted in the German-language single Weisse Rosen aus Athen (\"The White Rose of Athens\"). The song was originally adapted from a folk melody by Hadjidakis. It became an enormous hit, selling over a million copies in Germany. The song was later translated into several different languages and it went on to become one of Mouskouri's signature tunes. Mouskouri married Yorgos Petsilas in 1961. Mouskouri and Petsilas have two children, son, Nicolas born in February 1968 and daughter, Hélène born in 1970. In 1974, Mouskouri and Petsilas separated and she moved to Geneva, Switzerland. In 1975, Mouskouri and Petsilas were officially divorced.\n\nIn 1962, she met renowned American song producer Quincy Jones. Jones got her to go to New York to record an album of American jazz titled, The Girl From Greece Sings. Following that she scored another hit in the United Kingdom with My Colouring Book.\n\nIn 1963, she left Greece to live permanently in Paris, France. Mouskouri performed Luxembourg's entry in the Eurovision Song Contest that year, À Force de Prier. The song became an international hit, and helped win her the prestigious Grand Prix du Disque in France. Mouskouri soon attracted the attention of French composer Michel Legrand, who composed her two major French hits Les Parapluies de Cherbourg (1964) and L'Enfant au Tambour (1965).\n\nIn 1965, she recorded her second English-language album that was released in the United States entitled, Nana Sings. Jamaican-American Calypso musician Harry Belafonte heard and liked the album. Belafonte brought Mouskouri on tour with him through 1966. They teamed for a live duo album entitled, An Evening With Belafonte/Mouskouri. During this tour, Belafonte told Mouskouri to remove her signature black-rimmed glasses when on stage. She was so unhappy with the request that she wanted to quit the show after only two days. Finally, Belafonte relented and respected her wishes to perform with her glasses.\n\nMouskouri's 1967 French album Le Jour Où la Colombe ascended her to superstardom in France. This album featured many of her French songs, Au Coeur de Septembre, Adieu Angélina, Robe Bleue, Robe Blanche and the French pop classic Le Temps des Cerises. Her rendition of Guantanamera was very well received. Mouskouri made her first appearance at Paris' legendary Olympia concert theater in 1967, with a repertoire blending French pop, Greek folk, and Hadjidakis numbers.\n\nIn 1968, Mouskouri turned her attention to the British market and hosted a variety show called Nana and Guests. In 1969, she released her first full-length British LP, Over and Over. It became a smash hit that spent almost two years on the U.K. charts. Mouskouri spent much of the 1970s on the road which helped to broaden her worldwide popularity to levels. In France, she released a series of top-selling albums that included Comme un Soleil, Une Voix Qui Vient du Coeur, Vielles Chansons de France, and Quand Tu Chantes. She also recorded a successful version of Habanera, from Bizet's opera Carmen. She continued to release highly received albums in Europe, including her 1975 album Sieben Schwarze Rosen which was a significant success in Germany, and her English-language album Book of Songs that sold millions of copies worldwide.\nIn 1979, Mouskouri had another English-language album named Roses and Sunshine. This album was very well received in Canada. She scored a worldwide hit in 1981 with Je Chante Avec Toi, Liberté, which was translated into several languages after its widespread success in France. The momentum from this album also helped boost her following German album, Meine Lieder Sind Meine Liebe. In 1984, Mouskouri returned to Greece for her first live performance in her homeland since 1962.\n\nIn 1986, Mouskouri recorded Only Love, the theme song to a BBC TV series that went on to top the U.K. charts. The song was also a hit with its French version, L'Amour en Héritage. That same year, Mouskouri made a play for the Spanish-language market with the hit single Con Todo el Alma. The song was a major success in Spain, Argentina and Chile. She released five albums in different languages in 1987, and the following year returned to her classical conservatory roots with the double LP The Classical Nana (aka Nana Classique), which featured some of her favorite opera excerpts.\nMouskouri's 1991 English album, Only Love: The Best of Nana Mouskouri became her best-selling release in the United States. She spent much of the 1990s with her rigorous global touring schedule. Among her early 1990s albums were spiritual music, Gospel (1990), the Spanish-language Nuestras Canciones, the multilingual, Mediterranean-themed Côté Sud, Côté Coeur (1992), Dix Mille Ans Encore, Falling in Love Again: Great Songs From the Movies. Falling in Love reunited her with Harry Belafonte on two songs.\nShe recorded several more albums over 1996-1997, including the Spanish Nana Latina (which featured duets with Julio Iglesias and Mercedes Sosa), the English-language Return to Love, and the French pop classics, Hommages. In 1997, she staged a high-profile Concert for Peace at the Cathedral of St. John the Divine in New York. This concert was later released as an album, and aired as a TV special on PBS in the U.S.\n\nMouskouri was appointed a UNICEF Goodwill Ambassador in October 1993 [1]. She took over from the previous ambassador, American actress Audrey Hepburn. Mouskouri's first U.N. mission took her to Bosnia to draw attention to the plight of children affected by Bosnian war. She was deeply moved by her experience in Bosnia and went on to give a series of fund-raising concerts in Sweden and Belgium.\n\nMouskouri represented Greece in the European Parliament from 1994 until 1999 as a member of the largely conservative New Democracy party.\n\nIn 1993, Nana recorded a new album, Hollywood. It was produced by Michel Legrand. Hollywood was a collection of famous film songs. It served was not only a tribute to the world of cinema, but also as a personal reference to childhood memories of sitting with her father in his projection room in Crete.\n\nBetween December 11-14, 1997, Mouskouri gave four triumphant performances at the Olympia in Paris to celebrate the 40th anniversary of her singing career. Also in 1997, Mouskouri resigned from her position as a European MP. She explained that a fervent pacifist, she refused to back wars.\n\nMouskouri currently lives in Switzerland with her second husband, André Chapelle whom she married on January 13, 2003. She still performs about 100 concerts each year. In 2004, her French record company released an unprecedented 34-CD box set of more than 600 of Mouskouri's mostly French songs.\n\nFor 2005 and 2007, she plans a farewell concert tour of Europe, Australia, Asia, South America, the United States, and Canada. During an interview with The Australian newspaper, when asked why this would be her final concert series, Mouskouri said she wanted to retire on a high note. \"I never thought that I would grow that old. It is better really to stop while you are standing well on your feet. I just want to be proud and in very good form and thank the audience for all this love,\" she said. <a href=\"https://www.last.fm/music/Nana+Mouskouri\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
