{"artist":{"name":"Negură Bunget","mbid":"aeeeaab0-7262-4eef-aa80-198c98b2ba95","url":"https://www.last.fm/music/+noredirect/Negur%C4%83+Bunget","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fe0b4b651bc14ffb90303b5525913de3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fe0b4b651bc14ffb90303b5525913de3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fe0b4b651bc14ffb90303b5525913de3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe0b4b651bc14ffb90303b5525913de3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe0b4b651bc14ffb90303b5525913de3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe0b4b651bc14ffb90303b5525913de3.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"60972","playcount":"2706762"},"similar":{"artist":[{"name":"Dordeduh","url":"https://www.last.fm/music/Dordeduh","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8cf246ddf7334242bfda45063d84c94b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8cf246ddf7334242bfda45063d84c94b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8cf246ddf7334242bfda45063d84c94b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8cf246ddf7334242bfda45063d84c94b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8cf246ddf7334242bfda45063d84c94b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8cf246ddf7334242bfda45063d84c94b.png","size":""}]},{"name":"Drudkh","url":"https://www.last.fm/music/Drudkh","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0e45a922b3fa4f69cf8591e81c54ee17.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0e45a922b3fa4f69cf8591e81c54ee17.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0e45a922b3fa4f69cf8591e81c54ee17.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0e45a922b3fa4f69cf8591e81c54ee17.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0e45a922b3fa4f69cf8591e81c54ee17.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0e45a922b3fa4f69cf8591e81c54ee17.png","size":""}]},{"name":"A Forest of Stars","url":"https://www.last.fm/music/A+Forest+of+Stars","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8f01127278f2e8218e4a9c0b6872a1a1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8f01127278f2e8218e4a9c0b6872a1a1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8f01127278f2e8218e4a9c0b6872a1a1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8f01127278f2e8218e4a9c0b6872a1a1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8f01127278f2e8218e4a9c0b6872a1a1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8f01127278f2e8218e4a9c0b6872a1a1.png","size":""}]},{"name":"Blut aus Nord","url":"https://www.last.fm/music/Blut+aus+Nord","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d1f56fa40f3943329585fe52ed762c8c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d1f56fa40f3943329585fe52ed762c8c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d1f56fa40f3943329585fe52ed762c8c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d1f56fa40f3943329585fe52ed762c8c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d1f56fa40f3943329585fe52ed762c8c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d1f56fa40f3943329585fe52ed762c8c.png","size":""}]},{"name":"Darkspace","url":"https://www.last.fm/music/Darkspace","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0b865d6e101e4a1ea0391c496e706ae6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0b865d6e101e4a1ea0391c496e706ae6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0b865d6e101e4a1ea0391c496e706ae6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0b865d6e101e4a1ea0391c496e706ae6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0b865d6e101e4a1ea0391c496e706ae6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0b865d6e101e4a1ea0391c496e706ae6.png","size":""}]}]},"tags":{"tag":[{"name":"black metal","url":"https://www.last.fm/tag/black+metal"},{"name":"atmospheric black metal","url":"https://www.last.fm/tag/atmospheric+black+metal"},{"name":"folk metal","url":"https://www.last.fm/tag/folk+metal"},{"name":"progressive black metal","url":"https://www.last.fm/tag/progressive+black+metal"},{"name":"Romanian","url":"https://www.last.fm/tag/Romanian"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/Negur%C4%83+Bunget/+wiki"}},"published":"08 Oct 2006, 12:29","summary":"Negură Bunget is a folk-influenced atmospheric black metal band from Timișoara, Romania. The band was formed in early 1995 by Hupogrammos (guitars, vocals, keyboards) and Negru (drums). The duo’s first demo, \"From Transilvanian Forests\", was recorded at Magic Sound Studio in Bucharest, November 1995, and released at the end of the same year, under the band’s original name, Wiccan Rede. The release of this demo was preceded by the band’s first live performance, in Buzau (June 1995) and was then followed by concerts all around Romania.  <a href=\"https://www.last.fm/music/+noredirect/Negur%C4%83+Bunget\">Read more on Last.fm</a>","content":"Negură Bunget is a folk-influenced atmospheric black metal band from Timișoara, Romania. The band was formed in early 1995 by Hupogrammos (guitars, vocals, keyboards) and Negru (drums). The duo’s first demo, \"From Transilvanian Forests\", was recorded at Magic Sound Studio in Bucharest, November 1995, and released at the end of the same year, under the band’s original name, Wiccan Rede. The release of this demo was preceded by the band’s first live performance, in Buzau (June 1995) and was then followed by concerts all around Romania. \nOnce their conceptual perspective shifted towards the exploration of the universe and spirituality of their ancestors, the band’s name changed to Negură Bunget. The new approach became clearly evident on the debut album, Zîrnindu-să, released by the newly founded Romanian label Bestial Records (late 1996).\n\nDecember 1998 brought Negură Bunget’s second release, Sala Molksa, a mini-album also released by Bestial Records. Sala molksa introduced the band’s third official member, Spurcatu, on guitars/bass. The 4 tracks unveil a much more straight-forward sound, complex, aggressive, atmospheric, fast - The Music of Transilvanian Spirituality. The band played in July 1999 at the Open Hell Festival in Volyne (Czech Republic).\n\nMăiastru sfetnic is the third opus of Negură Bunget. The album was released by Bestial Records in 1999 in a special digipak format (designed and handmade by Negură Bunget). More than 56 minutes, yet only 6 epic tracks, united in haunts, evilness, descent, atmospheres, speed and aggression, displaying the band’s vision on how a black metal-based world should have looked like.\nMăiastru sfetnic also brought the band a 3-album contract with Italian label code666 Records. A new track was recorded specially for code666’s compilation Better Undead Than Alive, and the band’s first video was shot for the same track (Văzduh) in the mountains of Transilvania.\n‘N crugu bradului album, the first one to be released by code666 Records, can be seen as a spiritual endeavor though the essences of the Transilvanian traditional spirituality. Just 4 tracks, symbolizing the evolution of a year’s 4 seasons, yet 54 minutes of conceptual black metal. The album was released in February 2003, and got positive reviews all over the media, making the band better known on the international scene. \nIn April/March 2004 Negură Bunget embarked on its first European tour, with gigs in Portugal, Germany, Belgium, Slovakia and Hungary. In the following summer the band also played at Under The Black Sun Festival in Germany and on Wanted Festival in Hungary. Finally, few gigs in Romania ended the year.\n2005 saw the release of the limited edition Inarborat Kosmos MCD. With lyrics in English, the 4-track EP offers an apparently traditional black metal, but turned complex by intricate and slightly chaotic guitar sounds, which have by now become a landmark of the band’s constant quest for the proper rendition of Transilvanian Spirituality. The CD also contains a multimedia section with 2 live recordings.\nA second European Tour followed in October-November 2005, in anticipation of the following album, OM. 23 gigs all over Europe showed the band live potential is no less than its studio one.\nOM is finally released by code666 Records in November 2006 in a special double digipak edition featuring a CD and a full DVD. With OM Negură Bunget proposes once again a new complete opus, focused around the symbolism and signification of one unitary concept. Romanian language offers a vast and complex signification: OM means MAN (the human being), but OM is also the main contemplative state for elevation in traditional esotericism.\n\nA new extended European Tour took place in April/May 2007, with the band performing more than 40 concerts throughout the Europe. Another tour was done at the end of 2007, focused more on Netherlands and Germany.\n\nIn October 2007 Negură Bunget signed a contract with German label Lupus Lounge / Prophecy Production followed by the release in 2008 of the early Negură Bunget albums on a special digipak edition. A live DVD was also recorded at the beginning of 2008 and is planned to be released by Prophecy Productions in the second part 2010.\nThe begging of 2008 marked yet another European tour for Negură Bunget, this time along The Vision Bleak and Farsot. This was followed by a Romanian tour in April. In the summer of 2008 Negură Bunget played some of the most important metal festivals: Wacken Open Air and Summerbreeze, and also Artmania Festival, Kaltenbach Open Air, Rockmania Festival, Paalisare Rock Fest. Another extended European Tour was completed in October/November 2008.\n\nThe spring of 2009 bought new challenges for the Negură Bunget. Founding member Hupogrammos, along Sol Faur left the band, and a new line-up was formed, featuring Corb on guitars and vocals and Spin on guitars. The first gigs in the new line-up followed soon after, including Graspop Metal Meeting, MetalCamp, Brutal Assault Festival, Hole in the Sky Festival.\n\nThe work on Măiestrit, a re-interpretation of the original Negură Bunget album Măiastru sfetnic was finalized before the end of 2009, and the album was released in March 2010, by Prophecy Productions as the last material of the old line-up.\n\nSoon after the band started to work on a new album, entitled Vîrstele pămîntului, which was completed on seclusion in the wilderness of the mountains. Vîrstele pămîntului (Ages of the Land/Earth) is as the title suggests an album about ages, about places of the earth and places of the spirit, about bounds transcending worlds. It’s an album about embracing your destiny, about choosing and consciously assuming a way of life. The album was released by code666 Records in March 2010, in a special handmade woodbox edition, and immediately got some amazing review across the media. A full European Tour, entitled Spirit of the Land followed in March/April/May 2010, with almost 50 across Europe, presenting the new materials.\n\n2010 was the most intense year in the history of Negură Bunget. Two albums released, followed by a long European tour as headliners (Spirit of the Land Tour), another tour in autumn (Black Trolls Over Europe - 10 dates), some festivals in between (including Hellfest) and a lot of work, all make this year special and unforgettable. Figures for 2010: 72 gigs played, 2 European Tours as headliners, more than 50.000 km of driving on our van, 66 answered interviews, more than 10.000 CD’s sold.\n\n2011 marked 15 years of Negură Bunget, so all the band activities celebrated this anniversary. April brought the release of the Live DVD - Focul Viuand of the MCD - Poartă de dincolosymbolically marking the end of the 10 years cooperation with Code666 Records. April also meant a tour along Norwegian legends Enslaved. Some summer festivals were played - Exit and Party San. The second part of 2011 saw the band on the Transilvanian Legacy Tour, traveling through Europe and Romania, playing more than 35 dates. In 2011 Negură Bunget started developing its most ambitious project, The Transilvanian Trilogy, a complex musical and visual trilogy.\n\n2012 was another busy year for the band. March brought Negură Bungeton Paganfest Europe 2012 on a amazing line-up along Eluveitie, Primordial, Heidevolkand Solstafir. April/May was time for the very first US and Canadian tour - 40 dates were set for this amazing endeavor Transilvanian Legacy US. Some summer festivals followed. The first part of the visual & musical trilogy was developed and a complex production and recording process started. Some media recognition - the band was voted Best Romanian Metal band in 2012 by www.metalhead.ro, Romanian leading metal Portal and Metal Artist of 2012 by www.czb.ro.\n\nThe 2013 started again intensely, with a complete reset of the band studio and live concept, meant to open brand new paths for Negură Bunget. The EPgînd a-prinswas completed in the first part of the year, as an introduction for the TĂUalbum. The band presented live this evolution on the TĂU tour, traveling throughout all Europe again.\n\nThe name:\nThe band explains: \"A powerful dark presence of an intense nature, connected with the local nature and with its spirit, ascending and descending, shaping through the clouds of the present. You can sometimes feel it is there, but you cannot grab it. Only your clean mind and soul can came close of its presence. From the very beginning we shaped ourselves into relating with it, so that is now part of us. That’s how we understand Negură Bunget. Negură Bunget is a black fog coming from a deep dark dense forest. The name tries to picture somehow the kind of atmosphere, both musical and spiritual we’d want to create through our music. It has also a symbolical nature, standing for the inexpressible parts of our ideology. The two words are also from the Tracic substrate of the Romanian language (the oldest one, containing about 90 words) as the interest for our local history and spirituality is something of crucial importance and meanings for us as a band.\"\n\nCurrent members:\nGabriel Mafa / Negru - drums, percussion, dulcimer, xylophone, horns\nTibor Kati - vocals, guitars, keyboards, programming\nAdrian Neagoe - guitars, vocals, keyboards\nPetrică Ionuțescu - pipes, horns, duduk, traditional instruments\nOvidiu Corodan - bass\n\nPast members\nGădineț - bass (2009-2013)\nInia Dinia - keyboards (2005-2013) (Argus Megere)\nFulmineos - vocals, guitar (2010-2013) (Argus Megere, Kultika, Fogland, Ekasia, Ordinul Negru, Nocturnal Invocation, Cursed Cemetary, Karpates Omos, Apollinic Rites, Ultima Candela)\nUrzit - guitar\naGer (Ageru Pamintului) - percussion, xylophone, pipes, vocals (2003-2012)\nHupogrammos Disciple's (Edmond Karban) - vocals, guitars, keyboards, folk instruments (1995-2009) (Makrothumia, Dordeduh)\nSol Faur (Spurcatu) - guitars, bass (1997-2005, 2006-2009) (Dordeduh)\nUrsu (aka Ermit) - live bass (1997-2007), studio bass on \"N'Crugu Bradului\" and \"Om\"\nAivazz Valah Disciple - keyboards (1995)\nDaniel - live keyboards (1997-1998) (Thy Veils)\nVampir (Naval) - live keyboards (1996-1997, 1998-2005), bass (1997-1998)\nNecuratu - live percussion (2000-2002)\nFreak (Teodor Alexuta) - live percussion (2003) (also in Vokodlok)\nAndrei Popa - live guitar (2005) (My Shadow) \nSpin - guitars (2009-2010)\nCorb - vocals, guitars, dulcimer (2009-2010)\n\nDiscography:\nFrom Transilvanian Forest (demo) - self-released, 1995\nZîrnindu-să - Bestial Records, 1997 (tape version)\nZîrnindu-să (CD) - Breath of Night Records, 1998\nSala molksa (MCD) - Bestial Records, 1998\nMăiastru sfetnic (handmade digipak) - Bestial Records, 2000\n‘N crugu bradului (handmade digibox) - Code666 Records, 2003\nInarborat Kosmos (digi MCD) - Code666 Records, 2005\nCD BOX - re-edition of the first 3 CD’s - Negura MUSIC, 2005\nOM (CD/DVD, double digipak) - Code666 Records, 2006\nFrom Transilvanian Forest (digipak, re-release, box) - Lupus Lounge/Prophecy Productions, 2008\nZîrnindu-să (double digipak, re-release, box) - Lupus Lounge/Prophecy Productions, 2008\nSala Molksa (double digipak, re-release, box) - Lupus Lounge/Prophecy Productions, 2008\nMăiastru sfetnic (digipak, re-release, box) - Lupus Lounge/Prophecy Productions, 2008\nMăiestrit (digipak, artbook) - Lupus Lounge/Prophecy Productions, 2010\nVîrstele pămîntului (digipak, handmade woodbox) - Code666 Records, 2010\nPoartă de dincolo (digi MCD) - Aural Music/Code666 Records, 2011\nFocul Viu - Live DVD (DVD, 2CD) - Lupus Lounge/Prophecy Productions, 2011 <a href=\"https://www.last.fm/music/+noredirect/Negur%C4%83+Bunget\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
