{"artist":{"name":"B.U.G. Mafia","mbid":"b324dcad-82fa-4fe2-9a97-26fff814d36e","url":"https://www.last.fm/music/B.U.G.+Mafia","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5fbb7c0354834cae86da8df12e5838e4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5fbb7c0354834cae86da8df12e5838e4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5fbb7c0354834cae86da8df12e5838e4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5fbb7c0354834cae86da8df12e5838e4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5fbb7c0354834cae86da8df12e5838e4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5fbb7c0354834cae86da8df12e5838e4.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"16577","playcount":"384696"},"similar":{"artist":[{"name":"Bitza","url":"https://www.last.fm/music/Bitza","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1c9a6b6d4a1a4d63ba390fb2f5737beb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1c9a6b6d4a1a4d63ba390fb2f5737beb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1c9a6b6d4a1a4d63ba390fb2f5737beb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1c9a6b6d4a1a4d63ba390fb2f5737beb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1c9a6b6d4a1a4d63ba390fb2f5737beb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1c9a6b6d4a1a4d63ba390fb2f5737beb.png","size":""}]},{"name":"La Familia","url":"https://www.last.fm/music/La+Familia","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a415d31adcf74cc6bd17b18b910b9b05.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a415d31adcf74cc6bd17b18b910b9b05.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a415d31adcf74cc6bd17b18b910b9b05.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a415d31adcf74cc6bd17b18b910b9b05.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a415d31adcf74cc6bd17b18b910b9b05.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a415d31adcf74cc6bd17b18b910b9b05.png","size":""}]},{"name":"Ombladon","url":"https://www.last.fm/music/Ombladon","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d91d606aa02e4d9d84955b56c53591bb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d91d606aa02e4d9d84955b56c53591bb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d91d606aa02e4d9d84955b56c53591bb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d91d606aa02e4d9d84955b56c53591bb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d91d606aa02e4d9d84955b56c53591bb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d91d606aa02e4d9d84955b56c53591bb.png","size":""}]},{"name":"Sisu Si Puya","url":"https://www.last.fm/music/Sisu+Si+Puya","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2844491aae0144efaa9b47324aed2a9e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2844491aae0144efaa9b47324aed2a9e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2844491aae0144efaa9b47324aed2a9e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2844491aae0144efaa9b47324aed2a9e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2844491aae0144efaa9b47324aed2a9e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2844491aae0144efaa9b47324aed2a9e.png","size":""}]},{"name":"Grasu XXL","url":"https://www.last.fm/music/Grasu+XXL","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1d2e9150bc6641768d8d44eac6b0c1a9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1d2e9150bc6641768d8d44eac6b0c1a9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1d2e9150bc6641768d8d44eac6b0c1a9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1d2e9150bc6641768d8d44eac6b0c1a9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1d2e9150bc6641768d8d44eac6b0c1a9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1d2e9150bc6641768d8d44eac6b0c1a9.png","size":""}]}]},"tags":{"tag":[{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"Romanian","url":"https://www.last.fm/tag/Romanian"},{"name":"Romanian Hip-Hop","url":"https://www.last.fm/tag/Romanian+Hip-Hop"},{"name":"rap","url":"https://www.last.fm/tag/rap"},{"name":"BUG Mafia","url":"https://www.last.fm/tag/BUG+Mafia"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/B.U.G.+Mafia/+wiki"}},"published":"18 Feb 2006, 19:44","summary":"Bucharest Underground Mafia = B.U.G. Mafia\n1993 — Începuturi\n\nLa sfârşitul anului 1993, pe vremea când albumele de hip hop circulau doar în cercuri restrânse, iar cd-urile erau obiecte rare şi preţioase, Dragoş Vlad-Neagu îl întâlneşte pe stradă pe Vlad Irimia. Ei intră în vorbă, subiectul fiind pălărioara purtată de Vlad care era brodată de mână cu numele unei formaţii de gen, celebră şi acum, adică Cypress Hill. Amândoi <a href=\"https://www.last.fm/music/B.U.G.+Mafia\">Read more on Last.fm</a>","content":"Bucharest Underground Mafia = B.U.G. Mafia\n1993 — Începuturi\n\nLa sfârşitul anului 1993, pe vremea când albumele de hip hop circulau doar în cercuri restrânse, iar cd-urile erau obiecte rare şi preţioase, Dragoş Vlad-Neagu îl întâlneşte pe stradă pe Vlad Irimia. Ei intră în vorbă, subiectul fiind pălărioara purtată de Vlad care era brodată de mână cu numele unei formaţii de gen, celebră şi acum, adică Cypress Hill. Amândoi aveau deja tentative de intrare în lumea hip hop ca artişti şi pun bazele trupei Black Underground la începutul lui ’94 împreună cu alţi doi băieţi care la scurt timp părăsesc această trupă, îndreptându-se probabil către alte domenii. Dragoş şi Vlad, cu numele de scenă Klax 187 şi respectiv Doom (astăzi Caddy şi Tataee), reuşesc să îşi înregistreze prima piesă, în limba engleză, cu ajutorul lui Adi Niculescu, acţionratorul emisiuni “Yo!Rap Is Moving!” de la radio Uniplus. După ce în prealabil fusese cântată live în cadrul emisiunii mai sus amintite, piesa “Straight Outta Da Hell” rulează acum, în aceeaşi emisiune, sub formă de pozitiv făcut în studioul de producţie al Uniplus-ului.\n\nBăieţii continuă să creeze piese în engleză, realizându-şi instrumentalele cu ajutorul lui Romeo Vanica, pe keyboard-ul acestuia. Pe 6 octombrie 1994, trupa are prima apariţie live într-un concert organizat în Club A de către DJ Sleek, primul promoter al hip hop-ului în România. Urmează o serie de show-ri, pe la baluri de boboci ale unor licee din Bucureşti, alături de cei de la M&G. Se mai înregistreză două piese în engleză care însă nu apar pe radio. În căutare de colaboratori, Klax 187 şi Doom întâlnesc trupa Demonii, din care făcea parte şi Uzzi, pe atunci sub numele de scenă Drama. Se formează o grupare, Cartelul, împreună cu un al treilea membru, Nicollo, artist solo.\n\nPrima evoluţie live a grupării se produce la concertul “Rap Attack” din martie 1995, organizat de către Adi Niculescu la teatrul “Ion Creangă”. Publicul de hip hop creşte de la câteva zeci la câteva sute. Demonii se destramă, iar Alin Demeter, adică Drama este cooptat în Black Underground. Odată cu venirea noului component, trupa trece de la engleză la română. Cei trei apar astfel la “Rap Attack”, ediţia a doua, făcându-şi deja loc în topul trupelor de gen pe atunci încă necomercializate. La începutul verii lui ’95 trupa semnează primul contract de producţie, multiplicare şi comercializare cu casa de discuri Amma, urmând ca piesa “Psihopatu’” sa între pe o compilaţie de rap. Totodată, numele trupei se măreşte devenind Black Underground Mafia, iar Drama şi Doom fac pasul către trecerea la Uzzi şi respectiv Mr.Juice.\n\n1995 — Mafia\n\nPe 20 septembrie 1995 apare primul album al trupei numit “Mafia”, lansat la tarabă în Piaţa Universităţii. Pe acest album, invitaţi pe piese sunt M&G şi Marijuana, iar pe interludii Rona Hartner, “Coco” Coroianu, Ben, Alex. Materialul discografic înregistrat în studioul lui Tino Furtuna de la Holograf este al treilea ca dată a apariţiei pe piaţa din hip hop-ul românesc, după cele ale trupelor Racla şi Paraziţii şi urma să fie reeditat în ‘97, fără acordul trupei, la o altă casă de discuri, sub pretextul că ar fi un material nou. Băieţii, deja cu un album la vânzare, înregistrează cel de-al doilea album în regim propriu cu bani împrumutaţi de la Dragoş Hriscu, un bun prieten, actualmente patronul clubului Zebra din Bacău. Trupa se numeşte acum B.U.G. Mafia, după abrevierea cuvintelor Bucuresti UnderGround şi reuşeşte să semneze un nou contract, de data aceasta însă cu Cat Music.\n\nLansat pe 8 iunie 1996, E.P.-ul (album scurt) ”Înc-o Zi, Înc-o Poveste”, gata de multiplicat la ora semnării contractului, aduce mai multă melodie scoasă bine în evidenţă şi de prezenţa vocii feminine a Iulianei “July” Petrache pe piesa “Pantelimonu’ Petrece”. Aceeaşi piesă, devenită hit, este respinsă de către Tele7ABC ca propunere în vederea realizării unui videoclip. Prin topurile câtorva radiouri din ţară au mai stat puţin “Înc-o Zi, Înc-o Poveste” şi “Viaţa De Borfaş”. Încep concertele în afara Bucureştiului, primul fiind în Bacău. Iar vânzările urcă, ajungând la bilanţul final, adică la retragerea de pe piaţă, cu o cifră de peste 22.000 de exemplare. Pe 29 noiembrie 1996, B.U.G. Mafia aruncă pe piaţă cea de a treia bombă, albumul “Născut Şi Crescut În Pantelimon”. Piesa “Până Când Moartea Ne Va Despărţi”, pe care apare pentru prima dată Puya, face ravagii. Trupa este într-o continuă creştere. La succesul albumului mai contribuie piesele “Născut Şi Crescut În Pantelimon” şi “Lacrimi”. Colaboratorii sunt într-un număr mai mare, astfel că îi întâlnim, pe lângă Puya, şi pe: July, Baxter, FreakaDaDisk, Trăgaci, C.R.Bel. Apar chitara reală şi scratch-ul. Totul sună mai bine şi mai interesant. Klax187 îşi schimbă numele în Daddy Caddy. Vânzările depăşesc 30.000 de exemplare. Până la acest album inclusiv, băieţii l-au avut ca inginer de sunet pe Emil “Coco” Coroianu.\n\nLa începutul verii lui ’97 apare primul maxi-single al mafioţilor, “Hoteluri”, compus din piesa care îi dă numele, remixul acesteia, instrumentalele şi o piesă bonus. Coperta casetei este de carton, “ca afară’. Se vând 20.000 de exemplare. Tot în ’97, însă în toamnă, Uzzi, Caddy, Juice, împreună cu Sişu şi Puya (membrii trupei La Familia) sunt arestaţi, după terminarea unui concert la Turnu Severin, pentru “ultraj contra bunelor moravuri” - articolul 231 din codul penal. Toţi au fost eliberaţi după 10 ore în care au dat declaraţii la poliţie şi procuratură. A doua zi presa scria despre acest incident, aducându-i astfel pe băieţi şi mai mult în atenţia marelui public. De atunci nu au mai avut nicio problemă în legătură cu acest caz. În aceeaşi toamnă a anului 1997 se lansează, la club Martin, “Deasupra Tuturor”, album care aduce cu sine premiera de a fi imprimat, pe lângă casetă şi pe CD. Se remarcă piesele “Marijuana 2”, ”Nimic Mai Presus”, “Jucător Adevărat” şi “Delicvent La 15 Ani”. Ca invitaţi subscriu: Puya, July, Baxter, Gunja şi Raluca. Sound-ul începe să se apropie de adevăr. Se folosesc başi reali şi efecte pe voci. DJ Phantom (C.R.Bel) îi ajuta pe băieţi să introducă sample-uri în muzica lor. Deşi nu a beneficiat de niciun hit răsunător ca albumele precedente, “Deasupra Tuturor” a atins cota de 45.000 de exemplare vândute.\n\nÎn iunie ’98 iese maxi-single-ul “Pentru ‘98”. Piesa bonus a acestui material, ”N-ai Fost Acolo”, este cea care anunţă practic apariţia unui album tare. Pe 20 septembrie 1998 are loc lansarea albumului “De Cartier”. Invitaţi să colaboreze, şi-au adus aportul la realizarea acestuia: Cătălina, Tenny-e(Cheloo), Don Baxter, Puya, Gunja, July şi Andreea. Piesa de promovare, “Poveste Fără Sfârşit”, urcă rapid în top, iar lumea cumpără albumul în draci. Trupa câştigă fani din toate păturile sociale. Toată lumea vorbeşte despre ei şi controversa creşte la maxim. La “Galele Ballantine’s” câştigă premiul pentru “cea mai bună piesa rap”, dar pierd premiul pentru “cea mai bună piesă a anului” în faţa celor de la Holograf, fapt ce face ca toata lumea să se ridice, să bată din picioare şi să scandeze “MA-FI-A!”. Presa îi prezintă cu titlul “Fenomenul B.U.G. Mafia”. Mihai Tatulici îi invită la emisiunea “Audienţa Naţională”. Albumul este susţinut în continuare de alte piese, bune de top, însă prea puţin difuzate deoarece aveau versuri care trebuiau cenzurate sau abordau subiecte care pe prea mulţi îi speriau. Printre ele se numără: ”Limbaj De Cartier”, “Hai Să Fim High”, “De Cartier”, “La Vorbitor” şi altele. Loredana Groza le propune băieţilor să scoată în colaborare un maxi-single. Mafia acceptă şi produce “Lumea E A Mea”, piesa care are parte de primul videoclip profesionist făcut vreodată în România. “Lumea E A Mea” se vinde în 25.000 de exemplare, iar “De Cartier” în 125.000 de exemplare.\n\n1999 — Concert la Sala Polivalentă\n\nPe 13 martie ’99, la Sala Polivalentă, are loc cel mai mare concert al trupei. Datorită amplorii pe care o luase “fenomenul”, băieţii au fost chemaţi la IGP pentru a da câte o declaraţie referitoare la materialul pe care îl aveau la vânzare. În august ’99 iese un nou maxi-single, “România”, care vorbeşte despre patriotism, despre condiţia socială a românilor şi despre modele demne de urmat cum ar fi: Hagi, Lăcătuş şi Ghiţă Mureşan. Leonard Doroftei le cere permisiunea de a intra în ring, la toate meciurile, pe această piesă, spunând că îl motivează. Deşi era prevăzut să îi pregătească terenul, nicio piesă de pe “România” nu se regăseşte pe albumul “După Blocuri” deoarece, zic ei, ”erau prea multe idei şi nu au mai încăput”.\n\nMafia concertează la penitenciarul Rahova la cererea mai multor deţinuţi. Albumul se lasă aşteptat până pe data de 18 ianuarie 2000. Piesa care dă numele albumului, “După Blocuri”, este aleasă ca single. Se face videoclip pe peliculă, regizor fiind Bogdan Albu, iar operator Viorel Sergovici, ca şi la cel cu Loredana, care este filmat însă în digital. Acesta este primul videoclip exclusiv al trupei. La piese colaborează M&G, Luchian, Nico, Puya şi Roxana, iar la interludii Ţeavă, Pleşa, Greu’ şi Cătălin. Lui Juice i se spune de acum Tataee. Deşi cel mai bine închegat din punct de vedere muzical, albumul este “închis şi violent”. Versurile sunt mai simple, mai dure şi mai directe decât pe albumul precedent. Alte piese foarte ascultate sunt: “Capu’ Sus”, “Anturaju’”, “La Greu”, “Cartieru’ Pantelimon”. Vânzările sunt şi de această dată foarte bune, adică 90.000 de exemplare. Cum după ploaie vine întotdeauna soare, băieţii ies în august 2000 cu o piesă deschisă, melodică, în colaborare pentru prima dată cu Villy pe care îl cunoşteau din ’97, de la Zalău. “Un 2 Şi Trei De 0”, aşa se numeşte piesa, este lansată pe maxi-single. Radiourile o difuzează, cluburile o introduc în program, iar videoclipul lui Tudor Giurgiu uimeşte pe toată lumea. Pe 17 octombrie 2000 apare albumul “Întotdeauna Pentru Totdeauna” care nu aduce prea mare succes, dar se vinde în peste 70.000 de exemplare. Colaboratori: M&G, Puya, Luchian, Maximillian, Pacha Man, Villy şi Moni-K. Este prima oară când scot 3 materiale într-un singur an.\n\nÎn 2001, B.U.G. câştigă premiul “cel mai bun album rap”, cu “După Blocuri”, la Premiile Industriei Muzicale, dar şi “cea mai bună trupă rap” şi “cel mai bun videoclip”, cu “Un 2 şi Trei De 0”, la Premiile Bravo. Tot în 2001 trupa realizează o nouă premieră, extrăgând pe maxi-single piesa “Poezie De Stradă” de pe albumul “Întotdeauna Pentru Totdeauna”, care era deja pe piaţă. Remixul acesteia are parte de un videoclip din nou foarte bun şi devine în scurt timp hit. Produsul este cel mai bine vândut maxi-single al trupei (peste 50.000 de exemplare). Băieţii pun pe picioare casa de producţie “Casa” şi îi semnează pe M&G, Villy, XXL&10Grei, Mahsat, Anturaj şi Luchian.\n\n2002 — B.U.G. Mafia Prezintă CASA\n\nCompilaţia “B.U.G. Mafia Prezintă Casa” este lansată pe 20.02.2002, în clubul Dumars (cu intrare la ora 20.02) şi se doreşte a fi o prezentare a tuturor artiştilor semnaţi. În videoclipul piesei “Cine E Cu Noi” (piesa de promovare a compilaţiei) apar Leonard Doroftei şi Marius Lăcătuş, care sunt de fapt menţionaţi şi în versuri. Pe refrenul piesei îşi dă concursul Nico. Şi această piesă devine hit. La Premiile Industriei Muzicale 2002 câştigă premiul “cel mai bun proiect rap” cu “Poezie De Stradă”. Vânzările trupei B.U.G. Mafia urcă din nou, compilaţia vânzându-se în 100.000 de exemplare.\n\nUrmează o pauză discografică de aproape 2 ani, timp în care se pregătesc albume ale mai multor artişti de la Casă. În componenţa trupei B.U.G. apare al 4-lea membru, DJ Swamp. “Orice trupă de hip hop trebuie să aibă un dj”.\n\nPe 1 decembrie 2003 apare videoclipul piesei “Româneşte”, iar pe 7 decembrie, acelaşi an, apare albumul “Băieţii Buni”. Materialul este cel mai complex de până acum cuprinzând 15 piese, 5 interludii, intro şi outro. Invitaţi sunt: Villy, M&G, XXL&10Grei, Mahsat, Mario (fost membru Anturaj, trupă care nu mai există), Luchian, Flocea, Brasco şi Primo. Următorul videoclip esta la piesa “O Lume Nebună, Nebună De Tot”. Alte piese remarcate sunt: “În Anii Ce Au Trecut”, “Gherila PTM”, “40 Kmh”, “Garda” şi “Prin Cartieru’ Minunat”. Este al 2-lea album, incluzându-l pe primul (“Mafia”), care nu are voce feminină pe niciun refren şi totodată primul album al unei trupe de la Casa.\n\nMafia este singurul nume cu 5 nominalizări la Premiile MTV 2004. Au reuşit să plece acasă cu două dintre ele, “cel mai bun album” şi “cel mai bun act hip hop”, şi în acest sens fiind singurii. Vânzări: 100.000 de exemplare. În septembrie 2004, din partea MediaPro Pictures vine propunerea de a realiza piesa de generic a serialului poliţist “Băieţi Buni” pe care aceştia urmau să-l producă. Proiectul este acceptat şi aşa se naşte piesa “Străzile”, care nu putea să poarte numele filmului deoarece Mafia avea deja albumul “Băieţii Buni”. Lansarea filmului se tot amâna, iar băieţii trebuie să aştepte şi ei, în acest timp pregătind un maxi-single.\n\nAl 3-lea produs Casa iese pe piaţă pe 5 ianuarie 2005, acesta fiind albumul “Asalt Raggafonic” al trupei M&G. Proiectul beneficiază de două videoclipuri: unul în peliculă şi unul în HD. În sfârşit serialul a pornit, B.U.G. Mafia a terminat maxi-single-ul “Străzile”, astfel că pe 16 mai 2005 este aşteptat pe piaţă. Materialul cuprinde piesa originală, remixul acesteia, o altă piesă nouă, instrumentalele acestora şi două piese bonus (remixuri la piese mai vechi) menite să introducă albumul aniversar.\n\n2006 — Viaţa Noastră\n\nApare primul volum din albumul aniversar „Viaţa noastră”. Conţine 14 dintre cele mai cunoscute piese ale trupei şi single-ul care dă numele albumului. Deşi în mod normal, un album aniversar include hituri în forma lor iniţială, totuşi B.U.G. Mafia a hotărât să reînregistreze absolut toate piesele, deoarece până la un moment dat în România posibilităţile tehnice au fost destul de reduse. Toate vocile feminine au fost înlocuite, fiind preferată Adriana Vlad, selectată dintre câteva soliste. La acest album şi-au mai adus aportul Villy şi Cheloo. Părerea membrilor trupei este că toate piesele de pe album sună categoric mai bine, dar aşteaptă şi opinia fanilor. Înregistrările pentru acest album au început în 2004, fiind întrerupte pentru lansarea maxi-single-ului „Străzile”. La reluarea acestor înregistrări a început cu adevărat lucrul la albumul „Viaţa Noastră - vol. 1”.\n\nSurpriza pentru fani o constituie ediţia specială a acestui album, într-un ambalaj de lux, care va conţine un bonus de patru videoclipuri („Viaţa noastră”, „Româneşte”, „Un 2 şi trei de 0”, ”Poezie de stradă”).\n\n 2009 — Viaţa Noastră vol. 2 \n\nAl 2-lea volum al albumului aniversar a fost lansat în data de 11 august.\nBucuresti, Romania\n1.10.1993\nCaddillac\nTataee\nUzzi\n\nwww.bugmafiaoficial.com <a href=\"https://www.last.fm/music/B.U.G.+Mafia\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
