{"artist":{"name":"Nick Cave and the Bad Seeds","mbid":"172e1f1a-504d-4488-b053-6344ba63e6d0","url":"https://www.last.fm/music/+noredirect/Nick+Cave+and+the+Bad+Seeds","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/282f8a4d1da04b44be1fb6214aeffaeb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/282f8a4d1da04b44be1fb6214aeffaeb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/282f8a4d1da04b44be1fb6214aeffaeb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/282f8a4d1da04b44be1fb6214aeffaeb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/282f8a4d1da04b44be1fb6214aeffaeb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/282f8a4d1da04b44be1fb6214aeffaeb.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"0","playcount":"0"},"similar":{"artist":[]},"tags":{"tag":[{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"post-punk","url":"https://www.last.fm/tag/post-punk"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"alternative rock","url":"https://www.last.fm/tag/alternative+rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/Nick+Cave+and+the+Bad+Seeds/+wiki"}},"published":"05 Feb 2006, 01:28","summary":"Nick Cave and the Bad Seeds were formed in 1983 in West Berlin, Germany by two former members of the Australian band The Birthday Party: Nick Cave (vocals, songwriter, keyboards, harmonica) and multi-instrumentalist Mick Harvey. The duo were joined by Einstürzende Neubauten member Blixa Bargeld (guitar), Hugo Race (guitar), and former Magazine member Barry Adamson (bass, piano). Cave's then girlfriend Anita Lane was also a creative influence and occasional lyricist. <a href=\"https://www.last.fm/music/+noredirect/Nick+Cave+and+the+Bad+Seeds\">Read more on Last.fm</a>","content":"Nick Cave and the Bad Seeds were formed in 1983 in West Berlin, Germany by two former members of the Australian band The Birthday Party: Nick Cave (vocals, songwriter, keyboards, harmonica) and multi-instrumentalist Mick Harvey. The duo were joined by Einstürzende Neubauten member Blixa Bargeld (guitar), Hugo Race (guitar), and former Magazine member Barry Adamson (bass, piano). Cave's then girlfriend Anita Lane was also a creative influence and occasional lyricist. This lineup recorded their debut album, From Her to Eternity, released in 1984. During their initial Australian tour, Birthday Party bass guitarist Tracy Pew also performed with the band.\n\nThe name of the new project indicated the shift in Cave's role from band member, as in The Birthday Party, to band leader, and coincided with his shift in songwriting style from expressionism to detailed lyrical narrative. The group has been through many personnel changes, with Cave and Harvey remaining the constants until 2009.\n\nWhile in West Berlin, the band released four albums: The Firstborn Is Dead, Kicking Against the Pricks, Your Funeral... My Trial and Tender Prey. Kicking Against the Pricks was the first album to feature the drumming of Thomas Wydler, now the longest-serving band member alongside Cave and Harvey.\n\nIn 1987, The Bad Seeds made an appearance in the Wim Wenders film, Wings of Desire. In 1990, the band collectively eliminated hard drugs from its diet, relocated to Brazil, and released The Good Son, which reflected a less punk approach than their previous works. Their next record, 1992's Henry's Dream, was the first to feature current members Martyn P. Casey and Conway Savage. Following it came 1994's commercially successful Let Love In.\n\nIn 1996, Nick Cave and the Bad Seeds released Murder Ballads, their most successful album to date. The album included \"Henry Lee\", a duet with English rock singer PJ Harvey, with whom Cave had a brief relationship, and arguably the band's most well-known song, \"Where the Wild Roses Grow\", a duet with Australian pop idol Kylie Minogue. The latter was a mainstream hit in the United Kingdom and in Australia, winning three ARIA Awards including Song Of The Year.\n\nTheir next album, 1997's The Boatman's Call, marks a radical shift from archetypal and violent narratives to biographical and confessional songs about Cave's relationships with his ex-wife Vivianne Carneiro and PJ Harvey. It was also the first full-length album centered around Cave's piano playing.\n\nCave then took a short break to rehabilitate from his 20 years of heroin and alcohol abuse, during which time he married. The band resurfaced with No More Shall We Part in 2001, which followed a similar dynamic to The Boatman's Call, but received a mixed response from fans. After the release of the 2003 album Nocturama, which failed to excite reviewers, Bargeld announced he was leaving The Bad Seeds to devote more time to Einstürzende Neubauten, leaving Mick Harvey as the only original member other than Cave. \n\nThe following year, the band released their first double record, the acclaimed two-disc set Abattoir Blues/The Lyre of Orpheus. In 2005, they released B-Sides and Rarities, a three-disc, 56-track collection of B-sides, rarities and unreleased songs.\n\nIn October 2007, Cave was inducted into the ARIA Hall of Fame. During his acceptance speech, he cheekily took it upon himself to also induct the Australian members of The Bad Seeds (excluding Hugo Race), plus the members of The Birthday Party (excluding Phill Calvert).\n\nIn March 2008, the band released their 14th studio album, Dig, Lazarus, Dig!!!, inspired by the Biblical story of the resurrection of Lazarus. Following a similar style to The Bad Seeds' side project Grinderman, the album was \"universally-acclaimed.\" An exclusive Live Session EP was released through iTunes in April 2008, recorded at the legendary Air Studios on 2 March, 2008 as part of iTunes' Live From London series.\n\nOn 22 January 2009, Mick Harvey announced through the band's web page that he was leaving The Bad Seeds to pursue other endeavours. Now the only original member of the band, Cave focused on Grinderman, which includes The Bad Seeds' Martyn P. Casey, Jim Sclavunos and Warren Ellis; as the project includes so many Bad Seeds members it is therefore sometimes referred to as \"Mini-Seeds.\"\n\nThe current line-up of the band is:\nNick Cave - vocals, piano, organ, harmonica, percussion, electric guitar, string arrangements (1984-)\nThomas Wydler - drums, percussion, vocals (1987—) \nMartyn P. Casey - bass, vocals (1991—) \nConway Savage - piano, organ, vocals (1991—) \nWarren Ellis - violin, fender mandocaster, loops, mandolin, tenor guitar, viola, bouzouki, accordion, flute, lute, piano, programming, percussion, string arrangements, vocals (1994—) \nJim Sclavunos - percussion, drums, organ, melodica, vocals (1996—) \nJames Johnston - organ, electric guitar, acoustic guitar, vocals (2003—) \n\nPast members, guest and touring musicians include:\nMick Harvey - electric guitar, acoustic guitar, bass, drums, organ, percussion, piano, loops, string arrangements, vocals (1984-2009)  \nBlixa Bargeld - electric guitar, slide guitar, pedal steel guitar, vocals (1984–2003); original member who quit after almost 20 years \nAnita Lane - lyrics (1984) \nBarry Adamson - bass, electric guitar, drums, organ, piano, percussion, vocals (1984-1986) \nHugo Race - electric guitar, vocals (1984) \nRowland S. Howard (deceased) - electric guitar, organ, vocals\nTracy Pew (deceased) - bass \nKid Congo Powers - electric guitar, slide guitar (1986-1989) \nRoland Wolf (deceased) - piano, organ, electric guitar, vocals (1986-1989)  <a href=\"https://www.last.fm/music/+noredirect/Nick+Cave+and+the+Bad+Seeds\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
