{"artist":{"name":"Non Phixion","mbid":"fbca5223-6808-49cd-aebe-300600f51077","url":"https://www.last.fm/music/Non+Phixion","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f6e681c834824b3396eae5b314fed6e3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f6e681c834824b3396eae5b314fed6e3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f6e681c834824b3396eae5b314fed6e3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f6e681c834824b3396eae5b314fed6e3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f6e681c834824b3396eae5b314fed6e3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f6e681c834824b3396eae5b314fed6e3.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"132035","playcount":"1948282"},"similar":{"artist":[{"name":"Ill Bill","url":"https://www.last.fm/music/Ill+Bill","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/09cc06c5afc4468695d89b3d0bcc61cb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/09cc06c5afc4468695d89b3d0bcc61cb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/09cc06c5afc4468695d89b3d0bcc61cb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/09cc06c5afc4468695d89b3d0bcc61cb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/09cc06c5afc4468695d89b3d0bcc61cb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/09cc06c5afc4468695d89b3d0bcc61cb.png","size":""}]},{"name":"Sabac","url":"https://www.last.fm/music/Sabac","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2dc678543afc42c8a8240981db2a008e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2dc678543afc42c8a8240981db2a008e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2dc678543afc42c8a8240981db2a008e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2dc678543afc42c8a8240981db2a008e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2dc678543afc42c8a8240981db2a008e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2dc678543afc42c8a8240981db2a008e.png","size":""}]},{"name":"Necro","url":"https://www.last.fm/music/Necro","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/87b919cf41464cbbb2d0e8b68a6bc1cb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/87b919cf41464cbbb2d0e8b68a6bc1cb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/87b919cf41464cbbb2d0e8b68a6bc1cb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/87b919cf41464cbbb2d0e8b68a6bc1cb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/87b919cf41464cbbb2d0e8b68a6bc1cb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/87b919cf41464cbbb2d0e8b68a6bc1cb.png","size":""}]},{"name":"Jedi Mind Tricks","url":"https://www.last.fm/music/Jedi+Mind+Tricks","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/102a1802ec0d4d8f958af8bcdd4ea8f7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/102a1802ec0d4d8f958af8bcdd4ea8f7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/102a1802ec0d4d8f958af8bcdd4ea8f7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/102a1802ec0d4d8f958af8bcdd4ea8f7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/102a1802ec0d4d8f958af8bcdd4ea8f7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/102a1802ec0d4d8f958af8bcdd4ea8f7.png","size":""}]},{"name":"Army of the Pharaohs","url":"https://www.last.fm/music/Army+of+the+Pharaohs","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/65071b90e8fe4ee09e494b3b39492cf9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/65071b90e8fe4ee09e494b3b39492cf9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/65071b90e8fe4ee09e494b3b39492cf9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/65071b90e8fe4ee09e494b3b39492cf9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/65071b90e8fe4ee09e494b3b39492cf9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/65071b90e8fe4ee09e494b3b39492cf9.png","size":""}]}]},"tags":{"tag":[{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"underground hip-hop","url":"https://www.last.fm/tag/underground+hip-hop"},{"name":"rap","url":"https://www.last.fm/tag/rap"},{"name":"underground rap","url":"https://www.last.fm/tag/underground+rap"},{"name":"hip hop","url":"https://www.last.fm/tag/hip+hop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Non+Phixion/+wiki"}},"published":"24 Feb 2006, 07:15","summary":"NON PHIXION  (pronounced non-fiction) was a hardcore hip-hop group formed in 1995 in Brooklyn, New York. It consisted of three MCs — Ill Bill, Sabac Red, and Goretex — plus DJ Eclipse. Ill Bill and Goretex are considered to be along with a few other key figures responsible for orchestrating the booming and highly popular \"Underground Rap\" scene in New York City in the early nineties.\n\nThe group was originally formed in 1995 by Ill Bill and MC Serch of 3rd Bass fame after many years of Bill <a href=\"https://www.last.fm/music/Non+Phixion\">Read more on Last.fm</a>","content":"NON PHIXION  (pronounced non-fiction) was a hardcore hip-hop group formed in 1995 in Brooklyn, New York. It consisted of three MCs — Ill Bill, Sabac Red, and Goretex — plus DJ Eclipse. Ill Bill and Goretex are considered to be along with a few other key figures responsible for orchestrating the booming and highly popular \"Underground Rap\" scene in New York City in the early nineties.\n\nThe group was originally formed in 1995 by Ill Bill and MC Serch of 3rd Bass fame after many years of Bill, Goretex and Necro working together as a unit after growing up together in Glenwood Projects, which is located in Canarsie, Brooklyn. Ill Bill and Necro's short lived \"New Minority\" was a stepping stone for them as a rap act after disbanding their thrash metal band \"Injustice\" who had opened up for such popular thrash and death metal bands such as Sepultura, Obituary and Napalm Death. Ill Bill and Goretex's \"The Dead Celebrities\" was their next musical entity, which ran from 1992-1993 and can be found on Ill Bill's Early Years cd's as well as Necro's. Their second offering, the extreme \"Department Of Forensics\" which was active from 1993-1995 and also had featured producer 10K who went on to do early production for Non Phixion, was an experimental hardcore rap outfit combining horror elements with urban realism sounding like a cross between N.W.A and The Geto Boys on L.S.D.\n\nAfter Ill Bill having a meeting with MC Serch, who was in his own words \"Looking to form an all white group of MC's that rivaled the likes of Wu Tang Clan in skill and overall talent\", they released their first single Legacy b/w No Tomorrow on Serch's own Serchlite Records that year. However, by late 1997, Serch and Non Phixion had parted ways. It was around this time that Bill started Uncle Howie Records and released Non Phixion's critically acclaimed \"I Shot Reagan\" single which was influenced by punk group Suicidal Tendencies own \"I Shot Reagan\". Originally all of Non Phixion's music was to be released through Hebrew National Records which was Ill Bill and Goretex's short lived business venture which later became Uncle Howie Records inspired by Howie Tennenbaum ,Bill's drug addicted biological uncle.The group featured unique subject matter such as government conspiracies, secret assassinations, alien cover-ups, drug addictions and occult and kabbalah sciences.\n\nAfter previous record deals with Matador and Geffen their deal with Geffen fell apart, due to mismanagement and the group themselves issued a statement claiming MC Serch destroyed their deal and business ties to Geffen Records due to MC Serch's questionable financial ethics. They decided to work with Ill Bill's independent record label, Uncle Howie Records and distributor Landspeed Records. On April 23, 2002, the group released their debut album The Future Is Now. The album featuring production by DJ Premier, Pete Rock and Large Professor was quickly thought of as a classic and since its release has sold upwards of 200,000 copies. On April 6, 2004 they released The Green CD/DVD, a compilation of rare songs and rare interview, concert, and behind-the-scenes footage. Non Phixion's cult status had seen them travel all over the U.S and Europe with a rapid fan base and had set a new level of hip hop music with subject matter and lyrical dexterity not seen before nor arguably since.\n\nIn 2004 and 2005, all three emcees released diverse solo albums, all fully produced and released by Ill Bill's brother Necro on his label, Psycho+Logical-Records. Goretex's album was an Occult and Psychedelic opus , featuring dark and brooding production by Necro, sampling death metal riffs and obscure film score samples by Goretex. Ill Bill's album was along the lines of a traditional hardcore hip-hop album, while still maintaining the conspiracy themes native to Non Phixion. Sabac Red's album was a political album, focusing on current controversial issues such as the Iraq War and self improvement.\n\nA collaboration album between Necro and the whole of Non Phixion called Secret Society was originally scheduled for a January 2006 release date, but had endured numerous delays and most likely will not see the light of day due to Necro's disinterest and or schedule. Non Phixion meanwhile planned to release their highly anticipated second album, Nuclear Truth, in 2006, but this release had also been officially canceled.\n\nIll Bill, Goretex and Necro instead started \"Circle Of Tyrants\", which some say is among their best work, together and separate. With extreme production by Necro, the group focused heavily on the macabre, occult, violence and chemical dependencies. Musically Necro's production mirrored obscure gore and horror atmospheres and a somewhat anti-religious soundscape. Many observers became fans including many non-hip hop musicians mostly from the death and black metal scene who were highly intrigued by the out of the ordinary, bizarre project which seemed to draw just as much from heavy metal imagery as they did hip hop. The group name was influenced by eighties occult- black death metal group Celtic Frost, which were influences of Goretex and Ill Bill during their youth. The cover artwork itself looks similar to a late eighties death metal or thrash metal album, with all members in different costumes and outfits. Necro is created as bloody-futuristic bounty hunter, Ill Bill as half-extraterrestrial, weilding weapons and Goretex as norweigian black metal satanist, donning long hair, corpsepaint, spikes and a shotgun.\n\nNon Phixion disbanded in July 2006. There is much speculation surrounding this issue due to the cryptic and confusing statements made from the bands myspace page and online elsewhere.Officially, the group is said to have broken up because of Goretex's \"unreliability\" and \"lack of interest.\" Necro went on a 8000 word rant about Goretex claiming drug addiction and other accusations, which mostly to die hard fans, true supporters and persons who know Goretex formally came off as little truth, immaturity and a general propaganda. Some say Necro being bitter about not being a member of Non Phixion may have contributed to this propaganda, some have said both have had qualms in the past due to their turbulent business relationship concerning financial matters surrounding Goretex's \"The Art Of Dying\" and \"Circle Of Tyrants\". Many, including Goretex himself has denied \"lack of interest\" and has said he had no desire to quit the group, or see it disband and up until January of 2008 has said he would like to see the group active. Sources have said the group was broken up over a female Ill Bill once dated. After letting Goretex stay at her apartment while dealing with legal issues and a turbulent break up with ex- girlfriend Stephanie Martin, a friendly gesture of good faith turned sour and nightmarish due to her severe alcohol and chemical addictions, premeditated a final plan to sabatoge Goretex's 20 year friendship with Ill Bill and Necro, which is said to have affected Goretex immensely. Ill Bill (Now a member of the recently formed La Coka Nostra), (which once ironically included Goretex), Sabac, and DJ Eclipse have all gone their separate ways solo, with plans to release The Hour of Reprisal (Strange Music/Uncle Howie), The Ritual (Psycho+Logical), and the Halftime Show DVD (Uncle Howie) in 2007, respectively. Sabac and DJ Eclipse continue to make live appearances with Ill Bill at his concerts and on tour as well as new appearances on Bill's new record.Goretex has severed ties with the group and is currently working on his follow up to cult classic \"The Art Of Dying\" which is to be released through his own independent label Supercoven, and is said to be released in October of 2008. <a href=\"https://www.last.fm/music/Non+Phixion\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
