{"artist":{"name":"Buju Banton","mbid":"9f525d0b-3911-4c83-b0d1-e90aa1fd2d14","url":"https://www.last.fm/music/Buju+Banton","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ef973a8c9bdc4643bd3c401c81a9c6e9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ef973a8c9bdc4643bd3c401c81a9c6e9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ef973a8c9bdc4643bd3c401c81a9c6e9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ef973a8c9bdc4643bd3c401c81a9c6e9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ef973a8c9bdc4643bd3c401c81a9c6e9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ef973a8c9bdc4643bd3c401c81a9c6e9.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"334802","playcount":"2915766"},"similar":{"artist":[{"name":"Sizzla","url":"https://www.last.fm/music/Sizzla","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9c86124fef764d7aa0ca257a775bf257.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9c86124fef764d7aa0ca257a775bf257.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9c86124fef764d7aa0ca257a775bf257.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c86124fef764d7aa0ca257a775bf257.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c86124fef764d7aa0ca257a775bf257.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c86124fef764d7aa0ca257a775bf257.png","size":""}]},{"name":"Capleton","url":"https://www.last.fm/music/Capleton","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ad6b1b12c7f14ec789b8b803cde2d5f4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ad6b1b12c7f14ec789b8b803cde2d5f4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ad6b1b12c7f14ec789b8b803cde2d5f4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad6b1b12c7f14ec789b8b803cde2d5f4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad6b1b12c7f14ec789b8b803cde2d5f4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad6b1b12c7f14ec789b8b803cde2d5f4.png","size":""}]},{"name":"Beenie Man","url":"https://www.last.fm/music/Beenie+Man","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c1463a2f3c904bc68f531dbc46e2fe52.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c1463a2f3c904bc68f531dbc46e2fe52.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c1463a2f3c904bc68f531dbc46e2fe52.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c1463a2f3c904bc68f531dbc46e2fe52.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c1463a2f3c904bc68f531dbc46e2fe52.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c1463a2f3c904bc68f531dbc46e2fe52.png","size":""}]},{"name":"Shabba Ranks","url":"https://www.last.fm/music/Shabba+Ranks","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/56b822d9bd7d4448b2b2cd39bdd68962.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/56b822d9bd7d4448b2b2cd39bdd68962.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/56b822d9bd7d4448b2b2cd39bdd68962.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56b822d9bd7d4448b2b2cd39bdd68962.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56b822d9bd7d4448b2b2cd39bdd68962.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56b822d9bd7d4448b2b2cd39bdd68962.png","size":""}]},{"name":"Bounty Killer","url":"https://www.last.fm/music/Bounty+Killer","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a60af4ae9fe744b8979b2367f5b697a8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a60af4ae9fe744b8979b2367f5b697a8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a60af4ae9fe744b8979b2367f5b697a8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a60af4ae9fe744b8979b2367f5b697a8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a60af4ae9fe744b8979b2367f5b697a8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a60af4ae9fe744b8979b2367f5b697a8.png","size":""}]}]},"tags":{"tag":[{"name":"reggae","url":"https://www.last.fm/tag/reggae"},{"name":"dancehall","url":"https://www.last.fm/tag/dancehall"},{"name":"ragga","url":"https://www.last.fm/tag/ragga"},{"name":"roots reggae","url":"https://www.last.fm/tag/roots+reggae"},{"name":"jamaica","url":"https://www.last.fm/tag/jamaica"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Buju+Banton/+wiki"}},"published":"11 Mar 2006, 06:46","summary":"Buju Banton (born Mark Myrie 1973) is a Jamaican dancehall, ragga, and reggae singer. He was born in a slum near Kingston, Jamaica called Salt Lane. \"Buju\" is a nickname  which is of  Breadfruit. The name is ironic in light of Mark Myrie's slim frame and large head, but it is, nevertheless, the nickname his mother gave him as a child. \"Banton\" is a Jamaican word referring to someone with a superior attitude and a gift with speech, but it was also the name of a local artist Burro Banton that Buju admired as a child. <a href=\"https://www.last.fm/music/Buju+Banton\">Read more on Last.fm</a>","content":"Buju Banton (born Mark Myrie 1973) is a Jamaican dancehall, ragga, and reggae singer. He was born in a slum near Kingston, Jamaica called Salt Lane. \"Buju\" is a nickname  which is of  Breadfruit. The name is ironic in light of Mark Myrie's slim frame and large head, but it is, nevertheless, the nickname his mother gave him as a child. \"Banton\" is a Jamaican word referring to someone with a superior attitude and a gift with speech, but it was also the name of a local artist Burro Banton that Buju admired as a child. It was Burro's rough gravelly vocals that Buju emulated and ultimately made his own. Buju's mother was a higgler, or street vendor while his father worked as a labourer at a tile factory. He was one of fifteen children born into a family which was directly descended from the Maroons, a group of escaped slaves who proudly fought off the British colonialists.\n\nAs a youngster, Buju would often watch his favourite artists perform at outdoor shows and local dancehalls. At the tender age of 13 he picked up the microphone for himself and began toasting under the monicker of \"Gargamel\". His first single, \"The Ruler\" was released not long afterwards in 1987 under the production of Robert French at Penthouse Studios.\n\nIn 1991, Buju joined Donovan Germain's Penthouse Label and began a fruitful partnership with producer Dave Kelly. Buju is one of the most popular musicians in Jamaican history, having burst onto the charts there suddenly in 1992, with \"Bogle\" and \"Love Me Browning/Love Black Woman\", both massive hits in Jamaica. Controversy erupted over Love Me Browning which spoke of Banton's preference for light-skinned women: \"Mi love mi car mi love mi house mi love mi money and ting, but most of all mi love mi browning.\" Some accused Banton of promoting a colonialist attitude and denigrating the beauty of black women. In response, he released \"Black Woman\" which spoke of his love for dark-skinned beauties: \"Stop cry, fi all black woman, respect all the gyals with dark complexion.\" 1992 was an explosive year for Buju as he broke the great Bob Marley's record for the greatest number of number one singles in a year. Beginning with \"Man fi Dead\", Buju's gruff voice dominated the Jamaican airwaves for the duration of the year. Banton's debut album, Mr. Mention, includes his greatest hits from that year.\n\n1992 was also the year in which the controversy over Buju's homophobic \"Boom Bye Bye\" exploded. The media in Great Britain picked up on Buju's less than admirable promotion of violence against homosexuals. Myrie, who had recently signed with Mercury records, refused to back down from his stance against homosexuals, claiming his religious beliefs prevented him from accepting homosexuality. Banton downplayed the violent content of his song, claiming that it was metaphorical. Gay Rights groups campaigned against Buju as well as Shabba Ranks who, when asked about the controversy on the British show The Word, stated, \"God created Adam and Eve, not Adam and Steve.\" Shabba later apologized, but Buju refused to back down which drew the ire of various homosexual advocacy groups who continue to campaign against him.\n\nBanton released the hard-hitting Voice of Jamaica in 1993. The album included a number of conscious tracks. These tracks included \"Deportees\" a song which criticized those Jamaicans who went abroad but never sent money home, a remix of Little Roy's \"Tribal War\", a sharp condemnation of political violence, and \"Willy, Don't Be Silly\" which promoted condom use. The conscious spin of this disc did little to stop the attacks of gay rights groups who felt that his continued performance of \"Boom Bye Bye\" was a slap in their faces. Some dancehall fans felt that Banton could have exploded onto the American scene if his homophobic song hadn't held him back. Nevertheless, Buju was adopted by many new fans who appreciated his gravelly vocals and cared little about his homophobia.\n\nTil Shiloh (1995) was a very influential album, using a studio band instead of synthesized music, and marking a slight shift away from dancehall towards roots reggae for Banton. Buju turned Rasta and his new album reflected his new beliefs. Til Shiloh is one of the greatest dancehall albums of all time and successfully blended conscious lyrics with a hard-hitting dancehall vibe. The album included a single called \"Murderer\" which condemned the violence in Jamaican dancehall music, inspired by the murders of dancehall musicians Panhead and Dirtsman. The song inspired several clubs to stop playing songs with excessively violent subject matter. This conscious album had a large impact on dancehall music and showed the hunger the dancehall massive had for conscious lyrics. Dancehall music did not move away from slack and violent lyrics, but the album did pave the way for a greater spirituality within the music.\n\nInna Heights (1997) substantially increased Banton's international audience as Buju explored his singing ability and recorded a number of roots-tinged tracks. Banton covered The Silvertones' \"Destiny\" and recorded songs with such artists as Beres Hammond and the legendary Toots Hibbert. The album was well-received but had distribution problems. Also, some fans were disappointed, having hoped for another ground-breaking album like \"Til Shiloh.\" Still, Buju's experimentation and soaring vocals impressed many fans and this album remains a highly regarded work.\n\nIn 1998, Buju met the punk band Rancid and recorded two tracks with them: \"Misty Days\" and \"Life Won't Wait.\" The latter became the title track of Rancid's 1999 album, Life Won't Wait. Subsequently, Buju signed with Rancid's eclectic Anti, a subsidiary of Epitaph and released Unchained Spirit in 2000.\n\nIn March 2003 he released Friends for Life, which featured more sharply political songs, including \"Mr. Nine\", an anti-gun song that further verified his status as one of reggae's most anti-confrontational artists.\n\nBanton's 2006 album Too Bad got him nominated for a second Grammy but despite the album's brilliance and artistic excellence \"Too Bad\" did not garner the award.  \"Too Bad\" brings us back to the Buju of the nineties with his rough phenomenal voice backed by hypnotic beats and conscious lyrics that seem to stay on repeat in your head.  \"Too Bad\" is a complete listen from start to finish and is an extra success because the Gargamel executive produced the album on his own label.\n\nOn April 21, 2009, Buju released the often delayed album Rasta Got Soul. This is Banton's ninth album and features the hit single Magic City. This release sees Buju returning to roots and culture reggae. The album received a Grammy nomination in the Best Reggae Album category.\n\nAs of December 2009, Buju allegedly attempted to buy cocaine from an undercover officer in Miami and faces up to life in prison if convicted. The trial of Banton began on September 20, 2010 in Tampa, Florida. <a href=\"https://www.last.fm/music/Buju+Banton\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
