{"artist":{"name":"Ol' Dirty Bastard","mbid":"d50548a0-3cfd-4d7a-964b-0aef6545d819","url":"https://www.last.fm/music/Ol%27+Dirty+Bastard","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1ea7537af1a4455195ad0ce7652f4676.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1ea7537af1a4455195ad0ce7652f4676.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1ea7537af1a4455195ad0ce7652f4676.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ea7537af1a4455195ad0ce7652f4676.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ea7537af1a4455195ad0ce7652f4676.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ea7537af1a4455195ad0ce7652f4676.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"546084","playcount":"5978768"},"similar":{"artist":[{"name":"Method Man","url":"https://www.last.fm/music/Method+Man","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b179552241eb415680d0b86a75d18259.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b179552241eb415680d0b86a75d18259.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b179552241eb415680d0b86a75d18259.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b179552241eb415680d0b86a75d18259.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b179552241eb415680d0b86a75d18259.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b179552241eb415680d0b86a75d18259.png","size":""}]},{"name":"Ghostface Killah","url":"https://www.last.fm/music/Ghostface+Killah","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8d1ea19f6ec24e148a735943c8ebe5fc.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8d1ea19f6ec24e148a735943c8ebe5fc.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8d1ea19f6ec24e148a735943c8ebe5fc.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8d1ea19f6ec24e148a735943c8ebe5fc.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8d1ea19f6ec24e148a735943c8ebe5fc.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8d1ea19f6ec24e148a735943c8ebe5fc.png","size":""}]},{"name":"GZA/Genius","url":"https://www.last.fm/music/GZA%2FGenius","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/733cbdc4bea9492db7a98bd5bd898545.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/733cbdc4bea9492db7a98bd5bd898545.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/733cbdc4bea9492db7a98bd5bd898545.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/733cbdc4bea9492db7a98bd5bd898545.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/733cbdc4bea9492db7a98bd5bd898545.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/733cbdc4bea9492db7a98bd5bd898545.png","size":""}]},{"name":"Raekwon","url":"https://www.last.fm/music/Raekwon","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d174cb7d39cb43e2919f21f9c1ac1624.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d174cb7d39cb43e2919f21f9c1ac1624.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d174cb7d39cb43e2919f21f9c1ac1624.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d174cb7d39cb43e2919f21f9c1ac1624.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d174cb7d39cb43e2919f21f9c1ac1624.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d174cb7d39cb43e2919f21f9c1ac1624.png","size":""}]},{"name":"Wu-Tang Clan","url":"https://www.last.fm/music/Wu-Tang+Clan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2cc4204f212b4512a68d7550d7ba7280.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2cc4204f212b4512a68d7550d7ba7280.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2cc4204f212b4512a68d7550d7ba7280.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2cc4204f212b4512a68d7550d7ba7280.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2cc4204f212b4512a68d7550d7ba7280.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2cc4204f212b4512a68d7550d7ba7280.png","size":""}]}]},"tags":{"tag":[{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"rap","url":"https://www.last.fm/tag/rap"},{"name":"wu-tang","url":"https://www.last.fm/tag/wu-tang"},{"name":"hip hop","url":"https://www.last.fm/tag/hip+hop"},{"name":"Gangsta Rap","url":"https://www.last.fm/tag/Gangsta+Rap"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Ol%27+Dirty+Bastard/+wiki"}},"published":"15 Feb 2006, 23:55","summary":"Russell Tyrone Jones (November 15, 1968 – November 13, 2004) was an American rapper from New York known by the stage name Ol' Dirty Bastard (often shortened to ODB by mainstream media) since 1988. He was one of the founding members of the hip hop group Wu-Tang Clan.\n\nOl' Dirty Bastard simultaneously brought a measure of humor and a touch of the absurd to the Wu-Tang Clan. Often noted for his unusual mic technique (critic Steve Huey writes of Jones's \"outrageously profane <a href=\"https://www.last.fm/music/Ol%27+Dirty+Bastard\">Read more on Last.fm</a>","content":"Russell Tyrone Jones (November 15, 1968 – November 13, 2004) was an American rapper from New York known by the stage name Ol' Dirty Bastard (often shortened to ODB by mainstream media) since 1988. He was one of the founding members of the hip hop group Wu-Tang Clan.\n\nOl' Dirty Bastard simultaneously brought a measure of humor and a touch of the absurd to the Wu-Tang Clan. Often noted for his unusual mic technique (critic Steve Huey writes of Jones's \"outrageously profane, free-associative rhymes\" delivered \"in a distinctive half-rapped, half-sung style\"), Jones's stage name came from a 1980 kung fu film entitled Ol' Dirty & The Bastard, the relevance of which was articulated by Method Man's assertion that there was \"no father\" to Jones's style.\n\nAfter establishing the Wu-Tang Clan, Ol' Dirty Bastard went on to a successful solo career. However, his professional success was hampered by his erratic personal behavior and frequent legal troubles, including incarceration. He died in late 2004 of a drug overdose in a recording studio.\n\nLife and Career\nOl' Dirty Bastard was born Russell Jones in Brooklyn in 1968, and grew up in the neighborhood of Fort Greene. As he got older, he started hanging out more and more with his cousins Robert Diggs and Gary Grice; they all shared a taste for rap music and kung-fu movies. Diggs, later to be known as the RZA, Grice, later the GZA, and Jones formed Force Of The Imperial Master, which subsequently became known as the All in Together Now Crew after they had a successful underground single of that name.\n\nWu-Tang Clan\nThe cousins soon added six more friends and associates to the Clan, and released their debut album Enter the Wu-Tang (36 Chambers) in 1993 (1993 in music). 36 Chambers received enormous critical praise, and is now widely regarded as one of the best and most influential albums of any genre to be released in the 1990s, as well as one of the best hip hop albums of all time.\n\nWhile most of the group's members received individual praise from critics and fans, Jones became perhaps the best-known member of the group. Armed with a seemingly crazed, slurred, often off-beat, half-sung half-rapped delivery, bizarre lyrics and humorous antics that were unlike anything ever heard before in rap, he seemed to encapsulate and personify the raw, unadulterated and innovative style of the group.\n\nOl' Dirty Bastard takes his name from the 1980 film by Meng-Hwa Ho called An Old Kung Fu Master, known also as Mad Mad Kung Fu and Ol' Dirty & The Bastard. The movie features Yuen Siu Tien aka Simon Yuen who can also be found in other classics such as Drunken Master. Yuen Siu Tien often played a character of an old drunkard who had mastered the martial art of Drunken Boxing.\n\nSolo career\nODB's solo career began in 1995, the second member of the Wu-Tang Clan to release a solo album, following Method Man's 1994 effort, Tical. Return to the 36 Chambers: The Dirty Version, released on March 28, 1995, spawned the hit singles Brooklyn Zoo and Shimmy Shimmy Ya, and powered the album to gold status. The album's sound was as raw and gritty as 36 Chambers, producer RZA creating beats even more minimalist and stripped-down than on the group's debut.\n\nThat same year, he was featured on the remix of Mariah Carey's \"Fantasy\". What might have seemed like an unlikely pairing spawned a major hit song. \"Fantasy\" was among the first popular pop, R&B, and hip hop collaborations.\n\nAround this time, Jones gained notoriety when, as he was being profiled for an MTV biography, he took two of his thirteen children by limousine to a New York State welfare office to pick up his welfare check while his latest album was still in the top ten of the US charts. The entire incident was filmed by an MTV camera crew and was broadcast nationwide.\n\nIn 1997, ODB appeared on the Wu-Tang Clan's second and most commercially successful album, Wu-Tang Forever. However, Jones appeared less often on the Clan's sophomore than on the debut; he contributed a solo track titled \"Dog Shit\" as well as hooks (\"As High As Wu-Tang Get\") and spoken introductions (\"Triumph\"), but other than these appearances and featuring prominently on the songs \"Maria\" and \"Reunited,\" as well as delivering a very short verse on \"Heaterz\", he was absent.\n\nIn February 1998, Jones witnessed a car accident from the window of his Brooklyn recording studio. He and a friend ran to the accident scene and organized about a dozen onlookers who assisted in lifting the 1996 Ford Mustang—rescuing a 4-year-old girl from the wreckage. She was taken to a hospital with second and third degree burns. Using a false name, Jones visited the girl in the hospital frequently until he was spotted by members of the media. \n\nThe evening following the traffic accident, Jones rushed onstage unexpectedly during Shawn Colvin's acceptance speech for \"Song of the Year\" at the Grammy Awards, and began complaining that he had recently purchased expensive clothes in anticipation of winning the \"Best Rap Album\" award that he lost to Puff Daddy. Before being escorted off-stage, he implored the audience, \"I don't know how you all see it, but when it comes to the children, Wu-Tang is for the children. We teach the children. Puffy is good, but Wu-Tang is the best. I want you all to know that this is ODB, and I love you all. Peace!\" (He evidently was confused between Shawn Colvin and Sean Combs, Puff Daddy's real name). His bizarre onstage antics were widely reported in the mainstream media.\n\nIn April 1998, he announced his new stage name, Big Baby Jesus (the first of many alternate stage names; see the list below), but was never able to give a coherent explanation for the very brief switch.\n\nIn 1999, he found time to release Nigga Please between jail sentences, which received much success and was even more bizarrely warped than his debut. This release included the single \"Got Your Money\" which became extremely successful in the US and elsewhere; it was produced by The Neptunes, and its success would serve as one of the production group's main stepping stones to the superstardom they would later achieve. As well as the Neptunes, the single also put singer Kelis, who sang the chorus, on the map; she went on to have a successful solo career.\n\nIn 2001, with Jones again in jail for crack cocaine possession, his record company Elektra Records made the decision to release a greatest hits album (despite there being only two albums in ODB's back catalogue) in order to both end their contract with the unreliable, troubled artist as well as make some money off the publicity generated by his legal troubles. After the contract with Elektra was terminated, the label D-3 records released the album \"The Trials and Tribulations of Russell Jones\" in 2002, comprised of tracks put together without Jones's input, using the vocals he had recorded prior to his capture by authorities. The label recruited many guests including several Wu-Tang Clan affiliates, No Limit Records artist C-Murder, and the Insane Clown Posse. However, the album was critically panned and sales were poor.\n\nThe year 2003 brought a change in the life of Ol' Dirty Bastard however. The day he was released from prison, with Mariah Carey and Damon Dash by his side, Jones signed a contract with Roc-A-Fella Records, and began a new chapter in his life. Living at his mother's home under house arrest and with a court-ordered probation hanging over his head, he managed to star in a VH1 reality television series. He also managed to record a new album, scheduled to be released in 2006 through Dame Dash Music Group.\n\nHe had stated that he also planned on collaborating with artists in the electronic music genre, such as Carnage and The Fiasco, Fischerspooner, and possibly even Massive Attack.\nLegal troubles\n\nIn 1993, ODB was convicted of second degree assault for an attempted robbery and in 1994, he was shot in the abdomen following an argument with another rapper.\n\nIn 1997, he was arrested for failure to pay child support for three of his thirteen children. His wife, Icelene Jones, claimed he had not paid any support in over a year.\n\nIn 1998, he pled guilty to attempted assault on his wife and was the victim of a home invasion robbery at his girlfriend's house. He was shot in the back and arm but the wounds were superficial.\n\nIn July 1998, only days after being shot in a push-in robbery at a cousin's house in Brooklyn, he was arrested for shoplifting a pair of $50 shoes in Virginia Beach, Virginia, although he was carrying close to $500 at the time. He was issued bench warrants by the Virginia Beach Sheriffs Department to stand trial after he failed to appear in court numerous times. He was arrested for criminal threatening after a series of drunken confrontations in Los Angeles a few weeks later, and was then re-arrested for similar charges not long after that.\n\nDuring a routine traffic stop, the details of which remain clouded in multiple versions of events, he was arrested for attempted murder and criminal weapon possession. The case was later dismissed.\n\nIn February 1999, he was arrested for driving without a license and for being a convicted felon wearing a bulletproof vest (the first person arrested for this infraction under a new California law). Back in New York weeks later, he was arrested for drug possession of crack cocaine and for traffic offenses. With multiple cases in the past and present, he was arrested with marijuana and 20 vials of crack. After his arrest, ODB reportedly asked the police to \"make the rocks disappear\". During a court hearing, he once called a female prosecutor a \"sperm donor.\"\n\nThis criminal record was commented on by Chris Rock in his 1999 spoken word song, \"No Sex (In the Champagne Room)\", with Rock asserting that \"ODB couldn'tve possibly committed all those crimes. Coolio did some of that shit.\"\n\nODB entered rehab while still technically a fugitive from the law, but strange behavior during a subsequent court date sent him to jail for a brief period.\n\nIn October 2000, he escaped from his court-mandated drug treatment facility and spent one month as a fugitive. During his time on the run, he hooked up with the RZA and managed to log some time in the recording studio. He then appeared onstage swigging a bottle at a record release party for The W, a Wu-Tang Clan album. He was later arrested in a Philadelphia McDonald's parking lot while signing autographs, and extradited to New York City. A Manhattan court sentenced him to two to four years incarceration. Mental problems resulted in a suicide attempt not long after his sentencing.\n\nIn May 2003, Russell Jones was released from prison. It was said that long time friend, Mariah Carey, picked him up after his release.\n\nAt first, his legal troubles and odd behavior made Jones \"something of a folk hero\", according to The New Yorker writer Michael Agger. However, Huey writes that \"it was difficult for observers to tell whether ODB's wildly erratic behavior was the result of serious drug problems or genuine mental instability ... the possibility that his continued antics were at least partly the result of conscious image-making disappeared as time wore on.\"\n\nRussell Jones collapsed at approximately 5:29 p.m. on November 13, 2004 at Wu-Tang's recording studio (36 Records LLC on West 34th Street in New York City). He was pronounced dead less than an hour later. He was buried at Brooklyn's Christian Cultural Center.\n\nA statement was released on Saturday (November 13, 2004) evening by his mother Cherry Jones:\n\n    \"This evening, I received a phone call that is every mother's worst dream,\" she said. \"My son, Russell Jones, passed away. To the public, he was known as Ol' Dirty Bastard, but to me, he was known as Rusty, the kindest, most generous soul on earth. I appreciate all the support and prayers that I have received. Russell was more than a rapper, he was a loving father, brother, uncle, and most of all, son.\"\n\nA statement was also released by Damon Dash, who signed ODB to Roc-A-Fella Records in the fall of 2004:\n\n    \"All of us in the Roc-A-Fella family are shocked and saddened by the sudden and tragic death of our brother and friend. Russell inspired all of us with his spirit, wit and tremendous heart. He will be missed dearly, and our thoughts, prayers and deepest condolences go out to his wonderful family. The world has lost a great talent, but we mourn the loss of our friend.\"\n\n    The cause of death remained unknown until December 15, 2004; although he reportedly complained of chest pains prior to collapsing, a heart attack was not listed as the cause of death. During the initial autopsy of the 35-year-old rapper, a doubled plastic bag containing cocaine was discovered in his stomach. Final results from an autopsy show he had a lethal mixture of the prescription painkiller Tramadol and high amounts of cocaine in his system at the time of his death, which was ruled an accidental overdose by the New York Medical Examiner's Office. <a href=\"https://www.last.fm/music/Ol%27+Dirty+Bastard\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
