{"artist":{"name":"One Be Lo","mbid":"9068a4af-a495-4d82-b6f3-b195f358e16d","url":"https://www.last.fm/music/One+Be+Lo","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a5c4fbe223cc4257ae7a245030cfc280.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a5c4fbe223cc4257ae7a245030cfc280.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a5c4fbe223cc4257ae7a245030cfc280.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a5c4fbe223cc4257ae7a245030cfc280.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a5c4fbe223cc4257ae7a245030cfc280.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a5c4fbe223cc4257ae7a245030cfc280.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"91708","playcount":"1266374"},"similar":{"artist":[{"name":"Binary Star","url":"https://www.last.fm/music/Binary+Star","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f5586b9b5dfc4f01aaae65d79c680c81.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f5586b9b5dfc4f01aaae65d79c680c81.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f5586b9b5dfc4f01aaae65d79c680c81.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f5586b9b5dfc4f01aaae65d79c680c81.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f5586b9b5dfc4f01aaae65d79c680c81.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f5586b9b5dfc4f01aaae65d79c680c81.png","size":""}]},{"name":"MF Grimm","url":"https://www.last.fm/music/MF+Grimm","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/371eb3dafa2c4085a92ae4df44f2c746.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/371eb3dafa2c4085a92ae4df44f2c746.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/371eb3dafa2c4085a92ae4df44f2c746.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/371eb3dafa2c4085a92ae4df44f2c746.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/371eb3dafa2c4085a92ae4df44f2c746.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/371eb3dafa2c4085a92ae4df44f2c746.png","size":""}]},{"name":"Elzhi","url":"https://www.last.fm/music/Elzhi","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/716f2ab62023427293a35e8e46b82026.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/716f2ab62023427293a35e8e46b82026.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/716f2ab62023427293a35e8e46b82026.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/716f2ab62023427293a35e8e46b82026.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/716f2ab62023427293a35e8e46b82026.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/716f2ab62023427293a35e8e46b82026.png","size":""}]},{"name":"J-Live","url":"https://www.last.fm/music/J-Live","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/07fa2fc52cf8459d804f701146f87a01.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/07fa2fc52cf8459d804f701146f87a01.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/07fa2fc52cf8459d804f701146f87a01.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/07fa2fc52cf8459d804f701146f87a01.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/07fa2fc52cf8459d804f701146f87a01.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/07fa2fc52cf8459d804f701146f87a01.png","size":""}]},{"name":"Typical Cats","url":"https://www.last.fm/music/Typical+Cats","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8b901abe9f674cf48bd04bbdb15152e1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8b901abe9f674cf48bd04bbdb15152e1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8b901abe9f674cf48bd04bbdb15152e1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8b901abe9f674cf48bd04bbdb15152e1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8b901abe9f674cf48bd04bbdb15152e1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8b901abe9f674cf48bd04bbdb15152e1.png","size":""}]}]},"tags":{"tag":[{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"underground hip-hop","url":"https://www.last.fm/tag/underground+hip-hop"},{"name":"hip hop","url":"https://www.last.fm/tag/hip+hop"},{"name":"rap","url":"https://www.last.fm/tag/rap"},{"name":"underground hip hop","url":"https://www.last.fm/tag/underground+hip+hop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/One+Be+Lo/+wiki"}},"published":"14 Jul 2006, 04:36","summary":"OneBeLo has performed around the world as a solo artist and a member of the legendary rap duo Binary Star, but his travels throughout different mindsets and communities have made even more of an impact. Throughout his life, Lo has also assumed the roles of star athlete, convicted felon, Christian, Muslim, and Egyptian resident—and all of these things are reflected in his music.\n\n “When I talk about religion, sports, winning, losing, struggle, pain <a href=\"https://www.last.fm/music/One+Be+Lo\">Read more on Last.fm</a>","content":"OneBeLo has performed around the world as a solo artist and a member of the legendary rap duo Binary Star, but his travels throughout different mindsets and communities have made even more of an impact. Throughout his life, Lo has also assumed the roles of star athlete, convicted felon, Christian, Muslim, and Egyptian resident—and all of these things are reflected in his music.\n\n “When I talk about religion, sports, winning, losing, struggle, pain, prison, poverty, crime, women—these are the ingredients of OneBeLo, because those are my personalexperiences,” he explains. “I've been a straight-A student, I've been a knucklehead, I've been a heathen, I've been a Christian, I've been a Muslim, I've been a criminal, I've been in the belly of the beast, I've been to the Mecca, I've been to Europe. I've been to the top, I've been to the bottom. I'm talking about everything.”\n\nLo was adopted in Pontiac, Michigan, where his mother worked as a beautician and his stepfather worked at a plant. As a result, he developed appreciation for women, fashion, working with a variety of different people, discipline, and forgiveness. He busied himself with over a dozen different activities and attended church several times a week with his family. Life changed once his parents divorced when he was 14 years old. With lower supervision and more exposure to new things, he ran the streets with older kids until he went to prison days after his 18th birthday.\n\nWhile in prison, OneBeLo read extensively and converted to Islam, after seeing it wasn't what he was told it was as a Christian child. He also formed the rap group Binary Star with his partner-in-crime  Senim Silla. Despite domestic violence, murder and other drama out of his control happening back home, Lo handled his sentence without losing himself.\n\n“When I went to prison, Allah gave me two and half years to get away from all that weed, all that pussy, and all those distractions,” Lo remembers. “I wasn't going to be like the cats in prison that come back when they're 35 years old. … I was behind bars, but I realized that the people in the streets were the ones locked up. My mind was free.”\n\nUpon Lo’s release, Binary Star hit the ground running. On their self-released debut Waterworld, they teamed up with future staples like Elzhi, J.U.I.C.E., and Athletic Mic League to exercise creative concepts and deliver substantial messages. Lo formed a production team with Decompoze, who he had recorded with in high school. Binary Star quickly sold out of their initial 1,000 copies as the album was praised as an “instant classic.” Though Lo had intended to rhyme anonymously as a solo act to revert attention to the music, he was often addressed as OneManArmy because of a line he used in a song. He and Senim Silla would later go their separate ways, and Lo compiled his Subterraneous Records crew—which consisted of Malaki The Most High, Decompoze, Kodac, Magestik Legend, DJ Phrikshun and iLLite—in January 2000.\n\nLo added extra Senim Silla verses and new songs to a Waterworld re-release entitled Masters of the Universe, and continued to focus on touring with Subterraneous and recording several albums’ worth of new music. After showcasing his crew with Waterworld Too, he released Project F.E.T.U.S. as a planned prequel to his debut. The disc sold thousands of copies, and he would later complete his next project, S.O.N.O.G.R.A.M.. He approached Fat Beats Records to press a single to help promote the album, and they gave him a different offer.\n\n“They asked me to send them the song I was thinking about using for the single, and I was like, 'If they're doing the 12-inch, I'll let them pick the song.' So I just sent them the whole album,” Lo remembers. “They hit me back like, 'We don't want to do a 12-inch. We want to do the whole album.”\n\nLo signed with Fat Beats for distribution in 2003, and the label asked him to change his name from OneManArmy to avoid legal troubles with a similarly-named punk band. He changed his name to OneBeLo, since he had used that with F.E.T.U.S. He would later go to Saudi Arabia on Mecca, an Islamic tradition to find one's self. Meanwhile, Fat Beats pushed back S.O.N.O.G.R.A.M. until 2005. The album was critically-acclaimed and sold about 12,000 copies within Lo's first few weeks on tour. Shortly afterward he would prepare S.T.I.L.L.B.O.R.N., a 27-track compilation of Lo's released and unreleased guest appearances over original new beats. With two projects in tow, Lo landed tours and major festivals, rocking 160 shows per year between 2005 and 2007.\n\nContinuing his journey to chase the greater good, Lo moved his family to Egypt to expose them to a non-American perspective. Once he saw personnel changes at Fat Beats when he arrived back years later, he worked his way out of his deal and self-released The R.E.B.I.R.T.H.. Eager to collaborate with producers and use a different sound, Lo collaborated with beatmakers like Lab Techs, Jake One, Memo of the Molemen, and others. The album performed well, but Lo again wanted to change his approach. Rather than use his previous method of recording as many songs as possible and compiling what he thought were the best songs, he decided to sit down and focus on one piece of work.\n\nThat piece was entitled B.A.B.Y. (Being A Black Youth). Much of the album, which features the likes of Freeway, Phonte Coleman, Devin the Dude and others, was lost when thieves broke in and stole studio equipment. Additionally, the label he had signed with, MYX Music Label, dissolved before the record could drop. Lo stashed his latest sessions and began to work on his upcoming album, L.A.B.O.R.  from scratch. The new project takes metaphorical inspiration from animals and occupations, jumpstarts a new Waterworld movement with the LABORhood, and lays the foundation to a crop of other conceptual records.\n\n“With this project, I’m staying busy and developing my ideas. I’m going through the pains of L.A.B.O.R. before delivering this B.A.B.Y.,” Lo says. “Don’t let anyone stop you from creating your art.”\n\nDespite L.A.B.O.R. being his fifth solo release, Lo is just getting started. With a continuous repertoire of new travels, new experiences and world events, OneBeLo will always have the music to reflect it. <a href=\"https://www.last.fm/music/One+Be+Lo\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
