{"artist":{"name":"Owsley","mbid":"0c93dc90-83ef-483d-91f4-d525386c7ff3","url":"https://www.last.fm/music/Owsley","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/21550e7c42354d518317213ff2104e51.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/21550e7c42354d518317213ff2104e51.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/21550e7c42354d518317213ff2104e51.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21550e7c42354d518317213ff2104e51.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21550e7c42354d518317213ff2104e51.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21550e7c42354d518317213ff2104e51.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"12947","playcount":"130681"},"similar":{"artist":[{"name":"The Nines","url":"https://www.last.fm/music/The+Nines","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f3e7fb8d686048ac8607832b5895daf3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f3e7fb8d686048ac8607832b5895daf3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f3e7fb8d686048ac8607832b5895daf3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f3e7fb8d686048ac8607832b5895daf3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f3e7fb8d686048ac8607832b5895daf3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f3e7fb8d686048ac8607832b5895daf3.png","size":""}]},{"name":"Roger Joseph Manning Jr.","url":"https://www.last.fm/music/Roger+Joseph+Manning+Jr.","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c30a0e6aef7c4a31a255fb7553c51fa5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c30a0e6aef7c4a31a255fb7553c51fa5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c30a0e6aef7c4a31a255fb7553c51fa5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c30a0e6aef7c4a31a255fb7553c51fa5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c30a0e6aef7c4a31a255fb7553c51fa5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c30a0e6aef7c4a31a255fb7553c51fa5.png","size":""}]},{"name":"Linus of Hollywood","url":"https://www.last.fm/music/Linus+of+Hollywood","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/37f41cd0c9874b49a7ed9c4f0aa1b825.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/37f41cd0c9874b49a7ed9c4f0aa1b825.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/37f41cd0c9874b49a7ed9c4f0aa1b825.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37f41cd0c9874b49a7ed9c4f0aa1b825.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37f41cd0c9874b49a7ed9c4f0aa1b825.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37f41cd0c9874b49a7ed9c4f0aa1b825.png","size":""}]},{"name":"L.E.O.","url":"https://www.last.fm/music/L.E.O.","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e385cd50f7e84d99b498f975767e9286.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e385cd50f7e84d99b498f975767e9286.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e385cd50f7e84d99b498f975767e9286.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e385cd50f7e84d99b498f975767e9286.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e385cd50f7e84d99b498f975767e9286.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e385cd50f7e84d99b498f975767e9286.png","size":""}]},{"name":"Candy Butchers","url":"https://www.last.fm/music/Candy+Butchers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7ca58c01d219494dbd2854c110e14cea.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7ca58c01d219494dbd2854c110e14cea.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7ca58c01d219494dbd2854c110e14cea.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7ca58c01d219494dbd2854c110e14cea.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7ca58c01d219494dbd2854c110e14cea.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7ca58c01d219494dbd2854c110e14cea.png","size":""}]}]},"tags":{"tag":[{"name":"power pop","url":"https://www.last.fm/tag/power+pop"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"},{"name":"male vocalists","url":"https://www.last.fm/tag/male+vocalists"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Owsley/+wiki"}},"published":"27 Oct 2007, 04:42","summary":"William Owsley III (March 6, 1966-April 30, 2010), better known by the stage name Owsley, was a power pop singer-songwriter from Anniston, Alabama. Owsley released two albums - \"Owsley\" (1999) and \"The Hard Way\" (2004) before his death in 2010.\n\nHe was also the lead singer for the power pop group The Semantics and was the guitarist for Amy Grant's band from 1994 to 2010.\n\nIt seems like such a phony platitude that doing things the hard way is the most rewarding. <a href=\"https://www.last.fm/music/Owsley\">Read more on Last.fm</a>","content":"William Owsley III (March 6, 1966-April 30, 2010), better known by the stage name Owsley, was a power pop singer-songwriter from Anniston, Alabama. Owsley released two albums - \"Owsley\" (1999) and \"The Hard Way\" (2004) before his death in 2010.\n\nHe was also the lead singer for the power pop group The Semantics and was the guitarist for Amy Grant's band from 1994 to 2010.\n\nIt seems like such a phony platitude that doing things the hard way is the most rewarding. Of course, anyone with a shred of sense, or anyone who has done something the hard way can tell you that the spoils are greater, and so is the sense of accomplishment. But it’d be nice if things came more easily.\n\nFor singer-songwriter-rocker Owsley, it’s been a pretty easy ride. Music came to him naturally through a richly musical family. Now that’s typical for most talented folks—that the music comes easy—the hard part is getting folks to listen. That’s what he’s talking about on his new album, The Hard Way, even though the Anniston, Alabama native will tell you, “It’s about a lot of things.”\n\nSo is Owsley. As a youngster, he played guitar along to the radio bands like Wings, KISS, and The Cars, matching licks with his older brother, Bud. This morphed into writing songs of his own, 4-track bedroom recording sessions (his penchant for multi-tracking vocals explains the plethora of big choruses on The Hard Way), underage bar gigs with cover bands—he’d do anything to scratch the musical itch.\n\nEventually he made the pros: his guitar prowess landed him a gig with funk-pop pioneer Judson Spence with whom Owsley played around the world and appeared on MTV in Spence's videos. Subsequently, a pre-fame Ben Folds introduced him to Millard Powers, and the two would form the legendary power-pop trio The Semantics with Zak Starkey (their lone album, Powerbill, released only in Japan, is now hot property). This led to Owsley joining Amy Grant’s touring band in 1994, a gig he holds today. Playing with Grant enabled Owsley to create a musical playground/home studio, not to mention spend time off writing and recording his own music. In 1999, he released Owsley on Giant Records, garnering raves for the anthemic power-pop songs (“I’m Alright” was a minor hit) and a Grammy™ nomination for his engineering efforts.\n\nOwsley next crossed paths with his musical hero, legendary producer Mutt Lange. Lange, equally enamored with Owsley, hired him to play guitar and sing the duet, “No One Needs to Know” with Lange’s wife, Shania Twain live on “The Tonight Show with Jay Leno”, “Late Night with Conan O’Brien,” “The Today Show,” “Regis & Kathy Lee” and “The American Country Music Awards.”\n\nThen came the hard part: Giant fell victim to corporate mergers and boarded up the windows within a year of Owsley hitting shelves. Rather than be swept up in the swirling flush, Owsley began writing and recording another album, The Hard Way.\n\nAgain produced and performed almost entirely by Owsley in his home studio, The Hard Way continues Owsley’s fascination with perfect pop tunes—big choruses and big words set to lush, exhilarating arrangements. “I’m a sucker for an anthem,” says Owsley, explaining how the lead track “Be With You” is a love song to “God and woman, not just to woman,” and an expression of a yearning to for spiritual, interpersonal and terrestrial connections. You can’t help but ache with him when he sings:\n\n“I wanna know how it feels to believe in something/ride on the heels of a good thing comin’/run to the one thing I know is something true…/I wanna live my life like I know the meaning/deep inside my soul I hear the music screamin’/eyes wide open so I’m awake and dreaming, too.”\n\n“Undone” and “She’s The One” are likewise transcendent, explosive examples of songs you sing in the car or the shower, but also out loud at inopportune times because you just can’t help it. But Owsley is also a first-rate balladeer, able to convey as much sorrow in a sad song as he does joy in a fist-pumping anthem. “Matriarch,” written for Owsley’s departed grandmother, is a piano ballad in the great AM-radio style of Carole King and Gerry Goffin, with nods to Todd Rundgren and Jeff Lynne on the FM side. And like those songwriters, you feel every word and every note in your blood.\n\nHe’s also a startling analyst, able to extract the most significance from his surroundings and his and others’ situations, and pair it with vivid detail. For instance, the folksy title track, where he draws parallels between a gambling addict and his life in music.\n\n“I hate casinos,” Owsley opines. “They’re gross, to me. You know, no clocks, drinks for free, pumpin' in oxygen through the air vents, no windows, call girls, smell of cigarettes.” Like the losers at the tables, Owsley is begging for a lesson—“Let me learn the hard way.” He explains, “I guess the message is I’ll never learn. I keep getting hit in the face, and keep getting back up to get it again.”\n\nBut that’s not necessarily a bad thing. In making The Hard Way, Owsley has experienced a lesson he skipped by performing side and session gigs and writing in the wings. He’s learned that he must be a master of the results. “I guess,” he says, “in a world of pretenders, I’m a contender. Sorry if that sounds egotistical; I still have so much to learn, but most of the people on the radio today probably started playing guitar last week. And I’ve been doing this and preparing for today since birth—no kidding. It’s all I ever wanted, to be a legitimate player, writer, producer, and performer.”\n\nAll this… on his terms. He says, “it feels good to make music again, and for the right reasons. I’m optimistic about the future but most importantly want to be loyal to the fans that have stuck by me through thick and thin. This record is really for them.”\n\nNot that he’s opposed to doing it again, or consigned to indie life. He’s learned some lessons, but he’d still take another shot at the spoils. “The final chapter has not been written. Who knows what will happen? Right now, all that matters is we’re taking control and doing it our way. The Hard Way.”\n\nSadly, Will Owsley died on April 30, 2010 at the age of 44 of what the Tennessean reported to be \"an apparent suicide\".  He is survived by 2 sons, his ex-wife and his wonderful music. <a href=\"https://www.last.fm/music/Owsley\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
