{"artist":{"name":"Pascal Obispo","mbid":"2db6e9c3-5aa1-4876-9ec6-8f18c75d5210","url":"https://www.last.fm/music/Pascal+Obispo","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/75708a67b3d540988c345fe53477d560.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/75708a67b3d540988c345fe53477d560.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/75708a67b3d540988c345fe53477d560.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/75708a67b3d540988c345fe53477d560.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/75708a67b3d540988c345fe53477d560.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/75708a67b3d540988c345fe53477d560.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"63487","playcount":"630553"},"similar":{"artist":[{"name":"Calogero","url":"https://www.last.fm/music/Calogero","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/25fd9a3709e94d22b5b2baddb2826101.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/25fd9a3709e94d22b5b2baddb2826101.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/25fd9a3709e94d22b5b2baddb2826101.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/25fd9a3709e94d22b5b2baddb2826101.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/25fd9a3709e94d22b5b2baddb2826101.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/25fd9a3709e94d22b5b2baddb2826101.png","size":""}]},{"name":"Florent Pagny","url":"https://www.last.fm/music/Florent+Pagny","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3eb2ea1283f44a8889285931b37693d2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3eb2ea1283f44a8889285931b37693d2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3eb2ea1283f44a8889285931b37693d2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3eb2ea1283f44a8889285931b37693d2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3eb2ea1283f44a8889285931b37693d2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3eb2ea1283f44a8889285931b37693d2.png","size":""}]},{"name":"Patrick Bruel","url":"https://www.last.fm/music/Patrick+Bruel","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Marc Lavoine","url":"https://www.last.fm/music/Marc+Lavoine","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/45f04a1364a149eabe3182ee19de7e93.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/45f04a1364a149eabe3182ee19de7e93.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/45f04a1364a149eabe3182ee19de7e93.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/45f04a1364a149eabe3182ee19de7e93.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/45f04a1364a149eabe3182ee19de7e93.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/45f04a1364a149eabe3182ee19de7e93.png","size":""}]},{"name":"Patrick Fiori","url":"https://www.last.fm/music/Patrick+Fiori","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c996bfd7d36c474eb235faaec5630d33.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c996bfd7d36c474eb235faaec5630d33.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c996bfd7d36c474eb235faaec5630d33.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c996bfd7d36c474eb235faaec5630d33.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c996bfd7d36c474eb235faaec5630d33.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c996bfd7d36c474eb235faaec5630d33.png","size":""}]}]},"tags":{"tag":[{"name":"french","url":"https://www.last.fm/tag/french"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"french pop","url":"https://www.last.fm/tag/french+pop"},{"name":"chanson francaise","url":"https://www.last.fm/tag/chanson+francaise"},{"name":"francais","url":"https://www.last.fm/tag/francais"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Pascal+Obispo/+wiki"}},"published":"13 Aug 2006, 17:54","summary":"Pascal Michel Obispo (born 8 January 1965 in Bergerac, Dordogne, France) is a French singer/songwriter.\n \nPascal Obispo started singing in 1980. He got his first record deal in 1990, Le long du fleuve. With his second album, Plus que tout au monde, selling over 2 million albums, his songs became a popular success. Some of his most famous songs are \"Plus que tout au monde\", \"Laurelenn\", \"Tombé pour elle\", \"L'important c'est d'aimer\", \"Personne\" and \"Fan\". <a href=\"https://www.last.fm/music/Pascal+Obispo\">Read more on Last.fm</a>","content":"Pascal Michel Obispo (born 8 January 1965 in Bergerac, Dordogne, France) is a French singer/songwriter.\n \nPascal Obispo started singing in 1980. He got his first record deal in 1990, Le long du fleuve. With his second album, Plus que tout au monde, selling over 2 million albums, his songs became a popular success. Some of his most famous songs are \"Plus que tout au monde\", \"Laurelenn\", \"Tombé pour elle\", \"L'important c'est d'aimer\", \"Personne\" and \"Fan\". With his 2007 release of Les Fleurs du Bien (a play on Baudelaire's Les Fleurs du mal) he makes allusions to Rosa Parks, Pablo Picasso and others. He is also well known for his various escapades, his unconservative behavior, his haircut, etc. His name is an anagram of painter Pablo Picasso's name. Most of his albums have now sold more than 1 million copies.\n \nObispo used his popularity to help with humanitarian work and particularly with work to stop the AIDS epidemic. He has worked with many other well-known artists such as Jean-Jacques Goldman, Florent Pagny, Johnny Hallyday, Patricia Kaas, Amel Bent, and Natasha St-Pier.\n\nPascal Obispo was born in Bergerac in Southwest France. The son of a football star (his father used to play for the Girondins team in Bordeaux), young Pascal had originally dreamed of becoming a basketball player. But when in 1978 he moved to Rennes with his mother, he discovered a new passion in life: music.\n\nIn the early 80's Rennes had a thriving music scene and the town even produced its own annual festival, the famous Transmusicales. This hotbed of music talent soon spawned a whole host of French new wave pop stars such as Etienne Daho and the group Niagara.\n\nGrowing up in this highly creative atmosphere it was not long before the young Pascal formed his own group, Senzo, in 1988, teaming up with Franck Darcel (who had made his name with the Breton group Marquis de Sade).\n\nObispo went on to record a first single which soon earnt him a recording contract with Epic (an offshoot of the Sony label). In 1992 the up-and-coming star went into the studio to work on his début album, \"Plus que tout au monde\". Produced by Nick Patrick (renowned for his work with the Gipsy Kings, Bashung, Alain Souchon etc), this album was an instant hit with the French public, the title track proving extremely popular with all the main radio stations.\n\nFollowing this enormous success, Obispo embarked upon a series of extensive tours, playing numerous dates across France between September and December 93. At the end of the year the singer performed his first Paris gig, appearing at the now-defunct Passage du Nord Ouest.\n\nPascal Obispo's recording career continued to go from strength to strength, his singles \"Tu vas me manquer\" and \"La moitié de moi\" rocketing straight to the top of the French charts and remaining in prime positions for several months.\n\n\"Zen\"\n\nObispo returned to the studio in 1994 to record his second album entitled \"Un jour comme aujourd'hui\". Released in October of that year, the album continued in the same catchy pop vein as Obispo's début and, not surprisingly, proved just as great a hit. Following the release of the album, Obispo promptly embarked upon another tour (which kicked off in February 95 and continued through March of that year). This tour included performances in over 60 French lycées, where the singer proved extremely popular in music lessons.\n\nBetween September and December 95 Obispo continued his hectic touring schedule, performing a series of concerts across France and then embarking upon an international tour. One of the highlights of this particular tour was the singer's impressive concert at La Cigale in Paris on 15 November. That same year Obispo would also reveal his songwriting talent, penning the hit single \"Zen\" for his close friend Zazie. \n\nAt the start of 1996 Obispo was back on the road again, supporting Quebecois star Céline Dion on her French tour. This tour included 4 dates at Bercy Stadium (the largest concert venue in Paris) where Obispo performed in front of capacity crowds.\n\nWhen this mammoth tour (which included 40 dates) was finally over Obispo returned to the studio to set to work on his third album, \"Superflu\". Released on 29 October 1996, this album spawned two hit singles \"Personne\" and the best-selling smash \"Lucie\" (which sold a staggering 80,000 copies in just one month) and went on to become a kind of anthem on the promotional tour which followed.\n\nBy February 1997 the album \"Superflu\" had proved a phenomenal hit, selling over 300,000 copies. Following this success Obispo was invited to perform at the legendary Olympia in Paris, where he performed six sell-out concerts. The singer then went on to appear at the Zénith on 21 May, 4,000 fans greeting his performance with rapturous applause.\n\nObispo, who had by this point established himself as one of the most popular figures on the French music scene, was invited to perform at the famous Francofolies festival in La Rochelle on Bastille Day (14 July 1997).\n\nAt one of his most recent concerts, in Ajaccio on 28 July 1997, Obispo and one of his backing group were hit by a shower of buckshot fired from a gun in the audience. Extremely shaken but not seriously injured, the pair were nevertheless taken to a nearby hospital where they were discharged within 24 hours. Obispo fans breathed a huge sigh of relief - losing such a talented singer/songwriter at the height of his career would have left a huge void at the heart of the contemporary French music scene.\n\n1997 would prove to be an extremely eventful year for Obispo, for later that year the young star's songwriting talents were much in demand. Indeed, Obispo went on to work with two of France's top music stars, Florent Pagny and Johnny Hallyday. Obispo would pen several tracks on Florent Pagny's new album, including the best-selling single \"Savoir aimer\" which rocketed to the top of the French charts in the autumn of 97. The young songwriter was then invited to write an entire album for the French megastar Johnny Hallyday. Obispo's excellent work on both albums established him as one of the most sought-after songwriter/composers on the French music scene.\n\nSadly Obispo's professional success was not echoed at this year's Victoires de la Musique awards (held in Paris in February). In spite of being nominated for three major awards, Obispo walked off empty-handed from the prestigious French award ceremony once again. Obispo's only comfort this year was that Florent Pagny scooped Best Male Artist of the Year and received the Best Video award for the top selling single \"Savoir aimer\".\n\nUbiquitous\n\nObispo may not have triumphed at the Victoires de la Musique awards, but his recent record sales have certainly proved that his fans have not deserted him. Indeed, Obispo's latest album \"Superflu\" recently topped the million mark, earning Monsieur Obispo a coveted diamond disc. Recently the SACEM (the French association of songwriters and composers) awarded Obispo the Prix Vincent Scotto for Florent Pagny's best-selling single \"Savoir aimer\".\n\nConfirming his status as one of France's most hyperactive artists, Obispo was back in the music news in '98, masterminding a compilation album to raise funds for AIDS charities. \"Ensemble\" turned out to be a highly original album featuring an interesting and extensive mix of French music stars. The album proved to be a big hit with the French public, selling around 700,000 copies.\n\nObispo turned his attention to songwriting and producing in 1999, composing several songs for Patricia Kaas's new album \"le Mot de passe\" and producing nine tracks on Florent Pagny's album \"Récréation\" (an innovative work featuring covers of French chanson classics reworked with techno-style dance beats).\n\nBesides continuing his fund-raising work with Restos du Cœur and Sol en Si, Obispo somehow found time to begin work on a new album entitled \"Soledad\". Released in December '99, Obispo's new album - as the title \"Soledad\" (Solitude) suggests - revolves around the theme of loneliness. Obispo wrote the majority of the songs on the album himself (penning more songs on one album than ever before) but he also called on the services of Etienne Roda Gil (\"Ce qu'on voit, allée Rimbaud\"), Serge Guirao (\"l'Important c'est d'aimer\") and Lionel Florence who penned the Spanish-sounding title track \"Soledad\", chosen as the first single release.\n\nBeing too busy, Pascal Obispo decided to postpone his \"Soledad\" tour until 2001. Indeed for the French star, the millennium goes off to a flying start with a very tight timetable. Amongst other things, the artist took on the penning of the musical, Les Dix Commandements that Elie Chouraqui, the famous film director, was going to direct. The hype around the show kicked off in spring with a flourish of trumpets, although it was not scheduled before autumn-winter 2000-2001. That season also saw the revival of the 'musical' in France, a revival certainly inspired by the recent triumph of Notre-Dame de Paris.\n\nDespite so much activity, the singer managed to find some time for his private life and on April the 4th he married his girlfriend Isabelle Funaro. The celebration was attended by a host of their friends, Zazie was of course one of their guests of honour.\n\nThe couple had got engaged in Tahiti on New Year's Eve.\n\nTriumph\n\nThen, for Obispo the summer of 2000 rhymed with the rehearsals of The Ten Commandments. Even before the first performances, its single \"L'envie d'aimer\" (\"Lust for love\") hit the million sales, raising very high expectations for the show itself. Those weren't dashed by the performances which, as soon as the opening night on the 4th of October, took place before a full house. On the evening of the dress rehearsal (12.10.00), Pascal Obispo became the father of a young boy called Sean.\n\nAt the climax of his professional career and quite happy in his private life as well, Obispo eventually hit the road for a tour across France that he began with a few days at the Zenith in Paris (November 17th-22th). He also recorded the song \"Christmas Together\" for the association Ensemble contre le sida (Together Against Aids). It will be the leading title of the association's collective Christmas album. Pascal Obispo is one of this association's most active members.\n\nIn 2001, the singer was presented with the NRJ Music Award for Best singer—a likely yet unexpected reward for an artist who had always been ignored by the Victoires de la Musique (the French equivalent of the Brit Awards). Following the award, Obispo went back on the road to resume his tour. Then in November, he brought out a live album entitled \"Millesime\". Among the fourteen tracks on the album, one had been yet unreleased. A very personal song , it deals with the theme of fatherhood, mirroring the artist’s private life.\n\nIn July 2002, Obispo took part in the charity concert for the Restaurants du Coeur given by the Enfoirés in Marseilles. Then he went back to the studio to work on a benefit title that is to be sung by the French football team to collect funds for the fight against AIDS. The Senegalese artist Youssou N’Dour, who is a big fan of football, is expected to sing the chorus, accompanying the French football players.\n\nFan\n\nThe press has often remarked on the influence of Michel Polnareff on Pascal Obispo, so it was no surprise when the latter decided to pay homage to former in the form of a concert tour. Obispo undertook a sixty-date tour across France from October 2003 to August 2004, with several stopovers in Paris (November 18-19, then December 18-20, 2003 at the Zénith, followed by Bercy on January 27, 2004. He put on a real show with the first half entirely devoted to Polnareff songs. In the second half he sang a number of cherished covers as well as new songs such as the aptly titled \"Fan\". The tour was a homage to all the artists who had inspired him when he was younger, from Téléphone to Queen and Madonna. This mammoth tour attracted some 300,000 people and received a Victoires de la Musique award in February 2004 for the best show of the year.\n\nA double album entitled \"live fan/studio fan\" came out on March 15, 2006, featuring the singles \"Fan\", \"Zinedine\" and \"La prétention de rien\" – three new and original tracks.\n\nAlbums\n ■Le long du fleuve (1990)\n ■Plus Que Tout au Monde (1992)\n ■Un Jour Comme Aujourd'hui (1994)\n ■Superflu (1997)\n ■Live 98 (1998)\n ■Soledad (1999)\n ■Millésime Live 00/01 (2001)\n ■Studio Fan – Live Fan (2004)\n ■Les Fleurs du Bien (2006)\n ■Les Fleurs de forest(live)(2007)\n ■Welcome to the Magic World of Captain Samourai Flower (2009)\n \nMusicals:\n ■Les Dix Commandements (2000) – Music: Pascal Obispo, Book and Lyrics: Lionel Florence and Patrice Guirao\n \nAs of the end of 2011, Pascal was working on \"Adam et Eve, La Seconde Chance\". The musical comedy was set to open on Jan. 31, 2012 at the Palais Des Sports in Paris, France.\n <a href=\"https://www.last.fm/music/Pascal+Obispo\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
