{"artist":{"name":"Paul Taylor","mbid":"bec7d307-2477-46bf-aaaf-efac64cff5f8","url":"https://www.last.fm/music/Paul+Taylor","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6a4915fdf53649d3c93083a1826af274.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6a4915fdf53649d3c93083a1826af274.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6a4915fdf53649d3c93083a1826af274.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6a4915fdf53649d3c93083a1826af274.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6a4915fdf53649d3c93083a1826af274.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6a4915fdf53649d3c93083a1826af274.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"60078","playcount":"543784"},"similar":{"artist":[{"name":"Marion Meadows","url":"https://www.last.fm/music/Marion+Meadows","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8fec5867d16e473f919bdbccc546bc5d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8fec5867d16e473f919bdbccc546bc5d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8fec5867d16e473f919bdbccc546bc5d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8fec5867d16e473f919bdbccc546bc5d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8fec5867d16e473f919bdbccc546bc5d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8fec5867d16e473f919bdbccc546bc5d.png","size":""}]},{"name":"Kim Waters","url":"https://www.last.fm/music/Kim+Waters","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/380d2493d62d415482ee6568a0024452.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/380d2493d62d415482ee6568a0024452.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/380d2493d62d415482ee6568a0024452.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/380d2493d62d415482ee6568a0024452.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/380d2493d62d415482ee6568a0024452.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/380d2493d62d415482ee6568a0024452.png","size":""}]},{"name":"Euge Groove","url":"https://www.last.fm/music/Euge+Groove","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e3ffa6e729fe4fa397d3661dc86c500d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e3ffa6e729fe4fa397d3661dc86c500d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e3ffa6e729fe4fa397d3661dc86c500d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e3ffa6e729fe4fa397d3661dc86c500d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e3ffa6e729fe4fa397d3661dc86c500d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e3ffa6e729fe4fa397d3661dc86c500d.png","size":""}]},{"name":"Richard Elliot","url":"https://www.last.fm/music/Richard+Elliot","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/42f339342ef84e229f5bb967cf2bd11c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/42f339342ef84e229f5bb967cf2bd11c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/42f339342ef84e229f5bb967cf2bd11c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/42f339342ef84e229f5bb967cf2bd11c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/42f339342ef84e229f5bb967cf2bd11c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/42f339342ef84e229f5bb967cf2bd11c.png","size":""}]},{"name":"Gerald Albright","url":"https://www.last.fm/music/Gerald+Albright","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4899953db792432a9f19cde11b6c40d5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4899953db792432a9f19cde11b6c40d5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4899953db792432a9f19cde11b6c40d5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4899953db792432a9f19cde11b6c40d5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4899953db792432a9f19cde11b6c40d5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4899953db792432a9f19cde11b6c40d5.png","size":""}]}]},"tags":{"tag":[{"name":"Smooth Jazz","url":"https://www.last.fm/tag/Smooth+Jazz"},{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"saxophone","url":"https://www.last.fm/tag/saxophone"},{"name":"contemporary jazz","url":"https://www.last.fm/tag/contemporary+jazz"},{"name":"keepin-it-smooth-jazz","url":"https://www.last.fm/tag/keepin-it-smooth-jazz"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Paul+Taylor/+wiki"}},"published":"01 Feb 2008, 07:18","summary":"The name \"Paul Taylor\" is used for (at least) three different artists:\n\n(1) Paul Taylor - Jazz Musician\n\nPaul Taylor (born April 30, 1960) is an American smooth jazz saxophonist who has released eight albums since his debut On the Horn in 1995. He is signed to Peak Records. Although originally from Denver, Colorado, he is based in Las Vegas, Nevada. He also played as a special guest with the Rippingtons for a short time in 1999 and 2000, after Jeff Kashiwa left the group and before Eric Marienthal joined them. <a href=\"https://www.last.fm/music/Paul+Taylor\">Read more on Last.fm</a>","content":"The name \"Paul Taylor\" is used for (at least) three different artists:\n\n(1) Paul Taylor - Jazz Musician\n\nPaul Taylor (born April 30, 1960) is an American smooth jazz saxophonist who has released eight albums since his debut On the Horn in 1995. He is signed to Peak Records. Although originally from Denver, Colorado, he is based in Las Vegas, Nevada. He also played as a special guest with the Rippingtons for a short time in 1999 and 2000, after Jeff Kashiwa left the group and before Eric Marienthal joined them.\n\nHe collaborated with many R&B vocalists such as LaToya London, Regina Belle, and Terry Dexter.\n   \nExpanding upon the sensuous and romantic smooth jazz vibe that has made him one of the genre’s most dynamic saxophonists, Paul Taylor makes his fourth Peak Records release a true Ladies’ Choice; creating his most soulful instrumental tracks ever and keeping company with three of today’s most acclaimed female R&B vocalists—Regina Belle, La Toya London and Terry Dexter.\n\nCapturing all of the soulful grooves, dazzling melodies and seductive magic that have become his trademark, Ladies’ Choice perfectly reflects the incredible synergy the charismatic Taylor has had for over a decade with his devoted audience, and takes his music to a whole new urban adult contemporary dimension. The collection is also the sax man’s third in a row—after 2003’s Steppin’ Out and 2005’s Nightlife--to feature tracks helmed by veteran R&B/jazz producers Barry Eastmond (Al Jarreau, Regina Belle, Jonathan Butler, Anita Baker) and Rex Rideout (Richard Elliot, Gerald Albright, Boney James, Najee). The title was inspired by a special moment that happened every night at clubs throughout the country in the 70s. The DJ would stop the music, take the mike and declare the next song to be “Ladies’ Choice”—an invitation for the ladies to pick the guys they want to dance with.\n\n“When I first got into the studio with Barry at his place in New York, we started completely from scratch and had no idea that the exciting Ladies’ Choice idea would emerge,” says Taylor. “Generally, he’ll have some tracks worked up and I’ll start with some melodic ideas and take it from there. When we listened back to the first song we wrote, its cool thumping old school vibe just reminded me of those 70s disco nights and the title ‘Ladies’ Night’ just hit me as the right title to convey the blend of retro-soul, romantic music and contemporary edges we were going for. Once we had established this concept, we expanded on it by including songs sung by some of my favorite female artists. I’ve included vocal tracks before on my recordings, but these ladies are taking my music to a whole new level.”\n\nEastmond (who produced seven tracks), Rideout (four) and Taylor are all good friends, and Taylor’s two producers have a friendly competition going each time the sax man asks them to come on board. “They want to know who’s going to do the most tracks,” Taylor laughs, “and who’s going to win out—Barry, whom Rex calls ‘the king of urban AC,’ or Rex, whose trademark is creating subtle accompaniment that lets me grow and do my thing. I have a dynamic chemistry with both, and each in their own way brings out the essence of what I do with my melodies.\n\nI know their tracks and soundscapes are going to be amazing, and I look forward to what we’re going to come up with together.” The first five Eastmond-produced cuts on Ladies’ Choice include the title track, “Here We Go” and “Streamline,” three co-writes by Eastmond and Taylor that blend old school soul atmospheres, bouncing bass grooves and the saxophonist’s dashing flair for horn texturing. Taylor’s powerful alto coloring and solo complement London’s passionate voice on the dreamy late night ballad “I Want To Be Loved By You”; his alto also sways behind Belle’s playful and sassy vocals on the crisp, sparsely arranged romance “How Did You Know” (which she co-wrote with Eastmond).\n\nEastmond’s other tracks include another lush Belle penned ballad, “Open Your Eyes,” which features a searing vocal/sax duet energy; and the sweet and breezy, old school-vibin’ “Summer’s End.” Rideout produced the other two incredible vocals on Ladies’ Choice, the sensuous, almost mystical “Long Distance Relationship,” which features beautiful voice texturing behind the lead of Terry Dexter, and the mid-tempo and brassy, classic blues and soul flavored “A Love Of Your Own” (a cover of an Average White Band classic) with vocalist Lauren Evans; Evans also co-wrote “Long Distance Relationship” with Rideout and guitarist Darrell Crooks. Rideout also helmed the sizzling, hard-edged disco-fied “Overdrive” and the funky; horn inflected closer “Point Of View.”\n\nA native of Denver, Taylor has lived and worked in the thriving musical environment of Las Vegas since graduating as a music performance major from UNLV. He began playing sax at age seven and discovered his true calling while playing in a local high school garage band called Mixed Company, which played Top 40, funk and Crusader-styled fusion. Aiming to build his resume beyond the many dues-paying Vegas lounge gigs that marked his early professional life, he commuted often to Los Angeles and hooked up in the late 80s with (his later producer) Dino Esposito. Taylor did one of Esposito’s sessions at Jeff Lorber's home studio; a few years later, in 1994, the popular keyboardist remembered Taylor and asked him to play with him at the Catalina Island Jazz Trax Festival. Popular keyboardist Keiko Matsui and her producer/husband Kazu liked Taylor’s charismatic performance and soon offered him an audition with their band. He recorded and toured with the Matsuis for two years (appearing on Sapphire and Dream Walk), and Kazu Matsui eventually produced the sax man’s debut On The Horn, which spawned the #1 radio hit “Till We Meet Again.” Taylor quickly found his own niche in the smooth jazz world, and his quick but well deserved popularity led Pleasure Seeker to the top of the radio charts. The #1 title track was one of Radio & Records most played genre cuts of the year.\n\nAlthough Taylor has since been one of the genre's most popular live attractions as a solo artist, he eagerly accepted Russ Freeman’s invitation to tour with The Rippingtons as a special guest artist in 2000—the year he released his third album Undercover--after Jeff Kashiwa left the group. After making his Peak debut with 2001’s Hypnotic, Taylor’s career reached a fever pitch in 2004 when “Steppin’ Out,” the title track from his 2003 Top Ten Billboard Contemporary Jazz album, became Radio & Records’ third biggest genre airplay cut of the year. He also toured as a featured performer with the all-star “Groovin’ For Grover” lineup (including Jeff Lorber, Richard Elliot and Gerald Albright) and performed and made his acting debut on the legendary ABC soap opera One Life To Live. The incredible momentum continued with his 2005 release Nightlife, Taylor’s latest to hit the Top Five of Billboard’s Contemporary Jazz Chart. After participating in Norman Brown’s Summer Storm II tour in 2006, the saxophonist began 2007 aboard the Brian Culbertson All-Star Smooth Jazz Cruise as a featured headlining performer.\n\nThis year, he is looking forward to sharing numerous tour dates with Regina Belle. “For me, the whole music making process begins with me in a room with the sax, writing melodies from the heart,” says Taylor. “In addition to working with Barry and Rex again, it’s been a great experience to work with these incredible ladies. The best part of this project was just being able to get in the studio and do it. It’s easy to take this journey for granted, but I’m grateful to be alive to share the music that’s in my heart with the fans. I feel very lucky that I’ve been able to make it happen for so long.”\n\nOne of the high points of Taylor’s live performances is the segment when he invites a handful of excited female fans onstage to sway along with him as he plays his hit song “Deeper.” With Ladies’ Choice, the sweet ongoing seduction goes deeper still!\n\n(2) Paul Taylor - Psytrance DJ\n\n      Already well known internationally as a DJ with a unique ability to source and play the freshest sounds, Paulfs credentials are well documented. A veteran from Goa parties since the mid nineties, he was quickly noticed by TIP records and joined in 2001 as a label DJ along with Dimitri Nakov and Raja Ram. After two years in the London Tip Office, he then relocated to Ibiza where he soon began to co produce music with artists such as Earthling, Shanti and Bushman. \n\n      In 2002 he joined Spun Records as Ibiza label manager and A&R/DJ, compiling the very well received Spun Complilation: Tweakers. A regular at many of the bigger events in Europe, Mexico, South America, Israel and Japan, Paul is one of the most sought after Psy Trance DJ's around the world, having made his reputation for playing powerful sets of his own particular style of Hi Tech inspired Full On and continuously pushing the boundaries of the Psy Trance medium. His exacting taste, and ability to source music has led to five very successful V.A compilations so far, on labels such as Crystal Matrix, Spun, Sirius, & Sound Sorcery; all of which have been firm favourites with on the world DJ circuit. \n     \n     His new record 'High Times' (Kundalini 2008) was originally meant as another V/A compilation. However Paul soon decided to craft his own sounds and the album soon became an artist album under his own name. With a focus on a more minimal sound 'High Times' reflects on the tech-trance of the late 90's but gives it a new fresh edge with some tight production and forward thinking.\n\n(3) Paul Taylor - Experimental Musician\n\n     One half of Sutcliffe Jügend and occasional solo artist. <a href=\"https://www.last.fm/music/Paul+Taylor\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
