{"artist":{"name":"Paul Thorn","mbid":"f560cffe-c225-4b91-8511-403219819200","url":"https://www.last.fm/music/Paul+Thorn","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ad39f23608a6443291f759270668c1c6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ad39f23608a6443291f759270668c1c6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ad39f23608a6443291f759270668c1c6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad39f23608a6443291f759270668c1c6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad39f23608a6443291f759270668c1c6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad39f23608a6443291f759270668c1c6.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"11251","playcount":"129404"},"similar":{"artist":[{"name":"Will Kimbrough","url":"https://www.last.fm/music/Will+Kimbrough","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5b59752c12954eb2cec6dd6fd7769040.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5b59752c12954eb2cec6dd6fd7769040.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5b59752c12954eb2cec6dd6fd7769040.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5b59752c12954eb2cec6dd6fd7769040.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5b59752c12954eb2cec6dd6fd7769040.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5b59752c12954eb2cec6dd6fd7769040.png","size":""}]},{"name":"Bruce Robison","url":"https://www.last.fm/music/Bruce+Robison","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/98a4ded8d0944790bc4b88c4e4c987e1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/98a4ded8d0944790bc4b88c4e4c987e1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/98a4ded8d0944790bc4b88c4e4c987e1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/98a4ded8d0944790bc4b88c4e4c987e1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/98a4ded8d0944790bc4b88c4e4c987e1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/98a4ded8d0944790bc4b88c4e4c987e1.png","size":""}]},{"name":"Radney Foster","url":"https://www.last.fm/music/Radney+Foster","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/aebca8a782944f899d8fdbce61bae117.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/aebca8a782944f899d8fdbce61bae117.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/aebca8a782944f899d8fdbce61bae117.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aebca8a782944f899d8fdbce61bae117.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aebca8a782944f899d8fdbce61bae117.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aebca8a782944f899d8fdbce61bae117.png","size":""}]},{"name":"Kevin Welch","url":"https://www.last.fm/music/Kevin+Welch","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e2463f70eb164ec58a5dc9baecb20eec.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e2463f70eb164ec58a5dc9baecb20eec.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e2463f70eb164ec58a5dc9baecb20eec.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e2463f70eb164ec58a5dc9baecb20eec.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e2463f70eb164ec58a5dc9baecb20eec.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e2463f70eb164ec58a5dc9baecb20eec.png","size":""}]},{"name":"The Derailers","url":"https://www.last.fm/music/The+Derailers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1e011ba916484fa391df52c5ad52a9ff.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1e011ba916484fa391df52c5ad52a9ff.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1e011ba916484fa391df52c5ad52a9ff.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1e011ba916484fa391df52c5ad52a9ff.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1e011ba916484fa391df52c5ad52a9ff.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1e011ba916484fa391df52c5ad52a9ff.png","size":""}]}]},"tags":{"tag":[{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"americana","url":"https://www.last.fm/tag/americana"},{"name":"Southern Rock","url":"https://www.last.fm/tag/Southern+Rock"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Paul+Thorn/+wiki"}},"published":"16 Sep 2006, 07:55","summary":"Paul Thorn (born Paul Wayne Thorn on July 13, 1964, in Kenosha, Wisconsin) is an Americana singer-songwriter whose style is a mix of blues and rock music with a hint of Gospel. While utilizing narrative story-telling in his songs, Thorn's music is mostly centered around themes such as love, heartache, memories, his religious beliefs, and just having a good time.\n\nBefore his professional music career began, Thorn was briefly a professional boxer. After a few years of working in a local furniture factory and playing in local clubs <a href=\"https://www.last.fm/music/Paul+Thorn\">Read more on Last.fm</a>","content":"Paul Thorn (born Paul Wayne Thorn on July 13, 1964, in Kenosha, Wisconsin) is an Americana singer-songwriter whose style is a mix of blues and rock music with a hint of Gospel. While utilizing narrative story-telling in his songs, Thorn's music is mostly centered around themes such as love, heartache, memories, his religious beliefs, and just having a good time.\n\nBefore his professional music career began, Thorn was briefly a professional boxer. After a few years of working in a local furniture factory and playing in local clubs, he was discovered by music professional Miles Copeland (brother of The Police drummer Stewart Copeland). This resulted in Thorn being signed to a recording contract with A&M Records and recording his first album, Hammer & Nail in 1997.\n\nThorn took an unexpected detour on the road to recording a follow-up to his most successful release, 2010's Pimps and Preachers. After writing many discs of semi-autobiographical tunes that have drawn comparisons to John Hiatt and John Prine, the critically acclaimed singer/songwriter - hailed as the \"Mark Twain of Americana\" - decided to do an album of covers. \"I wanted to take a break from myself,\" he reveals, \"do something different, and just have fun.\"\n\nThe collection, entitled What The Hell Is Goin' On? (Perpetual Obscurity / Thirty Tigers) finds Thorn putting his own gritty rock stamp on some of his favorite songs. There are some names familiar to Americana fans (Buddy Miller, Ray Wylie Hubbard), some lesser-known (Foy Vance, Wild Bill Emerson) and some surprises. The Buckingham/Nicks tune Don't Let Me Down Again originated on that duo's debut, not during the Fleetwood Mac era, while the Paul Rogers/Free song that Thorn chose to cover is an obscure one, Walk In My Shadow.\n\nThe idea for a covers album grew as Thorn encountered tunes that meant something important to him. \"I would hear them in the tour van or I'd be at a festival and see someone perform them live,\" Thorn says, \"and I'd say 'That's a great song, I wish I had written it!'\" One thing all the writers of these songs have in common, according to Thorn, is that they are true artists. \"They don't just write songs in an effort to become popular or follow trends,\" he explains. \"At the risk of sounding corny, they write with their hearts. None of these songs are cookie-cutter tunes like you hear on the radio today. They all have real depth, which is very appealing to me.\"\n\nThe set covers subjects that are familiar territory to Thorn, from the spiritual pull of Miller's Shelter Me Lord to the spirited fun in Big Al Anderson's Jukin'. Thorn, so skilled with his own character studies, plays storyteller with such lurid tales as Hubbard's Snake Farm and Emerson's Bull Mountain Bridge. Emerson (who has written for George Jones and Tammy Wynette) is someone, according to Thorn, who \"can tell a story in a song like nobody else.\"\n\nWhat The Hell Is Goin' On? also delivers songs of love and salvation. Vance's Shed A Little Light and Eli \"Paperboy\" Reed's Take My Love With You are emotionally powerful tunes. The latter particularly expresses Thorn's feelings about being on the road and missing his family back home: \"Being a touring musician is a blessing and a curse... and Eli put into words what I feel like sometimes.\"\n\nWhat The Hell's centerpiece is the powerful title track, a blistering look at life in modern times that was penned by blues-rock icon Elvin Bishop. \"We are living in a new world where people are very connected, but also at the same time are disconnected,\" Thorn states. \"I believe technology in moderation is good but too many folks are walking around wearing ear phones and some have forgotten the lost art of basic social skills.\"\n\nThe song also is significant because he has developed a friendship with Bishop over the years. \"I sometimes visit him at his house when I'm out in California and he always gives me a jar of his homemade jelly that he makes with fresh kiwis from his garden,\" Thorn recalls. \"He sang this song for me on his front porch one day and it blew me away.\" It was also a treat to have Bishop perform a guitar solo on the tune - which Thorn describes as \"wonderfully raw and dirty.\" Other special guests on the album are Delbert McClinton (another Thorn idol) and the marvelous singing McCrary Sisters.\n\nThe heavy lifting on the album, however, was done by Thorn and, as usual, his touring band (guitarist Bill Hinds, keyboard player Michael Graham, bassist Ralph Friedrichsen and drummer Jeffrey Perkins). \"The guys in this outfit are a tight unit and a well-oiled machine,\" he proclaims. \"I've had the same guys in my band for goin' on 15 years and they are incredible musicians.\" Another long-time collaborator is Billy Maddox, who steered the ship and also served as What The Hell's producer. The sense of camaraderie among Thorn, his band and Maddox contributes to the disc's loose, live performances. The lived-in quality is undoubted aided by the fact that Thorn and the band had already played these songs live and honed them into what he calls \"crowd-pleasers.\"\n\nPhoto of Paul ThornThorn has been pleasing crowds for years with his muscular brand of roots music - bluesy, rocking and thoroughly Southern, yet also speaking universal truths. The Tupelo, Mississippi native worked in a furniture factory, jumped out of airplanes, and was a professional boxer before sharing his experiences with the world as a singer-songwriter. Pimps and Preachers, which topped the Americana charts for three weeks and broke into the Billboard Top 100, perfectly exemplified the vivid scope of his songwriting and illuminated his family background. While his father is a Church of God Pentecostal Minister, his uncle (his father's brother) spent time as a pimp, and Thorn was influenced by both of these men. Mining these \"saint and sinner\" scenarios, Thorn crafted a disc that All Music Guide lauded as \"a great rock & roll album,\" while The Nation labeled it \"an incredible find.\"\n\nWhen Thorn and his band hit the road, he'll be performing both his captivating originals and these favored covers, because, as he says, \"there are so many great writers out there whose songs need to be heard.\" Thorn also might slip in a new song or two as he already has started writing more songs of his own for the next album. <a href=\"https://www.last.fm/music/Paul+Thorn\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
