{"artist":{"name":"Penguin Cafe Orchestra","mbid":"4dfadf48-e15b-4fc2-a800-2b68702a72d5","url":"https://www.last.fm/music/Penguin+Cafe+Orchestra","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bb4ad8e8e8e3457689f442f22e993ef4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bb4ad8e8e8e3457689f442f22e993ef4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bb4ad8e8e8e3457689f442f22e993ef4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb4ad8e8e8e3457689f442f22e993ef4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb4ad8e8e8e3457689f442f22e993ef4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb4ad8e8e8e3457689f442f22e993ef4.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"282237","playcount":"4005825"},"similar":{"artist":[{"name":"Penguin Cafe","url":"https://www.last.fm/music/Penguin+Cafe","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/15206dea2cb22066733399f56c791c79.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/15206dea2cb22066733399f56c791c79.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/15206dea2cb22066733399f56c791c79.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/15206dea2cb22066733399f56c791c79.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/15206dea2cb22066733399f56c791c79.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/15206dea2cb22066733399f56c791c79.png","size":""}]},{"name":"Wim Mertens","url":"https://www.last.fm/music/Wim+Mertens","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/47194b05678a4541bb31e9492de0c27b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/47194b05678a4541bb31e9492de0c27b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/47194b05678a4541bb31e9492de0c27b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/47194b05678a4541bb31e9492de0c27b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/47194b05678a4541bb31e9492de0c27b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/47194b05678a4541bb31e9492de0c27b.png","size":""}]},{"name":"Harold Budd/Brian Eno","url":"https://www.last.fm/music/Harold+Budd%2FBrian+Eno","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/31573ce3e207ed479d432a81ac72ef8e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/31573ce3e207ed479d432a81ac72ef8e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/31573ce3e207ed479d432a81ac72ef8e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31573ce3e207ed479d432a81ac72ef8e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31573ce3e207ed479d432a81ac72ef8e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31573ce3e207ed479d432a81ac72ef8e.png","size":""}]},{"name":"Simon Jeffes","url":"https://www.last.fm/music/Simon+Jeffes","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/378f99e1a4ae4dfd9971dd9e28b2781c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/378f99e1a4ae4dfd9971dd9e28b2781c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/378f99e1a4ae4dfd9971dd9e28b2781c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/378f99e1a4ae4dfd9971dd9e28b2781c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/378f99e1a4ae4dfd9971dd9e28b2781c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/378f99e1a4ae4dfd9971dd9e28b2781c.png","size":""}]},{"name":"Harold Budd","url":"https://www.last.fm/music/Harold+Budd","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/66943057aaf2404cc0f2d88633952cf9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/66943057aaf2404cc0f2d88633952cf9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/66943057aaf2404cc0f2d88633952cf9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/66943057aaf2404cc0f2d88633952cf9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/66943057aaf2404cc0f2d88633952cf9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/66943057aaf2404cc0f2d88633952cf9.png","size":""}]}]},"tags":{"tag":[{"name":"instrumental","url":"https://www.last.fm/tag/instrumental"},{"name":"contemporary classical","url":"https://www.last.fm/tag/contemporary+classical"},{"name":"ambient","url":"https://www.last.fm/tag/ambient"},{"name":"new age","url":"https://www.last.fm/tag/new+age"},{"name":"Classical","url":"https://www.last.fm/tag/Classical"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Penguin+Cafe+Orchestra/+wiki"}},"published":"24 Mar 2006, 16:34","summary":"The Penguin Cafe Orchestra was the creation of classically-trained guitarist, composer, and arranger Simon Jeffes (Crawley, Sussex, England, 1949–1997).  Jeffes and cellist co-founder Helen Liebmann were members throughout its life; a number of other musicians became part of the ensemble playing live and also appearing on studio albums according to the instrumentation of particular pieces. Several members of the original PCO, Geoffrey Richardson <a href=\"https://www.last.fm/music/Penguin+Cafe+Orchestra\">Read more on Last.fm</a>","content":"The Penguin Cafe Orchestra was the creation of classically-trained guitarist, composer, and arranger Simon Jeffes (Crawley, Sussex, England, 1949–1997).  Jeffes and cellist co-founder Helen Liebmann were members throughout its life; a number of other musicians became part of the ensemble playing live and also appearing on studio albums according to the instrumentation of particular pieces. Several members of the original PCO, Geoffrey Richardson, Jennifer Maidman, Steve Fletcher, and Annie Whitehead have continued to play the music initailly under the name “The Anteaters” but more recently as “The Orchestra That Fell to Earth”.\n\nThe orchestra’s sound is not easily categorized, but has elements of exuberant folk music and a minimalist aesthetic occasionally reminiscent of composers such as Philip Glass.\n\nThe group toured extensively during the 1980s and early 1990s; two albums, When in Rome (1988) and Concert Program (1995), captured the sound of the live ensemble. Penguin Cafe Orchestra recorded and performed for twenty-four years until Jeffes died of a brain tumour in 1997. The tenth anniversary of Jeffes’ death was marked by the original PCO members reforming for three concerts at the Union Chapel in London in 2007. \n\nIn 2009 Simon Jeffes’ son Arthur Jeffes formed a new group called “Music from the Penguin Cafe” which plays some of the music of PCO along with Arthur’s own compositions. In 2011 Arthur’s group changed their name to simply “Penguin Cafe”.\n\n\nHistory\n\nAfter becoming disillusioned with the rigid structures of classical music and the limitations of rock music, in which he also dabbled, Jeffes became interested in the relative freedom in ethnic music and decided to imbue his work with the same sense of immediacy and spirit.\n\nDescribing how the idea of the Penguin Cafe Orchestra came to him, Jeffes said, “I was on the beach sunbathing and suddenly a poem popped into my head. It started out ‘I am the proprietor of the Penguin Café, I will tell you things at random’ and it went on about how the quality of randomness, spontaneity, surprise, unexpectedness, and irrationality in our lives is a very precious thing. And if you suppress that to have a nice orderly life, you kill off what’s most important. Whereas in the Penguin Café your unconscious can just be. It’s acceptable there, and that’s how everybody is. There is an acceptance there that has to do with living the present with no fear in ourselves.”\n\nTheir first album, Music from the Penguin Cafe, was released in 1976 on Brian Eno’s experimental E.G. Records label; a collection of pieces recorded from 1974–1976, it was followed in 1981 by Penguin Cafe Orchestra, after which the band settled into a more regular release schedule.\n\nThey played their first major concert in 1977, supporting Kraftwerk at The Roundhouse. They went on to tour the world and play at a variety of music festivals as well as residencies on London's South Bank.\n\n\nEvolution\n\nSimon Jeffes experimented with various configurations both live and in the studio, including an occasional “dance orchestra” and a quintet of strings, oboe, trombone, and himself on piano. On the studio albums he sometimes played many of the instruments himself, bringing in the other musicians according to the needs of a particular piece.\n\nThere were a number of incarnations of the live band. Original members Gavyn Wright and Steve Nye left in 1984 and 1988 respectively. Bob Loveday replaced Gavyn Wright on violin. Gradually, a regular line-up evolved around Simon Jeffes and Helen Liebman: Neil Rennie, who joined in 1975 on ukulele; Geoffrey Richardson who had joined in 1976 and co-wrote three pieces on Broadcasting from Home (1984), played viola, cuatro, guitar, clarinet, mandolin, and ukulele; Julio Segovia answered an advert in Melody Maker and joined in 1978 on percussion; Jennifer Maidman joined in 1984 on percussion, bass, ukulele, and cuatro; Steve Fletcher replaced Steve Nye in 1988 on piano and keyboards; and Annie Whitehead, who had also appeared on Broadcasting from Home, joined the live band in 1988 on trombone. Finally, Peter McGowan took over from Bob Loveday on violin and Barbara Bolte joined on oboe. Doug Bevridge also became a regular fixture at the live mixing desk. The album Concert Program (1995) is the definitive recording of this line up, and includes many of the orchestra’s best-known pieces.\n\nAfter Simon’s death, members of the orchestra continued to meet up occasionally to play together but there were no recordings or public appearances for over ten years. In 2007 the band briefly re-appeared, with the same line up minus Julio Segovia, but joined by Simon Jeffes’ son Arthur on percussion and piano, to mark the tenth anniversary of its dissolution, playing three sold-out shows at the Union Chapel in London. \n\nHowever, after the Union Chapel farewell concerts a core of long-time members, the multi-instrumentalists Geoffrey Richardson and Jennifer Maidman, trombonist Annie Whitehead, and pianist Steve Fletcher decided to continue playing the orchestra’s music. They called themselves “The Anteaters” at first, then “The Orchestra That Fell to Earth”, and have been joined by percussionist Liam Genockey, best known as a member of Steeleye Span, but who also played live with the original Penguins.  \n\n\nFilms\n\nPenguin Cafe Orchestra provided the complete score for the 1986 Australian film Malcolm. One of their most popular and recognisable pieces is “Music For A Found Harmonium”, which has been used extensively as incidental music in films ranging from Ferris Bueller’s Day Off to Napoleon Dynamite. It has also enjoyed frequent plays as a chill out anthem in Ibiza and has featured in many television advertisements in the U.K. \n\n <a href=\"https://www.last.fm/music/Penguin+Cafe+Orchestra\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
