{"artist":{"name":"Perez Prado","url":"https://www.last.fm/music/+noredirect/Perez+Prado","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/94827c58fb294c0e8a345c73a2c4519d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/94827c58fb294c0e8a345c73a2c4519d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/94827c58fb294c0e8a345c73a2c4519d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94827c58fb294c0e8a345c73a2c4519d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94827c58fb294c0e8a345c73a2c4519d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94827c58fb294c0e8a345c73a2c4519d.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"0","playcount":"0"},"similar":{"artist":[]},"tags":{"tag":[{"name":"mambo","url":"https://www.last.fm/tag/mambo"},{"name":"latin","url":"https://www.last.fm/tag/latin"},{"name":"instrumental","url":"https://www.last.fm/tag/instrumental"},{"name":"cuban","url":"https://www.last.fm/tag/cuban"},{"name":"50s","url":"https://www.last.fm/tag/50s"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/Perez+Prado/+wiki"}},"published":"21 Jan 2007, 14:00","summary":"Universally known as the King of the Mambo, Pérez Prado was the single most important musician involved in the hugely popular Latin dance craze. Whether he actually created the rhythm is somewhat disputed, but it's abundantly clear that Prado developed it into a bright, swinging style with massive appeal for dancers of all backgrounds and classes. Prado's mambo was filled with piercing high-register trumpets, undulating saxophone counterpoint, atmospheric organ (later on), and harmonic ideas borrowed from jazz. <a href=\"https://www.last.fm/music/+noredirect/Perez+Prado\">Read more on Last.fm</a>","content":"Universally known as the King of the Mambo, Pérez Prado was the single most important musician involved in the hugely popular Latin dance craze. Whether he actually created the rhythm is somewhat disputed, but it's abundantly clear that Prado developed it into a bright, swinging style with massive appeal for dancers of all backgrounds and classes. Prado's mambo was filled with piercing high-register trumpets, undulating saxophone counterpoint, atmospheric organ (later on), and harmonic ideas borrowed from jazz. While his tight percussion arrangements allowed for little improvisation, they were dense and sharply focused, keeping the underlying syncopations easy for dancers to follow. Prado played the piano, but was often more in his element as the focal point of the audience's excitement; he leaped, kicked, danced, shouted, grunted, and exhorted his musicians with a dynamic stage presence that put many more sedate conductors and bandleaders to shame. With this blueprint, Prado brought mambo all the way into the pop mainstream, inspiring countless imitators and scoring two number one singles on the pop charts (albeit in a smoother vein than the fare that first made his name) as the fad snowballed. He was a star throughout most of the Western Hemisphere during the '50s, and even after his popularity waned in the United States, he remained a widely respected figure in many Latin countries, especially his adopted home of Mexico. Prado is often best remembered for his softer, more commercial work, which has an undeniable kitschiness that plays well with modern-day lounge-revival hipsters. Unfortunately, that has served to obscure his very real credentials in the realm of authentic, unadulterated Latin dance music, and to this day he remains somewhat underappreciated.\n\nDamaso Pérez Prado was born in the heavily Afro-Cuban area of Matanzas, Cuba, on December 11, 1916 (though he habitually gave his birthdate as five years later). According to custom, he carried both his father's and mother's last name; his earliest recordings were issued under the name D. Pérez Prado, but the \"D.\" was dropped on his American releases, and in 1955 he had his full name legally shortened to Pérez Prado. Starting in childhood, Prado studied classical piano, and by the time he finished school, he was good enough to play piano and organ professionally in local clubs and movie theaters. He moved to Havana around 1942 and freelanced for a number of smaller orchestras over the next year or so. Chiefly a pianist at this point, he also landed an arranging job with Gapar Roca de la Peer, which sometimes supplied material to the highly popular Orquesta Casino de la Playa. The orchestra's lead vocalist, Cascarita, liked Prado's work, and soon they hired him as arranger and pianist. This was the early platform Prado needed to develop his own arranging style, and after-hours jam sessions around Havana were already influencing his rhythmic concepts. Seeking to bring more excitement into the well-established rumba rhythm, Prado began to experiment with the hard swing of American jazz, influenced especially by the harmonically sophisticated big-band music of Stan Kenton. He also sought to build new Afro-Cuban-derived rhythms, including a pattern that was dubbed the mambo, whose early forms were traced back to Arsenio Rodriguez and Orestes Lopez. \n\nPrado's innovations were greeted with outright hostility from Cuba's conservative musical establishment, which resisted the incursion of jazz on their native music. No longer able to find arranging work, he left Cuba in 1947 to try his luck in Puerto Rico. He eventually joined a touring group that swung through Argentina, Venezuela, Panama, and Mexico, and emerged as their star attraction. In 1948, he relocated to Mexico City and set about putting together his own orchestra, which featured a core membership of Cuban expatriates. One of those was singer Beny Moré, who performed and recorded with Prado (among several other bandleaders) through 1950; the association helped make Prado's orchestra a top draw in Mexico City, and set Moré on a path to becoming one of Cuba's best-loved singers. RCA's Mexican division signed Prado as an artist in his own right in 1949, and his first 78 rpm record, \"Que Rico el Mambo\" b/w \"Mambo No. 5,\" was a hit across much of Latin America. In 1950, RCA reissued it in the U.S., with the A-side's title changed to \"Mambo Jambo\"; it had moderate success there too. Over 1950, Prado released numerous singles in Mexico; most of them were titled in tribute to a broad range of social classes and occupations, which helped make them wildly popular. Additionally, Prado appeared in several Mexican films, generally playing himself and spotlighting his stage act.\n\nThe early '50s were a busy time for Prado, who mounted a number of international tours as the mambo sound spread like wildfire. In Peru, Catholic authorities threatened to deny absolution for anyone who participated in mambo dancing, to little discernible effect. Prado's first U.S. tour came in 1951, with Beny Moré accompanying him; because of musicians' union rules, he was often forced to hire local musicians in place of his Mexican personnel, and train them rigorously in a very short period of time with little knowledge of English. The tour was a smashing success, however, especially on the West Coast, and RCA started releasing his records on their main RCA Victor imprint, rather than consigning them to a specialty subsidiary. In late 1953, Prado caused a stir when he was abruptly deported by Mexican officials to Havana; his sudden disappearance (he was arrested in a backstage dressing room) sparked rumors of kidnapping before he finally resurfaced to explain that he had forgotten to renew his visa.\n\nPrado returned to the U.S. in 1954, embarking on another hugely successful tour of the West Coast. He then made his way to New York, where his orchestra played several upscale venues that helped make mambo all the rage among upper as well as lower classes. Spurred by mambo nights in clubs across the city, mambo was pushing its way into the pop mainstream, as traditional pop crooners and R&B/blues artists alike recorded Latin-flavored novelty items paying tribute to the emerging fad. Seeing that his music could cross over to the lucrative white market, Prado began to tailor it for mainstream consumption, scoring minor hits with covers of the theme from the Italian film Anna and the South African tune \"Skokiaan,\" which signaled the beginning of a more polished studio sound. He finally scored a breakout pop hit in early 1955 with \"Cherry Pink and Apple Blossom White,\" which was used as the theme to the Jane Russell film Underwater!. Ironically for the Cuban-born El Rey del Mambo, his first major hit was an adaptation of a French song (\"Cerisier Rose et Pommier Blanc\"), and its underlying rhythm was a cha-cha. Powered by a dramatic, swooping trumpet lead by Billy Regis, \"Cherry Pink and Apple Blossom White\" spent an astounding ten weeks at number one on the pop charts, making it one of the biggest instrumental hits of all time. The accompanying album, Mambo Mania, was Prado's first full-length 12\" LP, and mostly featured material he'd recorded during his time in Mexico.\n\nPrado took advantage of his success to attempt more ambitious compositions during this period. His first effort in this vein was 1954's The Voodoo Suite, an impressionistic tone poem for Afro-Cuban big band that incorporated elements of jazz and exotica. West Coast trumpeter Shorty Rogers helped out on the arrangements, and the results often recalled Stan Kenton's progressive big-band mood music, albeit with a Latin sound. The 1956 album Havana 3 A.M. was a wilder excursion that ranked as probably the purest, most authentically Latin record of Prado's commercial period. Of course, there were many commercial projects too; the biggest was 1958's Prez, which fell just short of the Top 20 on the pop LP charts. That same year, Prado scored his second number one single with the self-composed \"Patricia,\" a slinky if subdued instrumental spotlighting his organ playing. The tune was later used in a steamy, controversial sequence in director Federico Fellini's classic La Dolce Vita. The follow-up single, \"Guaglione,\" just missed the Top 50.\n\nDetermined not to become a one-trick pony, Prado had begun to experiment with new rhythms and dance forms as early as 1954. A rhythm he called \"La Culeta\" was his answer to the cha-cha, adding violins to the required instrumentation. Several others — the suby and the pau-pau (both mid-'50s), La Chunga and El Dengue (both early '60s) — failed to catch fire with the public as mambo had. In the early '60s, Prado began to flirt with rock & roll dances, adding Twist-type rhythms and tempos to albums like 1961's Rockambo and 1962's The Twist Goes Latin (the latter featured Twist reworkings of his two chart-topping singles). However, he wasn't simply chasing trends during this period; 1962 brought another compositionally ambitious tone poem, The Exotic Suite of the Americas, which added strings and a movie-soundtrack feel to an Afro-Cuban big band. Unfortunately, Prado was running out of commercial steam, his early thunder largely stolen by rock & roll. His last American album for RCA, Dance Latino, was released in 1965, and by the early '70s, he had returned to Mexico City permanently.\n\nDespite his declining fortunes in the U.S., Prado remained an icon in much of Latin America, and he continued to tour successfully in Mexico, South America, and Japan during the '70s. He also released records in those markets, and appeared frequently on Mexican television. In 1981, he appeared in a musical revue, Sun, that enjoyed a lengthy run in Mexico City. A false report surfaced in 1983 that Prado had died in Milan, Italy, but it was actually his younger brother, Pantaleón Pérez Prado, who had passed away; Prado had been forced to sue Pantaleón in 1956 for impersonating him and using the performing name Pérez Prado to draw audiences in Europe. Prado himself started grooming his son, Pérez Prado, Jr., to take over the reins of his orchestra in the mid-'80s. Prado returned to America for a final concert at the Hollywood Palladium in 1987; although age and ill health had taken its toll on his stage demeanor, the appearance was a sold-out success. He passed away in Mexico City on September 14, 1989, after suffering a stroke. Prado's music has lived on in popular culture in the years since his death: \"Guaglione\" was a near-number one hit in England in 1995 after being featured in a Guinness beer commercial; \"Patricia\" was adopted as the theme for the HBO documentary series Real Sex; and \"Mambo No. 5\" was adapted into the unnervingly catchy novelty hit \"Mambo No. 5 (A Little Bit Of...)\" by Lou Bega in 1999. Prado Jr. continues to direct his father's orchestra in Mexico City. \n <a href=\"https://www.last.fm/music/+noredirect/Perez+Prado\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
