{"artist":{"name":"Peter Hunnigale","mbid":"e6de99a3-fa2d-47bb-973a-95202ba8332a","url":"https://www.last.fm/music/Peter+Hunnigale","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ad7a742f957f4f119d28bdbf38facfd5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ad7a742f957f4f119d28bdbf38facfd5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ad7a742f957f4f119d28bdbf38facfd5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad7a742f957f4f119d28bdbf38facfd5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad7a742f957f4f119d28bdbf38facfd5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad7a742f957f4f119d28bdbf38facfd5.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"10453","playcount":"58037"},"similar":{"artist":[{"name":"Kashief Lindo","url":"https://www.last.fm/music/Kashief+Lindo","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fcde6895aeac64c56a4b2cbeae1003ee.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fcde6895aeac64c56a4b2cbeae1003ee.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fcde6895aeac64c56a4b2cbeae1003ee.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fcde6895aeac64c56a4b2cbeae1003ee.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fcde6895aeac64c56a4b2cbeae1003ee.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fcde6895aeac64c56a4b2cbeae1003ee.png","size":""}]},{"name":"Lloyd Brown","url":"https://www.last.fm/music/Lloyd+Brown","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c96a5454ee044a4fa728ce0a079a049e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c96a5454ee044a4fa728ce0a079a049e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c96a5454ee044a4fa728ce0a079a049e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c96a5454ee044a4fa728ce0a079a049e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c96a5454ee044a4fa728ce0a079a049e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c96a5454ee044a4fa728ce0a079a049e.png","size":""}]},{"name":"Mikey Spice","url":"https://www.last.fm/music/Mikey+Spice","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/37e7801ec81c44b78165a78e091c26fb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/37e7801ec81c44b78165a78e091c26fb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/37e7801ec81c44b78165a78e091c26fb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37e7801ec81c44b78165a78e091c26fb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37e7801ec81c44b78165a78e091c26fb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37e7801ec81c44b78165a78e091c26fb.png","size":""}]},{"name":"Thriller U","url":"https://www.last.fm/music/Thriller+U","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/784fa6283c364124ada27a3e4ee864de.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/784fa6283c364124ada27a3e4ee864de.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/784fa6283c364124ada27a3e4ee864de.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/784fa6283c364124ada27a3e4ee864de.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/784fa6283c364124ada27a3e4ee864de.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/784fa6283c364124ada27a3e4ee864de.png","size":""}]},{"name":"Singing Melody","url":"https://www.last.fm/music/Singing+Melody","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ec075e1181864ae8bc4df4eb4690edd5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ec075e1181864ae8bc4df4eb4690edd5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ec075e1181864ae8bc4df4eb4690edd5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec075e1181864ae8bc4df4eb4690edd5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec075e1181864ae8bc4df4eb4690edd5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec075e1181864ae8bc4df4eb4690edd5.png","size":""}]}]},"tags":{"tag":[{"name":"reggae","url":"https://www.last.fm/tag/reggae"},{"name":"lovers rock","url":"https://www.last.fm/tag/lovers+rock"},{"name":"dancehall","url":"https://www.last.fm/tag/dancehall"},{"name":"singers delight","url":"https://www.last.fm/tag/singers+delight"},{"name":"dennis brown mix","url":"https://www.last.fm/tag/dennis+brown+mix"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Peter+Hunnigale/+wiki"}},"published":"25 Dec 2008, 16:27","summary":"Born in South London 12th December 1960 Peter Hunnigale was to develop into one of Britain's most formidable Reggae artist of our time. \nIt was clear at a tender age Peter's main interest was in music and being born of Jamaican parentage he was exposed and influenced by music of West Indian culture. \nGrowing up in Britain meant that Peter was also opened to other genre's in music and with seeing the popular acts of the day performing on Television and hearing the songs on Radio, Peter knew what he wanted to be.  <a href=\"https://www.last.fm/music/Peter+Hunnigale\">Read more on Last.fm</a>","content":"Born in South London 12th December 1960 Peter Hunnigale was to develop into one of Britain's most formidable Reggae artist of our time. \nIt was clear at a tender age Peter's main interest was in music and being born of Jamaican parentage he was exposed and influenced by music of West Indian culture. \nGrowing up in Britain meant that Peter was also opened to other genre's in music and with seeing the popular acts of the day performing on Television and hearing the songs on Radio, Peter knew what he wanted to be. \nThere were very few places where one could nurture their talents during the 60's so Peter had to wait until secondary school before he would be able to learn basic Guitar chords and discover other students with the same interests as himself. It was at secondary school in South London where Peter met Fitzroy Blake who was to become the recording engineer for Peter's earlier hits. Their interests in music took Peter and Fitzroy through the basic \nrudiments of recording and making records and learning the skills needed to develop their talents as professionally as possible. \nAt the end of their academic years Fitzroy took on work as tape operator at De Wolfe Studio in Wardour St. London, whilst Peter continued to learn his craft as a guitarist and both saw further encouragement in the wake of the Lovers Rock phenomena. \nPeter's first recordings were at De Wolfe Studio where Fitzroy was given free studio- time on weekends and being in such a privileged circumstance they both were exposed to a professional level of playing and recording music. The first record to be released from that period was a song written by Peter called \"Slipping Away\" (circa 1980 LGR records) and was to be the beginning of a long line of hits to follow from this prolific exponent of British Reggae music. \"Dancin Time\" was the next release Peter was to appear on teaming up with Raymond Simpson, a much-respected vocalist by many, including Peter. The song was recorded at \"Vibes Corner Studio\" the brainchild of Fitzroy and Raymond. Consisting mainly of British local talent, the studio was like a workshop and was an ideal environment for Peter to improve on his skills as a musician and to practice his vocal techniques which was seen as an important factor to any of the in-house productions. \nDancin Time was the only record released from Vibes Corner and \nunfortunately enough the studio came to a close not long after. This gave birth to the idea of creating a new label as both Peter and Fitzroy were still a team producing material and still eager to continue their chosen profession so it was not long before \"Street Vibes Records\" was formed. \n\"Got to get to know you\" c/w \"Money Money\" was Street Vibes Records first issue but did very little to bring any further awareness to the talents of the outfit. It would be some time before Street Vibes released a second \nrecording. \nDuring the period outside of the studio productions Peter and Fitzroy took on the role of session and live work with Reggae legends such as \"The Chosen few\" \"The Pioneers\" \"B B Seaton\" and many others while earning the respect of their peers as a competent Bassist and qualified engineer. The live commitments were a new direction in Peter's career and taught him live performance protocol, which only served to enhance his knowledge of music and the industry. \nProduction was still the main feature of the duo's forte so armed with a 4 track quarter-inch machine, desk, keyboards and guitars Peter and Fitzroy continued to produce material and it was not long before \"Giving myself away\" was recorded and released on the Street Vibes Label and became the first entry for Peter in the then \"Black Echoes\" charts. The song got to number 24 and received positive response from sales and media sources and gave the partners the platform they needed. \n1986 was the year Peter Hunnigale firmly established his name as the industry's most promising newcomer charting with a song called \"Be my lady\" (1986) and achieving the respectful position of number 4 in the Echoes charts and again featuring on the Street Vibes label. The path was set for a flurry of songs written and performed by Peter proving his talents as a recording artist and displaying the production qualities of Street Vibes. \"Fool for you\" \"Let's get it together\" \"It's like happiness\" \"Mr. Vibes\" \n\"Heart of steel\" were some of the title's released by the outfit and prompted Peter's first album entitled \"In this time\" which featured new elements in the team. \nTuca Rainbow, (percussion) & Delroy \"Fluty\" Clarke (keyboard's & horns) were the formal additions to the Street Vibes camp. \nAfter it's launch, \"In this time\" came to rest at the number 1 position in the album charts and gained Peter notoriety for consistency and quality in his recordings and was quoted to be one of Britain's finest singer/songwriters in Reggae music. \nInevitably awards followed, marking the respect Peter had gained for his music, so 1987 saw Peter collect his first accolade at the Celebrity Awards ceremony held in London, for best newcomer. Within the same year Peter was presented with a second award at the British Reggae Industry ceremony, for best British Reggae album. \nMore recordings followed and with his growing popularity began co-writing and producing other artists from the industry. A DJ/Singer partnership was born from the notable success of \"Raggamuffin girl\" with Tippa Irie. It stole the number one position in the charts and won Peter and Tippa record of the year (1989) Black Echoes Magazine and also received an award at the British Reggae industry ceremony for reaching to number one (1989). Two albums were recorded making official the new partnership between Peter and Tippa. \"New Decade\" (Mango records) and \"Done cook and curry\" (Tribal bass records) was once again a new direction in Peter's career and his partner Tippa Irie was quite a formidable artist in his own right which led the team to different areas within the Reggae industry. \n1990 Peter recorded his first single in Jamaica entitled \"A Love like this\" at the courtesy of Augustus\"Gussie\"Clarke (Music Works) but was mainly only available on the \"Massive compilations\" produced by Level Vibes Records in the UK. \nAt this stage Peter had firmly established himself in the market with chart topping hits such as \"Mr. Vibes\" \"Heavenly\" \"Time for love\" \"Seeing is believing\" and \"Heart of Steel\" which eventually culminated into Peter's second solo album entitled \"Mr.Vibes\" all recorded for the Street Vibes label but released by Arawak Records in 1992 as an album. \nAlthough by this time the British Reggae Industry had moved on from the Lovers Rock era and Jamaican Dance hall became the theme, Peter still maintained his brand and level of music much to his own benefit as this now placed him as a unique alternative in the market. A third album was released upon signing to \"Down to Jam\" Records (London) entitled \"Nah Give Up\" (1995) containing more singles recorded by Peter and featuring songs for other producers. \nTwo tracks, which appeared on the Nah give up album made British Reggae history. \"Perfect lady\" recorded and released by Fashion records and \"Baby- Please\" recorded and released by Saxon records both achieved the number one slot consecutively in the Echoes charts 1994, each changing positions with themselves from 1-2 and visa versa. As recognition of this remarkable event Peter received no less than three awards at the BRI 14th Annual Awards Ceremony 1995 for the year 1994. Best song / Best songwriter and Best Male Singer. BBC 3 counties radio hosted by Crucial Robbie also furnished Peter with the Best British Male Vocalist Award for 1994 at its ceremony. \nPeter had recorded and produced the Arsenal football club 1994 Coca Cola cup double anthem \"Shouting for the Gunners\" along with DJ partner Tippa Irie which was released by London records 1994, and reached the top Forty in the national chart. Arsenal went on to win both matches! \nLegendary pop icon Gilbert O' Sulivan was one of many who also \ncommissioned Peter to remix his 1970's hit \"Why oh Why\" which was sheer delight for Peter as this became a new challenge to his capabilities. Gilbert noted the song as a perfect fit even though the track was performed in true Lovers Rock style. \nNah Give up was yet to bear more fruits as it won the first MOBO Awards best Reggae album category 1996 and also the Black Music Awards within the same year. \nPeter won more awards during the same period for Best Male Vocalist and best single \"Share your love\" with fellow artists Nerious Joseph / Mafia & Fluxy and Glamour Kid (Passion) released by (Jet Star records) at the 1996 People's Awards ceremony and again in1997 for Best Male Vocalist. More albums were to follow \"The Pacifists\" (Sony records) \"Mr.Government\"(Ariwa) \"Reggae Max\" (Jet Star Records) \"Silly Habits\" (Jamming) \"Genuine\" (Saxon records) and \"Back to the old school\" - (Disco Tex Records) all between (1996 - 98). \"African Tears\" \"Going out of my head\" \"Lets be Friends\" \"Find a way\" the \"Dennis Brown Tribute\" recording featuring the British Reggae Industry were more singles performed By Peter on the run up to the Millenium year 1999 and is hailed by his peers as Britain's Premier and number one Reggae Singer / songwriter to date, with still another album to be released by Disco Tex Records entitled \" African Tears\" and due for release in Spring 2001. \nAfter recording several hit singles with Charm Records, Jetstar Phonographics are also scheduled to release a new CD from Peter in Autumn 2001 which will see his Album catalogue well into double figures and with no doubt will reflect the consistency in the quality of recordings expected from this artist. \n\nPeter has toured throughout the world from Australia, Japan, Jamaica (Reggae Sunsplash) UK, Germany, Sweden, Spain, Paris, New York and California to name but a few, and have performed alongside Reggae legends the likes of Beres Hammond, Freddie McGregor, Alton Ellis, The Chosen Few And The Pioneers.  <a href=\"https://www.last.fm/music/Peter+Hunnigale\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
