{"artist":{"name":"Peter Spence","mbid":"e92bc035-be6e-43e5-a3e0-fd5166100b52","url":"https://www.last.fm/music/Peter+Spence","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5e4c93474d08474cb5228d5a21a26870.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5e4c93474d08474cb5228d5a21a26870.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5e4c93474d08474cb5228d5a21a26870.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5e4c93474d08474cb5228d5a21a26870.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5e4c93474d08474cb5228d5a21a26870.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5e4c93474d08474cb5228d5a21a26870.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"2438","playcount":"13322"},"similar":{"artist":[{"name":"Keith Douglas","url":"https://www.last.fm/music/Keith+Douglas","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Fiona & Lloyd Brown","url":"https://www.last.fm/music/Fiona+&+Lloyd+Brown","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Donna Rhoden","url":"https://www.last.fm/music/Donna+Rhoden","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7090d381ce4d4698ac3a9efba97f1de1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7090d381ce4d4698ac3a9efba97f1de1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7090d381ce4d4698ac3a9efba97f1de1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7090d381ce4d4698ac3a9efba97f1de1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7090d381ce4d4698ac3a9efba97f1de1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7090d381ce4d4698ac3a9efba97f1de1.png","size":""}]},{"name":"Winsome","url":"https://www.last.fm/music/Winsome","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b264649f0eea4e31b0c7266e0df29a1d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b264649f0eea4e31b0c7266e0df29a1d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b264649f0eea4e31b0c7266e0df29a1d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b264649f0eea4e31b0c7266e0df29a1d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b264649f0eea4e31b0c7266e0df29a1d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b264649f0eea4e31b0c7266e0df29a1d.png","size":""}]},{"name":"Neville Morrison","url":"https://www.last.fm/music/Neville+Morrison","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/520a037027c54c58b29424a0e0aaffd1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/520a037027c54c58b29424a0e0aaffd1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/520a037027c54c58b29424a0e0aaffd1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/520a037027c54c58b29424a0e0aaffd1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/520a037027c54c58b29424a0e0aaffd1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/520a037027c54c58b29424a0e0aaffd1.png","size":""}]}]},"tags":{"tag":[{"name":"reggae","url":"https://www.last.fm/tag/reggae"},{"name":"lovers rock","url":"https://www.last.fm/tag/lovers+rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Peter+Spence/+wiki"}},"published":"26 Jul 2008, 10:39","summary":"\"Peter Spence\" can refer to two different creators:\n\n1. An English journalist and writer:\n\nBorn in 1944, Peter Spence was educated at Bromsgrove School, Worcestershire. At the age of 18, he became a reporter for the Birmingham Post and Mail. Around the same times, he joined the Territorial Army. He studied Politics and American Studies at Nottingham University and graduated in 1968 and became a professional writer in the same year.\n\nPeter Spence has written for many television shows including Not the Nine O'Clock News <a href=\"https://www.last.fm/music/Peter+Spence\">Read more on Last.fm</a>","content":"\"Peter Spence\" can refer to two different creators:\n\n1. An English journalist and writer:\n\nBorn in 1944, Peter Spence was educated at Bromsgrove School, Worcestershire. At the age of 18, he became a reporter for the Birmingham Post and Mail. Around the same times, he joined the Territorial Army. He studied Politics and American Studies at Nottingham University and graduated in 1968 and became a professional writer in the same year.\n\nPeter Spence has written for many television shows including Not the Nine O'Clock News, Crackerjack and Rosemary & Thyme. In the early-1970s, Peter married into the Taylor family who owned and ran Cricket St Thomas Wildlife Park in Somerset. This provided him with a fund of anecdotes which he compiled into a book entitled \"some of our best friends are animals\". A few years later in the mid 1970s he created To the Manor Born, and after a radio pilot was made, the series aired on television from 1979 to 1981. Out of 21 episodes, he wrote 20 of them. The manor shown in the opening credits is in fact Cricket St Thomas - the home of his inlaws.\n\nSpence has also written for radio, including Roy Castle Show and Windsor Davies Presents.\n\n2. An English reggae musician:\n\nReggae music has flourished in England like no other place outside Jamaica. At least two generations of talented UK artists and producers have laid down musical roots that are now celebrated far beyond the confines of the inner city communities that first nurtured them. Whilst Maxi Priest has proven Britain's most successful reggae singer to date, the name on a lot of people's lips right now is Peter Spence; a Birmingham born artist with street credentials to spare, but whose gifts increasingly demand a more international setting.\n\nIt's the quality of his songs and material, as well as his peerless vocals that have reaped Peter most acclaim so far. Whilst hardly prolific, he's consistently delivered music of the highest order, and yet just seems to get better as time goes by. A retrospective of his earlier songs called Lover's Rock was released by Warriors Of Peace at the end of 2003, but look out for new singles on the Checkmate and Stingray labels, the latter having issued his second album, Unfinished Business in 1999. The title of this milestone set says it all, since Peter's career is still only at the midway stage, as demonstrated by his spiralling popularity on both sides of the Atlantic.\n\nHis story begins in England's second city of Birmingham, where he was taught guitar by his father, who had played with bands in Jamaica before settling in England. His own musical apprenticeship was first served by roles as the drummer and then rhythm guitarist for a group called the Experts during the very early 80s. Inspired by Jamaican harmony groups such as the Heptones and Tamlins, he then turned singer and joined a reggae sound-system called Warrior, based in the Balsall Heath area of Birmingham. The influence of Jamaican sound-system culture was all persuasive at the time, and new UK reggae acts began to emerge at a phenomenal rate, including friends and contemporaries of Peter's such as Pato Banton, Macka B, Tippa Irie, Maxi Priest, Smiley Culture and many others.\n\nHis debut track, Frivolous Woman, was recorded for Birmingham producer G. T. Haynes, who also managed Pato Banton, Tippa Irie and Annette B, in addition to Peter himself. His breakthrough arrived in 1987 with a hit on Greensleeves called Don't Leave Me Lonely, for which he received a Best Newcomer award. His next stop was another London based reggae independent label called Fashion, where he recorded a handful of tunes in the lover's rock vein, including Yesterday's Magic, I Believe In Love and Crazy Feelings, as well as further tunes for G.T such as A Love Affair. His debut album for G. T, I'll Be There was released in 1989 to rave reviews and won Best Reggae Album for that year at the Black Music awards, whilst Peter himself was voted Best Male Reggae Singer. He and deejay Tippa Irie, then co-starred on Girl Of My Best Friend for Island, which they promoted throughout the US, Japan and Africa.\n\nWider fame should have beckoned at this point, but the next time we heard Peter's winning partnership with Tippa was on a 1996 single entitled Where Is The Love, produced by Peter Hunnigale. All three performed on a tribute record to Dennis Brown released in 1999, featuring an all-star line-up from the UK reggae community. Such camaraderie is reflected in the way Peter has toured and recorded with both Tippa Irie and Pato Banton on many occasions. In 2000, Pato's Life Is A Miracle album was nominated for a Grammy award. No less than seven of the tracks feature Peter, who also wrote and played on the album, in addition to singing backing vocals. One of the tracks, Ocean Warrior, was included on Surf Dog's Music For Our Oceans project, which is run by a California based charity dedicated to cleaning up the sea and protecting its endangered species.\n\nJet Star, who'd previously released his answer version to Gwen McRae's Girlfriend's Boyfriend, then commissioned two tracks, Flying Without Wings and Make It With You, for their Pop Hits Inna Reggae Vol. 1 album. Peter's cover of Bread's Make It With You later featured in the Channel 4 documentary Dancehall Queens, but it wasn't until searching out an old producer friend from Birmingham called Wooligan that his career took proper shape once more. It through Wooligan that he met Tony English - a New York based producer who's also from Birmingham, and once saw Peter play with the Experts. Tony promptly invited him to New York where they recorded two tracks, Mr. Charmer and I Don't Care (co-starring Shellene Thomas) at Philip Smart's HCF studio in Long Island. Mr. Charmer was an immediate, transatlantic reggae chart hit, thus confirming what Tony English had known all along. Firstly, that within an industry dominated by MCs, there was definitely room for singers of his calibre, and secondly, there were audiences out there eager to show their appreciation of advanced vocal and song writing skills such as his own.\n\nFrom there it was but a small step to Stingray's Big House studio in NW London, where Peter recorded hit single Daddy's Love and the album Unfinished Business, as well as collaborations with Richie Davis, Lloyd Brown and Winsome. The communal atmosphere at Stingray obviously inspired him since Unfinished Business contains some of his best-ever material, including Mr. Charmer and I Don't Care. Now considered a classic reggae vocal set, Unfinished Business also announced how he'd successfully transcended his early reputation as a lovers' rock artist to deliver songs of even greater depth and meaning. Two of them, Know Yourself Mankind and Freedom, enjoy anthem status in roots dances, which is something they have in common with tracks he's voiced for Gussie P such as Redemption, They're Still Crying, To The Bone and Whom Have I Angered. This love of roots and dub music has been with Peter since the start, which may explain why he excels at writing and performing more conscious material, despite his undoubted gift for love songs.\n\nFuture plans include a further album of songs called \"Emotionally Charged\" for Peter's own Warriors Of Peace label.  <a href=\"https://www.last.fm/music/Peter+Spence\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
