{"artist":{"name":"Philippe Eidel","mbid":"dee943c2-0f40-42f1-8412-23f6d1eaa252","url":"https://www.last.fm/music/Philippe+Eidel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6bc74e9fa1c94dfdbb1a161450bb3289.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6bc74e9fa1c94dfdbb1a161450bb3289.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6bc74e9fa1c94dfdbb1a161450bb3289.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6bc74e9fa1c94dfdbb1a161450bb3289.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6bc74e9fa1c94dfdbb1a161450bb3289.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6bc74e9fa1c94dfdbb1a161450bb3289.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"427","playcount":"4227"},"similar":{"artist":[{"name":"Shai No Shai","url":"https://www.last.fm/music/Shai+No+Shai","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e12f208aaca641128ecd108b690eefa6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e12f208aaca641128ecd108b690eefa6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e12f208aaca641128ecd108b690eefa6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e12f208aaca641128ecd108b690eefa6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e12f208aaca641128ecd108b690eefa6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e12f208aaca641128ecd108b690eefa6.png","size":""}]},{"name":"Jeanne Balibar","url":"https://www.last.fm/music/Jeanne+Balibar","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/882c15ad24044a99bbd645f0a4e5bd53.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/882c15ad24044a99bbd645f0a4e5bd53.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/882c15ad24044a99bbd645f0a4e5bd53.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/882c15ad24044a99bbd645f0a4e5bd53.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/882c15ad24044a99bbd645f0a4e5bd53.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/882c15ad24044a99bbd645f0a4e5bd53.png","size":""}]},{"name":"Franck Monnet","url":"https://www.last.fm/music/Franck+Monnet","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7b6bfdbc35644827b02c5ffc2d9b0ac9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7b6bfdbc35644827b02c5ffc2d9b0ac9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7b6bfdbc35644827b02c5ffc2d9b0ac9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b6bfdbc35644827b02c5ffc2d9b0ac9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b6bfdbc35644827b02c5ffc2d9b0ac9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7b6bfdbc35644827b02c5ffc2d9b0ac9.png","size":""}]},{"name":"Magyd Cherfi","url":"https://www.last.fm/music/Magyd+Cherfi","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/df3f28a04cc64fa09eed95a0d227964a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/df3f28a04cc64fa09eed95a0d227964a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/df3f28a04cc64fa09eed95a0d227964a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df3f28a04cc64fa09eed95a0d227964a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df3f28a04cc64fa09eed95a0d227964a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df3f28a04cc64fa09eed95a0d227964a.png","size":""}]},{"name":"David Walters","url":"https://www.last.fm/music/David+Walters","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/aae0fc5a83154221b505ff5128fb2b40.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/aae0fc5a83154221b505ff5128fb2b40.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/aae0fc5a83154221b505ff5128fb2b40.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aae0fc5a83154221b505ff5128fb2b40.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aae0fc5a83154221b505ff5128fb2b40.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aae0fc5a83154221b505ff5128fb2b40.png","size":""}]}]},"tags":{"tag":[{"name":"french","url":"https://www.last.fm/tag/french"},{"name":"world","url":"https://www.last.fm/tag/world"},{"name":"tango","url":"https://www.last.fm/tag/tango"},{"name":"composer","url":"https://www.last.fm/tag/composer"},{"name":"folk rock","url":"https://www.last.fm/tag/folk+rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Philippe+Eidel/+wiki"}},"published":"24 Feb 2008, 12:45","summary":"It’s not so much for the sake of chronology that I’ll begin by saying that I was born in Madagascar, of a father from Marseille and a Creole mother, rather, it’s because this diversity, this mixing of races has really influenced my music, and my life too. In truth, it was only well after my return to France that I first become aware of this racial mixing, and this awareness only really came about quite late on, if I can even say that it’s fully taken place. <a href=\"https://www.last.fm/music/Philippe+Eidel\">Read more on Last.fm</a>","content":"It’s not so much for the sake of chronology that I’ll begin by saying that I was born in Madagascar, of a father from Marseille and a Creole mother, rather, it’s because this diversity, this mixing of races has really influenced my music, and my life too. In truth, it was only well after my return to France that I first become aware of this racial mixing, and this awareness only really came about quite late on, if I can even say that it’s fully taken place.\n\n\nAt the very least I can say that I didn’t grow up in the love of music, as this was something with which my parents were completely unacquainted. So it’s by self-study that I discovered it, again quite late on. I proceeded as many others did, by learning to play the guitar, then joining small passing bands, after which I gave up my studies and left to join Club Med for a few months to earn a mere pittance.\n\n\nIt was on my return to Paris that I met someone who was a great synthesizer enthusiast, but not a musician. He let me use his instruments day and night, instruments that would leave anyone dreaming today (Moogs, Oberheim, Arp, Korg, etc…), so much so that I quickly became very familiar with a type of music that was only in its infancy, listening to the leading bands of the time for hours on end (Kraftwerk, Tangerine Dream, Klaus Schulze…).\n\n\nA producer called Maxime Schmitt heard about me and invited me to his studio to play the synthesizer arrangements and do the programming for a band that was recording its first single. His idea was to create the very first French Techno-Rock band. This group was called “Taxi Girl” and this work gave birth to “Man’kin”, “Chercher le garcon” and many others. At last, I had the exciting feeling of taking part in something really new.\n\nA short time later, my work with Taxi Girl caused another band to contact me for similar reasons and this partnership lasted even longer. The band was Indochine, and following a first single (and album) “L’aventurier”, I was a bit like the fifth member of the band for ten years, right up to the album “Le baiser”.\n\nIn spite of all this I didn’t want to remain stereotyped as a synthesizer specialist; something elsewhere was tempting me and fate took care of the rest.\n\n\nWithout really believing it, I offered to create the logo for an up-and-coming television channel, Canal+. I didn’t think it would come to anything, because I had never worked for either the film or television industries before. I was interested in them, though and was a big fan of Brian Eno, of his “Music for airports” and his very design approach to “Ambient Music”. Having composed something that broke absolutely every rule that applied to television at the time (and often still applies even now), I was extremely surprised when Pierre Lescure not only chose my composition but also even asked me to create the whole design of the channel. I went even further than him by choosing to do so with artists renowned at the time for their ‘no compromise’ attitude towards the media: Gainsbourg, Jonasz, Charlélie Couture, Mc Laughlin and others….\n\nThe media bug was well and truly caught. This design lasted almost 20 years. The design of Channels 7 and M6 followed.\n\nI shared my first experience with Cinema with someone else who was experiencing it for the first time himself, Enki Bilal for “Bunker Palace Hotel”. Even more than the film and its music, it was my few weeks spent in the decadent communist surroundings of Bulgaria and Yugoslavia, amidst the rising hatred between ethnic groups, which were decisive for me. It was there that I realized what it really meant to meet foreign artists on their home ground and what this implied in terms of respect and humility. It was there that I also learnt how to become inquisitive and no longer merely a spectator.\n\nIt was then that my slow awakening to other music, traditions and instruments from elsewhere began, thanks in particular to my collaboration on “Manhabharata” by Peter Brook. Thus began my desire to mingle with them and invite them into my compositions.\n\nThis idea permeated personal projects (like “Mammas”), as well as involvement with other artists for whom I produced their albums (like “Khaled”). At this time, I was lucky enough to be able to continue composing sound tracks for this sort of French “New Wave” (Klapisch, Harel, Salvadori) and even for what symbolized the former New Wave: Eric Rohmer.\n\nNowadays, it’s with pleasure that I pursue this mixing of genres, which makes me quite complex in the opinion of some, but which I know now that I could never do without.\n\n• Creole music ?\n\nLike others, I always find it difficult to define my music when asked. Probably, because it’s constantly taking diversions, while our contemporaries like to know exactly what they’re dealing with.\n\nAfter much thought, I’d quite simply call my music “Creole”. It exists here but was born elsewhere and continues to develop from this fusion.\n\nI prefer “Creole” to “diversity”, as it implies an uprooting which is an intimate part of my life story.\n\nI always think of my compositions as an unlikely Orchestra. I have familiarized myself with, and become greatly attached to instruments like accordions (chromatic and diatonic), various members of the guitar family (bouzouki, charango, cuatro, mandolute…), which are now my daily companions. I compose freely building on this variety. If I have always taken an interest in “traditional” instruments, it’s because they contribute to diversifying the sound palette. I enjoy the freedom of taking them out of their usual context to use them as I please.\n\n• Language and Voice\n\nI have written a lot of compositions for singers expressing themselves in their native tongues (Italian, Spanish, Arabic, Greek, Tuareg, Bulgarian, Hebrew…). Primarily because the voice is such a fascinating raw material, whatever its origin. There’s also something magical in finding yourself in a kind of Tower of Babel, in which you have to learn to coexist, while languages themselves (or actually their meaning) seem to separate us. <a href=\"https://www.last.fm/music/Philippe+Eidel\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
