{"artist":{"name":"Plasmatics","mbid":"3fec8b00-4142-4129-96f5-1c9bf65e8e8f","url":"https://www.last.fm/music/Plasmatics","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bcdf390c16cd471cb74dcd4d3d98b502.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bcdf390c16cd471cb74dcd4d3d98b502.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bcdf390c16cd471cb74dcd4d3d98b502.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bcdf390c16cd471cb74dcd4d3d98b502.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bcdf390c16cd471cb74dcd4d3d98b502.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bcdf390c16cd471cb74dcd4d3d98b502.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"33383","playcount":"497245"},"similar":{"artist":[{"name":"Wendy O. Williams","url":"https://www.last.fm/music/Wendy+O.+Williams","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/248948e9f11b4f9089412a452cc24617.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/248948e9f11b4f9089412a452cc24617.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/248948e9f11b4f9089412a452cc24617.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/248948e9f11b4f9089412a452cc24617.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/248948e9f11b4f9089412a452cc24617.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/248948e9f11b4f9089412a452cc24617.png","size":""}]},{"name":"GG Allin","url":"https://www.last.fm/music/GG+Allin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3ad41549cd7f4a8d8da2444f17bd4b55.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3ad41549cd7f4a8d8da2444f17bd4b55.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3ad41549cd7f4a8d8da2444f17bd4b55.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3ad41549cd7f4a8d8da2444f17bd4b55.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3ad41549cd7f4a8d8da2444f17bd4b55.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3ad41549cd7f4a8d8da2444f17bd4b55.png","size":""}]},{"name":"English Dogs","url":"https://www.last.fm/music/English+Dogs","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/71dce631c9454f7c84c1085f92c7acb1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/71dce631c9454f7c84c1085f92c7acb1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/71dce631c9454f7c84c1085f92c7acb1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/71dce631c9454f7c84c1085f92c7acb1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/71dce631c9454f7c84c1085f92c7acb1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/71dce631c9454f7c84c1085f92c7acb1.png","size":""}]},{"name":"Girlschool","url":"https://www.last.fm/music/Girlschool","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0a97ea3f9a5247cfa17115a10790ce90.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0a97ea3f9a5247cfa17115a10790ce90.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0a97ea3f9a5247cfa17115a10790ce90.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0a97ea3f9a5247cfa17115a10790ce90.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0a97ea3f9a5247cfa17115a10790ce90.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0a97ea3f9a5247cfa17115a10790ce90.png","size":""}]},{"name":"GBH","url":"https://www.last.fm/music/GBH","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6c11f1be0d42415898d8c3afef1f6657.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6c11f1be0d42415898d8c3afef1f6657.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6c11f1be0d42415898d8c3afef1f6657.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c11f1be0d42415898d8c3afef1f6657.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c11f1be0d42415898d8c3afef1f6657.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c11f1be0d42415898d8c3afef1f6657.png","size":""}]}]},"tags":{"tag":[{"name":"punk","url":"https://www.last.fm/tag/punk"},{"name":"punk rock","url":"https://www.last.fm/tag/punk+rock"},{"name":"Punk Metal","url":"https://www.last.fm/tag/Punk+Metal"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"hard rock","url":"https://www.last.fm/tag/hard+rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Plasmatics/+wiki"}},"published":"16 Aug 2006, 04:36","summary":"The Plasmatics were an American punk metal band, formed 1977 by Yale University graduate and radical anti-artist Rod Swenson with Wendy O. Williams. The band was a controversial group known for wild live shows that broke countless taboos as part of an assault on American popular culture.\n\nIn addition to chainsawing guitars on stage, blowing up speaker cabinets and sledgehammering television sets, Williams and the Plasmatics blew up automobiles live on stage. <a href=\"https://www.last.fm/music/Plasmatics\">Read more on Last.fm</a>","content":"The Plasmatics were an American punk metal band, formed 1977 by Yale University graduate and radical anti-artist Rod Swenson with Wendy O. Williams. The band was a controversial group known for wild live shows that broke countless taboos as part of an assault on American popular culture.\n\nIn addition to chainsawing guitars on stage, blowing up speaker cabinets and sledgehammering television sets, Williams and the Plasmatics blew up automobiles live on stage. Williams was arrested multiple times and was seriously beaten in Milwaukee by the Milwaukee police before being charged with public indecency. The group was banned in London where they were labeled as anarchists, and riots followed in Zürich and elsewhere.\n\nWilliam's and the Plasmatics' career (1977-1988) spanned seven albums, several of which were released as Wendy O. Williams solo albums. She received a Grammy nomination for one of them as Best Female Rock Vocalist. The band changed almost half its members with each album, and had over 17 different members playing with it over the 10 years that Wendy performed. The influence of the group's innovative mix of punk rock and heavy metal pioneered the music genre known as crossover punk. The band's influence can best be felt in many female rock vocalists and bands that have came out in the last 20 years, most notably Courtney Love and many of the Riot Grrrl bands such as Bratmobile and Bikini Kill.\n\nThe Plasmatics' career spanned five studio albums. The core of the band consisted of vocalist/front person Wendy O. Williams, guitarists Richie Stotts and Wes Beech, and manager Rod Swenson. Bassists and drummers rotated frequently over the years.\n\n\n\n\n History\n\n\n\n Formation (1977-1979)\n\nIn 1977, Rod Swenson, who received his MFA from Yale where he specialized in conceptual, performance, and neo-dadaist art, held the view that the measure of true or high art is how confrontational it is. He began a series of counter-culture projects which, by the mid-70s, found him in the heart of Times Square producing experimental counter-culture theater as well as video and shows with the likes of the then-little-known bands The Dead Boys, The Ramones, Patti Smith, and others. It was there that he met Wendy O. Williams (her actual birth-given name, the O. standing for Orlean and her initials spelling \"WOW\") after Wendy happened upon a copy of Show Business Weekly someone had discarded on the bus station floor. The issue lay open to a page with an ad in the casting calls section for Rod's theater. She answered the ad and applied for a job.\n\nThe earliest known photo of the Plasmatics taken in the 1970s.\n\nWendy and Rod began auditioning potential band members in 1977 and, in July 1978, the \"Plasmatics\" gave their first public performance at what would later become the rock shrine CBGB on New York City's Bowery. The earliest version of the band was a three piece put together with a strong emphasis on visuals. The band quickly realized they needed another guitarist to hold them together musically. Guitarist Wes Beech joined the group; he would become, after Wendy, the only permanent member of the group playing or touring behind or involved in the production of every Plasmatics and Wendy O. Williams record ever recorded.\n\n\nFrom their initial gig at CBGB's, The Plasmatics quickly rose in the New York City Punk Underground scene of the time. From playing a single weekday night, they moved quickly to playing repeated stands of four nights straight with two sold-out shows each night. They had lines stretching around the block and brought more fans into CBGB's during this time than any other band in its history. The group quickly outgrew CBGB's, largely because there were no intermediate rock venues to play in New York City at that time.\n\n\nRod Swenson soon made a deal to book what was then a little known polka hall called Irving Plaza from the Polish War Veterans who ran it at the time. The band repeatedly sold out the venue, with The Plasmatics helping to give Irving Plaza national recognition and launch it on the path to becoming an established rock venue in New York City. Having then caught the full attention of the most important people in the entertainment world of New York City, the Plasmatics headlined the Palladium Theater on , 1979, the first group in history to do so at full ticket prices and without a major label recording contract. The date was historic for being the first time Wendy O. Williams would blow up a car live on-stage.\n\n\n\n New Hope for the Wretched Era (1980-1981)\n\nThe Plasmatics were soon selling out shows in Philadelphia, Boston, venues in New Jersey, and elsewhere in the Northeast. Chris Knowles of Classic Rock magazine wrote: The Plasmatics \"were the biggest live attraction in New York...and the media was on them like white on rice...they scared the record companies shitless. It's one thing to play at subversiveness, but The Plasmatics, unlike other Punk bands... put their Punk philosophy into action.\" Many U.S. record labels were afraid to sign the band, largely due to Wendy's onstage behavior, including blowing up cars, chainsawing guitars, blowing up speakers, and destroying televisions sets with a sledgehammer. As well as frequently wearing nothing but g strings and electric tape over her nipples. The band was soon signed to Stiff Records, a British independent label. Artists and Repertoire (A&R) from Stiff Records flew to New York City to see a show in person to determine if what they had been reading and hearing could possibly be real. The day after seeing the performance, Stiff put in an offer and a deal was inked within a month. A few months later, The Plasmatics began to record songs in New York City for what would become the album New Hope for the Wretched.\n\nThe album cover of New Hope for the Wretched.\n\nStiff had originally put former Rolling Stones producer Jimmy Miller as producer on the project. Unfortunately, Miller's heroin addiction took almost complete control from the day he arrived in New York, which threatened the record from being completed. The record company fired Miller, and the album was finished by Engineer Ed Stasium and Rod Swenson over in England. In addition to songs like \"Corruption\" and \"Living Dead\", which were linked to TV smashing and automobile destruction, the song Butcher Baby featured a chainsaw sawing through a guitar in place of a guitar solo which also took place during their live shows. Stiff released Butcher Baby as a single where it made it into the Top 40 on the UK charts.\n\n\nThe Plasmatics UK debut was booked in the famed Hammersmith Odeon, where Wendy intended to do her famous routine of blowing up a car. The band's stay went well until the day of the show when the Greater London Council, or \"GLC\", announced they wanted to see a further demonstration of the way the car would be detonated. After seeing the demonstration, the GLC banned the show.\n\n\nStiff America had scheduled a release and a US tour. To capitalize on the band's popularity, the US edition of the album came packaged with a poster of the banned Hammersmith Odeon show and an insert for the Plasmatics Secret Service, the official fan club.\n\n\nThe band was set to tour the West Coast for the first time after the UK Hammersmith banning and get their momentum back. To kick off the tour, Wendy planned to drive a Cadillac towards a stage loaded with explosives, jumping out moments before the car would hit the stage, blowing up all the equipment. The permits needed for this were hard to get and only allowed for an estimated 5-6,000 people. The day of the performance, over 25,000 showed up, jamming the downtown streets and lining the rooftops. Even though it cost virtually the entire advance for the US release of New Hope for the Wretched to do it, Wendy was quoted by a reporter from the Associated Press as saying, \"It was worth it because it showed that these are just things and... people shouldn't worship them,\" a point she'd repeat more than once.\n\n\nThe Plasmatics debut in Los Angeles was at the famed Whiskey A Go Go. The show was originally planned for only 2 nights, but was later expanded to 4 due to large sold-out crowds. On , 1980, prior to returning to do the Santa Monica Civic Center, Wendy shaved her hair into a Mohawk, something she had wanted to do since before forming the band, but diligently held off on until the public became aware of her and the band, believing it would be a stronger statement. Being the first woman in the public eye and the first member of a band to do so, the response was shock. \"I want to say 'Fuck You!' to all the cosmetics companies,\" Wendy said in a much publicized interview.\n\n\nThe ABC show Fridays, which was looking to be a more cutting-edge version of Saturday Night Live, booked Wendy and the Plasmatics to appear in late December to go live on national TV. Constant struggles with censors went on until within minutes of airtime. \"Conservatives (across) America,\" Chris Knowles would write in Classic Rock, \"all of a sudden had castration anxiety when they saw Wendy wielding a chain saw.\"\n\n\n\n The Milwaukee beating and arrest\n\nOn , 1981, Wendy was arrested and brutally beaten by Vice unit police officers after a performance at The Palms Nightclub in Milwaukee on an obscenity charge for allegedly simulating a sex act with a sledgehammer. Once outside the club, Wendy was thrown to the ground and beaten into semi-consciousness. Rod was also dragged off behind a car and beaten to unconsciousness when he attempted to come to her aid. Both were taken to the hospital in ambulances and later thrown in jail.\n\n\nBail was raised, but large legal bills and the threat of going to jail became a problem for the future of the band. A show in Cleveland the next night was canceled as both Wendy and Rod were still in jail. It was re-scheduled, however, for the following night where, again, following the massive national press of the Milwaukee incident, Wendy was arrested again, although not assaulted as she had been in Milwaukee. The legal fees continued to grow.\n\nMugshot taken by the Milwaukee police the night she was arrested in 1981.\n\nPolice officers stated that no beating had taken place, a statement the band felt would endanger the band's chance at a fair trial. A local photographer had been able to photograph the beating, which refuted the claims of the police.\n\n\nStill recovering from a broken nose, ruptured sinuses, and other injuries, within 12 days Wendy and the band were playing in front of a sold-out crowd in Milan, Italy at the beginning of a 3-week European tour which saw her blowing up a Mercedes on the German Musikladen TV show and riots in Zurich.\n\n\nBy the time the band reached Berlin, Rod, along with agent Jim Kramer and Bruce Kirkland who was running Stiff America in the states, organized the first of what would be three historic shows at Bond's International Casino in Times Square NY as part of the effort to raise additional funds to offset the legal fees that were now accruing. The show was launched with little time for promotion, but word of mouth spread and fans lined up beginning in the early morning with some 2,000 people beyond the legal capacity packed for the first \"Wendy Will Win\" show in NYC. Wendy burst through a giant banner saying \"Stop the Gestapo!\", referring to the Milwaukee police and the new song \"Pig is a Pig\" (lyrics penned by Rod), also dedicated to \"them and fascists everywhere!\"\n\n\nThe Plasmatics were booked into Bond's for two more shows on May 15 and 16, where she blew up two facsimile Milwaukee police cars and then back on the Tom Snyder show were she blew up a car again during the song \"Masterplan\". The trial began , 1981 in the Circuit Court, Milwaukee County, State of Wisconsin with Rod as the sole defendant.\n\n\nThe District Attorney decided to put Wendy and Rod on trial separately and tried Rod first hoping the media would lose interest. It failed. The trial was still construed as the Wendy O. Williams/Plasmatics trial and the media was there full force. Fans came in from more than 2,000 miles away and it was standing room only in the court room. The trial lasted over one and a half weeks. Wendy presented a strong testimony, with the main turning point being when the jury saw a full color blow-up of her being beaten on the ground. Courageous citizens who had witnessed the events came forward and after days of testimony, the jury deliberated only 3.5 hours: Not Guilty. The charges against Wendy were soon dropped afterwards.\n\n\n\n Beyond the Valley of 1984 Era (1981-1983)\n\nA second album was long overdue but due to the ongoing legal battles and the Miller debacle with the first album, which was costly both in terms of time and money, it was agreed that this one had to be lean and mean. Bruce Kirkland at Stiff agreed to put up the funds as long as Rod produced and the album was done in less than 3 weeks at a quarter of the cost of the first.\n\nThe band performing with the Beyond the Valley line-up in 1981.\n\nGiven the recent turn of events, Rod proposed the name Beyond the Valley of 1984 and the tour, in 1981, became \"The 1984 World Tour\". In between touring drummers, Alice Cooper's Neal Smith was brought in to do the drumming for the record, and the album, with its Orwellian and apocalyptic theme and songs such as \"Masterplan\", \"Pig is a Pig\", and \"Sex Junkie\", was released a few months later. During recording for the album, The Plasmatics were booked on the Tom Snyder late night TV show, where Tom Snyder introduced them as possibly 'the greatest punk rock band in the entire world.\"\n\n\nIn Cleveland, Wendy faced trial for obscenity. Protesters lined up on Wendy's behalf and Wendy grabbed headlines criticizing Cleveland's District Attorney for prosecuting the case and \"flushing the taxpayer's money down the toilet,\" she said, \"because he's \"either afraid of the real criminals or paid off by them\". \"This woman's gone too far\", the Prosecutor told the jury, \"it's time for you to draw the line!\" and after deliberations that went on into the next day they did, bringing back a \"not guilty\" verdict to a cheering courtroom. Touring continued with repeated attempts by local authorities to shut down shows, which in some cases they managed to do.\n\n\nThe album cover for 'Beyond the Valley\" was photographed in the Arizona desert where Wendy appears on horseback with the band (without a drummer) as the \"Four Horsemen of the Apocalypse\".\n\n\nThe 1984 World Tour continued with the bold slogan \"Down On Your Knees and Pledge Allegiance!\".\n\n\n\n Metal Priestess EP\n\nDuring the last part of the tour Rod had been contacted by American singer, songwriter and record producer Dan Hartman's office asking that Dan have a meeting with Wendy and Rod. Hartman, who produced acts .38 Special, James Brown, and others, had been working on a session in LA when he picked up a copy of \"Beyond the Valley of 1984\" and couldn't stop playing it. He felt it was \"ground breaking\". He said, \"I knew I wanted to meet these people and do something with them.\" Dan came down to the Tribeca loft, met Wendy and Rod, and a month later he and Rod were working on the production of the Metal Priestess EP. The band needed more product but another album was premature, partly because Capitol Records was now making overtures for the next one. Bruce at Stiff was ready to release the EP and that summer Metal Priestess was recorded at Dan's private studio off his schoolhouse turned home and studio in Connecticut and released early that fall.\n\n\n\n Coup d'Etat and the Electric Lady Land Sessions (1982-1983)\n\nBy the spring of 1982, a worldwide deal was inked with Capitol Records, and Dan Hartman offered to produce a demo of the album for Capitol with Rod at Electric Lady Studios, Jimi Hendrix's old studio, in NY. The whole album was arranged, recorded and mixed within a week. Dieter Dierks, who had just come off a number one album with the Scorpions, also expressed interest in producing.\n\nPhoto from the Coup d'Etat era of the band from 1982.\n\nCoup d'Etat was a breakthrough album that began to blend the punk and metal genres, something that would later be done time and time again by bands such as S.O.D., Anthrax, and the Cro-Mags by the end of the 1980s. Wendy also broke ground for her unique singing style. She pushed her vocals so hard she had to make trips into Cologne, Germany, where the album was being recorded, each day for treatments to avoid permanent damage to her vocal cords.\n\n\nThe Hartman demo was released 20 years later under the name \"Coup De Grace\". The rawer version of Coup d'Etat, which took less than a tenth of the time and a fraction of the budget, is hailed by many fans as the true version of the album.\n\n\nThe video Rod produced and directed of \"The Damned\" featured Wendy driving a school bus through a wall of TVs, climbing onto the roof of a moving bus which had been loaded with explosives, and then singing from the roof and jumping off a few moments before the bus goes through a second wall of TVs and then blows sky high. During a run through of the jump off the bus, Wendy sprained her ankle. \"Put tape around it,\" she instructed one of the crew members, and with her ankle firmly taped with gaffer tape, the shoot went on. MTV ran a feature on the video in Rockbill Magazine, gaining plenty of attention. Before the premiere, however, MTV's legal department and the record company insisted that a warning be put at the beginning of the video warning the audience not to try anything like this at home. The warning was added, and the premiere went on, but the video was put instead in extremely light rotation and then pulled within weeks.\n\n\nIn the meantime, as the tour itself started, it became clear that Capitol was beginning to turn away from the group in favor of groups such as Duran Duran, who could generate ten times the sales with none of the political liability and fallout. Soon after the album was released, Capitol Records dropped The Plasmatics.\n\n\n\n Plasmatics \"break-up\", Wendy O. Williams' solo career (1983-1986)\nWendy O. Williams and Gene Simmons in 1982.\n\nIn 1982, Kiss asked for Wendy and the Plasmatics to appear as a special guest on their tour. Kiss wanted the controversial street edge that Wendy would bring as part of their tour and for the Plasmatics it was a chance to play in front of different audiences in different markets than they would ordinarily play. By the end of the tour with Kiss it was clear that, although the formal notice that Capitol would not pick up their option for a second album didn't come in for six months, the relationship with Capitol was done. It had taken months and months for the deal to be done, months to record and release the album and now months to get out of the deal. Bills still loomed from legal battles, with no way to pay them. Gene Simmons approached Wendy and Rod about producing the next Wendy O. Williams album. So as to avoid any wasted time in legal issues with Capitol Records, it was decided not to use the Plasmatics name on the record at all and was simply called W.O.W., the initials for Wendy O. Williams. Gene Simmons felt it would give him the freedom he wanted to add more new players to the album.\n\n\nWes Beech remained to play rhythm and lead and T.C.Tolliver, the drummer on Coup d'Etat, remained to play on the new album. Gene Simmons played bass under the pseudonym of \"Reginald Van Helsing\". The only other new player on the album was lead guitarist Michael Ray, brought in to solve the technical challenges that had been a problem for several albums and had come to a head with the more complex music of Coup D'Etat. Gene also pulled in the talents of Ace Frehley, who hadn't played with Kiss since leaving the band years before, Paul Stanley, and then-current Kiss drummer Eric Carr did one song as guests. The record was released on Passport (international and U.S. distribution by JEM).\n\n\nReview copies were sent out to the various media outlets. Malcolm Dome, a reviewer for KERRANG! magazine, had picked the WOW' album as his album of the year. Wendy would later receive a Grammy nomination as 'Best Female Rock Vocalist of the Year.\n\n\nWith Mohawks now starting to become common, Wendy decided to let her hair grow in, and the cover Rod shot for what would be called the \"album of the year\" in the pages of KERRANG! was the very opposite of the earlier covers; total simplicity.\n\n\nWes Beech took a sabbatical for personal reasons and would not tour with the band on the next tour. The band decided to return to being a 3-Piece. Wes came in as Associate Producer with Rod on the album and worked on writing, arranging and recording, but the recording would be Michael, TC, and Greg (who would go on to play with Alice Cooper, Richie Blackmore and others and who had been brought in as the touring bassist for the WOW album). There was tremendous excitement in tackling the project a kind of minimalist, stripped down concept, or rite of purification. The songs, including the lyrics would be also be minimalistic or archetypal again giving Wendy a chance to take her vocals step further. The tempo of the WOW album had been slower than previous albums in an effort to open it up, but the new album Kommander of Kaos (a.k.a. KOK) was to bring back the speed and then some. Songs would be played at breakneck speeds, with screaming leads and vocals. The recording was done in Fairfield NJ at the giant Broccoli Rabe Recording complex which would be home to numerous Wendy O./Plasmatics Projects including three studio albums with what the group fondly called \"The Fairfield Sound\".\n\n\n\n Maggots: The Record Era (1987)\n\nWes had rejoined the band to both tour and play on the next album where the re-formed 4 piece band became a centerpiece for perhaps the most complex arrangements in the band's career. After the archetypal minimalism, both lyrically and musically of Komander, the new album, which would again carry the Plasmatics name, was again filled with complexity and returned to the social and political themes previously found most strongly in Coup but in 1984 before it: environmental decay and a world where excess and abuse led directly to a doomsday scenario.\n\n\nMaggots: The Record was recorded in 1987 and set 25 years in the future where environmental abuse and the burning of fossil fuels have created a greenhouse effect leading to an end of the world scenario. Called by many the first \"thrash metal opera\", the central theme of the album is an end of the world scenario that follows from genetic engineering and global warming, something that was not at all part of the general public awareness of the time. A group of scientists trying to eliminate pollution in the rivers and oceans develop an RNA retro virus designed to eat it all up and then die once the pollution has been consumed. But global warming leading to the flooding of land areas instead puts the virus in contact with the \"common maggot\" leading to a mutated form of maggot that doubles in size with each generation looking for more and more things to consume. In the 'end of the world' finale cities are being destroyed and humans consumed by giant maggots a horrific metaphorical end to a world blind to human consumption and environmental destruction.\n\n\nThe album features various scenes of The White Family over the course of three days. The family is devoured while watching a TV game show. Valerie, the girlfriend of hot-shot television reporter Bruce is devoured by three massive maggots while lying in her boyfriend's bed. The final scene has Cindy White trying to fight off the attacking maggots and running out onto a fire escape where she sees the crowded streets below as the record shows the entire human population is headed for imminent annihilation. The album was on the WOW label; distributed by Profile Records in the U.S. and overseas by GWR Records, which had been started by Mot?rhead's longtime Manager Doug Smith.\n\n\nWendy did a performance piece to inaugurate the album at NYC's Palladium, which had been transformed from a proscenium theater into huge multi-level club where she sledgehammered and chainsawed to smithereens a facsimile all-American living room. \"Maggots: The Tour\" began a week later using the Plasmatics name for the first time in two albums with slogans such as \"Those Now Eating Will Soon Be Eaten,\" \"The Day of the Humans is Gone,\" and lyrics such as \"soldiers for the DNA dissidents are put away, dragged off in the dead of night, disappear without a sight\". Rear screen projectors ran film of human disasters, fascists and other historical horrors, environmental carnage and human rights violations on huge screens behind the band during all the songs from the Maggots album.\n\n\nA review in KERRANG! came out shortly there after: A 5 out of 5 Ks, \"Quite simply a masterpiece... a work of genius.\" Wendy's vocals \"reduces Celtic Frost's Tom G. Warrior's 'death grunts' to mere whimpers\" it went on coupled with \"a mixture of hedonistic operatic melodies..gut forged to some of the heaviest armadillo beats you're ever like to hear committed to vinyl.\"\n\n\n\n \"Hiatus\" (1988)\n\nWendy and Rod had agreed from the beginning that when a point came where diminishing returns meant having to compromise the integrity of their effort, they would stop. To continue would have meant compromise in one or many ways or another. In 1988, it was officially announced that Wendy and the Plasmatics were \"going on hiatus.\" Rod later told Classic Rock magazine that they both knew they had stopped.\n\n\nWendy's last performance of a Plasmatics song occurred due to the prompting of Joey Ramone. She performed \"Masterplan\" one final time with Richie Stotts, when Richie's band opened for the Ramones on New Year's Eve, 1988.\n\n\nOn April 6, 1998, Wendy O. Williams committed suicide, ending all hopes for a reunion. A memorial was held at CBGB on May 18. Chosei Funahara, Richie Stotts, Wes Beech, Stu Deutsch, Jean Beauvoir and possibly TC Tolliver played a six-song set with four of them handling the vocals.\n\n\nIn 1998, shortly after Wendy's death, the Plasmatics launched an official website. In 2000, Plasmatics Media, Ltd, began re-mastering and re-releasing the entire Plasmatics and Wendy O. Williams catalog, t-shirts, and assorted other merchandise. Under this new label, Coup De Grace, the demo version of Coup d'Etat, was released. In 2002, two greatest hits, Put Your Love in Me: Love Songs for the Apocalypse and Final Days: Anthems for the Apocalypse were released.\n\n\n\n\n Mot?rhead collaboration and the Stand by Your Man (EP)\n\n\nIn 1982, Lemmy of Mot?rhead was approached by his label to do a follow-up to his successful Mot?rhead/Girlschool collaboration, St. Valentine's Day Massacre EP and Motorhead's manager Doug Smith got in touch with Rod Swenson in the states and proposed a Wendy and Lemmy duet of the country classic \"Stand By Your Man\". The B side would have two tracks, the Plasmatics \"Masterplan\" covered by Motorhead and Motorhead's \"No Class\" covered by Plasmatics. The A side would have Wendy and Lemmy do a duet of \"Stand By Your Man\", the title track of the EP.\n\n\nTracked at a Canadian recording studio, the Stand by Your Man (EP) sessions proved to be tumultuous as guitarist Eddie Clarke (who was producing the tracks, but not playing on them) quit Motorhead in the middle of the project.. Rod Swenson and Dan Hartman, who had finished demoing the Plasmatics Coup d'Etat album together, were called upon to finish the rough and raw project in the mix which they did at Electric Lady Studios in New York. Rod then shot the cover with Lemmy and Wendy on it and the raw crude project was put out by Bronze records.\n\n\nA reviewer concluded \"their sandpaper-throated duet on Tammy Wynette's country standard \"Stand By Your Man\" has to be one of hard rock's greatest-ever middle fingers to the mainstream.\" The review goes on to say, \"The Plasmatics, therefore, wreaked havoc on 'No Class' while Mot?rhead hammered out a leering take of 'Masterplan.'\n\n\n\n\n Plasmatics performances\n\n\nIn addition to chainsawing guitars on stage, blowing up speaker cabinets and sledgehammering television sets, Williams and the Plasmatics blew up automobiles live on stage. To kick off one tour, Wendy drove a Cadillac towards a stage loaded with explosives, jumping out moments before the car would hit the stage, and all the equipment on it would blow up. Wendy would normally appear topless during shows. To avoid arrest, she began covering her nipples with electrical tape.\n\n\n\n\n Band members\n\n\n\n Final members\nWendy O. Williams - Vocals, sax, chainsaw, sledgehammer (1978-1988)\nWes Beech - Rhythm guitar, lead guitar, keyboards (1979-1988)\nChris Romanelli - Bass, keyboards (1981-1984; 1987-1988)\nRay Callahan - Drums (1986-1987)\n\n\n Former members\n\nFormer guitarists\n\nRichie Stotts - Lead guitar (1978-1983)\nMichael Ray - Lead guitar, rhythm guitar (1984-1987)\n\nFormer bassists\n\nMichael David - Bass (1978)\nChosei Funahara - Bass (1978-1980)\nJean Beauvoir - Bass, keyboards (1980-1981)\nGreg Smith - Bass (1984-1986)\n\nFormer drummers\n\nStuart Deutsch - Drums (1978-1980)\nNeal Smith - Drums (1981)\nTony Petri - Drums (1981)\nJoey Reese - Drums (1981)\nT.C. Tolliver - Drums (1982-1986)\nMichael Lugassy - Drums\n\nFormer personnel\n\nGeorge Pierson - Tour/Sound Manager\nJim Kramer - Booking Agent\nPyro Pete - Live Pyrotechnics\n\n\n\n Discography\n\nFor more details on this topic, see Plasmatics discography.\n\n\n Studio Albums\nAlbum Title\nYear\nLabel\nNew Hope for the Wretched\n(1980)\nStiff Records\nBeyond the Valley of 1984\n(1981)\nStiff Records\nCoup d'Etat\n(1982)\nCapitol Records\nMaggots: The Record\n(1986)\nProfile Records\nCoup De Grace\n(2000)\nGigasaurus Records\n\n\n Compilations\n\n\n EPs\nMeet the Plasmatics (12\" EP, 1979)\nButcher Baby EP (12\" EP, 1980)\nMetal Priestess (12\" EP, 1981)\n\n\n Singles\nButcher Baby b/w Fast Food Service (Live), Concrete Shoes (Live) (7\" single, 1978)\nDream Lover b/w Corruption (song), Want You Baby (7\" single, 1979)\nButcher Baby b/w Tight Black Pants (Live) (7\" single, 1980)\nMonkey Suit b/w Squirm (Live) (7\" single, 1980)\n\n\nThis page is based on the copyrighted Wikipedia article Plasmatics; it is used under the Creative Commons Attribution-ShareAlike 3.0 Unported License. You may redistribute it, verbatim or modified, providing that you comply with the terms of the CC-BY-SA. \n\nOriginal Wikipedia article: http://en.wikipedia.org/wiki/Plasmatics <a href=\"https://www.last.fm/music/Plasmatics\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
