{"artist":{"name":"R.L. Burnside","mbid":"355eed00-6c40-4d33-940a-600b2597407a","url":"https://www.last.fm/music/R.L.+Burnside","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/56ff5123e942488da6582adbdb41f1b8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/56ff5123e942488da6582adbdb41f1b8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/56ff5123e942488da6582adbdb41f1b8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56ff5123e942488da6582adbdb41f1b8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56ff5123e942488da6582adbdb41f1b8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56ff5123e942488da6582adbdb41f1b8.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"186586","playcount":"2064415"},"similar":{"artist":[{"name":"Junior Kimbrough","url":"https://www.last.fm/music/Junior+Kimbrough","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/20c69a8677174245b93dbb1e82ed884c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/20c69a8677174245b93dbb1e82ed884c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/20c69a8677174245b93dbb1e82ed884c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/20c69a8677174245b93dbb1e82ed884c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/20c69a8677174245b93dbb1e82ed884c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/20c69a8677174245b93dbb1e82ed884c.png","size":""}]},{"name":"T-Model Ford","url":"https://www.last.fm/music/T-Model+Ford","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5686b146df9a46ad83f188fe9916959f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5686b146df9a46ad83f188fe9916959f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5686b146df9a46ad83f188fe9916959f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5686b146df9a46ad83f188fe9916959f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5686b146df9a46ad83f188fe9916959f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5686b146df9a46ad83f188fe9916959f.png","size":""}]},{"name":"Mississippi Fred McDowell","url":"https://www.last.fm/music/Mississippi+Fred+McDowell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5507042d8dc44176a59b06858ae9ad3d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5507042d8dc44176a59b06858ae9ad3d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5507042d8dc44176a59b06858ae9ad3d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5507042d8dc44176a59b06858ae9ad3d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5507042d8dc44176a59b06858ae9ad3d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5507042d8dc44176a59b06858ae9ad3d.png","size":""}]},{"name":"Son House","url":"https://www.last.fm/music/Son+House","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/015d0c809c6e47759ebd30b2ae32ab3a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/015d0c809c6e47759ebd30b2ae32ab3a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/015d0c809c6e47759ebd30b2ae32ab3a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/015d0c809c6e47759ebd30b2ae32ab3a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/015d0c809c6e47759ebd30b2ae32ab3a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/015d0c809c6e47759ebd30b2ae32ab3a.png","size":""}]},{"name":"Lightnin' Hopkins","url":"https://www.last.fm/music/Lightnin%27+Hopkins","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/76c0d91777ab452bbeaa2fec28a68c02.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/76c0d91777ab452bbeaa2fec28a68c02.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/76c0d91777ab452bbeaa2fec28a68c02.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76c0d91777ab452bbeaa2fec28a68c02.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76c0d91777ab452bbeaa2fec28a68c02.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76c0d91777ab452bbeaa2fec28a68c02.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"delta blues","url":"https://www.last.fm/tag/delta+blues"},{"name":"Electric Delta Blues","url":"https://www.last.fm/tag/Electric+Delta+Blues"},{"name":"mississippi","url":"https://www.last.fm/tag/mississippi"},{"name":"modern electric blues","url":"https://www.last.fm/tag/modern+electric+blues"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/R.L.+Burnside/+wiki"}},"published":"07 Jul 2006, 11:21","summary":"R. L. Burnside (November 23, 1926 – September 1, 2005), born Robert Lee Burnside, was an American blues singer, songwriter, and guitarist who lived much of his life in and around Holly Springs, Mississippi. He played music for much of his life, but did not receive much attention until the early 1990s. In the latter half of the 1990s, Burnside repeatedly recorded with Jon Spencer, garnering crossover appeal and introducing his music to a new fanbase within the underground garage rock scene. <a href=\"https://www.last.fm/music/R.L.+Burnside\">Read more on Last.fm</a>","content":"R. L. Burnside (November 23, 1926 – September 1, 2005), born Robert Lee Burnside, was an American blues singer, songwriter, and guitarist who lived much of his life in and around Holly Springs, Mississippi. He played music for much of his life, but did not receive much attention until the early 1990s. In the latter half of the 1990s, Burnside repeatedly recorded with Jon Spencer, garnering crossover appeal and introducing his music to a new fanbase within the underground garage rock scene.\n\nOne commentator noted that Burnside, along with Big Jack Johnson, Paul \"Wine\" Jones, Roosevelt \"Booba\" Barnes and James \"Super Chikan\" Johnson, were \"present-day exponents of an edgier, electrified version of the raw, uncut Delta blues sound.\"\n\nEarly life and career\nBurnside was born in Harmontown, Mississippi, in Lafayette County. He spent most of his life in North Mississippi, working as a sharecropper and a commercial fisherman, as well as playing guitar at weekend house parties. He was first inspired to pick up the guitar in his early twenties, after hearing the 1948 John Lee Hooker single, \"Boogie Chillen\" (which inspired numerous other rural bluesmen, among them Buddy Guy, to start playing). He learned music largely from Mississippi Fred McDowell, who lived nearby in an adjoining county. He also cited his cousin-in-law, Muddy Waters, as an influence.\n\nDuring the 1950s, Burnside grew tired of sharecropping and moved to Chicago in the hope of finding better economic opportunities. But things did not turn out as he had hoped. Within the span of one year his father, brother, and uncle were all murdered in the city, a tragedy that Burnside would later draw upon in his work, particularly in his interpretation of Skip James's \"Hard Time Killing Floor\" and the talking blues \"R.L.'s Story\", the opening and closing tracks on Burnside's 2000 album, Wish I Was In Heaven Sitting Down.\n\nAround 1959, he left Chicago and went back to Mississippi to work the farms and raise a family. Burnside was convicted for murder and sentenced to six months' incarceration (in Parchman Prison) for the crime. Burnside's boss at the time reputedly pulled strings to keep the murder sentence short, due to having need of Burnside's skills as a tractor driver. Burnside later said \"I didn't mean to kill nobody ... I just meant to shoot the sonofabitch in the head. Him dying was between him and the Lord.\"\n\nHis earliest recordings were made in the late 1960s by George Mitchell and released on Arhoolie Records. Another album of acoustic material was recorded that year and little else was released before Hill Country Blues, in the early 1980s. An album's worth of singles followed, released on ethnomusicology professor Dr. David Evans' Highwater Records record label in Memphis, Tennessee.\n \nLater life and career\nIn the 1990s, he began recording for the Oxford, Mississippi, label Fat Possum Records. Founded by Living Blues magazine editor Peter Redvers-Lee and Matthew Johnson, the label was dedicated to recording ageing North Mississippi bluesmen such as Burnside and Junior Kimbrough. Burnside remained with Fat Possum from that time until his death, and he usually performed with his friend and understudy, the slide guitarist Kenny Brown, with whom he began playing in 1971 and claimed as his \"adopted son.\"\n\nBurnside attracted the attention of Jon Spencer, the leader of the Jon Spencer Blues Explosion, touring and recording with this group and gaining a new audience in the process.\n\nAfter the death of Kimbrough and the burning of Kimbrough's juke joint in Chulahoma, Mississippi, Burnside quit recording studio material for Fat Possum, though he did continue to tour. After a heart attack in 2001, Burnside's doctor advised him to stop drinking; Burnside did, but he reported that change left him unable to play.\n\nMembers of his large extended family continue to play blues in the Holly Springs area: grandson Cedric Burnside tours with Kenny Brown and most recently with Steve 'Lightnin' Malcolm as part of the 'Juke Joint Duo', while his son Duwayne Burnside has played guitar with the North Mississippi Allstars (Polaris; Hill Country Revue with R. L. Burnside). Duwayne's solo career began when \"Duwayne Burnside and the Mississippi Mafia\" recorded \"Live At the Mint\" in October 1997. Members included Cedric Burnside, Eddie Batos, Joe Hill from Alien Ant Farm, and David Kimbrough, Jr. (Junior Kimbrough's son) with Duwayne's father sitting in on a few tracks. Duwayne and the Mississippi Mafia released \"Under Pressure\" in March 2005, which was recorded at Delta Studios in Clarksdale, Mississippi featuring Jimbo Mathus, rhythm guitar (Squirrel Nut Zippers), Roy Cunningham on drums (Stax Sessions), and Burnside's son Garry Burnside on bass guitar. In 2004, the Burnside sons opened Burnside Blues Cafe, located 30 miles southeast of Memphis at the intersection of U.S. Highway 78 and Mississippi Highway 7 in Holly Springs, Mississippi.\n\nIn January 2006, Garry and Cedric released The Record under the moniker \"Burnside Exploration\".\n\nDeath\nBurnside had been in declining health since heart surgery in 1999. He died at St. Francis Hospital in Memphis, Tennessee on September 1, 2005 at the age of 78.[4] Services were held at Rust College in Holly Springs [which is also where services were held for his friend, Junior Kimbrough, who died in 1998], with burial in the Free Springs Cemetery in Harmontown. Around the time of his passing, he resided in Byhalia, Mississippi and his immediate survivors included:\n\nHis wife: Alice Mae Taylor Burnside (married 1951); died November 16, 2008 \nDaughters: Mildred Jean Burnside, Linda Jackson, Brenda Kay Brooks, and Pamela Denise Burnside; \nSons: Melvin Burnside, R.L. Burnside Jr., Calvin Burnside, Joseph Burnside, Daniel Burnside, Duwayne Burnside, Dexter Burnside, Garry Burnside, and Rodger Harmon \nSisters: Lucille Burnside, Verelan Burnside, and Mat Burnside \nBrother: Jesse Monia \n35 Grandchildren \n32 Great-Grandchildren\n\nStyle\n \n Burnside had a powerful, expressive voice and played both electric and acoustic guitars (both with a slide and without). His drone-based style was a characteristic of North Mississippi hill country blues rather than Mississippi Delta blues. Like other country blues musicians, he did not always adhere to 12- or 16-bar blues patterns, often adding extra beats according to his preference. He called this \"Burnside style\" and often commented that his backing musicians needed to be familiar with his style in order to be able to play along with him.\n\nHis earliest recordings, like those of John Lee Hooker, sound very similar in their vocal and instrumental style. Many of his songs do not have chord changes, but use the same chord or repeating bass line throughout, giving his music a hypnotic feel. His vocal style is characterized by a tendency to \"break\" into falsetto briefly (usually at the ends of long notes).\n\nLike the bluesman T-Model Ford, Burnside utilized the stripped-down element of his music, playing up the rawness, emphasizing his image as a lifelong hard-drinking man, and singing songs of swagger and rebellion. Burnside collaborated in the late 1990s with The Jon Spencer Blues Explosion on the album A Ass Pocket of Whiskey. Consequently, he gained the attention of many within this underground music scene, cited as an influence by Hillstomp[9] and covered on record by The Immortal Lee County Killers. Burnside's \"Skinny Woman\" was also interpolated into the song \"Busted\" by fellow Fat Possum musicians The Black Keys, a band associated with the punk blues scene in their early years.\n\nHe also knew many toasts (African American narrative folk poems such as \"Signifying monkey\" and \"Tojo Told Hitler\") and frequently recited them between songs at his live concerts and on his recordings.\n\nSelected albums\nFirst Recordings (recorded in the late 1960s by George Mitchell; re-released by Fat Possum Records in 2003) \nToo Bad Jim (produced in 1992 by Robert Palmer) \nWell, Well, Well (songs and interviews from 1986-1993, released in 2001 on MC Records) \nA Ass Pocket of Whiskey (1996, featuring the Jon Spencer Blues Explosion) \nMr. Wizard (1997) \nAcoustic Stories (1997) \nMy Black Name A-Ringin' (1999) \nBurnside on Burnside (a critically acclaimed 2001 live album recorded in the Crystal Ballroom on Portland, Oregon's Burnside Street) \nCome On In, Wish I Was in Heaven Sitting Down, and A Bothered Mind (three albums of remixed material, often featuring guest artists, released in 1998, 2000 and 2004, respectively) \n\nFilms\nDeep Blues: A Musical Pilgrimage to the Crossroads (1991). Directed by Robert Mugge \nAmerican Patchwork: Songs and Stories of America, part 3: \"The Land Where the Blues Began\" (1990). Written, directed, and produced by Alan Lomax; developed by the Association for Cultural Equity at Columbia University and Hunter College. North Carolina Public TV; A Dibb Direction production for Channel Four. This is a lightly re-edited version of \"The Land Where the Blues Began\" (1978) made by Alan Lomax, John Bishop, and Worth Long in Association with Mississippi Authority for Educational Television \nYou See Me Laughin': The Last of the Hill Country Bluesmen (2003; released by Fat Possum Records in 2005). Produced and directed by Mandy Stein. Oxford, Mississippi: Plain Jane Productions, Inc; Fat Possum Records. \n\n In popular culture\nThe 2007 Samuel L. Jackson / Christina Ricci film, Black Snake Moan is infused with countless Burnside nods, including: the Reverend R. L. character and when Jackson plays the blues toward the end of the film, he thanks \"Ced\" and \"Kenny\" - Cedric Burnside (Burnside's grandson) and Kenny Brown (Burnside's \"adopted son\"), who were primary sidemen through the 1990s and early 2000s. Cedric and Kenny are also part of Jackson's band in the juke joint scene.\n\n\"It's Bad You Know,\" and \"Shuck Dub\" were featured in the HBO series The Sopranos.\n\n\"Got Messed Up\" was featured in the FX series Rescue Me during an opening montage on Season 5 Episode 18, \"Carrot\".\n\nA Burnside poster can be seen on a wall in brothers Drake and Josh's room in the Nickelodeon sitcom, Drake & Josh. <a href=\"https://www.last.fm/music/R.L.+Burnside\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
