{"artist":{"name":"Rakim","mbid":"2792b097-0b1d-4c50-97f6-f7f097f86438","url":"https://www.last.fm/music/Rakim","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/aac701a4b251433a936c9943cd266125.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/aac701a4b251433a936c9943cd266125.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/aac701a4b251433a936c9943cd266125.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aac701a4b251433a936c9943cd266125.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aac701a4b251433a936c9943cd266125.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aac701a4b251433a936c9943cd266125.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"368203","playcount":"2937421"},"similar":{"artist":[{"name":"Eric B. & Rakim","url":"https://www.last.fm/music/Eric+B.+&+Rakim","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b61289cacfc94372a420fc3f0683c10d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b61289cacfc94372a420fc3f0683c10d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b61289cacfc94372a420fc3f0683c10d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b61289cacfc94372a420fc3f0683c10d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b61289cacfc94372a420fc3f0683c10d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b61289cacfc94372a420fc3f0683c10d.png","size":""}]},{"name":"KRS-One","url":"https://www.last.fm/music/KRS-One","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/df364ab235264e359b314114046fbbd6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/df364ab235264e359b314114046fbbd6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/df364ab235264e359b314114046fbbd6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df364ab235264e359b314114046fbbd6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df364ab235264e359b314114046fbbd6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df364ab235264e359b314114046fbbd6.png","size":""}]},{"name":"Nas","url":"https://www.last.fm/music/Nas","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5235896ac9e6405caf763984afd60d60.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5235896ac9e6405caf763984afd60d60.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5235896ac9e6405caf763984afd60d60.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5235896ac9e6405caf763984afd60d60.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5235896ac9e6405caf763984afd60d60.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5235896ac9e6405caf763984afd60d60.png","size":""}]},{"name":"Gang Starr","url":"https://www.last.fm/music/Gang+Starr","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/611b0c93ffb84f99cf6aef39ea4df3ce.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/611b0c93ffb84f99cf6aef39ea4df3ce.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/611b0c93ffb84f99cf6aef39ea4df3ce.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/611b0c93ffb84f99cf6aef39ea4df3ce.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/611b0c93ffb84f99cf6aef39ea4df3ce.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/611b0c93ffb84f99cf6aef39ea4df3ce.png","size":""}]},{"name":"EPMD","url":"https://www.last.fm/music/EPMD","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5634b68d5a31418794eb66b8a6caef8f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5634b68d5a31418794eb66b8a6caef8f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5634b68d5a31418794eb66b8a6caef8f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5634b68d5a31418794eb66b8a6caef8f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5634b68d5a31418794eb66b8a6caef8f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5634b68d5a31418794eb66b8a6caef8f.png","size":""}]}]},"tags":{"tag":[{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"rap","url":"https://www.last.fm/tag/rap"},{"name":"hip hop","url":"https://www.last.fm/tag/hip+hop"},{"name":"old school","url":"https://www.last.fm/tag/old+school"},{"name":"new york","url":"https://www.last.fm/tag/new+york"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Rakim/+wiki"}},"published":"10 Feb 2006, 22:55","summary":"Rakim (pronounced rah-KIM) (Born William Michael Griffin Jr. on January 28, 1968 in Long Island, New York, USA) is an American rapper and pioneer of the musical genre of hip hop. He is consistently cited as one of the most skilled (and top amongst the most influential) MCs of all time due to his exceptional flow and complex lyrical craftsmanship, he revolutionized hip-hop lyricism with his complex flow, elaborate metaphors and rapid delivery. Together with Eric B, he released a number of classic albums between 1987 and 1992. <a href=\"https://www.last.fm/music/Rakim\">Read more on Last.fm</a>","content":"Rakim (pronounced rah-KIM) (Born William Michael Griffin Jr. on January 28, 1968 in Long Island, New York, USA) is an American rapper and pioneer of the musical genre of hip hop. He is consistently cited as one of the most skilled (and top amongst the most influential) MCs of all time due to his exceptional flow and complex lyrical craftsmanship, he revolutionized hip-hop lyricism with his complex flow, elaborate metaphors and rapid delivery. Together with Eric B, he released a number of classic albums between 1987 and 1992.  To date his most successful album is 'The 18th Letter,' released in 1997 as his solo debut album.\n\nGriffin is the nephew of American R&B singer and actress Ruth Brown. He grew up in Wyandanch, New York, and became involved in the New York hip hop scene at a young age. Eric B brought him to Marley Marl’s house to record \"Eric B. is President.\" At the time Griffin was fresh out of high school and on his way to college, but he decided to forgo higher education and instead chose to record with Eric B. Leshaun\n\nWhen Griffin turned 16, he joined The Nation of Gods and Earths (also known as the 5 Percent Nation) and changed his name to Rakim Allah.\n\nIn 1986, Rakim started to work with New York-based producer-DJ Eric B. The duo — known as Eric B & Rakim — is widely regarded as among the most influential and groundbreaking of hip-hop groups. The duo’s first single, \"Eric B. Is President\" (#48, 1986) b/w “My Melody,” was a success and got the duo a contract with the fledgling Island Records sub-label 4th & B'way. The duo’s next single, the smash “I Know You Got Soul,” sparked early debate on the legality of unauthorized, uncredited sampling when James Brown sued to prevent the duo's use of a fragment of his music. Their first full length album, Paid in Full, was released in 1987, and has since been hailed as one of hip-hop's seminal albums. Their follow-up LP; Follow the Leader was released a year later, and was also well received by fans and critics. The duo recorded two more albums; Let the Rhythm Hit 'Em and Don't Sweat The Technique before they parted ways in late 1992. Due to legal wrangling over royalties and his contracts with both his record label, and with Eric B., Rakim would not release a solo album until five years later.\n\nAfter splitting with Eric B., Rakim signed with his good friend at the time DeShamus \"Q=BOB\" Sallis of Q=BOB Records to commence his solo career, however, the label folded shortly afterward. He eventually returned in 1997 with The 18th Letter, which included collaborations with DJ Premier and Pete Rock; which was released in two versions, one of which included an Eric B. & Rakim greatest hits disc titled The Book of Life. The critical reception of the album was positive, and it was certified gold. In 1999, Rakim released The Master, which received very good reviews as well.\n\nRakim was signed to Dr. Dre's Aftermath Entertainment record label in 2000, for work on an album tentatively titled Oh, My God. The album underwent numerous changes in artistic direction and personnel and was delayed several times. While working on the album, Rakim made guest appearances on numerous Aftermath projects, including the hit single \"Addictive\" by Truth Hurts, the Dr. Dre-produced \"The Watcher Part 2\" by Jay-Z, and Eminem's 8 Mile soundtrack. However, Rakim left the label in 2003 and Oh, My God was indefinitely shelved, a result of creative differences with Dre. Rakim signed with DreamWorks Records shortly afterward, but the label closed its doors shortly after that.\n\nRakim also made cameos in the Juelz Santana video \"Mic Check,\" the Timbaland & Magoo video \"Cop that Disc,\" and the Busta Rhymes video \"New York Shit.\" Eric B. and Rakim's classic album Paid In Full was named the greatest hip-hop album of all time by MTV. Rakim was engaged in a lawsuit with reggaeton performer R.K.M (formerly Rakim) over the use of the name \"Rakim\". Rakim won the rights to the name. Recently, Rakim was featured in an All-Pro Football 2K8 commercial.\n\nThe Seventh Seal, Rakim's long-anticipaited album, was released November 17 2009. The first single off the album, Holy Are You, was released through his MySpace page on July 14, 2009 and was made available on iTunes July 28. A second track \"Walk These Streets\" ft. Maino was released in October. Rakim has been active during its recording with several national tours and special events. Rakim recently closed the Knitting Factory in NYC as the last Hip-Hop performer to walk off the historic club's stage after 25 years of underground performances.\n\nRakim has influenced songs by Jay-Z, Nas, The Notirious BIG, Lil- Wayne and countless others. Other rappers use many of his lyrics in their songs, often without giving credit.\nTributes to Rakim include:\n  * Tupac Shakur pays homage to Rakim in the song \"Old School\" off the album \"Me Against the World\"\n    * Raekwon of Wu-Tang Clan dedicated a tribute to Rakim titled \"Rakim Tribute,\" which was released on DaVinci Code: The Vatican Mixtape Vol. II in 2006.\n    * 50 Cent makes a reference to Rakim on his hugely successful collaborative effort \"Hate It or Love It\" with The Game. \"Daddy ain't around, probably out committing felonies/my favorite rapper used to sing Ch-Check out my melody,\" referencing Eric B & Rakim's hit \"My Melody\".\n    * Shock-G paid homage to Rakim by playfully reciting lines from the Eric-B & Rakim song \"I Know You Got Soul\" in the Digital Underground song Doowutchyalike: \"since ya came here ya gotta show & prove, and do that dance until it don't move..\"\n    * Saul Williams mentions Rakim in the song \"Twice The First Time\", stating: \"not until you've listened to Rakim on a rocky mountain top have you heard hip hop\" and also in the song \"Penny For A Thought\" where he says \"Someone like Rakim said – 'I could quote any MC, but why should I? how would it benefit me?'\"\n    * Kurupt references Rakim on Snoop Dogg's debut album, Doggystyle. On \"For All My Niggaz and Bitches,\" Kurupt says, \"Who's jokin'? Rakim never joked, so why should I, loc? now that's my idol....\"\n    * Ghostface Killah references Rakim in the end of \"Paisely Darts,\" by saying that he is better than every artist except for Rakim, referring to him as \"the older god\". On his album More Fish, the first track, \"Ghost is Back\", makes use of the beat from \"Juice (Know the Ledge)\". He also raps some lines from \"Move the Crowd\" in \"Ghost Deini.\"\n    * Eminem has also paid tribute to Rakim's style as an inspiration and references lines from \"My Melody\"\" in his song “I'm Back”. The hook in Eminem's song \"The Way I Am\" is a homage to the line \"I'm the R, the A, to the KIM. If I wasn't then why would I say I am?\" from Eric B and Rakim's \"As the Rhyme Goes On\". Nas made a similar reference in Got Ur Self A...: \"I'm the N the A to the S-I-R / and If I wasn't I must've been Escobar\". I-Kompleate has also does the same in his song \"Rhymes\" on the hook: \"I'm not I-K-O to the N-I-C, cos if I was I wouldn't be I-Kompleate\".Masta Ace uses this in the song by Bekay \"Brooklyn Bridge\": \"I'm from the B-R double O-K L-Y-N, if I wasn't then why would I yell I am\"\n    * I-Kompleate pays tribute and references Rakim in his songs Rhymes, Dominate (The Microphone), and I'm Ready. \"Leaving a trace of R, When I chase the stars\" \"\n    * Jay-Z paid tribute to Rakim in his 2007 hit \"Blue Magic,\" where he states: \"Eighty-seven state of mind that I'm in/I'm in my prime so for that time I'm Rakim.\"\n    * Killah Priest references Rakim in many of his songs. He states: \"I remind you of Rakim but I'm not him.\"\n    * British rapper Scroobius Pip mentions Rakim in his song \"Fixed\" from the album Angles, as an example of hip hop as art, in the lines \"Take it back to the start/Like KRS and Rakim use passion and heart\".\n    * Nas' Street's Disciple album has a track titled \"U.B.R. (Unauthorized Biography of Rakim)\" where he tells a short version of Rakim's musical career and life.\n    * The Game directly refers to Rakim in the first line of the third verse of \"Da Shit\" by saying, \"I'm the West Coast Rakim, got niggaz blocked in.\" He also mentions Rakim in his song \"Angel\" on LAX: \"So I start hip-hop and I understand why Common used to love her. She got me open so I even had to fuck her. But I used the rubber, cause she was married to Rakim\".\n    * Apathy pays homage to Rakim in his song \"Hip Hop is Dead\" on Baptism by Fire. Apathy raps, \"Remember that video 'I Ain't No Joke', Rakim had a chain that'll break your neck, I'm trying to get paid in full and get that check.\"\n    * Rapper R.A. The Rugged Man references Rakim in his song \"On The Block\" referring to the golden age, \"that's when Rakim ran shit.\"\n    * Rage Against the Machine covered the song \"Microphone Fiend\" as the opening song on their final album, Renegades, in 2000.\n    * Canibus pays homage to Rakim on his 1000-bar song \"Poet Laureate Infinity\", most notably with the bars \"I been toe to toe with the best, I ‘Know the Ledge’\" and \"As odd as it may seem, the Microphone Fiend, Is God of the Hip Hop regime\"\n    * Songs like Lloyd's \"Girls Around the World\" and Snoop Dogg's \"Paper'd Up\" sample the beat of Eric B. and Rakim's \"Paid in Full\" with both Lil Wayne and Snoop Dogg putting their own twist on the Rakim's verse.\n    * Brother Ali calls Rakim his hero in his song \"As Real As Can Be\". He also references the line \"I came in the door/said it before\" from \"Eric B is President\" in his song \"Whatcha Got\" where he raps \"I came in the door/1984\".\n    * Drunken Tiger (South Korean hip-hop artist) features Rakim on the track \"Monster\" off of his 2009 album, \"Feel gHood Muzik: The 8th Wonder\".\n    * Jay-Z references Rakim in his song \"Run This Town\" rapping, \"Please follow the leader/So Eric B. we are/Microphone fiend/It's the return of the god/Peace god...\"\n    * Jin references Rakim in his song \"It's All Over\" from \"The Emcee's Properganda\" album with the line \"ya'll needa follow the leader like Rakim gave the orders\"\n    * Nas paid tribute in his song The World Is Yours by saying \"The fiend of hip-hop has got me stuck like a crack pipe\"\n    * Scott Van Pelt recently said on his radio show that '...because I'm Paid in Full like Rakim'\n    * Saigon mentions Rakim in his song 'Hip-Hop' stating \"We crown Rakim the king, cos he was calling the gods of earth that came with bling bling\"\n    * Jedi Mind Tricks paid tribute to Rakim by sampling two of his lines from Heat It Up in their song Saviorself, \"Elements burst and gave birth to the first/Get the pen from the nurse and hook the mic up first\"\nWidely considered the greatest rapper of all time, he continues his career with the recently released Seventh Seal.\n <a href=\"https://www.last.fm/music/Rakim\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
