{"artist":{"name":"Randy Travis","mbid":"09b697e3-a849-4670-ae49-e0b821a6271a","url":"https://www.last.fm/music/Randy+Travis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/745f411a3ef44671b997989f59f3cebe.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/745f411a3ef44671b997989f59f3cebe.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/745f411a3ef44671b997989f59f3cebe.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/745f411a3ef44671b997989f59f3cebe.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/745f411a3ef44671b997989f59f3cebe.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/745f411a3ef44671b997989f59f3cebe.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"247196","playcount":"1984572"},"similar":{"artist":[{"name":"Clint Black","url":"https://www.last.fm/music/Clint+Black","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/25d80a3dd4f845e6b4b55ed4a62ee1ee.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/25d80a3dd4f845e6b4b55ed4a62ee1ee.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/25d80a3dd4f845e6b4b55ed4a62ee1ee.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/25d80a3dd4f845e6b4b55ed4a62ee1ee.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/25d80a3dd4f845e6b4b55ed4a62ee1ee.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/25d80a3dd4f845e6b4b55ed4a62ee1ee.png","size":""}]},{"name":"George Strait","url":"https://www.last.fm/music/George+Strait","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c2945211e0a447e7aaa5fbbc52149a6a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c2945211e0a447e7aaa5fbbc52149a6a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c2945211e0a447e7aaa5fbbc52149a6a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c2945211e0a447e7aaa5fbbc52149a6a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c2945211e0a447e7aaa5fbbc52149a6a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c2945211e0a447e7aaa5fbbc52149a6a.png","size":""}]},{"name":"Alan Jackson","url":"https://www.last.fm/music/Alan+Jackson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2c89c064f6933070bd42a390433e048c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2c89c064f6933070bd42a390433e048c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2c89c064f6933070bd42a390433e048c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c89c064f6933070bd42a390433e048c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c89c064f6933070bd42a390433e048c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c89c064f6933070bd42a390433e048c.png","size":""}]},{"name":"Travis Tritt","url":"https://www.last.fm/music/Travis+Tritt","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d41ef02b304249dea3183d07eb4fa5f7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d41ef02b304249dea3183d07eb4fa5f7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d41ef02b304249dea3183d07eb4fa5f7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d41ef02b304249dea3183d07eb4fa5f7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d41ef02b304249dea3183d07eb4fa5f7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d41ef02b304249dea3183d07eb4fa5f7.png","size":""}]},{"name":"Alabama","url":"https://www.last.fm/music/Alabama","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5f44aad63b474bde90df895c85fc64a0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5f44aad63b474bde90df895c85fc64a0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5f44aad63b474bde90df895c85fc64a0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f44aad63b474bde90df895c85fc64a0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f44aad63b474bde90df895c85fc64a0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f44aad63b474bde90df895c85fc64a0.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"Randy Travis","url":"https://www.last.fm/tag/Randy+Travis"},{"name":"classic country","url":"https://www.last.fm/tag/classic+country"},{"name":"male vocalists","url":"https://www.last.fm/tag/male+vocalists"},{"name":"new traditionalist","url":"https://www.last.fm/tag/new+traditionalist"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Randy+Travis/+wiki"}},"published":"19 Jun 2006, 13:15","summary":"Randy Travis (born Randy Bruce Traywick, May 4, 1959 in Marshville, North Carolina) is an American multiple Grammy Award and Dove Award-winning American country singer. Active since 1985, he has recorded more than a dozen studio albums to date, in addition to charting more than thirty singles on the Billboard Hot Country Songs charts.\n\nTravis was born in Marshville, North Carolina, the second of six children of Bobbie, a textile factory worker, and Harold Traywick, a horse breeder, turkey farmer, and construction business owner. <a href=\"https://www.last.fm/music/Randy+Travis\">Read more on Last.fm</a>","content":"Randy Travis (born Randy Bruce Traywick, May 4, 1959 in Marshville, North Carolina) is an American multiple Grammy Award and Dove Award-winning American country singer. Active since 1985, he has recorded more than a dozen studio albums to date, in addition to charting more than thirty singles on the Billboard Hot Country Songs charts.\n\nTravis was born in Marshville, North Carolina, the second of six children of Bobbie, a textile factory worker, and Harold Traywick, a horse breeder, turkey farmer, and construction business owner. While growing up, Travis was forced to take guitar lessons by his father and began performing at the age of eight with his brother, Ricky. Travis began drinking at the age of 12, and by 14 was a regular marijuana user, who occasionally dabbled in harder drugs. He often fought with his father and soon dropped out of high school. He became a juvenile delinquent and was arrested for various offenses, including auto theft and burglary.\n\nHarold Traywick entered Randy and Ricky in a talent contest at a nightclub called \"Country City, USA\" in Charlotte, North Carolina. In the meantime, Ricky, who also had brushes with the law, was sentenced to jail and Randy had to complete the contest alone, but he won anyway. The club's manager, Elizabeth \"Lib\" Hatcher, took an interest in Travis and gave him a job singing at the club. Travis began focusing on music. He first recorded for Paula Records and released two unsuccessful singles — \"She's My Woman\" and \"Dreamin'\". Travis' legal troubles continued and he was due in court for probation violations. Hatcher pleaded with the judge and Travis was released in her custody with the warning that if the judge ever saw him again \"he'd better bring his toothbrush, because he would be going to jail for a very long time.\"\n\nTravis moved in with Hatcher. This put further strain on her already fragile marriage. She eventually left her husband and, in 1982, she and Travis moved to Nashville, Tennessee. Travis was soon turned down by every record label in town. His early demo tapes were criticized by Nashville record executives as being \"too country.\" Hatcher took a job as manager of a nightclub, \"The Nashville Palace\" and hired Travis as a cook and singer. It was during this time that an unlikely romance began to form between the two; Travis said \"I think we discovered how much we needed each other.\"\n\nCareer\n\nIn 1982, Travis recorded an independent album Randy Ray Live and Lib Hatcher used it to secure a deal with Warner Bros. Records. However, the label said they had to keep their romance a secret, so as not to turn away fans, and changed his stage name from Randy Ray to Randy Travis. In 1985, Warner Brothers released Travis' single, \"On the Other Hand,\" which topped out at 67 on the country charts. His next single, \"1982\", became a Top 10 hit followed by the re-release of \"On the Other Hand\" in 1986. The re-release became Travis' first number one hit.\n\nHis debut album, Storms of Life, went on to sell more than 4 million copies. In the late 1980s, he had a string of hits, including \"No Place Like Home\" and \"Diggin' Up Bones.\" A song from his second Warner Brothers album \"Always and Forever\" titled \"Forever and Ever, Amen\" arguably launched the neo-traditionalist country era, boosting the popularity of country music beyond its traditional fan base. For two years in a row, Travis won the Grammy Award for Best Male Country Vocal Performance, for the albums Always & Forever in 1988, and for Old 8x10 in 1989. Off the success of his first two albums, Old 8x10 shipped platinum. Always and Forever was number one for 43 weeks.\n\nTravis and Hatcher married in 1991. That year Travis took part in Voices That Care, a multi-artist project that featured other top names in music for a one-off single to raise money for the allied troops in the Gulf War. The project included fellow singers Garth Brooks, Kenny Rogers and Kathy Mattea. By 1992, Travis was no longer charting high, as Brooks, Clint Black and others had taken over Nashville. He took a break from music to concentrate on acting and landed roles in several Western-genre films. He returned to recording with the 1994 album This Is Me and the hit single \"Whisper My Name.\"\n\nIn 1997, Travis parted ways with Warner Brothers. He moved to DreamWorks Nashville and recorded You and You Alone, which produced the top 10 hits \"Out of My Bones\" and \"Spirit of a Boy, Wisdom of a Man.\" These were followed by 2000's albums Inspirational Journey, 2002's Rise and Shine and 2003's Worship and Faith. The single \"Three Wooden Crosses\" from the Rise and Shine album reached No. 1 and won the CMA song of the year in 2003. That same year, Travis ranked #13 on CMT's 40 Greatest Men of Country Music. Travis continues to act in film and television; he appeared on the series finale of Touched by an Angel. His second most recent album, Passing Through, was released in November of 2004. It combines the country music of his earlier years, with a little gospel mixed in from more recent albums. After the release of \"Glory Train\" in 2005 and the Christmas album \"Songs of the Season\" in 2007, Travis released his brand new single \"Faith In You\" as a free download from his official website. It heralds the projected summer [2008] release of his forthcoming album, \"Around the Bend\". Along with the release of the free single, RandyTravis.com has also underwent a complete overhaul, with opportunities for fans to create blogs and join an upcoming official fan club. The new sleek look of the website has attracted throngs of fans. Contributor Anthony Maurizio has recently produced the Digging Up Bones blog series on the website, which has increased website traffic and is considered one of the most esteemed country music articles available for reading. \n <a href=\"https://www.last.fm/music/Randy+Travis\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
