{"artist":{"name":"Barenaked Ladies","mbid":"86e736b4-93e2-40ff-9e1c-fb7c63fef5f6","url":"https://www.last.fm/music/Barenaked+Ladies","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/45e9615fca124e83a606938e2b3bc95e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/45e9615fca124e83a606938e2b3bc95e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/45e9615fca124e83a606938e2b3bc95e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/45e9615fca124e83a606938e2b3bc95e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/45e9615fca124e83a606938e2b3bc95e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/45e9615fca124e83a606938e2b3bc95e.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"978167","playcount":"19347371"},"similar":{"artist":[{"name":"Guster","url":"https://www.last.fm/music/Guster","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dbc27de9dff04ac984546f63a6b85ece.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dbc27de9dff04ac984546f63a6b85ece.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dbc27de9dff04ac984546f63a6b85ece.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dbc27de9dff04ac984546f63a6b85ece.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dbc27de9dff04ac984546f63a6b85ece.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dbc27de9dff04ac984546f63a6b85ece.png","size":""}]},{"name":"Sister Hazel","url":"https://www.last.fm/music/Sister+Hazel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/67159c12ef4149329433c9819ea3b219.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/67159c12ef4149329433c9819ea3b219.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/67159c12ef4149329433c9819ea3b219.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/67159c12ef4149329433c9819ea3b219.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/67159c12ef4149329433c9819ea3b219.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/67159c12ef4149329433c9819ea3b219.png","size":""}]},{"name":"The Tragically Hip","url":"https://www.last.fm/music/The+Tragically+Hip","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d68c2cccf2614efbb6065f838f23f273.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d68c2cccf2614efbb6065f838f23f273.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d68c2cccf2614efbb6065f838f23f273.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d68c2cccf2614efbb6065f838f23f273.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d68c2cccf2614efbb6065f838f23f273.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d68c2cccf2614efbb6065f838f23f273.png","size":""}]},{"name":"Great Big Sea","url":"https://www.last.fm/music/Great+Big+Sea","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/de931ac96f6644108d4e8fb83dc3dfcd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/de931ac96f6644108d4e8fb83dc3dfcd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/de931ac96f6644108d4e8fb83dc3dfcd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/de931ac96f6644108d4e8fb83dc3dfcd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/de931ac96f6644108d4e8fb83dc3dfcd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/de931ac96f6644108d4e8fb83dc3dfcd.png","size":""}]},{"name":"Fastball","url":"https://www.last.fm/music/Fastball","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7c9e6cd9c7014e68b07ef387fb86299d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7c9e6cd9c7014e68b07ef387fb86299d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7c9e6cd9c7014e68b07ef387fb86299d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c9e6cd9c7014e68b07ef387fb86299d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c9e6cd9c7014e68b07ef387fb86299d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c9e6cd9c7014e68b07ef387fb86299d.png","size":""}]}]},"tags":{"tag":[{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"Canadian","url":"https://www.last.fm/tag/Canadian"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"},{"name":"alternative rock","url":"https://www.last.fm/tag/alternative+rock"},{"name":"pop","url":"https://www.last.fm/tag/pop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Barenaked+Ladies/+wiki"}},"published":"12 Feb 2006, 19:17","summary":"Barenaked Ladies (often abbreviated BNL) is a Canadian alternative rock band currently composed of Jim Creeggan, Kevin Hearn, Ed Robertson, and Tyler Stewart, formerly featuring Andy Creeggan and Steven Page.  Page left the band amicably in February 2009 to pursue solo projects, and March 7th, 2009 saw the band's first show on stage as a foursome in Orlando, Florida. Tyler Stewart proudly emblazoned his drum-set with a \"Fantastic 4\" logo.  In March 2010, they released 'All In Good Time', their first post-Page studio album. <a href=\"https://www.last.fm/music/Barenaked+Ladies\">Read more on Last.fm</a>","content":"Barenaked Ladies (often abbreviated BNL) is a Canadian alternative rock band currently composed of Jim Creeggan, Kevin Hearn, Ed Robertson, and Tyler Stewart, formerly featuring Andy Creeggan and Steven Page.  Page left the band amicably in February 2009 to pursue solo projects, and March 7th, 2009 saw the band's first show on stage as a foursome in Orlando, Florida. Tyler Stewart proudly emblazoned his drum-set with a \"Fantastic 4\" logo.  In March 2010, they released 'All In Good Time', their first post-Page studio album.\n\nThey formed in 1988 in Scarborough, Ontario, a suburb of Toronto, and they are best known for a series of hit singles including: \"One Week\", \"Pinch Me\", \"If I Had $1000000\" and \"Brian Wilson\". The band's music often features influences from 60s pop rock by artists such as The Beach Boys and The Beatles as well as a light-hearted and comedic performance style. Their trademark at live shows is humorous banter between songs as well as improvised raps/songs, both of which are staples at almost every concert they perform. Each member of the group is a versatile musician, as there are a lot of varied instruments, and each member (with the exception of drummer Tyler Stewart) has written and sung lead on at least one song for the band.\n\nGroup origins and indie work\n\nBarenaked Ladies began as the duo of Ed Robertson and Steven Page. The two had gone to school together since Robertson was in the fourth grade (Page was a grade ahead), but were not friends until they ran into each other at a Harvey's restaurant following a Peter Gabriel concert. Each interested to find the other liked Gabriel, they began talking and found they had many of the same tastes. The two became friends, and when Page had an extra ticket to a Bob Dylan concert that no one wanted, he ran into Robertson at a party. The two attended the concert at Exhibition Stadium (most likely on August 29, 1988). It was a period where Dylan's band was led by G.E. Smith, and Robertson describes the show as \"horrible\" and \"lame\". The two turned to amusing each other, pretending they were rock critics, inventing histories and comments about the Dylan band. They also made up various band names; one of which was \"Barenaked Ladies\".\n\nOn another front, Robertson had agreed to perform with his cover band in a battle of the bands at Nathan Phillips Square for the Second Harvest food bank. The band broke up and he forgot about the gig. When he received a phone call a week before the show, asking him to confirm the gig, he improvised that the name of the band had changed to \"Barenaked Ladies\", recalling the name from the Dylan concert. He then called his friend Steve and asked if he wanted to do the gig; Steve reportedly replied \"You told them that?\". They arranged three rehearsals and missed them all.\n\nThey played the show, but instead of competing, they played while the other bands set up, playing every song they could think of that they both knew. The show went well and they were invited to open a show for another well-known local band, The Razorbacks, at the Horseshoe Tavern the coming weekend. They set up three more rehearsals, and again missed them all, and proceeded to improv their set once again. This would set a precident for an element of Barenaked Ladies concerts which still almost always contain some improvised raps or songs, as well as general improvised banter.\n\nThe two continued playing other shows like that and also began writing songs together. The band's first tape, Buck Naked, released in 1989, was recorded in basements and bedrooms. The pair became followers of a comedy group called Corky and the Juice Pigs, who they credit with exposing them to the idea of comedic stage presence. Ed and Steve presented the group with their tape, and were invited to open for the Juice Pigs on their cross-Canada tour.\n\nOne night, in Toronto, Ed and Steve invited their friends, percussionist Andy Creeggan and bassist Jim Creeggan, to play with them at a Chistmastime club show. \"From the first note,\" Page recalls, \"Ed and I just looked at each other and went 'this is it — this is the band'.\" The brothers were invited to join the band. Barenaked Lunch (also known as the Pink Tape) was released in 1990, and featured the two new band members. Unfortunately, the tape was mastered incorrectly and played too fast. As there were very few copies made of both Buck Naked and Barenaked Lunch, copies are now extremely rare.\n\nAfter only six months, Andy went on a student exchange trip to Ecuador, and the band was lacking a percussionist. While playing at a buskers' festival in the summer of 1990, they met drummer Tyler Stewart, who took over the position. While Andy was gone the band gained some attention when they were winners at the 1990 YTV Achievement Awards. They gained further attention when they squeezed into a small \"Speaker's Corner\" video booth, operated by Citytv in Toronto, and performed \"Be My Yoko Ono\" as well as an ode to Speaker's Corner. After the former song was aired on television it quickly became popular with viewers, and noticeably increased the band's fanbase. Andy returned in early 1991 to find that Tyler had taken over the percussion role. This caused some concern for Andy, who then moved more towards keyboards, though he still played percussion (usually congas) on some songs. The band quickly embarked upon their first full fledged tour of Canada that winter.\n\nEarly Canadian success\n\nThe full band's first release of note was the 1991 Yellow Tape. It was a demo tape originally created for the band's performance at South by Southwest and was the first recording to feature all five members. They spent between $2000 and $3000 on it, and sent a copy to all the labels in Canada; they were refused by all of them. The band turned to selling them off the stage, and wound up selling a lot of them. Word of mouth spread, and people began asking for the tape in local stores. The stores began asking the band for copies of the tape, and the demo tape became a commercial release. Sales began to steamroll based simply on word of mouth and their live shows, and the tape became the first indie release by any band to achieve platinum status (100,000 copies) in Canada.\n\nSales of the cassette tape were jump-started when the band was taken off the bill for the 1991 New Years Eve concert in Nathan Phillips Square outside Toronto City Hall because a staffer for then-mayor June Rowlands saw the band's name and felt it objectified women. The band shrugged it off and booked another show at McMaster University. However, the media got wind of the story and decided to write about it as an example of political correctness gone too far. The first article earned the paper a large quantity of mail against City Hall's decision. The story became more and more prominent until about a week after New Years, when the band was asked to take a photo in front of City Hall for the front page of the Toronto Star. The stories erroneously targeted Rowlands, even though she had not even been in town when the decision was made. The following week, sales of the Yellow Tape exploded. The City Hall story has followed the band ever since; Robertson credits the scale of the story to it being a slow news week.\n\nAlso in 1991, BNL contributed a cover of Bruce Cockburn's \"Lovers in a Dangerous Time\" to the Cockburn tribute album Kick at the Darkness. That song became the band's first Top 40 hit in Canada.\n\nThe first albums\n\nThe band's first full album, the hotly anticipated Gordon, released in 1992, was a smash hit in Canada and included some of the band's best known songs, including \"Enid\", the first single; \"Be My Yoko Ono\", the single which helped fund the album; \"If I Had $1000000\", which spawned a Kraft Dinner -- or, in the US, Kraft Macaroni & Cheese -- throwing tradition at live shows that the band has since discouraged; and \"Brian Wilson\", named after Beach Boy Brian Wilson (who later covered the song on a live album). It benefited from the fact that a number of songs on the album (including the latter three) had been live favorites for a while and had been recorded on past releases like the Yellow Tape. While the band was doing remarkably well in Canada, they found that it translated into little success in the U.S..\n\nBNL's second album, Maybe You Should Drive, released in 1994, fared considerably less well with the Canadian public. On the album, the band toned down its comic image, collaborated with kd lang producer Ben Mink, and produced what many critics acknowledged as a more mature work. They tried touring in America, but the tour was a failure and ended up losing money despite an appearance on Late Night with Conan O'Brien. Before the next release Andy Creeggan decided to leave the band. He had become disillusioned with the direction of the band, and was not fond of touring. In addition, Creeggan wanted to attend McGill University to further study music.\n\nThe band released Born on a Pirate Ship as a quartet in 1996. The album received two large boosts from the inclusion of the song \"Shoe Box\" on the Friends soundtrack, and from the Jason Priestley-directed video for \"The Old Apartment,\" which got notable American airplay. The Ladies appeared as the guest band on an episode of Beverly Hills 90210, immediately preceding their 1996 tour; they performed \"The Old Apartment,\" \"Life, In A Nutshell,\" and \"Jane\" at the Peach Pit After Dark night club. Kevin Hearn was hired as the keyboardist for the tour and ultimately joined the band full time.\n\nFrom two dates on the Born on a Pirate Ship tour during 1996, BNL recorded and released a live album called Rock Spectacle (pronounced 'Rock spek-TAK' - French for \"Rock Show\"), which had a modest radio hit in the United States with \"Brian Wilson.\" The album went Gold in the US and the success of \"Brian Wilson\", coupled with the success of \"The Old Apartment\", led to a new situation for the band. Having shed their self-proclaimed \"geeks in short pants\" image, the band knew their next album would be their chance to make it big in America.\n\nBreakthrough American success\n\nThey turned out to be right, as the 1998 release Stunt became (and remains) their greatest success, buoyed by \"One Week\", which coincidentally spent \"one week\" at the number one spot on the storied Billboard Hot 100. Immediately after Stunt was released, however, Kevin Hearn was diagnosed with leukemia, eventually undergoing a bone marrow transplant and spending several months at a Toronto hospital recovering. The band toured, with friends Chris Brown and Greg Kurstin both filling in on keyboards until Kevin recovered enough to rejoin them on the road. The singles \"It's All Been Done\" (used as the opening theme song on the short lived animated TV series Baby Blues) and \"Call and Answer\" (which later appeared in the film \"EdTV\") also came from this highly successful album. The band was also asked to contribute a song (\"Get In Line\", ending up as a single) to the soundtrack of the FOX cartoon, King Of The Hill.\n\nMaroon, released in 2000, did fairly well led by the single \"Pinch Me\", though not as well as Stunt had done. In 2001, they released a compilation album, entitled Disc One: All Their Greatest Hits 1991-2001, in ironic reference to a line from their early song \"Box Set\". It contains 15 singles from previous BNL albums, two singles from other compilations, and two new tracks (including the single \"Thanks, That Was Fun\").\n\nEverything to Everyone was released October 21, 2003, timed to coincide with the first show of the new \"Peep Show\" tour. The first single off the album was \"Another Postcard (Chimps)\", which received modest radio play. \"Testing 1, 2, 3\" was the second single off of the album and received a video, but no CD single, while \"Celebrity\" was released later in the UK with a CD single, but no video. \"Maybe Katie\" and an edited version of \"For You\" from a concert in Glasgow, Scotland were also released as singles to radio. Unfortunately, the album was their weakest seller in years, with a short chart life, despite positive reviews. With the release, the band fulfilled their contract with Reprise Records, which they did not re-sign. This made the band independent for the first time since 1992 (though they retained a distribution relationship with Warner Music). On the subsequent Everywhere For Everyone tour, in early 2004, the band began offering their full live shows for purchase as a download or CD-R on an eponymous website, as well as subsequent studio releases.\n\nReturn to independence\n\nThe band's next album was Barenaked for the Holidays, which was released on October 5, 2004. It was their first independent record since the Yellow Tape, as well the first album recorded at Steven Page's then-recently completed studio at his farmhouse called \"Fresh Baked Woods\". The label the band created for this album is called \"Desperation Records\". Currently, there does not seem to be any plan by the band to release material by any artist on the label other than themselves. The band's 2005 Christmas fan club release of a rare 1991 concert was also released on the label.\n\nIn January 2005, the band taped a television pilot for a variety show, tentatively titled \"Barenaked Ladies Variety Show\", which was ultimately rejected by the FOX network. Later that year, the band was asked to write music for the Stratford Festival of Canada's musical production of Shakespeare's As You Like It. Steven Page wrote most of the music (Shakespeare had provided lyrics in the play), and the band recorded it for the actors to sing over. The recording (with Page's vocals) was available on CD from the festival and on the band's website. On July 2, 2005 BNL took part in the Live 8 concert in Barrie, Ontario.\n\nFollowing several writing sessions throughout 2005, the band went into the studio at Fresh Baked Woods that fall to begin recording 29 songs. They broke from the studio in November and December of that year to play a 22-show holiday tour, each night of which they played one of their new songs. An iTunes Originals - a collection of interviews and live songs (coupled with some old album tracks) was recorded while the band was in the studio and was released in February 2006.\n\nIn January, the band went back into the studio to finish up the recordings they started the previous fall. Initially unsure of how to release so many songs, the band announced in May 2006 that they will release a one-disc album in early September entitled Barenaked Ladies Are Me. Several alternate versions will be available, including downloadable versions and a USB flash drive version. The band has stated that they expect to tour in support of the album starting with a U.S. tour around the release, followed by tours of the Canada and the UK in 2007. The band is also holding a contest in which the individual tracks from five of the new songs will be made available online. Fans can re-mix and submit them to the band, with the best remixes to be released on an EP, the proceeds from which will go to charity. The first single, \"Easy\", was released as a download on June 19, 2006. At around this time, it was also announced that the songs that did not make it to Barenaked Ladies Are Me will be released on another album, entitled Barenaked Ladies Are Men, in early 2007.\n\nIn May 2006, Barenaked Ladies, along with other prominent Canadian musicians, formed the Canadian Music Creators Coalition in response to plans by the Canadian government to revisit and update copyright laws. Steven Page has acted as a conduit between the CMCC and the press, urging the government to focus on the Canadian cultural scene.\n\nThe band has also indicated that a boxed set is in the works, to possibly be released by Christmas from Rhino Entertainment which may include demos, unreleased songs and other exclusive material, both audio and video.\n\nFollowing a lead from other artists (notably Dave Matthews and Friends), the band held a fan cruise called \"Ships and Dip\" from January 15-19, 2007. The band was onboard the entire cruise (unlike on other music cruises, such as aforementioned, where the headline band is not aboard the ship). They had several of their entertainment connections (bands and comedians) onboard. The bands Guster, The Brothers Creeggan, Kevin Hearn and Thin Buckle, and Trippin' Balls were all a part of the cruise.  The band is already planning \"Ships and Dip 3\" for January 6-10, 2008, since \"'Ships and Dip 2' would only be heartache and disappointment\".\n\nIn the spring of 2008, the group released a children's album called \"Snacktime\".\n\nIn July 2008, Steven Page was arrested in New York State on posession of cocaine. After the arrest, the group stated they were \"business as usual\" and will be going into the studio in the fall to record a new album.\n\nOn February 24 2009, Steven Page announced he was leaving the group in a joint statement with the band on their website. Steven plans on working on solo material. March 7, 2009 saw their first show on stage as a foursome in Orlando Florida and in March 2010, they released All In Good Time, their first post-Page studio album.\n\nSide projects\n\nTyler Stewart, Jim Creeggan, Kevin Hearn, and Steven Page all have past or present side projects during their time off from BNL. Tyler was part of a trio called Don't Talk Dance which released a self-titled album in 1995, but are no longer together. Jim is part of the alternative/jazz trio The Brothers Creeggan, with brother and former BNL member Andy Creeggan and friend Ian McLauchlan. They have been on hiatus for several years now. Andy also has several solo albums. Kevin is the frontman of Kevin Hearn and Thin Buckle, who play a mix of alternative rock and jazz with many other eclectic influences. Steve has a side project called The Vanity Project. The first self-titled album was written mostly with long-time collaborator Stephen Duffy. Steve has said that the project is an opportunity for him to write with non-BNL writers, and a future release might not necessarily include Duffy.\n\nBiography\n\nBarenaked Ladies have authorized a biography, Public Stunts Private Stories, written by friend of the band and fellow \"Scarberian\" Paul Myers, brother of actor Mike Myers. It is published in Canada by Madrigal Press. An updated 2003 version includes a different cover, information about Disc One: All Their Greatest Hits 1991-2001 and Everything to Everyone, and corrects several typos found in the original version.\n\nWebsite\n\nbarenakedladies.com <a href=\"https://www.last.fm/music/Barenaked+Ladies\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
