{"artist":{"name":"Rocky Hill","mbid":"7aa4e4b8-ee7f-4216-88c2-ac28a91e5523","url":"https://www.last.fm/music/Rocky+Hill","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c41b91e161244882c89d3822556d7b6c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c41b91e161244882c89d3822556d7b6c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c41b91e161244882c89d3822556d7b6c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c41b91e161244882c89d3822556d7b6c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c41b91e161244882c89d3822556d7b6c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c41b91e161244882c89d3822556d7b6c.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"765","playcount":"3729"},"similar":{"artist":[{"name":"John Earl Walker","url":"https://www.last.fm/music/John+Earl+Walker","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e33986a842bf4ecb9a574aadf14de224.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e33986a842bf4ecb9a574aadf14de224.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e33986a842bf4ecb9a574aadf14de224.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e33986a842bf4ecb9a574aadf14de224.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e33986a842bf4ecb9a574aadf14de224.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e33986a842bf4ecb9a574aadf14de224.png","size":""}]},{"name":"Arsen Shomakhov","url":"https://www.last.fm/music/Arsen+Shomakhov","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c84e6a3a6b1f49a587f3cabef00ef30b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c84e6a3a6b1f49a587f3cabef00ef30b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c84e6a3a6b1f49a587f3cabef00ef30b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c84e6a3a6b1f49a587f3cabef00ef30b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c84e6a3a6b1f49a587f3cabef00ef30b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c84e6a3a6b1f49a587f3cabef00ef30b.png","size":""}]},{"name":"Sonny Moorman","url":"https://www.last.fm/music/Sonny+Moorman","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0afd9e96067d4cb29da84920b61e0277.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0afd9e96067d4cb29da84920b61e0277.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0afd9e96067d4cb29da84920b61e0277.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0afd9e96067d4cb29da84920b61e0277.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0afd9e96067d4cb29da84920b61e0277.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0afd9e96067d4cb29da84920b61e0277.png","size":""}]},{"name":"Enrico Crivellaro","url":"https://www.last.fm/music/Enrico+Crivellaro","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6dfc212a88ea4d249014b6e6b1b106b8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6dfc212a88ea4d249014b6e6b1b106b8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6dfc212a88ea4d249014b6e6b1b106b8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6dfc212a88ea4d249014b6e6b1b106b8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6dfc212a88ea4d249014b6e6b1b106b8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6dfc212a88ea4d249014b6e6b1b106b8.png","size":""}]},{"name":"Mr. Keith Douglas","url":"https://www.last.fm/music/Mr.+Keith+Douglas","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"Southern Rock","url":"https://www.last.fm/tag/Southern+Rock"},{"name":"blues rock","url":"https://www.last.fm/tag/blues+rock"},{"name":"Texas Blues","url":"https://www.last.fm/tag/Texas+Blues"},{"name":"bluesrock","url":"https://www.last.fm/tag/bluesrock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Rocky+Hill/+wiki"}},"published":"12 Jul 2009, 04:16","summary":"Rocky Hill was born John Rockford Hill on December 1, 1946 in Dallas, Texas; and is the older brother to ZZ Top Bassit Dusty Hill. At the age of 15 Rocky formed a band with younger brother Dusty on bass, and Frank Beard on Drums originaly calling themselves The Starliners before finaling calling themselves American Blues. They dyed their hair blue to go along with the blues fused psycedlia music that was popular during the late 60's. In 1969 the Band relocated to Houston, Texas where they eventually disbanded. <a href=\"https://www.last.fm/music/Rocky+Hill\">Read more on Last.fm</a>","content":"Rocky Hill was born John Rockford Hill on December 1, 1946 in Dallas, Texas; and is the older brother to ZZ Top Bassit Dusty Hill. At the age of 15 Rocky formed a band with younger brother Dusty on bass, and Frank Beard on Drums originaly calling themselves The Starliners before finaling calling themselves American Blues. They dyed their hair blue to go along with the blues fused psycedlia music that was popular during the late 60's. In 1969 the Band relocated to Houston, Texas where they eventually disbanded. Dusty and Frank went to form the blues rock group of ZZ Top with former Moving Sidewalks gutar player, Billy Gibbions, while Rocky went out on his own and played blues.\n\nRocky went through periods of inactivity, possibly due to his \"erratic behavior\", but he always seemed to bounce back and play. He released \"Texas Shuffle\" in 1982, which found him at his best playing the blues, with a sharp guitar and voice that made folks who listen to the record not want to put it down.  He went on to release two more albums: 1988's \"Rocky Hill\" and 1994's \"Midnight Creeper\".\n\nRocky Hill died April 10, 2009 in Houston due to unnamed causes.\n\n\nRemembering Rocky Hill\n\nRocky Hill's blues were his own. He struggled with addictions, bad business dealings and a difficulty relating to other people. His blues were internalized, and he lived with them or for them, wrenching them out through his guitar. He'd share them on stage, though admirers suggested Hill's blues were of a personal nature, even in front of an audience. His sparse discography is a poor representation for a guitarist often described with superlatives.\n\n\"Rocky was good, \" says guitar great Johnny Winter. \"Rocky was damned good. He was a strong player, an innovative player.\" Two years after Hill's death, John Lomax III - who managed and produced him - says Hill \"is still the best electric guitarist I ever heard.\"\n\nLomax has taken a first step in trying to turn up the volume on Hill's legend. He produced an album for Hill in 1977, which was never released. Titled Texas Guitar Legend, the album is now available digitally through Amazon and iTunes, with a physical release coming in early 2012. Texas Guitar Legend makes the case for Hill as an instrumentalist with profound gifts.\n\n\"The main thing for me was getting this out there for the rest of the world to hear. People can decide if they think Rocky is as good as we all thought he was, \" Lomax says. \"Not one of his other albums showcases what he could do.\"\n\nHill, it should be stated, wasn't his own best representative. He was open in interviews about his struggles with drugs and alcohol. He was also notoriously mercurial. It's not entirely surprising that he didn't get around to making a record of his own until 1982.\n\nJohn Rockford Hill, who would be 65 today, got his start playing in Dallas, after co-opting his brother Dusty's guitar, a Christmas present in the mid-'50s. The siblings played in the Starliners when they were teens before forming the trio American Blues with Frank Beard. The group ran the blues through '60s rock. They also were notable for sporting blue hair. They backed blues greats such as Jimmy Reed and Freddie King but broke up in 1969 shortly after all three members moved to Houston. Dusty and Beard joined Billy Gibbons in ZZ Top, while Hill played bass and carried a guitar and drinks for his mentor, Lightnin' Hopkins. \"Dusty wanted to play rock 'n' roll, \" Hill told the Chronicle in 1979. \"(Dusty) wanted to make some money. And he did. … I wanted to play some blues. And I did.\"\n\nSays Dusty today, \"I don't know how to put it delicately but (expletive) just happens, and it's gonna work that way. I don't know if it's DNA or destiny. Come up with any word you want. He was predestined to go that direction because blues - as much as anything - reflected the way he felt about things.\"\n\nA 1972 Chronicle interview suggested an album might be forthcoming, but for years one didn't surface. Enter Lomax, who grew up in West University and graduated from Lamar High School. He wrote for Creem and Rolling Stone and worked at Space City News from 1971-1972, which is when he first heard Hill. Lomax's family includes some prominent ethnomusicologists and folklorists, and he, too, had an ear for discovery. As for sniffing out addicts with phenomenal talents, Lomax was like a German shepherd in a high school. In addition to Hill he worked with Townes van Zandt and Steve Earle.\n\nHill would not be his break, though. Shortly after Lomax made the recordings that became Texas Guitar Legend - which includes a version of Van Zandt's Waitin' Around to Die, bracing for its guitar parts - Hill left him and hooked up with manager Bill Ham, who for years steered ZZ Top. \"We were about to start building some buzz, contacting some labels, \" Lomax says, \"then poof! No Rocky. But that was not unusual behavior for him.\"\n\nLomax smarted over the slight but the two men stayed in touch. \"He could make enemies quicker than most people made friends, \" he says. \"But he didn't even know it. He was just in a different place. But then he'd walk on stage and it didn't matter. He was so good, he obliterated everyone.\"\n\nLomax cites the strength of Hill's hands as key to his sound. \"He had these heavy gauge strings up high and the muscles to push them way down even without a slide piece, he got this great whistling tone, \" he says. \"It was a whole different sound. If you think about all those English guitar guys, they were small guys compared to Rocky. And they sounded like little guys compared to Rocky.\"\n\nAdds Dusty, \"He was always a force. He was hard on the instrument, but he made it talk. That's just the way he was about everything.\"\n\nHill finally released a debut album in 1982 and another on Virgin in 1988 and a third one in the mid-'90s. None drew much attention. In April 2009 he died at age 62: \"undisclosed complications of a medical condition.\"\n\nNow, 30-plus years after Hill left him holding a tape, Lomax sees himself doing something closer in spirit to the recording work for which his family was known. \"It's been fun for me because of the family legacy and all that, to bring out somebody the world hasn't really heard, \" he says.\n\nHe hopes the new album might give Hill's work a life after death. And it might not be the end of the restoration work on Hill's legend. Hill's widow, Joy, has hundreds of cassettes of the musician, some dating back to live shows in the '70s. \"My problem was everything hurt to listen to, \" she says. \"I couldn't listen to so much of that stuff, but I'm finally ready to move forward. Some of this music will absolutely give you chills.\"\n\nThose close to him suggest Hill had more shadings than those who dealt with him fleetingly would admit. Dusty tells a story about playing the State Fairgrounds in Dallas in the '60s and being told to turn down the volume. Hill instead turned up the volume. \"I bring that up because that was him, \" Dusty says. \"But I don't want him to come off as some stubborn out-of-control guy. He studied what he played, all of it.\"\n\n\"His thinking process was deep but he also had very light-hearted feelings, \" Joy says. \"I would never say he couldn't be a handful, but he had so much soul.\n\n\"Rocky just had that ability to live as the person he was, good and bad. He always tried to be in the moment himself. He always said, 'Don't try. Be.'\" <a href=\"https://www.last.fm/music/Rocky+Hill\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
