{"artist":{"name":"Rod Bernard","mbid":"54f2ee7c-7f19-4d69-8577-1d61637eafbe","url":"https://www.last.fm/music/Rod+Bernard","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1d12b2ec95814119c14512d8a5917517.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1d12b2ec95814119c14512d8a5917517.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1d12b2ec95814119c14512d8a5917517.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1d12b2ec95814119c14512d8a5917517.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1d12b2ec95814119c14512d8a5917517.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1d12b2ec95814119c14512d8a5917517.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"3495","playcount":"14594"},"similar":{"artist":[{"name":"Cookie & The Cupcakes","url":"https://www.last.fm/music/Cookie+&+The+Cupcakes","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/318b6229aa4a4af886677585686aad49.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/318b6229aa4a4af886677585686aad49.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/318b6229aa4a4af886677585686aad49.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/318b6229aa4a4af886677585686aad49.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/318b6229aa4a4af886677585686aad49.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/318b6229aa4a4af886677585686aad49.png","size":""}]},{"name":"Warren Storm","url":"https://www.last.fm/music/Warren+Storm","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fe0fdf41c22b1c681ee0235b679e1d72.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fe0fdf41c22b1c681ee0235b679e1d72.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fe0fdf41c22b1c681ee0235b679e1d72.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe0fdf41c22b1c681ee0235b679e1d72.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe0fdf41c22b1c681ee0235b679e1d72.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe0fdf41c22b1c681ee0235b679e1d72.png","size":""}]},{"name":"Johnnie Allan","url":"https://www.last.fm/music/Johnnie+Allan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/af35123194574c02962d9e5b1906c8f7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/af35123194574c02962d9e5b1906c8f7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/af35123194574c02962d9e5b1906c8f7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/af35123194574c02962d9e5b1906c8f7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/af35123194574c02962d9e5b1906c8f7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/af35123194574c02962d9e5b1906c8f7.png","size":""}]},{"name":"Tommy McLain","url":"https://www.last.fm/music/Tommy+McLain","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/471f79748b6140f49a1f592ba2674839.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/471f79748b6140f49a1f592ba2674839.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/471f79748b6140f49a1f592ba2674839.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/471f79748b6140f49a1f592ba2674839.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/471f79748b6140f49a1f592ba2674839.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/471f79748b6140f49a1f592ba2674839.png","size":""}]},{"name":"The Kendall Sisters","url":"https://www.last.fm/music/The+Kendall+Sisters","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b6cbd6a491e549348b49ced95977dc1a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b6cbd6a491e549348b49ced95977dc1a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b6cbd6a491e549348b49ced95977dc1a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6cbd6a491e549348b49ced95977dc1a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6cbd6a491e549348b49ced95977dc1a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6cbd6a491e549348b49ced95977dc1a.png","size":""}]}]},"tags":{"tag":[{"name":"rockabilly","url":"https://www.last.fm/tag/rockabilly"},{"name":"swamp pop","url":"https://www.last.fm/tag/swamp+pop"},{"name":"Rock and Roll","url":"https://www.last.fm/tag/Rock+and+Roll"},{"name":"swamp rock","url":"https://www.last.fm/tag/swamp+rock"},{"name":"cajun","url":"https://www.last.fm/tag/cajun"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Rod+Bernard/+wiki"}},"published":"17 Nov 2007, 08:43","summary":"Rod Bernard (born August 12, 1940) is an American singer who helped to pioneer the musical genre known as \"swamp pop\", which combined New Orleans-style rhythm and blues, country and western, and Cajun and black Creole music. He is generally considered one of the foremost musicians of this south Louisiana-east Texas idiom, along with such notables as Bobby Charles, Johnnie Allan, Tommy McLain, and Warren Storm.\n\nBernard was born on August 12, 1940, in Opelousas, Louisiana. <a href=\"https://www.last.fm/music/Rod+Bernard\">Read more on Last.fm</a>","content":"Rod Bernard (born August 12, 1940) is an American singer who helped to pioneer the musical genre known as \"swamp pop\", which combined New Orleans-style rhythm and blues, country and western, and Cajun and black Creole music. He is generally considered one of the foremost musicians of this south Louisiana-east Texas idiom, along with such notables as Bobby Charles, Johnnie Allan, Tommy McLain, and Warren Storm.\n\nBernard was born on August 12, 1940, in Opelousas, Louisiana. His parents were French-speaking Cajuns from working-class backgrounds, and as a child he imbibed the traditional Cajun French music performed in his grandfather's dancehall, the Courtableu Inn, located in nearby Port Barre, Louisiana. There he heard the music of noted Cajun musicians Aldus Roger, Papa Cairo, and Jimmy C. Newman, as well as zydeco pioneer Clifton Chenier, all of whom would exert a strong influence on Bernard's music.\nAround age eight Bernard obtained his first guitar (an acoustic Gene Autry model) and around 1950 he began to perform with the Blue Room Gang, a Cajun-country troupe sponsored by local Red Bird brand sweet potatoes. During this period Bernard also hosted his own live music radio program on KSLO in Opelousas, singing Cajun and country tunes while strumming his guitar in emulation of his musical hero, Hank Williams, Sr.\n\nIn the mid-1950s, however, Bernard came under the influence of rock and roll and rhythm and blues music, especially the sounds of Fats Domino and Elvis Presley. Around 1957 he helped to form a rock 'n' roll band made up of fellow Opelousas teenagers. Calling themselves The Twisters, they recorded two singles for the obscure Carl label of Opelousas. The next year Bernard and his group recorded the sultry ballad \"This Should Go On Forever\" for recordman Floyd Soileau’s Jin label of Ville Platte, Louisiana. Leased to Argo Records of Chicago, the song became a national hit in 1959, propelling Bernard onto Dick Clark's American Bandstand, The Dick Clark Saturday Night Beechnut Show, and The Alan Freed Show, as well as onto tours with Jerry Lee Lewis, Frankie Avalon, Chuck Berry, and B.B. King, among others.\nA follow-up single for Argo, \"You're On My Mind,\" backed with \"My Life Is A Mystery,\" failed to achieve the success of his initial national release. In late 1959 Bernard signed with producer Bill Hall of Beaumont, Texas, who switched the artist to Mercury Records, which unwisely replaced Bernard’s earthy swamp pop style with lush violin sections and female choruses. Only one minor hit, \"One More Chance,\" emerged from these overproduced Nashville sessions.\n\nAround 1962 Bernard left Mercury for Bill Hall's own Hall-Way label in Beaumont, Texas. Recording with local artists Johnny Winter and Edgar Winter, he released several notable tunes, including \"Fais Do Do,\" \"Who's Gonna Rock My Baby,\" and a rock 'n' roll version of the Cajun folksong \"Allons Danser Colinda,\" the latter of which achieved national airplay and remains a regional favorite in south Louisiana and east Texas.\nA stint in the U.S. Marine Corps boot camp interrupted Bernard's musical career, but after several months he returned to south Louisiana to form The Shondells (not to be confused with Tommy James' group) with fellow swamp pop musicians Warren Storm and Skip Stewart. (Bernard served in the Marine Corps Reserve from 1962 to 1968, reaching the rank of sergeant.) During the mid-1960s the group recorded several singles for the La Louisianne label of Lafayette, Louisiana, and they hosted a live dance program on KLFY-TV called \"Saturday Hop.\" This program inspired their circa 1965 album, The Shondells at the Saturday Hop, issued on La Louisianne.\nDuring this period Bernard recorded singles for Huey Meaux's Teardrop and Copyright labels, and for Soileau's familiar Jin label. Isolated singles appeared on the Scepter and Shelby Singleton's SSS International labels. These sessions included notable releases such as the Chuck Berry-type rocker \"Recorded in England,\" the Cajun two-step inspired \"Papa Thibodeaux,\" and the doleful ballad \"Congratulations To You Darling.\"\nBernard performed infrequently during the 1970s, but returned to his roots by releasing several country and western albums, including Country Lovin’ and Nightlights And Love Songs. He also issued the album Boogie in Black and White with Clifton Chenier, considered a milestone by many because of its raucous blend of Cajun and black Creole elements. One music writer described it as \"a wild and woolly rock 'n' roll set with spontaneity one normally only dreams about,\" while another claimed that \"such a masterpiece, no doubt, spawned other 'experiments' like Wayne Toups' 'ZydeCajun' style or, perhaps, a Zachary Richard 'Zach Attack,' a similar fusion of Cajun, zydeco, and R&B.\"\nAround 1980 he recorded an album of Fats Domino favorites for Jin, titled A Lot of Dominoes, but the masters disappeared until around 1991, when the tracks were finally released (albeit only on cassette). In 2003 he recorded his first new album in over two decades. Titled Louisiana Tradition, the compact disk appeared on the CSP label of Forney, Texas, and included several new songs, as well as reworkings of vintage south Louisiana tunes like fellow swamp pop musician Bobby Charles' \"Later Alligator.\"\nIn June 2006 Bernard re-recorded his spoken-word single \"A Tear In The Lady's Eye,\" which he had originally written and recorded in 1968 as a pro-military response to anti-Vietnam War protestors. (The \"Lady\" of the song is the Statue of Liberty.) In the revised version, however, Bernard addressed Americans who opposed the ongoing war in Iraq. At his own expense Bernard pressed a handful of CD singles containing the revision, which he distributed for airplay to select radio stations and programs, mainly in south Louisiana.\nBernard performs today only sporadically around south Louisiana, concentrating instead on his career as a disk jockey and radio advertising executive in Lafayette, Louisiana. Many of his songs have been reissued on compact disk both in the U.S. and abroad, and continue to receive much regional airplay. Significantly, younger generations of south Louisiana musicians, including C. C. Adcock and Marc Broussard, have acknowledged him as a strong musical influence.\n <a href=\"https://www.last.fm/music/Rod+Bernard\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
