{"artist":{"name":"Roy Rogers","mbid":"5a2e5b57-b8d6-46d3-9b9b-1c7c575102ba","url":"https://www.last.fm/music/Roy+Rogers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/62b02fff94dc4eeb832ee2f2ebfbc57d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/62b02fff94dc4eeb832ee2f2ebfbc57d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/62b02fff94dc4eeb832ee2f2ebfbc57d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/62b02fff94dc4eeb832ee2f2ebfbc57d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/62b02fff94dc4eeb832ee2f2ebfbc57d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/62b02fff94dc4eeb832ee2f2ebfbc57d.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"25513","playcount":"132884"},"similar":{"artist":[{"name":"Hank Thompson","url":"https://www.last.fm/music/Hank+Thompson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3a4eb558f1c140c7b3a0aa04cadafd77.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3a4eb558f1c140c7b3a0aa04cadafd77.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3a4eb558f1c140c7b3a0aa04cadafd77.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a4eb558f1c140c7b3a0aa04cadafd77.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a4eb558f1c140c7b3a0aa04cadafd77.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a4eb558f1c140c7b3a0aa04cadafd77.png","size":""}]},{"name":"Bonnie Raitt","url":"https://www.last.fm/music/Bonnie+Raitt","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9fcd02cfc02143f8b365d0fcbdd1042a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9fcd02cfc02143f8b365d0fcbdd1042a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9fcd02cfc02143f8b365d0fcbdd1042a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9fcd02cfc02143f8b365d0fcbdd1042a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9fcd02cfc02143f8b365d0fcbdd1042a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9fcd02cfc02143f8b365d0fcbdd1042a.png","size":""}]},{"name":"Sons Of The Pioneers","url":"https://www.last.fm/music/Sons+Of+The+Pioneers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/31ed893c4d42492981cbbab0552e3b8b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/31ed893c4d42492981cbbab0552e3b8b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/31ed893c4d42492981cbbab0552e3b8b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31ed893c4d42492981cbbab0552e3b8b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31ed893c4d42492981cbbab0552e3b8b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31ed893c4d42492981cbbab0552e3b8b.png","size":""}]},{"name":"Dick Justice","url":"https://www.last.fm/music/Dick+Justice","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d4b9081af6524936941c6c79347fe6de.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d4b9081af6524936941c6c79347fe6de.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d4b9081af6524936941c6c79347fe6de.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d4b9081af6524936941c6c79347fe6de.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d4b9081af6524936941c6c79347fe6de.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d4b9081af6524936941c6c79347fe6de.png","size":""}]},{"name":"Frank Hutchison","url":"https://www.last.fm/music/Frank+Hutchison","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/896f744e99d448a39e566dedce5a6190.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/896f744e99d448a39e566dedce5a6190.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/896f744e99d448a39e566dedce5a6190.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/896f744e99d448a39e566dedce5a6190.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/896f744e99d448a39e566dedce5a6190.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/896f744e99d448a39e566dedce5a6190.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"western","url":"https://www.last.fm/tag/western"},{"name":"Cowboy Songs","url":"https://www.last.fm/tag/Cowboy+Songs"},{"name":"blues rock","url":"https://www.last.fm/tag/blues+rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Roy+Rogers/+wiki"}},"published":"06 Oct 2007, 10:30","summary":"There are at least three artists with that name: 1. a country music star, 2. a slide guitar player and 3. a house producer from the 90's\n\n1. Roy Rogers (born Leonard Franklin Slye) (November 5, 1911 – July 6, 1998), was a singer and cowboy actor, as well as the namesake of the famous Roy Rogers Restaurants chain. He and his second wife Dale Evans, his golden palomino Trigger, and his German Shepherd Dog, Bullet, were featured in over one hundred movies and The Roy Rogers Show. <a href=\"https://www.last.fm/music/Roy+Rogers\">Read more on Last.fm</a>","content":"There are at least three artists with that name: 1. a country music star, 2. a slide guitar player and 3. a house producer from the 90's\n\n1. Roy Rogers (born Leonard Franklin Slye) (November 5, 1911 – July 6, 1998), was a singer and cowboy actor, as well as the namesake of the famous Roy Rogers Restaurants chain. He and his second wife Dale Evans, his golden palomino Trigger, and his German Shepherd Dog, Bullet, were featured in over one hundred movies and The Roy Rogers Show. The show ran on radio for nine years before moving to television from 1951 through 1957. His productions usually featured a sidekick, often either Pat Brady, (who drove a jeep called \"Nellybelle\") or the crotchety Gabby Hayes. Roy's nickname was \"King of the Cowboys\". Dale's nickname was \"Queen of the West.\" For many Americans (and non-Americans), he was the embodiment of a cowboy.\n\n2. “Roy Rogers means the modern master in the art of slide guitar…His versatility with the technique is nothing short of astonishing.”    ~ All Music Guide\n\nRoy Rogers is considered one of the world's premier slide guitarists performing today.  With 8 Grammy nominations as producer and performer, he is also an internationally acclaimed producer, having produced recordings for John Lee Hooker (4 Grammy Nominations and 2 Grammy Awards) and Ramblin' Jack Elliott (2 Grammy Nominations).  He has received numerous accolades for his songwriting (Grammy Nomination for ‘Song for Jessica’, Grammy nomination for Bonnie Raitt for Best Rock Female Vocal on ‘Gnawin’ On It which he co-wrote), as well as his work on movie soundtracks and television.  Split Decision, is his latest studio recording with his band, The Delta Rhythm Kings which was released by Blind Pig in 2009.  In May of 2011, Roy released a collaboration with The Doors Keyboardist, Ray Manzarek entitled ‘Translucent Blues’ also available on Blind Pig which debut #6 on the Billboard charts, and reached #1 on the American Roots Rock Chart this past summer.  Ray and Roy are currently in the studio working on a new project - #3 for this rare collaboration.  This year - with 5 countries on the radar screen and touring the U.S. and Canada - he continues to ignite and inspire audiences across the globe.\n\nBorn in Redding, California in 1950, he began playing guitar at twelve years of age.   A year later at age 13, he was performing in a rock 'n' roll band that wore gold lame jackets and  played Little Richard and Chuck Berry tunes. He discovered the great blues players early on, especially when his older brother brought home an album by Robert Johnson. Thus began his love of the blues, slide guitar in particular, which had an immediate effect on Roy, who was indeed named after the King of the Cowboys. Through the years he developed a distinctive style of playing slide guitar that not only emerged, but one that is instantly recognizable.\n\nDuring the 1960's Rogers frequented the San Francisco rock clubs where he saw many of the blues greats who inspired him. He performed with various groups until 1976, when he and harmonica player David Burgin formed an acoustic duo and recorded an album Rogers And Burgin: A Foot In The Door for Waterhouse Records. They also played on the \"One Flew Over the Cuckoo's Nest\" movie soundtrack before the duet ran it's course.  Rogers then formed his own band in 1980, the Delta Rhythm Kings, hit the club circuit, played a few more movie and television gigs, and toured Europe with the 1982 San Francisco Blues Festival Revue (recording an album with that Revue in Paris).\n\nShortly after returning from Europe, Rogers was asked to join John Lee Hooker's Coast to Coast Blues Band. During the four years he toured with Hooker as a featured guitarist/vocalist, Rogers established a strong personal and professional relationship with the venerated blues legend. Said Hooker, \"I just can't say enough good things about Roy. He plays so good. Some of the best slide I've heard, best blues I've heard. He gets real deep and funky, and he masters whatever he plays.\" Near the end of his tenure in Hooker's band, Roy began to open shows as a solo act, giving him a chance to perform some of the classic country blues and original compositions he'd been perfecting for years.  He then went on to produce the historically important four recordings for John Lee Hooker.  \"The Healer\"  \"Mr. Lucky\"  \"Boom Boom\"  \"Chill Out\" - some tracks involving co producer credits with Ry Cooder and Van Morrison.\n\nIn 1985 he released his first solo album, Chops Not Chaps on his own label, which received widespread radio play and was nominated for a W.C. Handy Award.  In 1987, Blind Pig released his second solo album, Slidewinder.  It includes fantastic duets with Hooker and New Orleans piano great Allen Toussaint, as well as songs with his own band. The rave reviews in the national press and extensive radio play that followed further enhanced Roy's growing reputation. Roy's third solo release, Blues On The Range was also issued on Blind Pig in 1989 and continued to win new fans to his incredible slide guitar, arrangements and songwriting skills.\n\nRoy’s musical talents were featured on the soundtrack for the 1990 film “The Hot Spot,”\nwhich he recorded with Miles Davis, John Lee Hooker and Taj Mahal and which also garnered a Grammy nomination.\n\nIn 1991, Rogers hooked up with another Bay Area artist, harmonica virtuoso and vocalist Norton Buffalo to produce the highly acclaimed release R & B. The album is a true American array of acoustic tunes from blues to ballads capturing the incredible chemistry of these powerful performers. The cut \"Song For Jessica\" received a Grammy Award nomination in 1991 and another track, \"Ain't No Bread In The Breadbox\" was made into a performance video which received airplay on many outlets, including The Nashville Network.\n\nThe duo came back in 1992 with the Blind Pig release Travellin' Tracks, featuring live performances as well as studio tracks where they are joined by a rhythm section on several cuts. The dynamic interplay between the pair is undeniable and the release furthered the artist's already outstanding reputations.\n\nAs a recording artist, as well as a producer and composer, Rogers’ has recorded not only on his own to critical acclaim, but with others including Carlos Santana, Bonnie Raitt, Linda Ronstadt, Steve Miller, Sammy Hagar, Ray Manzarek and a slew of other great artists. He has been touring worldwide since 1982 and has performed in some of the world’s most prestigious festivals including Montreux, North Sea Jazz Festival, Pori, Pistoia, New Orleans Jazz Festival and more.  He continues to tour worldwide with stirring live performances.  His ability to electrify and move audiences is legendary.  Always eclectic in approach, Roy Rogers is consistently stretching the boundaries of slide guitar.\n\n“Thatʼs not a slide on Roy Rogersʼ pinky, itʼs a time machine. With it, Rogers transports you to the Mississippi Deltaʼs past and future. ......” ~ Guitar Player \n\nUS slide guitarist Roy Rogers plays blues, country and rock music. Aware of the inevitable confusion, Rogers named his publishing company \"Chops Not Chaps Music.\" The discography of this profile contains the following albums which are from him and/or from Roy Rogers & Norton Buffalo:\n\nSplit Decision\nBlues on the Range\nSlideways\nPleasure and Pain\nRhythm & Groove\nSlide Zone\nChops Not Chaps\nSlidewinder\nSlide of Hand\nLive! At The Sierra Nevada Brewery Big Room (with the Delta Rhythm Kings)\nTravellin' Tracks (with Norton Buffalo)\nR&B (with Norton Buffalo)\nRoots of Our Nature (with Norton Buffalo)\n\nOfficial Website: Roy Rogers\n\n3. Roy Rogers is a house producer who has released 2 records on the famous Vegas label.  <a href=\"https://www.last.fm/music/Roy+Rogers\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
