{"artist":{"name":"Ruffneck","mbid":"d6acbf85-0dbe-4cef-aa24-b3aaa44dba75","url":"https://www.last.fm/music/Ruffneck","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/43bcb2ab96874b01a7e465d78488fd5d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/43bcb2ab96874b01a7e465d78488fd5d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/43bcb2ab96874b01a7e465d78488fd5d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43bcb2ab96874b01a7e465d78488fd5d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43bcb2ab96874b01a7e465d78488fd5d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43bcb2ab96874b01a7e465d78488fd5d.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"15204","playcount":"53646"},"similar":{"artist":[{"name":"The Viper","url":"https://www.last.fm/music/The+Viper","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/43331ead908fc98709df26e0031ca6ef.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/43331ead908fc98709df26e0031ca6ef.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/43331ead908fc98709df26e0031ca6ef.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43331ead908fc98709df26e0031ca6ef.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43331ead908fc98709df26e0031ca6ef.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43331ead908fc98709df26e0031ca6ef.png","size":""}]},{"name":"Day-Mar","url":"https://www.last.fm/music/Day-Mar","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ee4dc270b27645ec858356d83e0c78a0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ee4dc270b27645ec858356d83e0c78a0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ee4dc270b27645ec858356d83e0c78a0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee4dc270b27645ec858356d83e0c78a0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee4dc270b27645ec858356d83e0c78a0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee4dc270b27645ec858356d83e0c78a0.png","size":""}]},{"name":"Negative A","url":"https://www.last.fm/music/Negative+A","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/96405138ff1f4d3db6ff8bfbb4a7b4b1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/96405138ff1f4d3db6ff8bfbb4a7b4b1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/96405138ff1f4d3db6ff8bfbb4a7b4b1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/96405138ff1f4d3db6ff8bfbb4a7b4b1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/96405138ff1f4d3db6ff8bfbb4a7b4b1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/96405138ff1f4d3db6ff8bfbb4a7b4b1.png","size":""}]},{"name":"Furyan","url":"https://www.last.fm/music/Furyan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3e510c4501758736dfd7c2efa99d4a1d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3e510c4501758736dfd7c2efa99d4a1d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3e510c4501758736dfd7c2efa99d4a1d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e510c4501758736dfd7c2efa99d4a1d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e510c4501758736dfd7c2efa99d4a1d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e510c4501758736dfd7c2efa99d4a1d.png","size":""}]},{"name":"Kasparov","url":"https://www.last.fm/music/Kasparov","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9085e52d4f6f41a49121d55bd878c319.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9085e52d4f6f41a49121d55bd878c319.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9085e52d4f6f41a49121d55bd878c319.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9085e52d4f6f41a49121d55bd878c319.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9085e52d4f6f41a49121d55bd878c319.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9085e52d4f6f41a49121d55bd878c319.png","size":""}]}]},"tags":{"tag":[{"name":"hardcore","url":"https://www.last.fm/tag/hardcore"},{"name":"Gabber","url":"https://www.last.fm/tag/Gabber"},{"name":"dance","url":"https://www.last.fm/tag/dance"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"electronic","url":"https://www.last.fm/tag/electronic"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Ruffneck/+wiki"}},"published":"12 Nov 2006, 13:58","summary":"1) Ruffneck was a house act consisting of Derek A. Jenkins, Dave Daniels, Dwayne Richardson, Shaheer Williams, Stephen B. Wilson, and Joanne Thomas aka Yavahn.  They debuted in 1987 with \"The Power - The Rhythm\", featuring Thomas' future co-member of Jomanda, Cheri Williams, on vocals.  They didn't emerge on the scene again until 1995, when their track \"Everybody Be Somebody\", featuring Yavahn, hit the dance charts worldwide.  They followed this up with several singles and the album New Life in 1999. <a href=\"https://www.last.fm/music/Ruffneck\">Read more on Last.fm</a>","content":"1) Ruffneck was a house act consisting of Derek A. Jenkins, Dave Daniels, Dwayne Richardson, Shaheer Williams, Stephen B. Wilson, and Joanne Thomas aka Yavahn.  They debuted in 1987 with \"The Power - The Rhythm\", featuring Thomas' future co-member of Jomanda, Cheri Williams, on vocals.  They didn't emerge on the scene again until 1995, when their track \"Everybody Be Somebody\", featuring Yavahn, hit the dance charts worldwide.  They followed this up with several singles and the album New Life in 1999.  Unfortunately Yavahn passed away in 2003 after a battle with colon cancer.  Ruffneck released a few more singles over the next couple of years featuring Yavahn's vocals.\n\n2) DJ Ruffneck - Patrick van Kerckhoven\n\nAt the age of 15 Patrick started playing in some local clubs. During that time he was inspired by the House Sound of Chicago, Detroit Techno, Kraftwerk, Georgio Moroder and the likes and was eager to produce similar music himself.\nAfter having played around youth houses, and in local clubs where he was actually being throwed out of because of playing \"his\" house music, Patrick was even more then ever convinced of the mission he just had to make.\nRemember that in the time Patrick was already busy with house music, most people on this side of the continent didn't even knew of the existence of the words \"House Music\", Jack, Jacking or \"The Warehouse\"!\nHowever, it took some years for Patrick to be able to move the spotlight on his person, but that just was a needed fase to go through.\nPatrick in the mean time kept on pushing House Music and send away tapes to loacl radio shows, but also to the regional shows who again turned the music down which nowadays can no longer be denied on any front in the charts or the clubs.\nFunny detail is that even the club who threw Patrick out their club for playing House Music later on asked him back to play in their club, when the sound and in the meantime also Patrick were both very popular :-)\n\n1989 - 1992\nThrough hard work he got himself a record deal and started 80 AUM Records together with his former partner, we nowadays refer to as Pinokkio.\nThe 80 AUM sound was nothing like the House Sound of Chicago; it was a new sound, unlike anyone had ever heard before then. The record company called it cult! And thus the first Dutch House record was released.\nThe 80 AUM label gained a lot of respect with hits like Mindcontroller, Dominator and artists like Incubus.These releases are among the biggest hits on the label together with Incubus, and are at the same time also among the biggest classics from that era.\nUnfortunately the record company and Patrick’s 80 AUM had a very different perspective on the running of a record label and managing new artists. After not having been paid for any of his hard work for two years in a row, Patrick decided to end the strained cooperation.\nPatrick left after the 11th release which was 'Mindcontroller'.\nIn 1992 he introduced a new label called Wipe Out. This label also presented modern and experimental music.\nIt was definitely the first Dutch label that brought the use of breakbeats to the surface as the last release featured a complete Breakbeat selection, something which had never been done before.\nWipe out records only released 3 records before Patrick decided to move on to the next level.\n\n1992 - 1998\nWipe Out turned out to be only a short excursion.\nIt was a break Patrick used to concentrate on his new plans. In the meanwhile a group of artists Patrick had signed to his 80 AUM label, “Human Recourse”, had started their own company called XSV Music and asked Patrick to help them out. Everyone involved thought this was a perfect opportunity for a fresh start. The perfect match had been made and success was inevitable. It was then that Patrick started the legendary Ruffneck Records label and produced over 250 tracks!\nRuffneck proliferate Dutch hardcore combined with breakbeats and a steady kickdrum. During this glorious time Patrick became famous under the alias DJ Ruffneck and he performed over a thousand times at the best raves clubs on the globe. Not only his DJ career was booming, but also a few of his pure underground hardcore productions managed to penetrate the charts. At the top of his career Patrick was again confronted with the problem of not getting paid. After his massive hit in the charts and the continued success of the Ruffneck merchandising line, XSV did not pay up. Patrick was forced to take legal actions, but before the lawsuit could even be completed XSV was declared bankrupt and Patrick ended up with nothing. At least he regained the rights to the masters of all his music he had produced and released while working with XSV.\n\n1999 - 2001\nIn 1998 DJ Ruffneck quit playing hardcore and decided to concentrate solely on the drum & bass scene. He was simply going back to his roots. In 1999 he started his own drum & bass label called Ruff-Teck. He handled production duties on the first release himself and the record did well enough for the label to remain alive. After the abrupt ending of the Ruffneck Record and the rapid lift-off of the Ruff-Teck label, Patrick had the strong feeling that he also had to continue working in the hardcore scene. His fans and producers convinced Patrick to go on and with that, in 1999, Supreme Intelligence and Gangsta Audiovisuals were created. Supreme Intelligence represented the newly invented Darkcore style, while Gangsta concentrated on the former Artcore and up-tempo productions. During this period sales in hardcore dropped drastically and the press stated that hardcore music was dead! It goes without saying that this affected Patrick's labels. People were complaining about the scene more and more.\nBesides that people and press seemed prone to being biased towards Gangsta & Supreme releases. That led to the forced end of these labels. Sales didn’t go up and Patrick was fed up by the ongoing prejudice the so-called ruling elite kept spitting.\n\n\n2002 - 2006\nTo avoid any further prejudice and to simultaneously fool the complete hierarchy of hardcore Patrick started Enzyme Records. A brand new name, image and above all: a label that managed to fool the entire music industry. Nobody knew Patrick was behind this top label until many years after it was started. Besides Enzyme and its sister labels Patrick expanded his company with other dance oriented labels; hardstyle, jumpstyle, industrial and hard techno were now all part of his ever-expanding business. He also produces most of the styles that his company releases and releases on the labels under various aliases.\n\nNowadays Patrick runs 11 dance labels and about 30 producers have joined him on his labels, and help him fulfill his desire to spread his vision of house music, which is what he calls the entire scene, which has all sprouted from the beat that started somewhere in a warehouse in Chicago... <a href=\"https://www.last.fm/music/Ruffneck\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
