{"artist":{"name":"Russ Morgan","mbid":"e9ef278b-740e-440e-97a7-7039ec589feb","url":"https://www.last.fm/music/Russ+Morgan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bbcb39ccc99d4dbd8afbe0bdfbf8c91b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bbcb39ccc99d4dbd8afbe0bdfbf8c91b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bbcb39ccc99d4dbd8afbe0bdfbf8c91b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bbcb39ccc99d4dbd8afbe0bdfbf8c91b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bbcb39ccc99d4dbd8afbe0bdfbf8c91b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bbcb39ccc99d4dbd8afbe0bdfbf8c91b.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"8820","playcount":"29762"},"similar":{"artist":[{"name":"Freddy Martin","url":"https://www.last.fm/music/Freddy+Martin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/87a895fc1c28412b85976aeac665c971.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/87a895fc1c28412b85976aeac665c971.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/87a895fc1c28412b85976aeac665c971.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/87a895fc1c28412b85976aeac665c971.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/87a895fc1c28412b85976aeac665c971.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/87a895fc1c28412b85976aeac665c971.png","size":""}]},{"name":"Sammy Kaye","url":"https://www.last.fm/music/Sammy+Kaye","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1a79e95230b44b87986145e147bb07d1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1a79e95230b44b87986145e147bb07d1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1a79e95230b44b87986145e147bb07d1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1a79e95230b44b87986145e147bb07d1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1a79e95230b44b87986145e147bb07d1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1a79e95230b44b87986145e147bb07d1.png","size":""}]},{"name":"Helen O'connell","url":"https://www.last.fm/music/Helen+O%27connell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f16bde4fea1d404a97f82f99de53c728.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f16bde4fea1d404a97f82f99de53c728.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f16bde4fea1d404a97f82f99de53c728.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f16bde4fea1d404a97f82f99de53c728.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f16bde4fea1d404a97f82f99de53c728.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f16bde4fea1d404a97f82f99de53c728.png","size":""}]},{"name":"Glen Gray","url":"https://www.last.fm/music/Glen+Gray","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8cb7a8cb669341298963d6b2908709cb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8cb7a8cb669341298963d6b2908709cb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8cb7a8cb669341298963d6b2908709cb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8cb7a8cb669341298963d6b2908709cb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8cb7a8cb669341298963d6b2908709cb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8cb7a8cb669341298963d6b2908709cb.png","size":""}]},{"name":"Charlie Spivak","url":"https://www.last.fm/music/Charlie+Spivak","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2d2650705da1493dbd777d2a8f5fd696.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2d2650705da1493dbd777d2a8f5fd696.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2d2650705da1493dbd777d2a8f5fd696.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2d2650705da1493dbd777d2a8f5fd696.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2d2650705da1493dbd777d2a8f5fd696.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2d2650705da1493dbd777d2a8f5fd696.png","size":""}]}]},"tags":{"tag":[{"name":"russ morgan","url":"https://www.last.fm/tag/russ+morgan"},{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"Big Band","url":"https://www.last.fm/tag/Big+Band"},{"name":"vocal","url":"https://www.last.fm/tag/vocal"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Russ+Morgan/+wiki"}},"published":"05 Oct 2008, 13:54","summary":"Russ Morgan (April 29, 1904 in Scranton, Pennsylvania – August 7, 1969 in Las Vegas, Nevada) was a Big Band orchestra leader.\n\nBorn into a Welsh family, Russ Morgan was encouraged to express himself musically from the tender age of seven. His ability had come naturally since his father, a coal-mine foreman, was a former musician who played drums in the local band in his spare time with his mother, before her marriage, had been a pianist in a vaudeville act. <a href=\"https://www.last.fm/music/Russ+Morgan\">Read more on Last.fm</a>","content":"Russ Morgan (April 29, 1904 in Scranton, Pennsylvania – August 7, 1969 in Las Vegas, Nevada) was a Big Band orchestra leader.\n\nBorn into a Welsh family, Russ Morgan was encouraged to express himself musically from the tender age of seven. His ability had come naturally since his father, a coal-mine foreman, was a former musician who played drums in the local band in his spare time with his mother, before her marriage, had been a pianist in a vaudeville act. Almost at the same age that he began to study piano, he began to work in the mines in order to earn money to help support his family and pay for his lessons.\n\nAt the age of fourteen, he earned extra money as a pianist performing in a theater in his hometown. With his extra money, he purchased another instrument: a trombone. In 1921, he used the trombone while working with a local band called the Scranton Sirens. This band became one of the hottest in the Pennsylvania area during the 1920s. In fact some of its alumni, such as Jimmy Dorsey on sax and clarinet, Billy Lustig on violin and Tommy Dorsey on trombone (who took Russ's place when he left the organization) went on to become famous.\n\n[edit] Early career\n\nAt eighteen, he decided to try and further his career by going to New York. By 1925, at the age of twenty-one, he arranged for both John Philip Sousa and Victor Herbert. He then continued to gain experience by joining Paul Specht's orchestra and toured throughout Europe with the orchestra. Contemporaries of Morgan's in this orchestra were among greats – names like Arthur Schutt, Don Lindley, Chauncey Morehouse, Orville Knapp, Paul Whiteman, Charlie Spivak and Artie Shaw also played in this orchestra during the 1920s.\n\nUpon returning from the European tour, Jean Goldkette invited him to Detroit to organize, lead and arrange for his new band. Some members of the now immortal all-star Goldkette orchestra were his old associates from former days. The band included Tommy and Jimmy Dorsey, Chauncey Morehouse, Joe Venuti, Eddie Lang, Bix Beiderbecke and Fuzzy Farrar.\n\nFor a short time, in 1934, he arranged for Fletcher Henderson's Orchestra. In 1935, he then played trombone with the Original Dixieland Jazz Band when they recorded four sides for Vocalion. On September 12, 1935, Russ playing piano and Joe Venuti on violin cut two sides for Brunswick, “Red Velvet” and “Black Satin.” Most of the songs were written by Russ and Joe.\n\n[edit] Radio work\n\nHis biggest success in the music world came when he was offered the post of Musical Director for Detroit Radio Station WXYZ. His show, \"Music in the Morgan Manner\", became one of the most popular radio shows. At one time, during his radio run, he was directing nine commercial programs. While in Detroit, he arranged for the Detroit 102 piece Symphony Orchestra thus demonstrating once again his varied musical experience and ability.\n\nIn the early 1930s, Russ was in an automobile accident that almost ended his career. After several months in the hospital he decided to start again in New York City. He became arranger for bands like the George White Scandals, The Cotton Club Revue and the Capitol Theatre. When not arranging for the various Broadway shows, he worked with leading orchestras in New York, such as Phil Spitalny, Eddie Gilligan, Ted Fio Rito and Freddy Martin, as pianist and/or trombonist.\n\nHe then joined the Freddy Martin Orchestra in 1934 as a piano player. He worked chiefly as trombonist and arranger with the band. While working with Martin's orchestra, he also worked as a musical director at Brunswick Records back in New York. It was here that he met the future Mrs. Morgan, Shirley Gray, whom he married in 1939.\n\n[edit] Career\n\nWhile at Brunswick, he met Rudy Vallee, who was impressed with Morgan's musical ability. He insisted he form an orchestra of his own. He then invited Russ to appear as a guest on his popular Fleishman Yeast radio show. Vallee was also instrumental in getting Morgan in his first engagement in New York City, along with his own orchestra at the Biltmore Hotel. This first engagement was indicative of the audiences' reaction to Morgan's appearances. He started with a four-week contract. But the contract extended and Morgan remained at the hotel for two years. In the next few years, he was able to add musical directorship to the Rinso-Lifebuoy Show on NBC for thirty-nine weeks and the Philip Morris radio series on NBC and CBS for two years to his growing list of achievements.\n\nSome of his other triumphs were his record-breaking runs in famed hotels, ballrooms and theatres across the country. A few of these engagements were at the Biltmore Hotel, Los Angeles; Claremont Hotel, California; Edgewater Beach Hotel, Chicago; Aragon and Trianon, Chicago; Strand, Chicago; the Statler Hotel, New York; Orpheum, Los Angeles; Palladium, Hollywood; to name a few.\n\n[edit] Chart success\n\nIn 1949, four songs he recorded made it big on the charts. They were \"So Tired\", \"Cruising Down the River\", \"Sunflower\" and \"Forever and Ever.\" On the latter he used a vocal quartet that was just starting out and would later become famous as the Ames Brothers. 1949 was his big year.\n\nAlan Herbert, the Morning Man on the American Forces Network Radio Station in Bremen, Germany played Morgan's \"So Tired,\" liked   the  tune  and played it  almost daily, to the  delight of his American and British audience in 1947-48. It was easily the most requested song played on the station. Herbert takes  some credit for putting it on the charts, as service men and women requested it from their local stations when they got back home.\n\n\n[edit] Later career / death\n\nDuring the 1950s, his orchestra continued to be a popular one for dancing and listening music. He continued to set house records with his appearances in California and New York as well as his many tours across the entire nation. During this decade, it was mostly the long-established veteran \"sweet bands\" that were supplying the music for dancers, and Russ Morgan was one of them. The veterans included Jan Garber, Sammy Kaye, Wayne King, Guy Lombardo, Freddy Martin and Lawrence Welk.\n\nIn 1958, Morgan's nineteen-piece band had been reduced to eleven men, with his sons Jack Morgan on trombone and David Morgan on guitar. In 1965, he was then booked for an eight-week engagement at the Top O' The Strip at the Dunes Hotel in Las Vegas. However, it ended up lasting until 1977, a total of twelve years.\n\nHe died in 1969 at the age of sixty-five. Morgan’s son, Jack, took over the leadership. He has led the band ever since.\n\nFor his contributions for recording, he has a \"Star\" on the Hollywood Walk of Fame. <a href=\"https://www.last.fm/music/Russ+Morgan\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
