{"artist":{"name":"RyanDan","mbid":"e30ba451-00f0-44a5-8518-85a08fbf290f","url":"https://www.last.fm/music/RyanDan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d86c7d35eef34c1997d2ec2f349b05df.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d86c7d35eef34c1997d2ec2f349b05df.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d86c7d35eef34c1997d2ec2f349b05df.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d86c7d35eef34c1997d2ec2f349b05df.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d86c7d35eef34c1997d2ec2f349b05df.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d86c7d35eef34c1997d2ec2f349b05df.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"37818","playcount":"320706"},"similar":{"artist":[{"name":"Amici Forever","url":"https://www.last.fm/music/Amici+Forever","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a726cc6430ff43f7bb5785a1e2a103f8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a726cc6430ff43f7bb5785a1e2a103f8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a726cc6430ff43f7bb5785a1e2a103f8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a726cc6430ff43f7bb5785a1e2a103f8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a726cc6430ff43f7bb5785a1e2a103f8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a726cc6430ff43f7bb5785a1e2a103f8.png","size":""}]},{"name":"Mario Frangoulis","url":"https://www.last.fm/music/Mario+Frangoulis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5cd8461e235f4be880ba66cb79407c86.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5cd8461e235f4be880ba66cb79407c86.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5cd8461e235f4be880ba66cb79407c86.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5cd8461e235f4be880ba66cb79407c86.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5cd8461e235f4be880ba66cb79407c86.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5cd8461e235f4be880ba66cb79407c86.png","size":""}]},{"name":"Patrizio Buanne","url":"https://www.last.fm/music/Patrizio+Buanne","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c5e00d63a5474c71b9e440c059865cd4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c5e00d63a5474c71b9e440c059865cd4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c5e00d63a5474c71b9e440c059865cd4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c5e00d63a5474c71b9e440c059865cd4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c5e00d63a5474c71b9e440c059865cd4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c5e00d63a5474c71b9e440c059865cd4.png","size":""}]},{"name":"Will Martin","url":"https://www.last.fm/music/Will+Martin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2834330a7c0a4ed1b053edd01571dc30.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2834330a7c0a4ed1b053edd01571dc30.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2834330a7c0a4ed1b053edd01571dc30.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2834330a7c0a4ed1b053edd01571dc30.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2834330a7c0a4ed1b053edd01571dc30.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2834330a7c0a4ed1b053edd01571dc30.png","size":""}]},{"name":"G4","url":"https://www.last.fm/music/G4","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8854085de4dc4f65a22ff3a1720ca383.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8854085de4dc4f65a22ff3a1720ca383.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8854085de4dc4f65a22ff3a1720ca383.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8854085de4dc4f65a22ff3a1720ca383.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8854085de4dc4f65a22ff3a1720ca383.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8854085de4dc4f65a22ff3a1720ca383.png","size":""}]}]},"tags":{"tag":[{"name":"Classical","url":"https://www.last.fm/tag/Classical"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"male vocalists","url":"https://www.last.fm/tag/male+vocalists"},{"name":"Canadian","url":"https://www.last.fm/tag/Canadian"},{"name":"ryan dan","url":"https://www.last.fm/tag/ryan+dan"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/RyanDan/+wiki"}},"published":"28 Sep 2007, 17:13","summary":"RyanDan isn't simply a play on the names of identical twins Ryan and Dan. It reflects an indivisible bond that runs so deeply that there is no discernible line where vocally one ends and the other begins. To hear them - and to connect to them - is to be taken on an emotional journey of rare intensity.\n\nGrowing up in Toronto, Canada, the youngest of five children, Ryan and Dan Kowarsky’s love of opera was spawned by the music of their childhood – the songs of the legendary Mario Lanza and the great Luciano Pavarotti. <a href=\"https://www.last.fm/music/RyanDan\">Read more on Last.fm</a>","content":"RyanDan isn't simply a play on the names of identical twins Ryan and Dan. It reflects an indivisible bond that runs so deeply that there is no discernible line where vocally one ends and the other begins. To hear them - and to connect to them - is to be taken on an emotional journey of rare intensity.\n\nGrowing up in Toronto, Canada, the youngest of five children, Ryan and Dan Kowarsky’s love of opera was spawned by the music of their childhood – the songs of the legendary Mario Lanza and the great Luciano Pavarotti. As teenagers they came to admire the pop harmonies of the Bee Gees, the melodies of Stevie Wonder and the smooth R&B vocals of Boyz II Men.\n\nGuided by their opera singing father, Ryan and Dan spent many evenings of their youth watching his performances from the side of the stage.\n\n“We never took vocal coaching or formal lessons,” says Dan. Yet their voices, which effortlessly slide from baritone to soprano, full voice to falsetto, have a stunning clarity and purity.\n\nThey have been performing on stage, in plays and musicals since they were about four years old. In high school they shared the lead role in Joseph and the Amazing Technicolor Dreamcoat, though no one else could be sure who was Joseph on any given night.\n\nIt was natural, then, that they should want to become performers, and at the age of 18, they (together with a friend) walked into the offices of Sony Music in Toronto. Through a combination of chutzpa, charm and luck, they secured an audition with the vice president and walked out with a record deal. The three subsequently performed as the boyband \"Before Four\" aka \"b-4-4\", which went on to release two full length albums that had considerable success, in fact going multi-platinum in Canada and Germany. Nevertheless, they gradually became dissatisfied with pop fare.\n\n“We reached a point at which the two of us felt that something was missing,” explains Ryan. “Dan and I have always tried to inject a lot of emotion into our singing and we wanted audiences to focus on vocal interpretation rather than on our hair. We decided that it was time to change direction and go back to our roots … to the kind of music we listened to as children.”\n\nThe emotion with which they sing is undeniable - and that emotion was evident during the recording process of their album. They composed “Tears of an Angel” in honour of their young niece Tal. “She was diagnosed with a malignant brain tumour and was undergoing chemotherapy at the time. We haven't played the song for her yet.” This was not their first encounter with life’s misfortunes. Their mother was recently diagnosed with Parkinson’s Disease.\n\nDespite the uncertainties in life, Ryan and Dan find much to celebrate. The energetic and uplifting song “High” (penned by seventies folk artist Judie Tzuke, also composer of another album track, “Like The Sun”) reflects their optimism and how they view life’s challenges.\n\nThe recording of the album was preceded by a process of elimination. To help them choose which songs they wanted on the album, they recorded over 50 songs before deciding on the final 12.\n\nThe album was produced by Steve Anderson (Kylie Minogue’s long-term musical collaborator), mixed by Ren Swan (Il Divo / KT Tunstall) and recorded in a private London recording studio owned by Grammy winning songwriter Terry Britten (Tina Turner's “What's Love Got To Do With It”). With a vintage Neve sound console once used by Pink Floyd, The Rolling Stones and The Beatles, and a microphone used by Frank Sinatra, the album combines Pro Tools technology and vintage recording equipment to beautifully create the rich orchestra accompaniment required for RyanDan's unique voices.\n\nThe fact that they are identical mirror-image twins - Dan being left handed and Ryan being right-handed - adds an extra dimension to their sound. When they harmonise they have the power of a duet yet they sound as one. “Even our parents don’t know who is singing which part,” Dan adds.\n\nThey have always shared a telepathic link. “If one of us was hurt, the other would feel pain at the same time, even if we were not together” explains Ryan. “This still happens sometimes.” Similarly their thoughts are often in harmony. One of them might start talking – only to have the other complete the sentence.\n\nAnd inevitably, as children, they would playfully swap identities. “Being identical twins enabled us to play all kinds of games with our teachers and our friends” says Ryan. “We were troublemakers during our teenage years, and probably drove everyone crazy. In some ways we are very similar” he adds, “particularly with regard to staying positive. Also, we’re both very open and introspective - we get that from our mother. In other ways, we’re different. Dan tends to be more intense than I am. I’m a little more laid back.”\n\n“It's extremely important to us that our music reflects the depth and strength of our emotions. We pour our hearts and our souls into our singing, and we want people to feel that passion.”\n\n“We think of the album like a meal. Starting with an appetizer, you get into your main course and finish with dessert, and hopefully after you've devoured the whole record you'll feel satisfied like you do after a great meal,” they say, complementing each other in speech as in song.\n\nSomewhere deep in their souls, their past and present fused together and is reflected in their astonishing debut album – one that is powerful and pure and is destined to turn these brothers into international stars.  <a href=\"https://www.last.fm/music/RyanDan\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
