{"artist":{"name":"SAF","mbid":"b3eba304-cafe-4d0e-847f-26a4889cf2e7","url":"https://www.last.fm/music/SAF","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ee49121d20ca48b79332d11f073d19a8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ee49121d20ca48b79332d11f073d19a8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ee49121d20ca48b79332d11f073d19a8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee49121d20ca48b79332d11f073d19a8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee49121d20ca48b79332d11f073d19a8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee49121d20ca48b79332d11f073d19a8.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"2453","playcount":"33257"},"similar":{"artist":[{"name":"cista okolina","url":"https://www.last.fm/music/cista+okolina","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/63f8000217f2433bc32f0f7c80a3becc.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/63f8000217f2433bc32f0f7c80a3becc.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/63f8000217f2433bc32f0f7c80a3becc.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/63f8000217f2433bc32f0f7c80a3becc.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/63f8000217f2433bc32f0f7c80a3becc.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/63f8000217f2433bc32f0f7c80a3becc.png","size":""}]},{"name":"Da Dzaka Nakot","url":"https://www.last.fm/music/Da+Dzaka+Nakot","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7a2fc762ec504441a3c4feab46f9a9a5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7a2fc762ec504441a3c4feab46f9a9a5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7a2fc762ec504441a3c4feab46f9a9a5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7a2fc762ec504441a3c4feab46f9a9a5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7a2fc762ec504441a3c4feab46f9a9a5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7a2fc762ec504441a3c4feab46f9a9a5.png","size":""}]},{"name":"Legijata","url":"https://www.last.fm/music/Legijata","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/69952dfa995e4c49aea55cae97c570fb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/69952dfa995e4c49aea55cae97c570fb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/69952dfa995e4c49aea55cae97c570fb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/69952dfa995e4c49aea55cae97c570fb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/69952dfa995e4c49aea55cae97c570fb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/69952dfa995e4c49aea55cae97c570fb.png","size":""}]},{"name":"RNS","url":"https://www.last.fm/music/RNS","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/78b20805af0347ceb99ab9cfce518934.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/78b20805af0347ceb99ab9cfce518934.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/78b20805af0347ceb99ab9cfce518934.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/78b20805af0347ceb99ab9cfce518934.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/78b20805af0347ceb99ab9cfce518934.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/78b20805af0347ceb99ab9cfce518934.png","size":""}]},{"name":"Dope Reach Squad","url":"https://www.last.fm/music/Dope+Reach+Squad","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/93b5dd541bf348308e5e11db12a66666.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/93b5dd541bf348308e5e11db12a66666.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/93b5dd541bf348308e5e11db12a66666.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/93b5dd541bf348308e5e11db12a66666.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/93b5dd541bf348308e5e11db12a66666.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/93b5dd541bf348308e5e11db12a66666.png","size":""}]}]},"tags":{"tag":[{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"rap","url":"https://www.last.fm/tag/rap"},{"name":"mk rap","url":"https://www.last.fm/tag/mk+rap"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"underground rap","url":"https://www.last.fm/tag/underground+rap"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/SAF/+wiki"}},"published":"21 May 2007, 23:09","summary":"There is more than one artist with this name\n\n1. The band \"SAF\" is formed in 1993 by Smilen Dimitrov, Goce Trpkov and Mitko Gatarovski. In their beginning, they actively work on their demo material, that made them one of the first demo rap artists to be presented on the music radio \"Kanal 103\", within the specialized hip-hop radio show \"Crna Hronika\". From 1993 to 1996 they work as a demo band. Their first studio recording, named \"Mis Ston\", was made in 1996 at the \"Cyberspace\" studio. <a href=\"https://www.last.fm/music/SAF\">Read more on Last.fm</a>","content":"There is more than one artist with this name\n\n1. The band \"SAF\" is formed in 1993 by Smilen Dimitrov, Goce Trpkov and Mitko Gatarovski. In their beginning, they actively work on their demo material, that made them one of the first demo rap artists to be presented on the music radio \"Kanal 103\", within the specialized hip-hop radio show \"Crna Hronika\". From 1993 to 1996 they work as a demo band. Their first studio recording, named \"Mis Ston\", was made in 1996 at the \"Cyberspace\" studio. The track reaches instant success within the \"Roze Kadilak\" chart on the Kanal 103, being voted number one by its audience and remaining there for a long time. The very same happens with the following recordings, \"Stihovna Gimnastika\" and \"Fatamorgana\". Along with the studio work, the band has worked on its live performances. The first live act takes place on 26 january 1996 in Bitola, at the \"No Drugs\" festival that featured domestic and bands from the neighboring countries. The following appearance is at the \"Future Sound of Skopje\" festival on the 1 may 1996 at the \"Dali\" club, where other significant artist from the macedonian electronic scene performed. \n\nIn 1997, the band has the honour of performing at the opening night of the Skopje Summer Festival 97, along with respected artists from the domestic and foreign scene. Later on, in october, they perform at the concert organized by Kanal 103 to celebrate the 103th show of it's \"Crossroads\" program, in the M1 studio of the national Macedonian Television. Next comes the appearance at the \"Tribal Gathering III\" festival on 12.12.1997 at the \"Park\" discotheque, presenting artists belonging to the macedonian electronic scene. Among the more interesting and the more important events, stands out the joint concert with the french hip hop group \"Monsieur Zoo\", which took place due to the days of the francophony in Macedonia, organized by the Centre Culturel Français in Skopje in march 1998. The most important and the most controversial event for the band occurs on 1 june 1998. It was the first solo concert of the band, recorded by the national Macedonian Television. It was not, and still isn't, broadcasted as arranged due to the preelection atmosphere in the Republic of Macedonia at the time, most likely because of the political implications of the lyrics in their song titled \"Skopska Situacija\". The lyrics were published by the biweekly magazine \"Forum\" during the entire hype surrounding the act and the censorship thereof. Their concert activity continues on the June 7th, where they perform at the grand finale of the basketball tournament \"Adidas Streetball Challenge\" in Skopje. The last show was held on the 1st of July 1999, within the Macedonian Centre for International Cooperation campaign for promotion of tolerance, entitled \"Celo e koga ima se\". The activities of the group members outgrow the usual concepts of a purely recording and concert engagement of a musical group. In 1996, at the \"Pony\" club, the first continuous streak of hip hop parties ever, occur under the organization of Mitko Gatarovski, every Saturday during 1996 and 1997, where the \"freestyle\" way of live rhyming was introtuced for the first time. The group conceives the first hip hop television show in Macedonia called \"Hiphopteza\" hosted by Mitko Gatarovski, broadcasted during the entire year of 1997 on A1 television. In 1998, the transmission of the first hop hop radio show \"Hiphopteza\" to cover the entire teritory of the Republic of Macedonia begins on the airwaves of A1 radio. The \"SAF\" production team also works with producing material for other bands from the macedonian hip hop scene, aiming to improve the quality of the scene's releases, and therefore attempting to expand the scene and the entire hip hop culture. The media coverage of the band, besides the presence of it's music on the elctronic media, is also manifested through interviews given for Kanal 103, the Second Programme of the national Macedonian Radio, Kanal Herc, and the newspapers \"Mlad Borec\", \"Studentski Zbor\" and \"Grad\". \n\n\nA music video has been made for the song entitled \"Safari\" which at the moment represents the peak of the domestic music video production in Macedonia. The group is also present on the Internet, through own website http://www.saf.com.mk and also through the Skopje clubbing and artists information bulletin \"Skopje Clubbing Online\" which can be found at: http://www.skopjeonline.com.mk/skclubbing. The band has been working on its studio releases throughout all this time, which brought about the material for their first album, entitled \"Safizam\" which you can download here http://frekvencii.com/albumi/id/2522/saf-safizam.html. On 19.01.2001 is their definitely most important performance the concert for the promotion of the LP Safizam together with one of the most eminent Hip Hop crews of all times, the group Das Efx from New York, which was organized and promoted by Balance. On 22.12.2001 Saf are performing in the K4 club in Ljubljana, Slovenia on the international Street Explosion Festival. On 10.02.2002, with the performance from Dj FU (RadYoYo, Slovenia) , in the club Element, SAF did the promotion of the vinyl reissue of Safizam on a limited 3LP set which is the first Hip Hop LP released on vinyl on the Balkans and further. Along this it was also an introduction for their new label and promoting agency Bootlegz entertainment and the start of the new era of club parties with eminent guests under their organization. Bootlegz ent. \n\nOrganized parties with Dj FU (RadYoYo, Slovenia), Dj Rondevu (Das Efx-Dangerous Minded, N.Y.), Dj DVS (Coolio, L.A.), Dj Ron Phlatline (C.E.O. Phlatline records, Germany), Dj 279 (UK), Dj Phat Phillie (Blackout, Croatia), Dj KPaw (RadYoYo, Slovenia), Dj Stancho (Sniper rec., Bulgaria), Dj Kut L (Grand Agent, Germany).. On 15.06.2003 an event called Bootlegz Fest took place with live performances from SAF and the famous underground artist Grand Agent (Phillie,USA). The same month SAF performed on the international Hip Hop festival in Sofia, Bulgaria - Balkan Fest. In beginning of 2003 Bootlegz ent. Also released their first official mixtape Bootlegz Mixtape vol.1 mixed by Goce Trpkov and Hosted by Mitko Gashtarovski which included two unreleased SAF tracks. In 2005 SAF put out a track on RadYoYos first official mixtape release Hiphop Miksmash Vol.1 mixed by Dj FU and released for Ts3/Matrix Music , check www.radyoyo.si/miksmash Also, made apperiance on Dj Rondevus DVD Dangerous Minded part 2, on which Goce Trpkov co-produced the score, check www.djrondevu.com On 18th of june SAF did a show at Mega3ce streetball finals in Ljubljana, Slovenia as guests of RadYoYo. On 1st of august 2005 SAF did a full live show at Coca-Cola Sound Festival in front of more than 2000 fans and hosted Dj Rondevu for the event. On 19th October 2005 SAF appeared on MTV Adria with their video for the song Race Gore as first Macedonian Hip-Hop artists on any MTV network, One month later MTV Adria aired a complete episode of MTV Block dedicated to SAF and Bootlegz. In this moment SAF are working on their next release entitled Safir, on the Bootlegz Vol.2 mixtape, Producing tracks for various artists (Together with Ghetto Penthouse entertainment N.Y.), And as Bootlegz entertainment hosting various shows on the radio, Club parties and artist promotions.\n\n2. SAF Formed in the romantic effervescence of Paris, SAF comprises of Marianne Elise and Eat Gas (Jeff) – a brother/sister duo who, despite their histories with the likes of Yuksek, Nouvelle Vague and FareWell Poetry, have only now forged a musical partnership – alongside mentor and co-conspirator Darius Keeler of Archive.\n\nBlending a shared love of the likes of Sonic Youth, PJ Harvey, Can and their beloved musical heritages, SAF have unleashed ‘BAM!’ as their introductory statement to the world. Imbibed with an emphatic youthful snarl and blistering intensity, it shows the band as one to be reckoned with more than most in its crescendoed madness. Razor-sharp guitars slash around Marianne’s punk wails, before culminating in a stadium-worthy, anthemic swagger of an ending.\n\n“There's such a diverse range of sleazy fucked up songs on our album, too”, says Jeff. “BAM! is just the first example of what we do. It's a perfect introduction to the band's music as it shows SAF with the accelerator pedal down.”\n\nHaving taken the trip over to London’s infamous RAK Studios to put their new work to record, SAF are set to come over to the UK again for their debut shows before the end of July. <a href=\"https://www.last.fm/music/SAF\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
