{"artist":{"name":"Saga","mbid":"f75cbb81-e419-4146-9eed-d6fa69a5a267","url":"https://www.last.fm/music/Saga","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7f29169f54ce43c0a3e337dd6e7ee771.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7f29169f54ce43c0a3e337dd6e7ee771.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7f29169f54ce43c0a3e337dd6e7ee771.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f29169f54ce43c0a3e337dd6e7ee771.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f29169f54ce43c0a3e337dd6e7ee771.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f29169f54ce43c0a3e337dd6e7ee771.png","size":""}],"streamable":"0","ontour":"1","stats":{"listeners":"87992","playcount":"1624098"},"similar":{"artist":[{"name":"Pallas","url":"https://www.last.fm/music/Pallas","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7808ec8e795f4a58aa933355c6c4e187.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7808ec8e795f4a58aa933355c6c4e187.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7808ec8e795f4a58aa933355c6c4e187.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7808ec8e795f4a58aa933355c6c4e187.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7808ec8e795f4a58aa933355c6c4e187.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7808ec8e795f4a58aa933355c6c4e187.png","size":""}]},{"name":"Arena","url":"https://www.last.fm/music/Arena","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/70c8ff448390412db3ae72b1a0572f48.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/70c8ff448390412db3ae72b1a0572f48.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/70c8ff448390412db3ae72b1a0572f48.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/70c8ff448390412db3ae72b1a0572f48.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/70c8ff448390412db3ae72b1a0572f48.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/70c8ff448390412db3ae72b1a0572f48.png","size":""}]},{"name":"IQ","url":"https://www.last.fm/music/IQ","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bfad59c9dd6044a5aff88d11c43ee573.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bfad59c9dd6044a5aff88d11c43ee573.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bfad59c9dd6044a5aff88d11c43ee573.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bfad59c9dd6044a5aff88d11c43ee573.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bfad59c9dd6044a5aff88d11c43ee573.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bfad59c9dd6044a5aff88d11c43ee573.png","size":""}]},{"name":"Kayak","url":"https://www.last.fm/music/Kayak","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7fdfd50a71f34ec7903520c0db376f23.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7fdfd50a71f34ec7903520c0db376f23.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7fdfd50a71f34ec7903520c0db376f23.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7fdfd50a71f34ec7903520c0db376f23.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7fdfd50a71f34ec7903520c0db376f23.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7fdfd50a71f34ec7903520c0db376f23.png","size":""}]},{"name":"Manfred Mann's Earth Band","url":"https://www.last.fm/music/Manfred+Mann%27s+Earth+Band","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/95c98248ca877b1b6b90dfccb6efd73b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/95c98248ca877b1b6b90dfccb6efd73b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/95c98248ca877b1b6b90dfccb6efd73b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95c98248ca877b1b6b90dfccb6efd73b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95c98248ca877b1b6b90dfccb6efd73b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95c98248ca877b1b6b90dfccb6efd73b.png","size":""}]}]},"tags":{"tag":[{"name":"Progressive rock","url":"https://www.last.fm/tag/Progressive+rock"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"Canadian","url":"https://www.last.fm/tag/Canadian"},{"name":"RAC","url":"https://www.last.fm/tag/RAC"},{"name":"80s","url":"https://www.last.fm/tag/80s"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Saga/+wiki"}},"published":"16 Feb 2006, 09:09","summary":"There are multiple artists named \"Saga\".\n\nSaga is \n\n1) A progressive rock quintet, formed in Oakville, Ontario, Canada. Bassist-keyboardist Jim Crichton and Welsh-born vocalist Michael Sadler have been the principal songwriters for Saga. Originally known as The Pockets, Saga formed in 1977 from the nucleus of Canadian rock band Fludd. In June 1978, they released their self-titled debut album. Their 1979 follow-up album Images at Twilight gave them <a href=\"https://www.last.fm/music/Saga\">Read more on Last.fm</a>","content":"There are multiple artists named \"Saga\".\n\nSaga is \n\n1) A progressive rock quintet, formed in Oakville, Ontario, Canada. Bassist-keyboardist Jim Crichton and Welsh-born vocalist Michael Sadler have been the principal songwriters for Saga. Originally known as The Pockets, Saga formed in 1977 from the nucleus of Canadian rock band Fludd. In June 1978, they released their self-titled debut album. Their 1979 follow-up album Images at Twilight gave them their first charting single in Canada with the song \"It's Time\" peaking at #84 in the Canadian Charts. Saga's next album, Silent Knight was released in 1980 and in 1981, the band's 4th album Worlds Apart was released. Following on the success of Worlds Apart, the band won the 1982 Juno Award for \"Most Promising Group of the Year.\n\nA 5th album Heads or Tales was released in late 1983 and became another success. Their 6th album Behaviour was released in 1985, and included the singles: \"Listen to Your Heart\" and \"What Do I Know\" (#57 Canada). In 1986, Steve Negus and Jim Gilmour left the band over management concerns. Saga continued to record and tour, with Michael Sadler and the Crichton brothers augmented by session musicians. Their 1987 release Wildest Dreams enjoyed better distribution under new label, Atlantic Records, but it failed to match expectations in America. For 1989's The Beginner's Guide to Throwing Shapes, Saga refocused on their earlier European popularity which marked a return to their earlier progressive style. \n\nIn 1993, Steve Negus and Jim Gilmour returned to Saga. The band's next album, The Security of Illusion, was well received by Saga fans in Canada and Europe. The 1994 followup, Steel Umbrellas, was considered uneven when compared to their previous release, perhaps due the material originally being produced for the short-lived television series Cobra. In 1995, Jim Crichton composed and produced the majority of Saga's next album, the conceptual Generation 13. Saga's next release, Pleasure and the Pain was released on the eve of their 26th anniversary tour in 1997. The album failed to maintain the interest created by the previous release. On the same anniversary tour the album Phase 1 was released. Their 1998 tour was captured on the next album, Detours, a double-live album released worldwide. \n\nSaga's next three albums, 1999's Full Circle, 2001's House of Cards and Marathon released in 2003 have been all been popular with the band's longtime and loyal fanbase. House of Cards, in particular enjoyed renewed interest. Saga released a new studio album, Network, in the fall of 2004. Their next album, Trust, was released in 2006, featuring Brian Doerner as their new drummer. \n\nDespite the band's fluctuating musical styles and limited commercial success, their fans have remained extremely loyal over the decades. Their musical style was defined by Ian Crichton's staccato guitar riffs, often in harmony with a synthesizer, and complex keyboard arrangements, frequently featuring three players. \n\nThe band's multi-song cycle \"The Chapters\" spanned their first four albums and were continued on later releases beginning in 1999. Songs from the cycle have been performed in concert throughout their career.\n\nOn January 16, 2007, it was announced by InsideOut, the band's current record label, that lead singer Michael Sadler would be leaving Saga for personal reasons at the end of 2007. \"10,000 Days\" was released on November 6, 2007 in conjunction with their planned European tour. As of 15 April 2008, Saga announced that Rob Moratti of Toronto, former singer of Final Frontier, has become their new lead vocalist. In 2009 the release of Saga's first cd with Rob Moratti. This CD is titled The Human Condition and was released in the spring 2009. The band also was touring in both Europe and Canada. On January 28, 2011, an official statement was made announcing Michael Sadler's return as the lead singer of Saga.\n\n2) A Swedish white nationalist singer-songwriter, with racist tendencies. She started as the vocalist for Symphony of Sorrow, but become widely known for her tribute CDs to Ian Stuart and Skrewdriver. More recently she has begun to produce original material as part of her solo career.\n\nIn a 2005 Discovery Times production she was described as a performer that “targets the mainstream by softening her image, while still maintaining her racist ideology.” She has been described as the “Swedish Madonna of the far right.” In the Discovery interview Saga said, “What makes me different is I think that I’m a lot more mainstream looking in that I’m very much toned down compared to the other [nationalist singers]. It’s not in your clothes. It’s not in the way you dress. It’s not in your appearance. It’s what’s in your heart. It’s a lot easier for the mainstream public to see themselves in me” she went on to say “most people do have the same beliefs that I do. It’s a bad thing to be labeled a racist these days, and it’s such a bad thing that people [would] rather shut up than express what they feel.”\n\nSaga was featured on the front cover of the Fall 2000 edition of Resistance Magazine, a production of the now defunct Resistance Records. Shaun Walker wrote the following at the website for the National Alliance, a pro white advocacy group in the US: “… just having her in front of the camera helps our Cause. But, she also is quite good at interviews. She comes across as the girl-next-door, who also understands the dynamics of racial conflict.”\n\n3) a Swedish 70’s band.\n\n4) a Dutch progressive rock band. They released one album, entitled To Whom It Concerns, in 1977.\n\n5) a Japanese band best known by the opening and ending of the TV show based on the Viewtiful Joe videogame\n\n6) a Portuguese Progressive/Symphonic Rock from the 1970’s. Their best-known work is the 1976 album Homo Sapiens. After the demise of the band, the members followed very diversified careers in different types of music.\n\n7) a Mexican Progressive/Hard Rock band. Their 2006 debut album El Camino a Titán was released under the independent Mexican label GravisRecords.\n\n8) A Lithuanian jazz quartet consisting of Andrė Pabarčiūtė - vocal, piano, Liudas Mockūnas - reeds, Vytis Nivinskas - bass, Marijus Aleksa - percussion. They've released an album by the same name.\n\n9) Irish grime producer currently living in London, released his debut EP Crescent via fellow London producer Visionist's Lost Codes label.\n\n10) A hip hop artist from Brooklyn, New York. <a href=\"https://www.last.fm/music/Saga\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
