{"artist":{"name":"Seal","mbid":"f053ae01-dae6-4aae-9883-e8c279fdbef4","url":"https://www.last.fm/music/Seal","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2992a7864f3146e7839f8b21b6073acc.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2992a7864f3146e7839f8b21b6073acc.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2992a7864f3146e7839f8b21b6073acc.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2992a7864f3146e7839f8b21b6073acc.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2992a7864f3146e7839f8b21b6073acc.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2992a7864f3146e7839f8b21b6073acc.png","size":""}],"streamable":"0","ontour":"1","stats":{"listeners":"1034092","playcount":"12711011"},"similar":{"artist":[{"name":"Simply Red","url":"https://www.last.fm/music/Simply+Red","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/63aa5e9fef5d081f06b27d4ce1e14d2e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/63aa5e9fef5d081f06b27d4ce1e14d2e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/63aa5e9fef5d081f06b27d4ce1e14d2e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/63aa5e9fef5d081f06b27d4ce1e14d2e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/63aa5e9fef5d081f06b27d4ce1e14d2e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/63aa5e9fef5d081f06b27d4ce1e14d2e.png","size":""}]},{"name":"Annie Lennox","url":"https://www.last.fm/music/Annie+Lennox","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dbd3cb1bce4c488ec880647ee49023c1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dbd3cb1bce4c488ec880647ee49023c1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dbd3cb1bce4c488ec880647ee49023c1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dbd3cb1bce4c488ec880647ee49023c1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dbd3cb1bce4c488ec880647ee49023c1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dbd3cb1bce4c488ec880647ee49023c1.png","size":""}]},{"name":"Lisa Stansfield","url":"https://www.last.fm/music/Lisa+Stansfield","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bac3a4484d7e8cbeae47a13b535aed58.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bac3a4484d7e8cbeae47a13b535aed58.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bac3a4484d7e8cbeae47a13b535aed58.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bac3a4484d7e8cbeae47a13b535aed58.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bac3a4484d7e8cbeae47a13b535aed58.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bac3a4484d7e8cbeae47a13b535aed58.png","size":""}]},{"name":"George Michael","url":"https://www.last.fm/music/George+Michael","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a4d913577f72442b853fb348e184c0e3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a4d913577f72442b853fb348e184c0e3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a4d913577f72442b853fb348e184c0e3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a4d913577f72442b853fb348e184c0e3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a4d913577f72442b853fb348e184c0e3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a4d913577f72442b853fb348e184c0e3.png","size":""}]},{"name":"Terence Trent D'Arby","url":"https://www.last.fm/music/Terence+Trent+D%27Arby","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b438e8eea83b4266bb80d61491290142.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b438e8eea83b4266bb80d61491290142.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b438e8eea83b4266bb80d61491290142.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b438e8eea83b4266bb80d61491290142.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b438e8eea83b4266bb80d61491290142.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b438e8eea83b4266bb80d61491290142.png","size":""}]}]},"tags":{"tag":[{"name":"soul","url":"https://www.last.fm/tag/soul"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"90s","url":"https://www.last.fm/tag/90s"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Seal/+wiki"}},"published":"30 Mar 2006, 01:02","summary":"Seal Henry Olusegun Olumide Adeola Samuel (born February 19, 1963 in Paddington, London) is a Grammy award winning English soul singer-songwriter of Nigerian and Brazilian descent, professionally known only by his first name, Seal. A childhood battle with discoid lupus left him with distinctive facial scarring and hair loss. He released his debut studio album Seal in 1991 and has since released 1994's Seal II, 1998's Human Being, 2003's Seal IV, 2007's System and 2010's Commitment. <a href=\"https://www.last.fm/music/Seal\">Read more on Last.fm</a>","content":"Seal Henry Olusegun Olumide Adeola Samuel (born February 19, 1963 in Paddington, London) is a Grammy award winning English soul singer-songwriter of Nigerian and Brazilian descent, professionally known only by his first name, Seal. A childhood battle with discoid lupus left him with distinctive facial scarring and hair loss. He released his debut studio album Seal in 1991 and has since released 1994's Seal II, 1998's Human Being, 2003's Seal IV, 2007's System and 2010's Commitment. He has also released four live albums and three greatest hits collection albums. He is married to German supermodel Heidi Klum and they have three children together.\n\nMusic career\n\nAfter a short time singing in local clubs and bars, in the 1980s, he joined Push, a British funk band, and toured with them in Japan. In Asia, he joined a blues band in Thailand for a while before separating from the group and journeying throughout India on his own. Seal returned to England, sleeping on the couch of friend Julian Bunster, then a model. He sometimes asked him \"Do I sing well?\"; to which he often met the response that he sang better than most current artists. His break came when he met the producer Adamski. He was given the lyrics of the song \"Killer\", which was a huge hit in 1990.\n\nSeal (1991) \n\nAs the vocalist on the Adamski single \"Killer\", Seal became a hot property when the single reached number one in 1990 in the UK. Like many other Adamski tracks, the single was also a hit in night clubs. Seal subsequently signed to ZTT Records and released his debut album (produced by Trevor Horn), titled Seal, in 1991. Two versions of the album are known to be in circulation: the original \"premix\" version and a second, more common version with an updated mix. This is attributed to the demand for a produced single rushing the final album edit, and as Seal puts it, his and producer Horn's \"inability to let go.\" The album was positively received by critics and the singles \"Crazy\", \"Future Love Paradise\", and his own rendition of \"Killer\" from the album all performed well on the charts, with \"Crazy\" becoming a big worldwide hit, reaching the number one in several countries.  Excerpts from \"Crazy\" have been used as commercial background music, and  more recently, Alanis Morissette has covered it.\n\nSeal (1994)\n\nHis second album, also eponymous, was released in 1994. A critical success, the album featured the singles \"Prayer for the Dying\" and \"Newborn Friend\", receiving a Grammy nomination for Album of the Year. A third single, \"Kiss from a Rose\", performed modestly when released but was later featured in the film Batman Forever which resulted in its worldwide success. It went on to win Grammy Awards for Record of the Year and Song of the Year in 1996 and became Seal's best performing single in the US market. Later, he recorded a cover of Steve Miller Band's \"Fly Like an Eagle\" for the soundtrack of the film Space Jam, which was again a hit.\n\nHuman Being (1998)\n\nFour years after the release of his previous album, in 1998, Seal released Human Being. The album was the product of a turbulent time in his life, including a split and later reconciliation with producer Horn as well as Seal's parting with ZTT Records and his signing with Warner Bros. Records in 1997. The record was critically panned upon its release. However, it received Gold record certification by the RIAA just two months after its release date. The album provided three singles, \"Human Beings\", \"Latest Craze\", and \"Lost My Faith\".\n\nFailed Album: Togetherland\n\nIn 2001, fans awaited the arrival of a new album, announced as Togetherland. However, after a protracted post-production period the album was cancelled in its entirety. The official word was that Seal simply didn't think it made the grade, although this conflicts with other reports that said the album was turned down by the label, which felt that it wouldn't be commercially successful. Although one single was released from the album. \"This Could Be Heaven\" was released in the US and featured on the Family Man soundtrack. Since December 2006, Seal has been indicating that, while still feeling the album as a whole is \"not worthy\", he plans to excerpt certain cuts from Togetherland and make them available for streaming download.\n\nMeanwhile, Seal made something of a comeback in dance and club scene when he co-wrote and provided vocals for the hit single \"My Vision\" from Jakatta in 2002.\n\nSeal (2003)\n\nIn 2003, Seal released his fourth album, which was again self-titled, except for Australia, where it was released under Seal IV. Although it did not sell as much as either of his first two albums, this release brought him back into the public eye in the United States and continental Europe. Singles from the album included \"Waiting For You\", \"Get It Together\", and \"Love's Divine\" (released in 2004, and a big hit in several European countries).\n\nGreatest Hits Album: Best 1991-2004\n\nIn 2004, a greatest hits album entitled Seal: Best 1991-2004 was released, including a cover of the Bacharach / David classic \"Walk on By\" and a cover of Echo and the Bunnymen's song \"Lips Like Sugar\".\n\nLive In Paris (2004)\n\nAlso in 2004, Seal performed a couple of shows at the Olympia Theatre in Paris, France. The July 6, 2004 show was recorded and released about one year after as CD/DVD package, simply titled Live In Paris.\n\nOne Night To Remember (2006)\n\nIn June 2005, Seal recorded a special concert which was subsequently released in 2006 entitled One Night To Remember as CD/DVD whereby the DVD includes a special \"the making of\" documentary in addition to the live performance. Recorded in a historic steel mill, the Altes Kesselhaus ('old boiler house'), in Düsseldorf, Germany, this 16-track package includes a special version of Brahms' Lullaby which Seal sings in German and then in English for the exclusive audience. Unusually, he is accompanied by his band, and a full orchestra comprised of 52 musicians and singers. This CD/DVD is not yet available in the USA.\n\nSystem (2007)\n\nDuring his 2007 spring tour, Seal announced his new album, System, which was released in 2007. He said it would be more dance-oriented, apparently a return to the roots of his first album. Years active 1989 - present.\n\nSoul (2008)\nMain article: Soul (album)\nSeal's sixth studio album Soul was released on 11 November 2008, in the United States and 3 November 2008, internationally, and contains eleven soul classics produced by David Foster.[13][14] The video for the first single, a cover of Sam Cooke's \"A Change Is Gonna Come\" is up on his official YouTube page. As well, he will be mentoring the top 9 on Deutschland sucht den Superstar and performing one of his songs from the album.\nSeal coached the participants of Germany's TV show \"Deutschland sucht den Superstar\" (Popidol) in February/March 2009.[15]\n\nHits\nMain article: Hits (Seal album)\nOn 4 December 2009, Hits, a compilation album was released. It contains two new tracks, \"I Am Your Man\" and \"Thank You\".\n\n7 (2015)\n <a href=\"https://www.last.fm/music/Seal\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
