{"artist":{"name":"Selena","mbid":"04b97d63-b900-4e2e-92dc-a4331ddc95a6","url":"https://www.last.fm/music/Selena","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8334f2713c814881a8af3a1d8dbc37d6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8334f2713c814881a8af3a1d8dbc37d6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8334f2713c814881a8af3a1d8dbc37d6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8334f2713c814881a8af3a1d8dbc37d6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8334f2713c814881a8af3a1d8dbc37d6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8334f2713c814881a8af3a1d8dbc37d6.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"184877","playcount":"2358001"},"similar":{"artist":[{"name":"Paulina Rubio","url":"https://www.last.fm/music/Paulina+Rubio","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0ea63d36536133962010d2b3c688471e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0ea63d36536133962010d2b3c688471e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0ea63d36536133962010d2b3c688471e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0ea63d36536133962010d2b3c688471e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0ea63d36536133962010d2b3c688471e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0ea63d36536133962010d2b3c688471e.png","size":""}]},{"name":"Gloria Trevi","url":"https://www.last.fm/music/Gloria+Trevi","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/35aec0d77bc74c16b3d9020100d9d43f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/35aec0d77bc74c16b3d9020100d9d43f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/35aec0d77bc74c16b3d9020100d9d43f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35aec0d77bc74c16b3d9020100d9d43f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35aec0d77bc74c16b3d9020100d9d43f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35aec0d77bc74c16b3d9020100d9d43f.png","size":""}]},{"name":"Thalía","url":"https://www.last.fm/music/Thal%C3%ADa","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/84c3d82d42784dae9aa79124d8ce5c9c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/84c3d82d42784dae9aa79124d8ce5c9c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/84c3d82d42784dae9aa79124d8ce5c9c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84c3d82d42784dae9aa79124d8ce5c9c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84c3d82d42784dae9aa79124d8ce5c9c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84c3d82d42784dae9aa79124d8ce5c9c.png","size":""}]},{"name":"Juan Gabriel","url":"https://www.last.fm/music/Juan+Gabriel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4dcf305d2e370678739924b702aaefae.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4dcf305d2e370678739924b702aaefae.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4dcf305d2e370678739924b702aaefae.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4dcf305d2e370678739924b702aaefae.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4dcf305d2e370678739924b702aaefae.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4dcf305d2e370678739924b702aaefae.png","size":""}]},{"name":"Intocable","url":"https://www.last.fm/music/Intocable","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2e923993e23443648c0e3acc52cf7cd0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2e923993e23443648c0e3acc52cf7cd0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2e923993e23443648c0e3acc52cf7cd0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2e923993e23443648c0e3acc52cf7cd0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2e923993e23443648c0e3acc52cf7cd0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2e923993e23443648c0e3acc52cf7cd0.png","size":""}]}]},"tags":{"tag":[{"name":"latin","url":"https://www.last.fm/tag/latin"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"tejano","url":"https://www.last.fm/tag/tejano"},{"name":"latin pop","url":"https://www.last.fm/tag/latin+pop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Selena/+wiki"}},"published":"01 Apr 2006, 00:00","summary":"Two artists have recorded as Selena: one Mexican-American, the other Dutch.\n\n1. Selena Quintanilla-Pérez (April 16, 1971 Lake Jackson, Texas – March 31, 1995 Corpus Christi, Texas) best known as Selena, was a Mexican American singer who has been called \"The Queen of Tejano music\". The youngest child of a Mexican-American couple, Selena released her first album at the age of twelve. She won Female Vocalist of the Year at the  1987 Tejano Music Awards and landed a recording contract with EMI a few years later. <a href=\"https://www.last.fm/music/Selena\">Read more on Last.fm</a>","content":"Two artists have recorded as Selena: one Mexican-American, the other Dutch.\n\n1. Selena Quintanilla-Pérez (April 16, 1971 Lake Jackson, Texas – March 31, 1995 Corpus Christi, Texas) best known as Selena, was a Mexican American singer who has been called \"The Queen of Tejano music\". The youngest child of a Mexican-American couple, Selena released her first album at the age of twelve. She won Female Vocalist of the Year at the  1987 Tejano Music Awards and landed a recording contract with EMI a few years later. Her fame grew throughout the early 1990s, especially in Spanish-speaking countries.\n\nSelena attained further notability in North America after she was murdered at the age of 23 by Yolanda Saldívar, the president of her fan club. On April 16, 1995, two weeks after her death, George W. Bush, governor of Texas at the time, declared her birthday \"Selena Day\" in Texas. Warner Bros. produced Selena, a film based on her life starring Jennifer Lopez in 1997. Selena's life was also the basis of the musical Selena Forever starring Veronica Vazquez as Selena. As of June 2006, Selena was commemorated with a museum and a bronze life-sized statue (Mirador de la Flor in Corpus Christi, Texas), which are visited by hundreds of fans each week.\nSelena was born in Lake Jackson, Texas, to a Mexican father, Abraham Quintanilla Jr. and a Mexican-American mother, Marcella Ofelia Samora,and was raised as a Jehovah's Witness. She began singing at the age of six; when she was nine her father founded the singing group Selena y Los Dinos, which she fronted. They initially performed at the Quintanilla family's restaurant, PappaGayo's, but the restaurant failed shortly afterwards.\n\nThe family soon went bankrupt and was evicted from their home. Taking their musical equipment in an old bus, they relocated to Corpus Christi, Texas. There, they performed wherever they could: at street corners, weddings, quinceañeras, and fairs. Their efforts at spreading their names and talents paid off in 1985 when the fourteen-year-old Selena recorded her first album for a local record company. The album was not sold in stores and her father bought all of the original copies. It was re-released in 1995 under the title Mis Primeras Grabaciones.\n\nSelena did well in school, but as she grew more popular as a musical performer, the travel demands of her performance schedule began to interfere with her education. Her father pulled her out of school altogether when she was in eighth grade. She continued her education on the road; at age seventeen she earned a high school diploma from The American School of Correspondence in Chicago, Illinois. Selena released her third album, Alpha, in 1986.\nAt the 1987 Tejano Music Awards, Selena won Best Female Vocalist (and dominated the award for the next seven years). In 1988, she released two albums, Preciosa and Dulce Amor. In 1989, José Behar, the former head of the Sony Latin Music division, signed Selena with Capitol/EMI, a record company he founded. He later said that he signed Selena because he thought he had discovered the next Gloria Estefan. Selena signed a contract with Coca-Cola to become one of its advertising spokesmen in Texas that same year, and her concerts drew thousands of people.\n\nIn 1988, Selena met Chris Pérez, who had his own band. Two years later, the Quintanilla family hired him to play in Selena's band and they quickly fell in love. At first her father did not approve of their relationship and went as far as firing Pérez from the band. He eventually came to accept the relationship. On April 2, 1992, Selena and Pérez were married in Nueces County, Texas, and Selena added her new husband's surname to her own.\n\nIn 1990, Selena released another album, Ven Conmigo, written by her main songwriter and brother Abraham Quintanilla, III. This recording was the first Tejano album recorded by a female artist to achieve gold status. Around the same time, a registered nurse and fan named Yolanda Saldívar approached Selena's father with the idea of starting a fan club. Her wish was granted and she became the club's president; later she became the manager of Selena's clothing boutiques. Selena released another hit album in 1992, Entre a Mi Mundo, which also achieved gold status. Songs from that album, such as \"Como La Flor\", helped make Selena a star. Her 1993 Selena Live! album won a Grammy award for Best Mexican-American Performance.\nSelena released her next album, Amor Prohibido, in 1994. The album was nominated for another Grammy award for Mexican-American Album of the Year. She began designing and manufacturing a clothing line in 1994 and opened two boutiques called Selena Etc., one in Corpus Christi and the other in San Antonio. Both were equipped with in-house beauty salons. Hispanic Business magazine reported that the singer earned over five million dollars from these boutiques. Selena also made appearances alongside Erik Estrada in a Latin soap opera titled Dos Mujeres, Un Camino.\n\nSelena and her band continued to receive accolades; Billboard's Premio Lo Nuestro awarded them six prestigious awards including Best Latin Artist and Song of the Year for \"Como La Flor\". Coca-Cola released a commemorative bottle in her honor to celebrate their five-year relationship. Meanwhile, her duet with the Barrio Boyzz, \"Dondequiera Que Estes\", raced to the top of the Latin charts. This prompted Selena to tour in New York City, Argentina, Puerto Rico and Central America where she was in growing demand. The duet with Salvadoran singer Alvaro Torres, \"Buenos Amigos\", was also a hit.\n\nBy fall of 1994, Amor Prohibido was a commercial success in Mexico and made four number one Latin hits, replacing Gloria Estefan's Mi Tierra on the chart's number one spot. It sold over 400,000 copies by late 1994 in the U.S. and another 50,000 copies in Mexico, reaching gold status. At this point, Selena developed plans to record an English-language album, but continued to tour for Amor Prohibido while beginning preparations for the album. Her next album Selena Live! won Best Mexican-American Album at the 36th Grammy Awards.\n\nIn 1995, Selena made a cameo appearance in the romantic comedy Don Juan DeMarco, which starred Marlon Brando, Johnny Depp and Faye Dunaway; she appeared as a background mariachi singer during the first scene. In February 1995, Selena played a concert at the Houston Livestock Show and Rodeo in the Houston Astrodome, which attracted over 65,000 fans—more than country stars such as George Strait, Vince Gill and Reba McEntire. Despite her busy schedule, Selena visited local schools to talk to students about the importance of education. She also donated her time to civic organizations such as D.A.R.E. and planned a fund raising concert to help AIDS patients. These demonstrations of community involvement won her loyalty from her fan base. Selena scheduled her English album for release in the summer of 1995. Afraid that her fans would think she was turning her back on them, she was working on a new Tejano album as well. Meanwhile, she planned to open two more boutiques including one in Monterrey, Mexico.\nIn early 1995, the Quintanillas discovered that Yolanda Saldívar, the president of Selena's fan club (Texas-section) and the manager of her boutiques, was embezzling money from the fan club and decided to fire her. Soon after the fallout, Selena agreed to meet Saldívar in a Days Inn hotel in Corpus Christi on the morning of March 31, 1995 to retrieve paperwork for tax purposes. At the hotel, Selena demanded the missing financial papers. Saldívar delayed the handover by claiming she had been raped in Mexico. The singer drove Saldívar to a local hospital where doctors found no evidence of rape. Saldívar returned to the motel where Selena again demanded the missing financial papers.\n\nSelena told Saldivar that she just couldn't be trusted anymore. At 11:49 am, Yolanda drew a gun from her purse, pointing it at Selena. As the singer turned and left the room, Saldívar shot her once in the back. Critically wounded, Selena ran towards the lobby to get help. She collapsed on the floor as the clerk called 911, with Saldívar chasing her, calling her a bitch. Before collapsing to the floor, Selena named Saldívar as her assailant and gave the room number where she had been shot. After an ambulance and the police arrived on the scene, Selena was transported to a local hospital. She died there from loss of blood at 1:05 p.m., two weeks before her 24th birthday.\nSelena's death had widespread impacts. Major networks interrupted their regular programming to break the news; Tom Brokaw referred to Selena as \"The Mexican Madonna\". Numerous vigils and memorials were held in her honor, and radio stations in Texas played her music non-stop. Her funeral drew approximately 60,000 mourners, many of whom traveled from outside the United States. Among the celebrities who were reported to have immediately phoned the Quintanilla family to express their condolences were Gloria Estefan, Julio Iglesias and Madonna. People magazine published a commemorative issue in honor of Selena's memory and musical career, titled Selena 1971–1995, Her Life in Pictures. A few days afterwards, Howard Stern mocked Selena's murder and burial, poked fun at her mourners, and criticized her music. Stern said, \"This music does absolutely nothing for me. Alvin and the Chipmunks have more soul... Spanish people have the worst taste in music. They have no depth.\" Stern's comments outraged and infuriated the Hispanic community across Texas. After a disorderly conduct arrest warrant was issued in his name, Stern later made an on-air apology, in Spanish, for his comments. Two weeks after her death, on April 16, George W. Bush, then Governor of Texas, declared Selena's birthday April 16 as \"Selena Day\" in Texas.\n\nThat summer, Selena's album Dreaming of You, a combination of Spanish-language songs and new English-language tracks, debuted at number one on the U.S. Billboard 200, making her the first Hispanic singer to accomplish this feat and the second highest debut after Michael Jackson's HIStory. On its release date, the album sold over 175,000 copies, a record for a female pop singer, and it sold two million copies in its first year.Songs such as \"I Could Fall in Love\" and \"Dreaming of You\" were played widely by mainstream English-language radio, with the latter reaching #21 on the Billboard Hot 100. Meanwhile, \"I Could Fall in Love\", while ineligible for the Hot 100 at the time, reached #12 on the Hot 100 Airplay chart and the top 10 on the Adult Contemporary Chart. David Byrne has paid homage to Selena on his past tours with Tosca Strings by performing their duo God's Child. \"Dreaming of You\" was certified three times Platinum by the Recording Industry Association of America.\n\nIn October 1995, a Houston jury convicted Saldívar of first degree murder and sentenced her to life in prison, with the possibility of parole in thirty years. The gun used to kill Selena was later destroyed and the pieces thrown into Corpus Christi Bay.\nJennifer Lopez played Selena in a film about her life. Directed by Gregory Nava, the biopic opened with mostly positive reviews. Over 20,000 people auditioned for the leading role in the movie. The film stirred some controversy in the Mexican-American community, since Lopez is Puerto Rican-American and played the role of a singer of Mexican descent. But Selena's fans supported the movie, and Lopez's acting in the film helped elevate her career. Although Lopez succeeded as a pop star a few years later, Selena's voice was dubbed in for all the songs in the movie. For her role, Lopez was nominated for a Golden Globe award for Best Actress in a Musical.\n\nReliant Stadium in Houston hosted a tribute concert, Selena ¡VIVE!, on April 7, 2005. Held a week after the 10th anniversary of her death, over 65,000 fans attended the concert, which featured high-profile artists including Gloria Estefan, Pepe Aguilar, Thalía, Paulina Rubio, Ana Barbara, Alejandra Guzmán, Ana Gabriel, and Fey. The artists performed renditions of Selena's music, as did her brother, A.B. Quintanilla, who performed with his band Kumbia Kings backed with footage of Selena singing \"Baila Esta Cumbia\". Broadcast live on the Univision network, Selena ¡VIVE! is the highest-rated and most-viewed Spanish-language show in American television history. The show, which lasted over three hours, scored a 35.9 Nielsen household rating.\n\nThe American Bank Center in Corpus Christi named their 2,526-seat concert auditorium, Selena Auditorium, in her memory.\n\n2. Selena a Dutch singer that was also active in the late 80s, early 90s. <a href=\"https://www.last.fm/music/Selena\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
