{"artist":{"name":"Shai Hulud","mbid":"2aaa7913-72ae-469b-9fdb-4c79cd70ed2e","url":"https://www.last.fm/music/Shai+Hulud","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/79c3dfdf40724a2e87b105bb1ce39d2a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/79c3dfdf40724a2e87b105bb1ce39d2a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/79c3dfdf40724a2e87b105bb1ce39d2a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/79c3dfdf40724a2e87b105bb1ce39d2a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/79c3dfdf40724a2e87b105bb1ce39d2a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/79c3dfdf40724a2e87b105bb1ce39d2a.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"83562","playcount":"2920936"},"similar":{"artist":[{"name":"Misery Signals","url":"https://www.last.fm/music/Misery+Signals","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/03be034bc71448a598471933ab929edf.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/03be034bc71448a598471933ab929edf.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/03be034bc71448a598471933ab929edf.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/03be034bc71448a598471933ab929edf.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/03be034bc71448a598471933ab929edf.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/03be034bc71448a598471933ab929edf.png","size":""}]},{"name":"Modern Life Is War","url":"https://www.last.fm/music/Modern+Life+Is+War","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/72de027a77244a9aaec46fb8ec810cab.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/72de027a77244a9aaec46fb8ec810cab.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/72de027a77244a9aaec46fb8ec810cab.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/72de027a77244a9aaec46fb8ec810cab.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/72de027a77244a9aaec46fb8ec810cab.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/72de027a77244a9aaec46fb8ec810cab.png","size":""}]},{"name":"Bane","url":"https://www.last.fm/music/Bane","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a119c147bf2b4b7d8882f822a28ae0be.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a119c147bf2b4b7d8882f822a28ae0be.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a119c147bf2b4b7d8882f822a28ae0be.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a119c147bf2b4b7d8882f822a28ae0be.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a119c147bf2b4b7d8882f822a28ae0be.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a119c147bf2b4b7d8882f822a28ae0be.png","size":""}]},{"name":"Poison the Well","url":"https://www.last.fm/music/Poison+the+Well","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/61447115f3ee4d37941f2abaa89d8284.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/61447115f3ee4d37941f2abaa89d8284.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/61447115f3ee4d37941f2abaa89d8284.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/61447115f3ee4d37941f2abaa89d8284.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/61447115f3ee4d37941f2abaa89d8284.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/61447115f3ee4d37941f2abaa89d8284.png","size":""}]},{"name":"It Prevails","url":"https://www.last.fm/music/It+Prevails","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/577002c078664a68abe1f32b8c44c5f7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/577002c078664a68abe1f32b8c44c5f7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/577002c078664a68abe1f32b8c44c5f7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/577002c078664a68abe1f32b8c44c5f7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/577002c078664a68abe1f32b8c44c5f7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/577002c078664a68abe1f32b8c44c5f7.png","size":""}]}]},"tags":{"tag":[{"name":"hardcore","url":"https://www.last.fm/tag/hardcore"},{"name":"metalcore","url":"https://www.last.fm/tag/metalcore"},{"name":"melodic hardcore","url":"https://www.last.fm/tag/melodic+hardcore"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"post-hardcore","url":"https://www.last.fm/tag/post-hardcore"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Shai+Hulud/+wiki"}},"published":"12 Feb 2006, 21:54","summary":"Shai Hulud is a metal/hardcore band originally formed in Pompano Beach, Florida, the band later moved up to Poughkeepsie, New York. \n\nHistory\n\nMatt Fox (guitar) and Dave Silber (Bass) formed Shai Hulud in 1995 with Damien Moyal on vocals, Jason Lederman on drums, and Oliver Chapoy on guitar. \"Matt was playing in several other kinds of bands like rock bands and they just wanted to play some hardcore\" says former bassist Jared Allen. However, things with Jason Lederman didn't work out and the band began to look for a new drummer. <a href=\"https://www.last.fm/music/Shai+Hulud\">Read more on Last.fm</a>","content":"Shai Hulud is a metal/hardcore band originally formed in Pompano Beach, Florida, the band later moved up to Poughkeepsie, New York. \n\nHistory\n\nMatt Fox (guitar) and Dave Silber (Bass) formed Shai Hulud in 1995 with Damien Moyal on vocals, Jason Lederman on drums, and Oliver Chapoy on guitar. \"Matt was playing in several other kinds of bands like rock bands and they just wanted to play some hardcore\" says former bassist Jared Allen. However, things with Jason Lederman didn't work out and the band began to look for a new drummer. This, unfortunately, would be something the band would become accustomed to. In 1994, Steve Kleisath and Matt Fox met for the first time in Tampa, FL, when Matt was filling in on drums for Strongarm, the band Steve later joined as drummer. With a complete lineup intact, the band recorded a six-song demo and was soon signed to Revelation Records by Rob Moran, bass player of Unbroken, who received their demo from Jeanne Probart, a friend that worked in Revelation's mail-order department. Although Revelation loved the Shai Hulud demo, they asked the band to change the name because they thought \"it was too difficult to remember\". Shai Hulud's first show was played on Halloween in 1996 at Discount's (a Florida based punk band) warehouse for under 50 people.\n\nDamien Moyal quit the band when the band signed to Revelation Records. With the exit of Damien, Shai Hulud would recruit 14 year-old Chad Gilbert on vocals. The band had a record deal with Revelation Records' subsidiary, Crisis Records. In September 1996, they recorded a three song EP called A Profound Hatred of Man which was released in February of 1997. On the first 5000 copies of their debut EP, the band's name is misspelled on the spine as, \"Shai Halud\", but spelled correctly on the cover. This EP started the legacy of Shai Hulud.\n\nChad Gilbert departed to found the pop punk band New Found Glory in 1997. This would pose problems for Shai Hulud in the future. However, they started recording their first full-length, Hearts Once Nourished With Hope And Compassion, in August 1997. They would finish the album in September and release it in November. Throughout the next year and a half Shai Hulud toured America with Strongarm, Bloodlet, Shadows Fall, Zao, Overcast, Cannibal Corpse and Disembodied. In May 1998 three tracks were recorded for a split with New York's Indecision entitled The Fall of Every Man. The split was released in November 1998. As Shai Hulud's popularity grew some of the band's member's interest began to waver. In 1998, Oliver Chapoy decided to leave the band. He was replaced by Matthew Fletcher who later moved on to Florida to join the band in January 1999. Matt Fletcher saw Shai Hulud for the first time in Seattle, Washington in 1997 with Strongarm and NineIronSpitFire. Andrew Gormley (former Shai Hulud drummer) was also at the show selling Kiss It Goodbye demos. In June of 1999, they recorded a cover of \"Fearless Vampire Killers\" for the Bad Brains tribute compilation called Never Give In.\n\nSteve Kleisath quit the band due to personal issues, and Chad Gilbert decided to leave Shai Hulud and become a full-time guitar player for the band New Found Glory. The band forged ahead and recruited Andrew Gormley to fill as drummer on a European tour. Matt Fletcher filled as singer until Geert van der Velde joined the band during the tour. The band returned to Florida determined to continue Shai Hulud. However, Dave Silber had been ready to quit and did so upon their return. In January 2000, Jared Allen, Matt Fletcher's friend from Oklahoma, would fill in the bass player position and quickly join the band in the studio. Three tracks would be recorded for a split with the band Another Victim named A Whole New Level of Sickness. This and another split, honoring Metallica, were both released in March 2000. Shai Hulud shared the Metallica tribute split, named Crush 'Em All Vol. 1, with Boy Sets Fire, covering the song Damage Inc.. Spikey Goldbach would fill as drummer for the A Whole New Level of Sickness split and Steve Kleisath would return for the sole track on the Crush Em' All split. In 2001 the band moved on to Poughkeepsie, NY. Chris Cardinal, who used to play for Inner Dam, joined the band to fill on drums, but he later decided to leave the band.\n\nIn 2002, Jared Allen decided to leave the band, and Matt Fletcher moved on to bass. The band recorded a second full-length That Within Blood Ill-Tempered, released on May 20, 2003. Throughout the creation of the new album, the band continued to search for a permanent drummer. Tony Tintari joined the band in the studio while recording the new album. After the release of That Within Blood Ill-Tempered and a number of tours going into the subsequent year, Shai Hulud and vocalist Geert van der Velde mutually decided it was for the best he leave the band. Geert left and soon thereafter started his solo project The Black Atlantic, and to join as vocalist for the metalcore band Miscreants. Drummer Tony Tintari left the band to join the indie rock band Holy Roman Empire. Acknowledging some people may misinterpret the parting as the end of Shai Hulud, the band came out on their homepage indicating that they would not be breaking up; instead, the band would change name to \"The Warmth of Red Blood\" and continue what had been started with Shai Hulud. In 2005 The band released a retrospective release entitled, A Comprehensive Retrospective: Or How I Learned to Stop Worrying and Release Bad and Useless Recordings containing rare demos and live tracks.\n\nIn early 2006, the band recorded a three song rough demo with Eric Dellon on lead vocals, Geert van der Velde on backup vocals, and Brian Go on drums. In March 2006, the band announced they were abandoning the moniker \"The Warmth of Red Blood\" and keeping the name Shai Hulud. In August of 2006, the band signed with Metal Blade Records and has already begun touring again, and new material exists that was released in their new album to be titled Misanthropy Pure with Matt Mazzali on vocals and Andrew Gormley on drums, released on May 27, 2008. For a number of months, Shai Hulud enlisted the help of former Unearth/The Red Chord drummer Mike Justain up until he joined the band Trap Them. They are still currently without a permanent drummer. The position of second guitar was recently filled by Chad Kishick of Miami, Florida, who had toured with 24 Hours to Live, Dead Weight, All Hell Breaks Loose, and Know the Score.\n\nShai Hulud also have a side project named Zombie Apocalypse (formerly called Boddicker), whose sound can be summed up as a faster, more chaotic and more manic version of its mother band. It features Matt Fox, Matthew Fletcher, Ronen Kaufman, and Greg Thomas. <a href=\"https://www.last.fm/music/Shai+Hulud\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
