{"artist":{"name":"Sheek Louch","mbid":"339ed05f-5f9f-4222-8e95-5bf5ec3af22a","url":"https://www.last.fm/music/Sheek+Louch","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cd8143b48fbd43a69c885fe354d55724.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cd8143b48fbd43a69c885fe354d55724.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cd8143b48fbd43a69c885fe354d55724.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cd8143b48fbd43a69c885fe354d55724.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cd8143b48fbd43a69c885fe354d55724.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cd8143b48fbd43a69c885fe354d55724.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"123715","playcount":"706811"},"similar":{"artist":[{"name":"Styles P","url":"https://www.last.fm/music/Styles+P","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/48f876af7e5d45b4bf2ba13720cc4fe0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/48f876af7e5d45b4bf2ba13720cc4fe0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/48f876af7e5d45b4bf2ba13720cc4fe0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/48f876af7e5d45b4bf2ba13720cc4fe0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/48f876af7e5d45b4bf2ba13720cc4fe0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/48f876af7e5d45b4bf2ba13720cc4fe0.png","size":""}]},{"name":"The Lox","url":"https://www.last.fm/music/The+Lox","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6e52a3504ef048edb151b398cd14366b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6e52a3504ef048edb151b398cd14366b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6e52a3504ef048edb151b398cd14366b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6e52a3504ef048edb151b398cd14366b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6e52a3504ef048edb151b398cd14366b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6e52a3504ef048edb151b398cd14366b.png","size":""}]},{"name":"Jadakiss","url":"https://www.last.fm/music/Jadakiss","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ba09d22fe758444bb39495fa90cf6c6d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ba09d22fe758444bb39495fa90cf6c6d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ba09d22fe758444bb39495fa90cf6c6d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba09d22fe758444bb39495fa90cf6c6d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba09d22fe758444bb39495fa90cf6c6d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ba09d22fe758444bb39495fa90cf6c6d.png","size":""}]},{"name":"Beanie Sigel","url":"https://www.last.fm/music/Beanie+Sigel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/89d97540d38b4b6b91a38d09da9f0631.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/89d97540d38b4b6b91a38d09da9f0631.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/89d97540d38b4b6b91a38d09da9f0631.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/89d97540d38b4b6b91a38d09da9f0631.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/89d97540d38b4b6b91a38d09da9f0631.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/89d97540d38b4b6b91a38d09da9f0631.png","size":""}]},{"name":"Shyne","url":"https://www.last.fm/music/Shyne","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4c58689eac3a4c4bb97c190f43715584.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4c58689eac3a4c4bb97c190f43715584.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4c58689eac3a4c4bb97c190f43715584.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4c58689eac3a4c4bb97c190f43715584.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4c58689eac3a4c4bb97c190f43715584.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4c58689eac3a4c4bb97c190f43715584.png","size":""}]}]},"tags":{"tag":[{"name":"rap","url":"https://www.last.fm/tag/rap"},{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"east coast rap","url":"https://www.last.fm/tag/east+coast+rap"},{"name":"D-Block","url":"https://www.last.fm/tag/D-Block"},{"name":"hip hop","url":"https://www.last.fm/tag/hip+hop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Sheek+Louch/+wiki"}},"published":"19 Feb 2006, 12:01","summary":"Sean D. Jacobs (born November 9, 1976 in Brooklyn, New York), better known as Sheek Louch, is a rapper and member of The Lox, founded in 1994 which includes Jadakiss and Styles P.\n\nAfter appearing on two Lox albums, 1998’s platinum debut Money, Power & Respect, and 2000’s follow-up We Are The Streets, Sheek became a business man. First, he bought a recording studio in his hometown city of Yonkers, NY, and then founded the record label D-Block with lifelong friends Jadakiss and Styles P. <a href=\"https://www.last.fm/music/Sheek+Louch\">Read more on Last.fm</a>","content":"Sean D. Jacobs (born November 9, 1976 in Brooklyn, New York), better known as Sheek Louch, is a rapper and member of The Lox, founded in 1994 which includes Jadakiss and Styles P.\n\nAfter appearing on two Lox albums, 1998’s platinum debut Money, Power & Respect, and 2000’s follow-up We Are The Streets, Sheek became a business man. First, he bought a recording studio in his hometown city of Yonkers, NY, and then founded the record label D-Block with lifelong friends Jadakiss and Styles P.\n\nWhen Jadakiss feuded with Beanie Sigel, the battle also brought along Sheek Louch and Styles P. Shortly before Beans went to jail, however, Sigel and Kiss made up definitively, performing together at a show; after his release from jail, the two did a remix on a Sheek Louch song and appeared on a track on a Funkmaster Flex compilation.\n\nWhen The Lox left Bad Boy Records, the group and each of its members' publication was still owned by label head Sean Combs. The group fought with him over royalties, debt issues and other things until 2005 when they briefly put their differences aside to perform with Jay-Z at his I Declare War concert.Combs still owned The Lox's publishing because they only completed one album on their contract. Afterward they went on New York radio station Hot 97 bashing Diddy about taking all their money.\n\nSheek Louch has played a supporting role in D-Block's battle with 50 Cent. Originally, after a guest appearance in Ja Rule's single \"New York\", Jadakiss was insulted on 50 Cent's track \"Piggy Bank\" on the 2005 album The Massacre. Sheek has in turn insulted 50 Cent and other members of G-Unit on tracks on various mixtapes, including ones by Big Mike and DJ Clue.\n\n\nShame on you for ever underestimating Sheek. Shame on you for thinking that his membership in the LOX is all he had and all he’d ever be. After dropping two LOX albums, 1998’s platinum debut Money, Power &  Respect, and 2000’s chart topping follow up We are the Streets, Sheek became a business man. First, he bought a recording studio in his hometown town of Yonkers, NY. Then, he founded the record label D-Block with lifelong friends Jadakiss and Styles P. Sheek has been quietly focused. While Jadakiss and Styles were busy making guest appearances with everyone from Mary J. Blige to Jennifer Lopez, Sheek was planning and securing the foundation for what will undoubtedly become one of hip hop’s greatest classics, “D Block.” As the first artist signed to D-Block, Sheek’s debut Walk Witt Me takes hip hop back to the good days when MCs rapped with the kind of passionate power that could move entire coasts. After listening to Walk Witt Me, you’ll never sleep on Sheek again. In fact, you’ll be excitedly waiting for the next 16 bar ride through his life. “This album is all me,” says Sheek. “With the LOX, I have to write about the topic agreed on by all three of us. But on my album, I can get deep into it and let you understand me.”\n\nMixtape DJs like Kay Slay, Clue, and Whoo Kid understand Sheek. For months, the streets have been buzzing with his highly sought after freestyles. But when Walk Witt Me drops, the buzz will stop and the raucous will begin. Super lyrical songs like the standout “How I Love You,” take listeners on a mental journey through Sheek’s ups and downs in the hip hop game. “I’m explaining everything that has happened to me,” he says. “How I was chillin with the LOX, got comfortable, and then this hip hop thing left me alone because I got so comfortable.” Tracks like the bonafide hit “Don’t Worry,” featuring legendary DJ Kid Capri, samples the Jackson 5 Motown classic “Don’t Worry.” Sheek’s cocky declaration of his triumphant return to the spotlight will keep kids rapping along to “Don’t Worry” for days. Hardcore cuts like “Love You” and “Don’t Mean Nutin’ featuring Jadakiss, Styles, and J-Hood remind LOX lovers that Sheek will never loose his grimy touch. While the happy, carefree vibe on “Good Day” with the memorable hook “White tees, white airs, TK/Benz coup, rims spinnin, jake hatin me/ But that’s my life, my life in the sunshine” guarantees a summertime bass knocker. Spin queen Cocoa Chanel produced “Ok” the party anthem which is one of Sheek’s favorite album singles. And when the club closes and cats take a minute to focus, the title track “Walk Witt Me” will show a deep, intellectual side of Sheek that will make listeners stretch their eyes wide with amazement. “When I got into this solo project I was in a zone,” he says. “ A lot came out. And I’m still in a zone right now.”\n\nBut Sheek has always been focused. As 11 year old Sean Jacobs, he rapped with childhood friend Jayson “Jadakiss” Phillips and started the group Lil J and Shawn Ski. Years later, after signing with the LOX to Bad Boy, fighting for release, and eventually signing to Ruff Ryders, Sheek has only thought about one thing. “I was always the cat like, “Let’s get a label and sign to ourselves,” Why don’t we get our own artists and put ourselves out there? he says.’ Years later, Sheek’s focus paid off. As the first MC set to drop from D-Block, Sheek is concentrating on the task at hand. “I have to blow up this album and take this label to another level,” he says. “I can’t dance on stage forever.”\n\nSo although you may’ve doubted Sheek, he never underestimated himself. Because the stellar work on Walk Witt Me is all about confidence and focus. “This is mental. All soul and very carefully thought out,” he says. “Run with it.” And after people witness Walk Witt Me, they’ll be running with Sheek for life.\n\nSheek's second album, \"After Taxes\", was released in 2005 with guest spots from Fabolous, Beanie Sigel, T.I., Redman and his two LOX homies Jadakiss and Styles P. It also featured production from producers like Havoc, Rockwilder, Red Spyda and The Alchemist. Unlike his first album, \"After Taxes\" was released on Kock Records, one of the largest independent labels in the United States. Sheek got a minor hit \"Kiss Your Ass Goodbye\". Also included on the album was a diss track going at 50 Cent called \"Maybe If I Sing\".\n\n    * He, as well as Jadakiss, made guest appearances in the movie Honey.\n\n    * Sheek Louch met Jadakiss during his early childhood.\n\n    * In high school, he used to play football on the varsity team. However, due to an             injury, he was force to not continue football.\n <a href=\"https://www.last.fm/music/Sheek+Louch\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
