{"artist":{"name":"Soda Stereo","mbid":"3f8a5e5b-c24b-4068-9f1c-afad8829e06b","url":"https://www.last.fm/music/Soda+Stereo","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/52ff78af394442fbc25bba723d55fd7a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/52ff78af394442fbc25bba723d55fd7a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/52ff78af394442fbc25bba723d55fd7a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/52ff78af394442fbc25bba723d55fd7a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/52ff78af394442fbc25bba723d55fd7a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/52ff78af394442fbc25bba723d55fd7a.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"280218","playcount":"11844870"},"similar":{"artist":[{"name":"Gustavo Cerati","url":"https://www.last.fm/music/Gustavo+Cerati","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/643b29265fe5100363c31152017a2eae.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/643b29265fe5100363c31152017a2eae.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/643b29265fe5100363c31152017a2eae.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/643b29265fe5100363c31152017a2eae.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/643b29265fe5100363c31152017a2eae.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/643b29265fe5100363c31152017a2eae.png","size":""}]},{"name":"Fito Páez","url":"https://www.last.fm/music/Fito+P%C3%A1ez","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/74dbb364263047e19c8c297ed7590844.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/74dbb364263047e19c8c297ed7590844.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/74dbb364263047e19c8c297ed7590844.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/74dbb364263047e19c8c297ed7590844.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/74dbb364263047e19c8c297ed7590844.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/74dbb364263047e19c8c297ed7590844.png","size":""}]},{"name":"Charly García","url":"https://www.last.fm/music/Charly+Garc%C3%ADa","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c624afe53f4e48c09dee1e8522c768a3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c624afe53f4e48c09dee1e8522c768a3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c624afe53f4e48c09dee1e8522c768a3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c624afe53f4e48c09dee1e8522c768a3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c624afe53f4e48c09dee1e8522c768a3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c624afe53f4e48c09dee1e8522c768a3.png","size":""}]},{"name":"Caifanes","url":"https://www.last.fm/music/Caifanes","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a9c56a0cc8d14dafbb0640e20e3d31c1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a9c56a0cc8d14dafbb0640e20e3d31c1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a9c56a0cc8d14dafbb0640e20e3d31c1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a9c56a0cc8d14dafbb0640e20e3d31c1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a9c56a0cc8d14dafbb0640e20e3d31c1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a9c56a0cc8d14dafbb0640e20e3d31c1.png","size":""}]},{"name":"Babasónicos","url":"https://www.last.fm/music/Babas%C3%B3nicos","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c26f63992623464c8c5aefdc16e6615c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c26f63992623464c8c5aefdc16e6615c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c26f63992623464c8c5aefdc16e6615c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c26f63992623464c8c5aefdc16e6615c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c26f63992623464c8c5aefdc16e6615c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c26f63992623464c8c5aefdc16e6615c.png","size":""}]}]},"tags":{"tag":[{"name":"Rock Argentino","url":"https://www.last.fm/tag/Rock+Argentino"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"Rock en Espanol","url":"https://www.last.fm/tag/Rock+en+Espanol"},{"name":"80s","url":"https://www.last.fm/tag/80s"},{"name":"argentina","url":"https://www.last.fm/tag/argentina"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Soda+Stereo/+wiki"}},"published":"16 Feb 2006, 03:33","summary":"Soda Stereo was a rock power trio formed in Buenos Aires, Argentina in 1982. Consisting of guitarist and vocalist Gustavo Cerati, bassist Zeta Bosio and drummer Charly Alberti, the band established what would become the template for many other popular Spanish-speaking pop and rock music groups: Clever, often mysterious lyrics, pleasing musical arrangements and an elaborate and glamorous aesthetic image.\n\nThough nominally thought of as a new wave or alternative rock group <a href=\"https://www.last.fm/music/Soda+Stereo\">Read more on Last.fm</a>","content":"Soda Stereo was a rock power trio formed in Buenos Aires, Argentina in 1982. Consisting of guitarist and vocalist Gustavo Cerati, bassist Zeta Bosio and drummer Charly Alberti, the band established what would become the template for many other popular Spanish-speaking pop and rock music groups: Clever, often mysterious lyrics, pleasing musical arrangements and an elaborate and glamorous aesthetic image.\n\nThough nominally thought of as a new wave or alternative rock group, they also experimented with several different styles throughout their career, including ska, post-punk, power pop, shoegazing, neo-psychedelia, dream pop and electronic rock. The band's sound was heavily influenced by British and American new wave and post-punk groups, including The Police, XTC, Talking Heads and Squeeze.\n\nIn 1997, after a farewell tour through various countries and finally Argentina, the band disbanded. Personal and creative differences brought them to this decision. On September 20, 1997, Soda Stereo played their last show, in front of 75,000 people at the Estadio Monumental (or River Plate Stadium) in Buenos Aires. \n\nA final comeback tour in late 2007, the \"Me Verás Volver\" tour was scheduled and the band performed live for large audiences breaking sell out records throughout Latin America and the US. \n\nWith the release of albums such as \"Signos\", \"Doble Vida\", \"Canción Animal\" and \"Dynamo\", Soda Stereo became one of the most critically acclaimed Argentinean rock bands, being the first one to tour through all of Latin America, and achieving a degree of success that no other local rock band had accomplished before.\n\nBio:\n\nIn 1982, Cerati, Bosio and Alberti recorded some demos and started to play regularly in a Buenos Aires bar called \"Zero\". After performing several shows, a CBS producer decided to give the band a chance. In 1984, their eponymous debut album, Soda Stereo was released. Produced by Federico Moura, lead singer of the band Virus, it proved successful. In October, 1984 the band played at the Buenos Aires Rock & Pop Festival with INXS, Nina Hagen and Charly García.\n\nTheir second album, Nada Personal was released in 1985 and re-affirmed the popularity of the band. Instant classics such as \"Nada Personal\" and \"Cuando Pase el Temblor\" made the album a big seller and increased the band's notoriety. The video for the single \"Cuando Pase el Temblor\" was nominated in the category \"Finalist Video\" on the 12th Edition of the Video and TV World Festival.\n\nReleased in 1986, their third LP Signos represented the international breakthrough from Argentina to the rest of Latin America: This was the first Argentinean rock album to be released on compact disc, -however the CD was first released in 1988. \"Signos\" contained songs as \"Persiana Americana\", the self-tiled \"Signos\" and \"Prófugos\". The album was number one in several countries and gave the band the chance to conquer much wider audiences. Sodamanía, resembling Beatlemania, was now widespread.  \n\nSoda Stereo embarked in an extensive tour through Latin America to promote the album: They gave an unprecedented 22 concerts in 17 different cities. A live album called Ruido Blanco was recorded and contained most of  the songs played on the \"Signos\" Tour.\n\nAfter over a year without recording new material, the band travelled to New York City to start work on Doble Vida which was released in 1988. The album, produced by David Bowie's guitarist Carlos Alomar, was recorded and mixed in a state of the arts console and was Soda's most ambitious project so far. The first three songs of the album were released as singles, \"Picnic en el 4ºB\", \"En la Ciudad de la Furia\" and \"Lo que Sangra (La Cúpula)\" which became massive hits. The EP Languis followed. Released the next year, it contaided mixes from Doble Vida and one new song, \"Mundo de Quimeras\".\n\nIt was their seventh album, Canción Animal, to be released in 1990 the one that represented the band's creative and commercial peak. The songs are amongst the band's strongest and most popular. It was recorded in Miami and Buenos Aires. \"Canción Animal\" contained the instant classic \"de Música Ligera\", the single \"Un Millón de Años Luz\", the intimate short piece \"Té Para Tres\" and the anthemic tracks \"(En) El Séptimo Día\" and \"Hombre Al Agua\". Overall, the album is considered  the most consistent work by the band, along with \"Signos\". On December 14, 1991 they performed the majority of the album on the 9 de Julio Avenue in Buenos Aires at a free concert. An unprecedented 250,000 people were in attendance. \n\nThis success brought them to perform 14 continuous sold-out shows at Buenos Aires's Gran Rex Theater. From these shows emerged the Live/Mixes EP Rex Mix.\n\nIn late 1992 Soda Stereo released Dynamo. This album although now regarded as a highlight in the history of Argentinean rock, was initially Soda's most underrated, and with the passing of time has achieved significant recognition. Its most ambitious and experimental work so far, Dynamo was recorded in Buenos Aires. The album delved in electronic, shoegazy and dance-ethereal sophisticated compositions. The band presented the highly experimental record in its entirety in a local talk-show, \"Fax\". This was the first stereophonic TV transmission in Argentina. The band toured Europe and did TV Shows and concerts in Spain and later again in South America. Shortly after the tour, bassist Zeta Bosio suffered the loss of his son in a car accident. This unfortunate incident forced the band to stop touring and promoting the album and sent the trio into a hiatus, during which singer Gustavo Cerati started his solo career and released his debut solo album Amor Amarillo.\n\nThe band's last studio album, Sueño Stereo was recorded in London and Buenos Aires and was released in 1995. Three singles became significant hits: \"Ella Usó mi Cabeza como un Revolver\", \"Paseando por Roma\" and \"Zoom\". \"Sueño Stereo\" reached platinum disc only 15 days after its release. MTV Unplugged's Comfort y Música Para Volar was released in 1996, and contained not only unplugged and plugged songs, but some out-takes from Sueño Stereo as well.\n\nOn May 1st, 1997, personal problems between the members and different artistic criteria led the band to announce its end and started the final tour on July 1997. Their last concert given on  September 20th at the River Plate Stadium was recorded and released in two CD's: \"El Último Concierto - A & B\".\n\nComeback\n\nDuring 2007, and after 10 years of the original split, rumours stated that Soda Stereo would tour South America before the end of the year. A reunion tour was finally announced on June 9, 2007 as the \"Me Verás Volver\" Tour (\"You'll See Me Return\", referring to lyrics on Doble Vida's \"En la Ciudad de la Furia\"). The tour started at the River Plate stadium on October 19, 2007, where they played \"El Último Concierto\" in 1997. It ended in the same venue on December 21, 2007.\n\nInitially, the band announced two concerts at River, but 90.000 tickets were sold in only 24 hours. The band added one more show to the schedule, and after three days, the tickets for the first three shows were also sold out, so the band added two more shows in Argentina to the tour. The surprising amount of fans attending the five shows (more than 300,000) made Soda Stereo's return one of the most watched public events in Argentina.\n\nAs of 20 October 2007, 22 shows were confirmed, including one show in Santiago - Chile, Bogotá - Colombia, and others in Ecuador, Venezuela, Perú and Panamá. Also three shows were confirmed in the United States: One in the Home Depot Center in Los Angeles, California and two in the American Airlines Arena in Miami, Florida. Later, more shows were added in Mexico and Argentina. This made Soda Stereo the only band to have performed more than five times in Buenos Aires's Estadio Monumental in a single tour.\n\n\"Gira Me Verás Volver\" -the supporting 2CD album, featured live performances of the songs in all the different countries of Latin America where the tour went, and the U.S. Together with the new comeback tour, a compilation album was released, entitled Me Verás Volver (Hits & +). Exclusive content can be downloaded via the band's official website using a special code featured on the CD booklet.\n\nAfter the end of the tour, the band members continued with their individual careers. \n\nOfficial Discography:\n\nSoda Stereo / 1984\nNada Personal / 1985\nSignos / 1986\nRuido Blanco (Recorded Live) / 1987\nDoble Vida / 1988\nLanguis (EP) / 1989\nCanción Animal / 1990\nRex Mix (Live EP) / 1991\nDynamo / 1992\nZona de Promesas (Remixes 1984-1993) / 1993\nSueño Stereo / 1995\nComfort y Música Para Volar (MTV Unplugged) /1996\nEl Último Concierto - A / 1997\nEl Último Concierto - B / 1997\nGira Me Verás Volver / 2007\n\nGuest Musicians w/ Soda Stereo on records and tours include:\n\nDaniel Melero: Keyboards\nRichard Coleman: Guitars\nFabian Von Quintiero: Keyboards\nDaniel Sais: Keyboards\nTweety González: Keyboards\nGonzalo Palacios: Sax\nMarcelo Sánchez: Sax\nAndrea Álvarez: Percussion\nCelsa Mel Gowland: Backing Vocals\nFlavio Etcheto: Keyboards\nLeo García: Keyboards, Guitar\nLeandro Fresco: Keyboards\nAxel Krigier: Flute, Guitar\nAlejandro Terán: Violin\n\nOfficial Website:\nwww.sodastereo.com <a href=\"https://www.last.fm/music/Soda+Stereo\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
