{"artist":{"name":"Soldiers of Jah Army","mbid":"c97c748f-d375-41a6-875d-25843f73ba6f","url":"https://www.last.fm/music/Soldiers+of+Jah+Army","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6581bdc77c444e7a82c78687bf54cbeb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6581bdc77c444e7a82c78687bf54cbeb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6581bdc77c444e7a82c78687bf54cbeb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6581bdc77c444e7a82c78687bf54cbeb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6581bdc77c444e7a82c78687bf54cbeb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6581bdc77c444e7a82c78687bf54cbeb.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"262214","playcount":"3852006"},"similar":{"artist":[{"name":"SOJA","url":"https://www.last.fm/music/SOJA","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7bb27d845f59422faf17b963b7efd7f6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7bb27d845f59422faf17b963b7efd7f6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7bb27d845f59422faf17b963b7efd7f6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7bb27d845f59422faf17b963b7efd7f6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7bb27d845f59422faf17b963b7efd7f6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7bb27d845f59422faf17b963b7efd7f6.png","size":""}]},{"name":"Tribal Seeds","url":"https://www.last.fm/music/Tribal+Seeds","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ebe6df81b6794814a2fc6337c36ceb46.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ebe6df81b6794814a2fc6337c36ceb46.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ebe6df81b6794814a2fc6337c36ceb46.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ebe6df81b6794814a2fc6337c36ceb46.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ebe6df81b6794814a2fc6337c36ceb46.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ebe6df81b6794814a2fc6337c36ceb46.png","size":""}]},{"name":"Groundation","url":"https://www.last.fm/music/Groundation","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4ba057b0107c478aa182f05f90db9bb8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4ba057b0107c478aa182f05f90db9bb8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4ba057b0107c478aa182f05f90db9bb8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4ba057b0107c478aa182f05f90db9bb8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4ba057b0107c478aa182f05f90db9bb8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4ba057b0107c478aa182f05f90db9bb8.png","size":""}]},{"name":"Chezidek","url":"https://www.last.fm/music/Chezidek","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7c91213ec96c4913bd45940c365f5127.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7c91213ec96c4913bd45940c365f5127.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7c91213ec96c4913bd45940c365f5127.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c91213ec96c4913bd45940c365f5127.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c91213ec96c4913bd45940c365f5127.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c91213ec96c4913bd45940c365f5127.png","size":""}]},{"name":"Rebelution","url":"https://www.last.fm/music/Rebelution","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fa0317643b3248e78f3c4db36721031e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fa0317643b3248e78f3c4db36721031e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fa0317643b3248e78f3c4db36721031e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa0317643b3248e78f3c4db36721031e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa0317643b3248e78f3c4db36721031e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa0317643b3248e78f3c4db36721031e.png","size":""}]}]},"tags":{"tag":[{"name":"reggae","url":"https://www.last.fm/tag/reggae"},{"name":"roots reggae","url":"https://www.last.fm/tag/roots+reggae"},{"name":"dub","url":"https://www.last.fm/tag/dub"},{"name":"Rasta","url":"https://www.last.fm/tag/Rasta"},{"name":"political","url":"https://www.last.fm/tag/political"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Soldiers+of+Jah+Army/+wiki"}},"published":"02 Apr 2006, 19:17","summary":"Mention folk music to the average listener and the list of usual suspects come to mind: Bob Dylan, Joni Mitchell, Woodie Guthrie, etc. Talk to SOJA lead singer/guitarist Jacob Hemphill, however, and you’ll walk away with a different perspective. “To me, Rage Against The Machine, Wu -Tang Clan, Sade, Johnny Cash, Bob Marley – they’re all folk artists,” he says. “There’s no difference between Raekwon saying, ‘I grew up on the crime side <a href=\"https://www.last.fm/music/Soldiers+of+Jah+Army\">Read more on Last.fm</a>","content":"Mention folk music to the average listener and the list of usual suspects come to mind: Bob Dylan, Joni Mitchell, Woodie Guthrie, etc. Talk to SOJA lead singer/guitarist Jacob Hemphill, however, and you’ll walk away with a different perspective. “To me, Rage Against The Machine, Wu -Tang Clan, Sade, Johnny Cash, Bob Marley – they’re all folk artists,” he says. “There’s no difference between Raekwon saying, ‘I grew up on the crime side, the New York Times side, where staying alive was no jive,’ to Bob Marley saying, ‘Cold ground was my bed last night and rock was my pillow, too,’ to Johnny Cash saying, ‘I know I had it coming, I know I can’t be free, but those people keep on moving (around) and that’s what tortures me.’ Folk is all about storytelling and passing on a legacy. It’s timeless, it’s limitless and it crosses all boundaries. That’s what this band is striving for. It’s a tall order,” he laughs, “but we’re making our way.”\n\nThey’ve raised the bar with Strength to Survive, their fourth full-length album, an intoxicating mix of hot-rod reggae grooves and urgent, zeitgeist-capturing themes. The album, produced by John Alagia (Dave Matthews, John Mayer, O.A.R.), is the band’s first for ATO, the label co-founded by Dave Matthews.\n\nHemphill says the album was greatly inspired by Bob Marley’s Survival. “That’s the greatest reggae album ever made,” he says. “It has the best basslines and the best lyrics ever heard on one record. Marley wrote it after he went to Africa. I was 13 or 14 when I listened to it for the first time and it triggered all these long-forgotten memories of when I lived in Africa as a kid. My dad was an IMF res rep in Liberia in the late 80’s. I remember when the coup first started—- my family had to hide in these iron bathtubs for 3 days because the military was shooting at everything. I was 7 and that was one of my first memories. We made it out on the last flight. So Africa was always a big part of our lives—- it defined our family, in a way. Music came right after that, so, for me, music was always tied to Africa and music was always something powerful.”\n\nShortly after returning from Africa, Hemphill met Bobby Lee (bass) in the first grade in Virginia. The two instantly became best friends, finding common ground through their love of hip hop, rock and reggae which they performed together at their middle school talent shows. Throughout high school, they met Ryan Berty (drums), Kenneth Brownell (percussion) and Patrick O’Shea (keyboards) and together formed SOJA. The band gigged locally in the DC area while a couple of the guys finished school, all the while making plans to hit the road after graduation. They actually wound up owning the road.\n\nOver the course of the past few years, SOJA has sold more than 200,000 albums, headlined large theaters in more than 20 countries around the world, generated over 40 million YouTube views, amassed nearly 2 million Facebook fans, and attracted an almost Grateful Dead-like international fanbase that grows with each tour, with caravans of diehards following them from city to city. Most impressive of all, they’ve accomplished all this on their own. This 8-piece band has spent the past year and a half grinding it out from venue to venue, playing more than 360 dates, including headlining sold-out tours of North and South America, as well as opening for O.A.R. and sharing stages with everyone from Dave Matthews Band to Matisyahu.\n\nWith Strength to Survive, the band makes an impassioned call for unity and change with universally relatable songs about faith, hope and love. “I could go on and on about the horrible damage we’ve done to the earth or the problems that arise when countries compete for money over an imaginary border, but the album has one central theme,” says Hemphill, “and that’s our hope for the world to be one family.”\n\nIt’s a concept best exemplified in the song “Everything Changes.” “People out there with no food at night,” sings Hemphill, “And we say we care, but we don’t, so we all lie/But what if there’s more to this, and one day we become what we do, not what we say/Maybe we need to want to fix it. Maybe stop talking, maybe start listening/ Maybe we need to look at this world less like a square and more like a circle.”\n\nAmong the album’s many highlights is the ethereal “Let You Go,” about the road not taken, “Mentality,” the disc’s hard-hitting opening track, and the one-two punch of “Be With Me Now” and “When We Were Younger,” the latter bringing together the macro and the micro with the simple yet resonant line, “All of my answers, now that I’m older, turn into questions.”\n\nHemphill says the band’s simple and honest approach to music is what’s enabled them to break through obstacles of language, distance and culture in amassing an international following. “What’s the alternative – pop music?” he laughs. “Pop music—especially American pop music, is about having money, sleeping with models, living in mansions, spending all of our time in clubs and generally being better than the rest of the world. It’s funny, ‘cuz everyone here is broke. We sing about different things—things that actually matter. I think our fans appreciate that.”\n\n“When I look out in the audience and I see these kids with tears in their eyes, not because I’m singing a love song, but because I’m singing about how the world is dying and we’re the only ones who can stop it, that is huge. I live for that. We played a festival in Brazil in front of 80,000 people, and everybody was singing every word—in English. After one of the songs, I told them, ‘We’re on the road a lot, and people always ask me, “Don’t you ever get homesick? Don’t you miss your family?” I said, ‘It took me awhile to realize this, but this is my home, and you all are my family.’ The place just blew up. It was amazing. But it’s the truth—those are my people and I always want to do right by them. It’s is the only game in town for me.” ❖ <a href=\"https://www.last.fm/music/Soldiers+of+Jah+Army\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
