{"artist":{"name":"Sonny James","mbid":"df822e9b-b88e-4940-b5c9-05f8be9a2e64","url":"https://www.last.fm/music/Sonny+James","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c9824539aa69445ea0de5638be3954c7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c9824539aa69445ea0de5638be3954c7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c9824539aa69445ea0de5638be3954c7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9824539aa69445ea0de5638be3954c7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9824539aa69445ea0de5638be3954c7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9824539aa69445ea0de5638be3954c7.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"48905","playcount":"243277"},"similar":{"artist":[{"name":"Carl Smith","url":"https://www.last.fm/music/Carl+Smith","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6906cc6500f44d709db91d9a0527f3e7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6906cc6500f44d709db91d9a0527f3e7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6906cc6500f44d709db91d9a0527f3e7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6906cc6500f44d709db91d9a0527f3e7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6906cc6500f44d709db91d9a0527f3e7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6906cc6500f44d709db91d9a0527f3e7.png","size":""}]},{"name":"Eddy Arnold","url":"https://www.last.fm/music/Eddy+Arnold","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/422343039ca0484c8a3431c48fdb9f63.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/422343039ca0484c8a3431c48fdb9f63.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/422343039ca0484c8a3431c48fdb9f63.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/422343039ca0484c8a3431c48fdb9f63.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/422343039ca0484c8a3431c48fdb9f63.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/422343039ca0484c8a3431c48fdb9f63.png","size":""}]},{"name":"Ray Price","url":"https://www.last.fm/music/Ray+Price","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/01f5606a13634958a6e0b381a22f1b4c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/01f5606a13634958a6e0b381a22f1b4c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/01f5606a13634958a6e0b381a22f1b4c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/01f5606a13634958a6e0b381a22f1b4c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/01f5606a13634958a6e0b381a22f1b4c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/01f5606a13634958a6e0b381a22f1b4c.png","size":""}]},{"name":"Bill Anderson","url":"https://www.last.fm/music/Bill+Anderson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6d2d00f511974efda49c68ae100574eb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6d2d00f511974efda49c68ae100574eb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6d2d00f511974efda49c68ae100574eb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6d2d00f511974efda49c68ae100574eb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6d2d00f511974efda49c68ae100574eb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6d2d00f511974efda49c68ae100574eb.png","size":""}]},{"name":"Don Gibson","url":"https://www.last.fm/music/Don+Gibson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1da41b384ade4faa8567888d26bd00d6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1da41b384ade4faa8567888d26bd00d6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1da41b384ade4faa8567888d26bd00d6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1da41b384ade4faa8567888d26bd00d6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1da41b384ade4faa8567888d26bd00d6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1da41b384ade4faa8567888d26bd00d6.png","size":""}]}]},"tags":{"tag":[{"name":"classic country","url":"https://www.last.fm/tag/classic+country"},{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"oldies","url":"https://www.last.fm/tag/oldies"},{"name":"male vocalists","url":"https://www.last.fm/tag/male+vocalists"},{"name":"Sonny James","url":"https://www.last.fm/tag/Sonny+James"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Sonny+James/+wiki"}},"published":"01 Jan 2007, 09:18","summary":"James Hugh Loden (May 1, 1929 – February 22, 2016), known professionally as Sonny James, was an American country music singer and songwriter best known for his 1957 hit, \"Young Love\". Dubbed the Southern Gentleman, James had 72 country and pop charted releases from 1953 to 1983, including an unprecedented five-year streak of 16 straight Billboard #1 singles among his 26 #1 hits. Twenty-one of his albums reached the country top ten from 1964 to 1976. <a href=\"https://www.last.fm/music/Sonny+James\">Read more on Last.fm</a>","content":"James Hugh Loden (May 1, 1929 – February 22, 2016), known professionally as Sonny James, was an American country music singer and songwriter best known for his 1957 hit, \"Young Love\". Dubbed the Southern Gentleman, James had 72 country and pop charted releases from 1953 to 1983, including an unprecedented five-year streak of 16 straight Billboard #1 singles among his 26 #1 hits. Twenty-one of his albums reached the country top ten from 1964 to 1976. In May 2007 James, accompanied by his Southern Gentlemen, walked the red carpet and were inducted into the Country Music Hall of Fame.\n\nJames Hugh Loden was born on May 1, 1929 to Archie Lee 'Pop' Loden and Della Burleson Loden, who operated a 300 acres (120 ha) farm outside Hackleburg, Alabama. His parents were amateur musicians, and his sister Thelma Lee Loden Holcombe also played instruments and sang from an early age. By age three he was playing a mandolin and singing and was dubbed \"Sonny Boy\". In 1933 the family appeared on a radio audition which resulted in their being offered a regular Saturday slot on Muscle Shoals, Alabama radio station WMSD-AM. About this time the parents volunteered to raise an Alabama girl named Ruby Palmer, and soon Ruby was also part of the musical group, and the singing Loden Family, later billed as Sonny Loden and the Southerners, was soon playing theaters, auditoriums and schoolhouses throughout the Southern United States.\n\nTo this point the musical appearances had been a part-time effort for the family, as they returned after each gig or tour to work the family farm. After a few years the father decided they were professional enough to immerse themselves into the field full-time, so the father leased out the farm and they took a daily spot on radio station KLCN, where they provided early-morning accompaniment for the area's early-risers. After that they had spots on several other radio stations around the South. In 1949 they returned to Alabama, with a show on radio station WSGN in Birmingham, Alabama. Near Christmastime that year, the two girls were married in West Memphis, Arkansas in a double ceremony and left the group. The parents found other girls to take their place, but the group soon disbanded (the parents returned to Hackleburg and opened a clothing store, where James worked while belatedly finishing his final year of high school). During the summer of 1950 James worked with a band, sometimes singing but he was most useful as a guitar player on the Memphis, Tennessee radio station WHBQ, but that was interrupted near the end of the summer when James' National Guard unit was activated to participate in the Korean War. On September 9, 1950 his Alabama Army National Guard unit was sent to Korea, returning home in the fall of 1951. Loden was honorably discharged and moved to Nashville, Tennessee where he signed with Capitol Records with the help of Chet Atkins, with whom he had previously roomed. Capitol Records exec Ken Nelson asked him to drop his last name professionally as they believed there were already several musicians named Loden, Louden or Luden, and that \"James\" would be easier to remember: \"The smallest children can remember Sonny James.\" So he released his first studio record as Sonny James. Later, because of his polite ways, he would be tagged as \"The Southern Gentleman\".\n\nWhile appearing on Louisiana Hayride he met musician Slim Whitman. James' performance on stage playing a fiddle and singing brought a strong crowd response, and Whitman invited him to front for his new touring band. James stayed with Whitman's group for only two months when Whitman felt he had to do some club work to keep up his income to be able to pay his band. The Loden family had only appeared in schoolhouses and such and Sonny agreed to stay on for a few shows until Whitman could find his replacement. For the remainder of his career he never played a club performance. Over the next few years, he had several songs that did reasonably well on the country music charts and he continued to develop his career with performances at live country music shows. He also appeared on radio, including Big D Jamboree, before moving to the all-important new medium, television, where he became a regular performer on ABC's Ozark Jubilee in Springfield, Missouri beginning in October 1955.\n\nFollowing his long streak of #1 hits, James is also remembered for his 1975 #6 song \"A Little Bit South of Saskatoon\" that was in the 1977 Paul Newman hockey comedy Slap Shot.\n\nTop of the charts\n\nIn late 1956 James released \"Young Love\", a 45 rpm single for which he would forever be remembered. As the first teenage country crossover single, it topped both the US country and pop music charts in January to February 1957. Record sales could have been higher if Capitol Records had anticipated the exposure on popular-music charts; they had ordered only enough copies of the record to satisfy the anticipated country-music demand, and were therefore unable to supply most of the requests for records. The track peaked at No. 11 in the UK Singles Chart. It sold well over one million copies, and was awarded a gold disc. Dubbed the Southern Gentleman because of his polite demeanor, he gained more exposure with an appearance on the popular Ed Sullivan Show and the Bob Hope Show.\n\nThus began a seven-year search for a sound that would give him a lasting career. Two more years at Capitol Records didn't produce it and they parted ways in 1959. James signed with National Recording Corporation, and then stints with Dot (1960–1961), RCA (1961–1962), his second time with Capitol (1963–1972), and later with Columbia (1972–1979), Monument (1979) and Dimension (1981–1983).\n\nIn 1962 he returned to his roots and became a member of the Grand Ole Opry and a year later signed again with Capitol Records. From 1964 to 1972 he was a dominant force in country music. James and his Southern Gentlemen appeared on the major TV shows during that period including (Ed Sullivan, Andy Williams, Glen Campbell, Jimmy Dean, Mike Douglas, Merv Griffin, The Joey Bishop Show, was a multi-time guest on Hee Haw, also on the Johnny Cash Show and made minor singing appearances in four motion pictures.\n\n#1 streak beginnings\nOn August 15, 1964 James made his first appearance with a vocal group that had been together for five years. The group had started singing as freshmen at Eastern Nazarene College in Quincy, Massachusetts in 1959, had moved to Nashville in September 1962 and 16 months later in January 1964 they replaced the Jordanaires as the Grand Ole Opry quartet. James felt he finally found the combination that would propel him into his second career - that sound he had been seeking for seven years. So these young 21 and 22 year-old men, along with Sonny's multi-talented bass player Milo Liggett, became The Southern Gentlemen, joined 36-year-old Sonny James and quickly headed into country music history.\n\nTwo months later, James had his first #1 Billboard hit since Young Love - topping the country charts with the song he co-wrote with Bob Tubert, You're The Only World I Know. His next five releases peaked on the Billboard country charts at 2, 1, 3, 1, and 2 (though all five of them hit #1 on either Billboard, Record World or Cashbox).\n\nWith his musical style now refined and his \"sound\" on records and on personal appearances produced to be immediately identifiable, Sonny James was set to begin what would become his legendary streak of 16 straight #1 singles - an uncontested record which no other solo recording artist has surpassed in any genre.\n\nBillboard #1 streak\nBeginning in 1967 with \"Need You\" and ending with \"Here Comes Honey Again\" in 1971, James recorded 16 straight #1 country singles. His career #1 total was 26, the last coming with 1974's \"Is It Wrong (For Loving You)\". During his career he would have 72 charted releases.\n\nIn 1973 James also helped launch the solo career of Marie Osmond, producing and arranging her first three albums, including her smash hit, \"Paper Roses\".\n\nIn July 1957 Sonny married Doris Shrode in Dallas, Texas.\n\nIn the spring of 1984, Sonny and Doris quietly retired to their home in Nashville, Tennessee. He came home to Hackleburg during the first annual Neighbor Day Festival on April 20, 2002 and would continue attending the festival every other year. During the April 25, 2009 festival, he recognized the 100th birthday of the town of Hackleburg on the main stage.\n\nJames died on February 22, 2016 in Nashville, Tennessee at the age of 87.\n\nIn 1956, as rock and roll was just beginning, Sonny's multi-million selling single Young Love became a #1 country and pop hit, one of the first such crossover hits by a country artist.\n\nIn 1957, James became the first country recording artist to appear on The Ed Sullivan Show.\n\nIn 1961, honoring his contribution to the music industry, James was honored with a star on the Hollywood Walk of Fame at 6630 Hollywood Blvd.\n\nIn 1967, along with Bobbi Gentry, James hosted the first CMA Awards show.\n\nFrom 1969 thru 1971, Sonny became the first country artist to achieve a feat previously not done in the country music industry: In the middle of his highly successful run of sixteen consecutive #1 hits, of the next seven singles that James released, five had previously been moderately successful releases for soulful R&B artists Ivory Joe Hunter, Brook Benton & Clyde Otis and Jimmy Reed. Those five songs were Since I Met You Baby, It’s Just A Matter of Time, Endlessly, Empty Arms, and Bright Lights, Big City, all of which hit #1 on the Billboard country charts.\n\nIn 1969, Billboard magazine named Sonny James Country Music's Artist of the Year.\n\nIn February 1971, James was the first country artist whose music went into space; he made a special music recording for the crew of Apollo 14. They later presented him with one of the small American flags that they had carried to the Moon.\n\nIn 1973, James produced Marie Osmond’s first three albums. The first single “Paper Roses” reached #1 on the Billboard Hot Country Songs chart less than one month after her 14th birthday. Osmond thus became the youngest female and overall youngest solo artist to ever reach the No. 1 position on that chart, a record that still stands as of 2015.\n\nIn 1987 Sonny was inducted into the Alabama Music Hall of Fame.\n\nIn June 2001 honored with the Male Golden Voice Award.\n\nIn November 2001 received the Master Achievement Award / R.O.P.E. Award\n\nIn June 2002 honored by the Country Music DJ Hall of Fame and Country Radio Broadcasters with the Career Achievement Award.\n\nOn November 6, 2006, he appeared on television for the first time in nearly 20 years when presenter Kris Kristofferson announced on the ABC television network's Country Music Association Awards that Sonny was to be one of its newest inductees. Sonny's acceptance speech opened with the words, \"I want to thank my Good Lord for the career He has given me.\"\n\nIn May 2007 Sonny James and his Southern Gentlemen were officially inducted into the Country Music Hall of Fame and Museum,\n\nIn 2009 James was inducted into the Hit Parade Hall of Fame.\n\nOn August 15, 2015, exactly 51 years to the day when he first teamed up with The Southern Gentlemen in 1964, Sonny James was inducted into The Birmingham Record Collectors Hall of Fame. Gary Robble, one of The Southern Gentlemen, accepted the award on behalf of Sonny and all of The Southern Gentlemen.\n <a href=\"https://www.last.fm/music/Sonny+James\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
