{"artist":{"name":"Sonny Landreth","mbid":"5ce64ed9-3015-4910-a2bb-1cd5c933de38","url":"https://www.last.fm/music/Sonny+Landreth","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/da98bc053b994309b0996c2fbddc5e11.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/da98bc053b994309b0996c2fbddc5e11.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/da98bc053b994309b0996c2fbddc5e11.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/da98bc053b994309b0996c2fbddc5e11.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/da98bc053b994309b0996c2fbddc5e11.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/da98bc053b994309b0996c2fbddc5e11.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"91752","playcount":"728566"},"similar":{"artist":[{"name":"Walter Trout","url":"https://www.last.fm/music/Walter+Trout","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e01bd5be3ab8405c9365c6dd0bbc2639.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e01bd5be3ab8405c9365c6dd0bbc2639.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e01bd5be3ab8405c9365c6dd0bbc2639.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e01bd5be3ab8405c9365c6dd0bbc2639.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e01bd5be3ab8405c9365c6dd0bbc2639.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e01bd5be3ab8405c9365c6dd0bbc2639.png","size":""}]},{"name":"Aynsley Lister","url":"https://www.last.fm/music/Aynsley+Lister","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6a7dcf4a29a6491dae8e6e042003a611.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6a7dcf4a29a6491dae8e6e042003a611.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6a7dcf4a29a6491dae8e6e042003a611.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6a7dcf4a29a6491dae8e6e042003a611.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6a7dcf4a29a6491dae8e6e042003a611.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6a7dcf4a29a6491dae8e6e042003a611.png","size":""}]},{"name":"Robben Ford","url":"https://www.last.fm/music/Robben+Ford","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/94452c9ba50f4f69b1d0b06e1a152943.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/94452c9ba50f4f69b1d0b06e1a152943.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/94452c9ba50f4f69b1d0b06e1a152943.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94452c9ba50f4f69b1d0b06e1a152943.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94452c9ba50f4f69b1d0b06e1a152943.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94452c9ba50f4f69b1d0b06e1a152943.png","size":""}]},{"name":"Anthony Gomes","url":"https://www.last.fm/music/Anthony+Gomes","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6f5dba745f8f4b308ef983c2e577a17f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6f5dba745f8f4b308ef983c2e577a17f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6f5dba745f8f4b308ef983c2e577a17f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6f5dba745f8f4b308ef983c2e577a17f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6f5dba745f8f4b308ef983c2e577a17f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6f5dba745f8f4b308ef983c2e577a17f.png","size":""}]},{"name":"Tommy Castro","url":"https://www.last.fm/music/Tommy+Castro","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5f9621b913b242dc99b50d18f9382191.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5f9621b913b242dc99b50d18f9382191.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5f9621b913b242dc99b50d18f9382191.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f9621b913b242dc99b50d18f9382191.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f9621b913b242dc99b50d18f9382191.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f9621b913b242dc99b50d18f9382191.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"blues rock","url":"https://www.last.fm/tag/blues+rock"},{"name":"slide guitar","url":"https://www.last.fm/tag/slide+guitar"},{"name":"guitar","url":"https://www.last.fm/tag/guitar"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Sonny+Landreth/+wiki"}},"published":"21 Apr 2006, 02:11","summary":"Clyde Vernon \"Sonny\" Landreth (born February 1, 1951) is an American blues musician from southwest Louisiana who is especially known as a slide guitar player. He was born in Canton, Mississippi, but soon after, his family moved to Jackson, Mississippi, before settling in Lafayette, Louisiana. When he is not touring and performing, he resides in Breaux Bridge, Louisiana.\n\nAlthough Landreth is an extremely competent guitarist in the conventional form, he is most well-known for his slide playing. <a href=\"https://www.last.fm/music/Sonny+Landreth\">Read more on Last.fm</a>","content":"Clyde Vernon \"Sonny\" Landreth (born February 1, 1951) is an American blues musician from southwest Louisiana who is especially known as a slide guitar player. He was born in Canton, Mississippi, but soon after, his family moved to Jackson, Mississippi, before settling in Lafayette, Louisiana. When he is not touring and performing, he resides in Breaux Bridge, Louisiana.\n\nAlthough Landreth is an extremely competent guitarist in the conventional form, he is most well-known for his slide playing. Landreth has developed a technique where he also frets notes and plays chords and chord fragments behind the slide while he plays. Landreth plays with the slide on his little finger, so that his other fingers have more room to fret behind the slide. He's also known for his unique right-hand technique, which involves tapping, slapping, and picking strings, using all of the fingers on his right hand.\n\nLandreth has worked steadily for decades and amassed a following among his fans and peers. Eric Clapton has said he is \"probably the most underestimated musician on the planet and also probably one of the most advanced.\n\nSonny Landreth's official website (Warning: Flash) is http://www.sonnylandreth.com. \n\n-----\nSonny Landreth released his Newest CD: \"From the Reach\"!“This ninth album, is the first is released on his own Landfall label. On it, the Louisiana-based slide guitar wizard does something unprecedented in his body of work, as he collaborates with five of the greatest guitar players on the planet – Eric Clapton, Mark Knopfler, Robben Ford, Eric Johnson and Vince Gill – for some jaw-dropping performances. Also making a house call is legendary New Orleans pianist and singer Dr. John and iconic Gulf Coast troubadour Jimmy Buffett and also features Nadirah Shakoor (backing vocals) from Buffett discovery. \n\nOn the opener, “Blue Tarp Blues,” Sonny trades solos with Knopfler, and the aural contrast between Sonny’s shimmering slide and the Dire Straits leaders’ biting Strat is a textural treat. Clapton cuts loose on the following “When I Still Had You,” adding his soulful voice to the choruses as well. Slowhand then wails on “Storm Of Worry”, a spooky slow blues reminiscent of his Bluesbreakers era.\n\n“The Milky Way Home” is a powerful instrumental rocker that features Eric Johnson on delectably distorted guitar passages that morph into his trademark violin-like sound. “The Goin’ On” shifts into a country rock groove, with Vince Gill and Sonny alternating guitar solos and lead vocals. Robben Ford brings his soulful tone and phrasing to “Way Past Long” and “Blue Angel (the latter with Gill on backing vocals), as Landreth swaps his trusty Strat for a Les Paul. Each of these performances is an extraordinary showcase of brilliant players reacting to each other in supremely inspired fashion.\n\n“I’ve wanted to make this kind of record for a long time – to do an entire album that would feature some of my favorite players as special guests,” says Landreth, who’s as articulate as he is virtuosic. “And after all these years, I’ve gotten to become friends with them, so that addressed the question of, who do you ask? Every one of them wanted to do it, so that really fired me up.”\n\n“The other thing was how to do it without it being yet another clichéd ‘duets’ album,” he continues. “Then I got the idea to write the songs specifically for each of the artists and that was the real hook for me, as a writer as well as a guitar player. I grew up listening to Eric and Mark, and these other players have influenced me along the way. Not only that, but we all came up listening to a lot of the same music, so we had common ground to work with. Once someone would say yeah, then I had to come up with songs that were worthy of them.”\n\nLandreth spent a year writing these songs, and another year putting the album together—a logistical feat of some magnitude considering the fact that every one of the principals, including Landreth, spends considerable time on the road. The process for most of the recording involved two stages. After Landreth had a particular song written, he went in the studio with his band and longtime engineer Tony Daigle and completed the basic tracks, leaving space for the guests. Daigle then sent his mix of the tune to the guest to contribute his or her parts. (The exceptions were the tracks with Gill, which were cut face to face in Nashville, and the one featuring Dr. John, which was recorded in New Orleans.)\n\n“I’d get back these fantastic solos, and I’d go, ‘Oh my God, I’ve gotta re-cut mine!” Sonny recalls with a laugh. He’s exaggerating, but he did take a second pass at a couple of his parts.\n\nThe final stereo mixes feature Landreth on the left and the other players on the right. “We did it to tap into the conversational aspect of it,” Sonny points out. Current technology brought virtually unlimited flexibility to the recording process, but in the end what matters is that the performances truly feel in the moment—even if that moment was actually separated by time and physical distance.\n\n“That was of course the goal with these performances,” Sonny confirms. “They’ve gotta feel right. I was going for the essence of what about these fabulous musicians inspired me to begin with, and that’s what I honed in on. I was able to go, ‘This sounds like a lick he would do,’ and then write that into the arrangement. The guests then had a chance to flesh the concepts out. I really wanted to make sure we captured each of their individual voices on the guitar, and I feel like we did that.”\n\nIn one of two delightful changes of pace to the album’s six-string focus, Dr. John brings the requisite gris-gris to “Howlin’ Moon” with his trademark rollicking piano and harmonies, on which he’s joined by Jimmy Buffett. “Although the central idea of the record was playing with my guitar heroes, I wanted to be open to the unexpected as well,” Sonny explains. “I’d written ‘Howlin’ Moon’ a long time ago, and I always had Dr. John in mind for it. Then we took it a step further with Jimmy’s vocal and the vibe was perfect.”\n\nAs for the rest, “Let It Fly,” a slice of exotica so warm that sweat drips off it, features backing vocals from Buffett discovery Nadirah Shakoor. The title of “Uberesso,” a blistering instrumental from Landreth and his band, was inspired by Sonny’s passion for espresso. The album closes with the metaphysical ballad “Universe,” as Gill adds his glorious voice to the goosebump finale.\n\nAnchoring the grooves is Landreth’s touring rhythm section featuring longtime musical partner Dave Ranson on bass and Mike Burch on drums. Steve Conn, another regular, is on keyboards. Sam Broussard plays acoustic guitar on “Universe” and “Let It Fly.”\n\nAs for the intriguing album title, “I thought about it a lot,” says Sonny. “One of the most interesting things to me in the songwriting process is letting it cook and bubble and see what comes up to the top. As I was writing these songs, the word ‘reach’ kept coming up, and ‘reach’ is a pretty powerful word. Aside from the obvious meanings, it can refer to a body of water. And the water imagery kept appearing as well, so it’s like this is what came up out of this whole project for me. What would happen if I invited all these people; where would this take me? I literally reached out to them, and they graciously came on board. Then there was the impact locally of Hurricane Katrina. So the title is the result of all of the above. It’s coming from an honest place.”\n\nThe same could be said of everything this one-of-a-kind artist has done in his single-minded career.\n\nSource:-- Bud Scoppa\n\nhttp://vetril.blogspot.com/2008/05/sonny-landreth-new-cd-from-reach.html\n\n\nLandreth was born February 1, 1951, in Canton, MS, and his family lived in Jackson, MS, for a few years before settling in Lafayette, LA. Landreth, who still lives in southwest Louisiana, began playing guitar after a long tenure with the trumpet. His earliest inspiration came from Scotty Moore, the guitarist from Elvis Presley's band, but as time went on, he learned from the recordings of musicians and groups like Chet Atkins and the Ventures. As a teen, Landreth began playing out with his friends in their parents' houses.\n\n\"They would ping-pong us from one house to another, and though we were all awful at first, as time went on we got pretty good. It's an evolutionary process, just like songwriting is,\" Landreth explained in an interview on his 44th birthday in 1995. After his first professional gig with accordionist Clifton Chenier in the 1970s (where he was the only White guy in the Red Beans and Rice Revue for awhile), Landreth struck out on his own, but not before he recorded two albums for the Blues Unlimited label out of Crowley, LA, Blues Attack in 1981 and Way Down in Louisiana in 1985. If anyone is living proof of the need to press on in spite of obstacles, it is Landreth.\n\nThe second of those two albums got him noticed by some record executives in Nashville, which in turn led to his recording and touring work with John Hiatt. That led to still more work with John Mayall, who recorded Landreth's radio-ready \"Congo Square.\" More recently, he's worked with New Orleans bandleader and pianist Allen Toussaint (who guests on several tracks on South of I-10, as does Dire Straits guitarist Mark Knopfler). In the last years he was on tour with guitarist, composer and singer Hank Shizzoe.\n\nOn Landreth's brilliant albums for Zoo, the lyrics draw the listener in to the sights, sounds, smells and heat of southwest Louisiana, and a strong sense of place is evident in many of Landreth's songs. Although his style is completely his own and his singing is more than adequate, Landreth admits that writers like William Faulkner have had a big influence on his lyric writing. The fact that it's taken so long for academics at American universities to recognize the great body of poetry that blues is concerns Landreth as well. Robert Johnson is Landreth's big hero when it comes to guitar playing. \"When I finally discovered Robert Johnson, it all came together for me,\" Landreth said, noting that he also closely studied the recordings of Skip James, Mississippi John Hurt and Charley Patton.\n\nFOR SPECIAL VIDEOS See Also:\nYoutube channel: \"Sonny Landreth's Specials\": http://www.youtube.com/user/WilliamMusicEater \n <a href=\"https://www.last.fm/music/Sonny+Landreth\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
