{"artist":{"name":"Sophie B. Hawkins","mbid":"fd7a8bc1-1b25-4b4c-b899-8f7b3343a229","url":"https://www.last.fm/music/Sophie+B.+Hawkins","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/94aaab6c5c382a396f411dee0287915a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/94aaab6c5c382a396f411dee0287915a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/94aaab6c5c382a396f411dee0287915a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94aaab6c5c382a396f411dee0287915a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94aaab6c5c382a396f411dee0287915a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94aaab6c5c382a396f411dee0287915a.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"211853","playcount":"1347968"},"similar":{"artist":[{"name":"Donna Lewis","url":"https://www.last.fm/music/Donna+Lewis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2c62b73fb2d1ac3c3a4a2f95b75ab9d4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2c62b73fb2d1ac3c3a4a2f95b75ab9d4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2c62b73fb2d1ac3c3a4a2f95b75ab9d4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c62b73fb2d1ac3c3a4a2f95b75ab9d4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c62b73fb2d1ac3c3a4a2f95b75ab9d4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c62b73fb2d1ac3c3a4a2f95b75ab9d4.png","size":""}]},{"name":"Paula Cole","url":"https://www.last.fm/music/Paula+Cole","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e0d11637c1bb4c208bee0e767b81ffe7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e0d11637c1bb4c208bee0e767b81ffe7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e0d11637c1bb4c208bee0e767b81ffe7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0d11637c1bb4c208bee0e767b81ffe7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0d11637c1bb4c208bee0e767b81ffe7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e0d11637c1bb4c208bee0e767b81ffe7.png","size":""}]},{"name":"Jewel","url":"https://www.last.fm/music/Jewel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/571de3760ca6556585f62f598f8ce626.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/571de3760ca6556585f62f598f8ce626.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/571de3760ca6556585f62f598f8ce626.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/571de3760ca6556585f62f598f8ce626.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/571de3760ca6556585f62f598f8ce626.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/571de3760ca6556585f62f598f8ce626.png","size":""}]},{"name":"Lisa Loeb","url":"https://www.last.fm/music/Lisa+Loeb","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/264a80cfacdb4dac85356f4f9ea015e2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/264a80cfacdb4dac85356f4f9ea015e2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/264a80cfacdb4dac85356f4f9ea015e2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/264a80cfacdb4dac85356f4f9ea015e2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/264a80cfacdb4dac85356f4f9ea015e2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/264a80cfacdb4dac85356f4f9ea015e2.png","size":""}]},{"name":"Sarah McLachlan","url":"https://www.last.fm/music/Sarah+McLachlan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b7128d8127b54d86bc6eb3c558f9ef56.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b7128d8127b54d86bc6eb3c558f9ef56.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b7128d8127b54d86bc6eb3c558f9ef56.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b7128d8127b54d86bc6eb3c558f9ef56.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b7128d8127b54d86bc6eb3c558f9ef56.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b7128d8127b54d86bc6eb3c558f9ef56.png","size":""}]}]},"tags":{"tag":[{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"90s","url":"https://www.last.fm/tag/90s"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Sophie+B.+Hawkins/+wiki"}},"published":"14 May 2006, 08:45","summary":"Vulnerability underscored by grit. Strength sealed by fire. Mood driven by melody. Reconciliation that\nturns to inspiration. This is the territory of Sophie B. Hawkins’ remarkable sixth album, which is at once the most directly personal, musically transporting and defiantly raw work yet from the Grammy nominated\nsinger/songwriter.\n\nSince her instantaneous 1992 breakthrough with the indelible hit single “Damn I Wish I Was Your\nLover” and her acclaimed debut album Tongues and Tails <a href=\"https://www.last.fm/music/Sophie+B.+Hawkins\">Read more on Last.fm</a>","content":"Vulnerability underscored by grit. Strength sealed by fire. Mood driven by melody. Reconciliation that\nturns to inspiration. This is the territory of Sophie B. Hawkins’ remarkable sixth album, which is at once the most directly personal, musically transporting and defiantly raw work yet from the Grammy nominated\nsinger/songwriter.\n\nSince her instantaneous 1992 breakthrough with the indelible hit single “Damn I Wish I Was Your\nLover” and her acclaimed debut album Tongues and Tails, Hawkins has proved an enduring artist with a fierce commitment to constantly evolving, while remaining steadfastly true to her own authentic history and experience. This comes to the fore as she breaks open her heart without reservation on The Crossing, her longawaited first album of new songs in several years. It is a searing, lush and startlingly naked chronicle of the most intense period of Hawkins’ life, in which she has come to terms with her father’s death, openly surrendered to the haunting specter of her past, discovered the exhilaration of motherhood and arrived at a profound reckoning of acceptance. All of this emerges in songwriting and vocals that mix the brashly playful and the unabashedly poignant in fresh ways for Hawkins.\n\n“I was really reaching for somewhere new as I wrote these songs,” she explains. “It all started with\ngetting a letter from my sister that my father was dying – and, in a way, that opened up not only struggle and emotion but all these opportunities for healing. I had to acknowledge that I’d never be able to heal the abyss created by my parents’ alcoholism. I had to say this is how it was, this is how it is with me now and surrender to the grace of that. These feelings have always been there in my writing but it’s like I always kind of danced around them in my songs and now I was ready to go head-on into them. The songs began to express a kind of eternal dream I’ve had, that I think we all have, for a moment of peace and clarity, for the ability to get beyond our personal struggles and move out into the larger world -- knowing exactly where you stand in it.”\n\n\nThe eleven songs on her upcoming album, The Crossing spilled out of Sophie B. Hawkins in a way she had never experienced before in a lifetime of diverse and critically admired songwriting – yet were so closely entwined with her very being, she confesses they felt at first like secrets that needed to be kept. “I didn’t play these songs to anybody, not a soul, for a long time,” she acknowledges. “But as I wrote, I developed deeper and deeper roots of strength. I felt it was time to do something that might scare me. And what I love about these songs is that they are very, very emotional but they aren’t filled with baggage. There’s something very unconscious about them, a letting go, and they seem to bring people a lot of joy.”\n\nHoping to sustain the stripped-bare honesty of how the songs were written, Hawkins created the album\nin a sonically hand-made way – recording entirely in her home studio and keeping the sparse, spontaneous immediacy of a demo-like sound. She engineered the album herself. “The album is entirely me with just drums, bass, guitar and flugel. I didn’t hire a band – I just would meet one musician at a time and have them come to the house to record and it was a very spacious and organic process. I became an engineer really by instinct. I kept things very simple and told the musicians to just have fun. It felt like it unfolded all on its own -- I really wanted to retain the feel of these songs that were written completely in the moment and I think we did. I felt lucky just to be there watching this be created.”\n\nThe tracks on The Crossing have that rare quality of feeling like an expedition underneath a human\nskin, revealing a woman who has dragged wisdom and strength from a lion’s den of complicated relationships and life experiences. The journey ranges from the feisty “Bet Ya Got A Cure” which Hawkins calls “a personal, guttural response to everything I’ve seen and a reminder that we’re all too easily lulled by what’s easy instead of the parts of life that require you to be really brave”; to the powerful testament “Heart and Soul of a Woman,” an ode to feminine strength (in all forms) which Hawkins notes was inspired in part by her experiences working on Hilary Clinton’s historic Presidential campaign; to the fluid, crescendoing “Life Is a River,” which Hawkins says is about the idea “that you don’t really know who you are until you’re challenged.”\n\nSome of the most personally revealing tracks include “Missing,” an impassioned reckoning with the dark\ntruths of her past that Hawkins says is about that “really simple dream of coming to the purest place of common ground with someone no matter what went on before. It also has this great feeling for me of New York in the springtime.” She makes a bold, no-holds barred declaration of independence in “I Don’t Need You,” then turns reflective in “Red Bird,” which was written after a friend was hit by a car and Hawkins muses “is about those moments when you have to move on, even though you don’t necessarily want to leave where you are, you can’t help but go forward.” Then there is “Dream Street & Chance,” a jazzy, modern torch song about possibility and acceptance. “There’s a lot of personal symbolism in that song,” notes Hawkins. “When I talk about the weatherman’s castle it goes back to me wanting to be a weatherman as a child, which my father used to tease me about. The song goes back to the idea of a sacred childhood, which is a part of being human no matter what your experience with childhood is, and which I think is the source of all creativity.”\n\nEvocative themes weave throughout the album from innocence and the purity of love in “A Child” (which\nmorphs into Hawkins’ sultry take on “Summertime And The Living Is Easy”) to the human need for the natural world in “The Land, The Sea and The Sky” to the brassy rebelliousness of youth in the sexy, sunny, straightahead pop song “Georgia.” Hawkins also collaborated with Academy Award®-winning actress Mary Steenburgen on the heart-felt, Joplinesque folk ballad “Gone Baby.” “I met Mary at a Clinton rally and in the middle of everything she mentioned that she wrote songs,” Hawkins recalls. “Later, she sang one of her songs to me over the phone and she was like a lone wolf in the desert. I felt that the song was all there, it just needed to be developed. It turned out to be a great partnership and I got so much out of working with her.”\n\nIn the end, the album became to Hawkins a kind of line in the sand: “These songs were written right on\nthat border between transcending the person I used to be and opening up to something new, to realizing I’ve come to a place where I can bring more love, more passion and more energy to my life and creation. It’s an acceptance of where I’ve been and a declaration of where I’m standing I am right now.”\n\nIn the middle of writing the songs for her new album, Hawkins received an unusual chance to take an\nartistic left turn. Hawkins was asked by her longtime manager and acclaimed filmmaker, Gigi Gaston, to join her in pitching a musical Gigi had been working on with Kristin Chenoweth, the Tony & Emmy award-winning singer and actress (Glee, Pushing Daisies, Wicked), in which Chenoweth would star. The musical had deep roots, having been started by Gaston’s mother, Theodora Lynch, in 1950, and now the three women were inspired to bring an extraordinary story back to life. A fan of Hawkins’ music, Chenoweth asked Sophie to write the new music & lyrics for a book by Gaston and Tony-award winning Broadway legend Thomas Meehan (Annie, The Producers, Hairspray), who joined the project as co-writer soon after.\n\n“When Gigi, my manager first approached me about writing a Broadway musical, I thought ‘there’s no\nway,’“ Sophie laughs. “It was completely outside anything I’d ever done, but at the same time, I’ve always loved musicals and some of my favorite songwriters and singers come from the theatre world, which has had a huge influence on me. I started to think that just maybe I had it in me.”\n\nAfter that fateful first meeting between Gaston, Chenoweth and Hawkins, the journey began.\nTentatively at first, Hawkins began writing with Gaston, then further collaborating with Meehan. It was a fresh and creative adventure that became a perfectly timed yin-yang contrast to Hawkins’ work on the album.\n\n“It has been a grand experiment and a lot of hard work but it was also an amazing opportunity to\nexplore a completely different creative process,” Hawkins explains. “Here I was writing these intensely\nemotional songs for the album, so working on the musical became a welcome release from that. It wasn’t about me, it was about fictional characters and the arc of telling a dramatic story -- and I could immerse myself in that in a whole different way. It’s a more intellectual way of writing, but it also became more unconscious and poetic as it went along. It was also great for me because I have rarely collaborated lyrically with anyone and it was very interesting to work with other people’s ideas and themes. I was moving back and forth between these songs for the album that were so personal on the one hand, and then on the other, working in a very collaborative atmosphere on something structured and theatrical. It was a great contrast that I think allowed me to explore more of the potential of who I am.”\n\n\nThe Crossing is in many ways the culmination of Sophie B. Hawkins’ life-long apprenticeship in\ncreative transcendence. Hawkins grew up in a colorful but troubled New York family and found an outlet for her yearning and imagination in music at 14 years old, Drawn to the intensity and spell of rhythm, she left home then and moved in with her African Drum teacher Godson, and African master drummer Babutune Olatunji, to learn, eat and breathe music. She entered the rarified realm of female percussionists, playing with a number of artists including Bryan Ferry, until she literally found the strength of her own voice. In 1992, she cut her first demo as a singer, and it would go on to become the international hit single, “Damn I Wish I Was Your Lover,” showcasing the tough-yet-tender, movingly transparent vocals that would become her trademark.\n\nHer first album, Tongues and Tails, full of primal, fiery pop, was an immediate success, earning her a\nGrammy nomination for “Best New Artist.” Hawkins followed that with Whaler, which featured the smash ballad, “As I Lay Me Down,” which remains the longest-running hit single in the Billboard charts in American history. The album, as equally gutsy as her first yet an atmospheric departure sealed her rising reputation for musical breadth and lyrical depth.\n\nHawkins’ third album, Timbre, in which she broke out into a more earthy, stripped-back sound that\naimed at the core of her personal expression, was released in 1999. In a move toward artistic independence, Hawkins worked out an arrangement that would allow her to leave her label while retaining the masters to Timbre. She re-released the album on her newly born label Trumpet Swan Productions – then hit the road, on her own this time, just Sophie and her band touring the country in a station wagon.\n\n2004’s Wilderness saw Hawkins diving into a jazzier style for what would become her most musically\nlayered and emotionally complex album yet, and the first recorded entirely in her Los Angeles home studio. Playfully exploring a collage of musical influences and her own multi-instrumental talents, Hawkins played guitar, cello, keyboard, drums and a variety of exotic percussion on a recording Rolling Stone singled out for its “dreamy charm.”\n\nThe roiling energy and close intimacy of Hawkins’ live shows was captured in 2006’s Bad Kitty Board\nMix, a two-disc set recorded in Seattle. Spotlighting her improvisational instincts, Hawkins says she wanted this live album to be something different, “not just the songs you already know, but what they become in front of you, totally raw, exposed and new every night.”\n\nIn 2008, Hawkins’ life took one of its most dramatic and enlarging turns yet, as she became the proud\nmother of a son, Dashiell, now only 14 months old. “Becoming a mother gave me an amazing new perspective on being an artist,” she muses. “There’s an immense amount of truth and honesty and presence that comes out in our relationship. It’s a constant reminder that the most beautiful thing you can ever do for another person is to fully, passionately and fearlessly express yourself and what you believe in.” <a href=\"https://www.last.fm/music/Sophie+B.+Hawkins\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
