{"artist":{"name":"Sounds Of Blackness","mbid":"4f9d560b-f378-4bdb-9676-8b7aa7744821","url":"https://www.last.fm/music/Sounds+Of+Blackness","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3ec70af8e07240e0a1ab96e574e4500b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3ec70af8e07240e0a1ab96e574e4500b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3ec70af8e07240e0a1ab96e574e4500b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3ec70af8e07240e0a1ab96e574e4500b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3ec70af8e07240e0a1ab96e574e4500b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3ec70af8e07240e0a1ab96e574e4500b.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"38788","playcount":"216893"},"similar":{"artist":[{"name":"Brownstone","url":"https://www.last.fm/music/Brownstone","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/201acc2159ed4010b5ffcb340ed5119b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/201acc2159ed4010b5ffcb340ed5119b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/201acc2159ed4010b5ffcb340ed5119b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/201acc2159ed4010b5ffcb340ed5119b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/201acc2159ed4010b5ffcb340ed5119b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/201acc2159ed4010b5ffcb340ed5119b.png","size":""}]},{"name":"Kirk Franklin","url":"https://www.last.fm/music/Kirk+Franklin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fe0add57964847b689a301f8a410b74a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fe0add57964847b689a301f8a410b74a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fe0add57964847b689a301f8a410b74a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe0add57964847b689a301f8a410b74a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe0add57964847b689a301f8a410b74a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe0add57964847b689a301f8a410b74a.png","size":""}]},{"name":"Alexander O'Neal","url":"https://www.last.fm/music/Alexander+O%27Neal","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/34e5c82bbaf9497280ce43d1d7440c4d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/34e5c82bbaf9497280ce43d1d7440c4d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/34e5c82bbaf9497280ce43d1d7440c4d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/34e5c82bbaf9497280ce43d1d7440c4d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/34e5c82bbaf9497280ce43d1d7440c4d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/34e5c82bbaf9497280ce43d1d7440c4d.png","size":""}]},{"name":"Mary Mary","url":"https://www.last.fm/music/Mary+Mary","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b0135dfb751c46b28e7e360622118f79.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b0135dfb751c46b28e7e360622118f79.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b0135dfb751c46b28e7e360622118f79.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b0135dfb751c46b28e7e360622118f79.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b0135dfb751c46b28e7e360622118f79.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b0135dfb751c46b28e7e360622118f79.png","size":""}]},{"name":"Tony Toni Toné","url":"https://www.last.fm/music/Tony+Toni+Ton%C3%A9","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b4b24e3c133f4af49049462307dd2b29.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b4b24e3c133f4af49049462307dd2b29.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b4b24e3c133f4af49049462307dd2b29.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b4b24e3c133f4af49049462307dd2b29.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b4b24e3c133f4af49049462307dd2b29.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b4b24e3c133f4af49049462307dd2b29.png","size":""}]}]},"tags":{"tag":[{"name":"gospel","url":"https://www.last.fm/tag/gospel"},{"name":"soul","url":"https://www.last.fm/tag/soul"},{"name":"funk","url":"https://www.last.fm/tag/funk"},{"name":"House","url":"https://www.last.fm/tag/House"},{"name":"sounds of blackness","url":"https://www.last.fm/tag/sounds+of+blackness"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Sounds+Of+Blackness/+wiki"}},"published":"08 Jan 2007, 09:34","summary":"A Grammy Award-winning vocal and instrumental ensemble from Minneapolis/St. Paul, Minnesota who perform music from several genres of African-American music including gospel, R&B, soul, and jazz, and who scored several big hits on the Billboard R&B chart and Billboard Hot Dance Music/Club Play chart in the 1990s. The group has received three Grammy Awards, four Stellar Awards, one Emmy nomination, the International Time for Peace Award, the International Dance Music Award and an NAACP Image Award nomination. <a href=\"https://www.last.fm/music/Sounds+Of+Blackness\">Read more on Last.fm</a>","content":"A Grammy Award-winning vocal and instrumental ensemble from Minneapolis/St. Paul, Minnesota who perform music from several genres of African-American music including gospel, R&B, soul, and jazz, and who scored several big hits on the Billboard R&B chart and Billboard Hot Dance Music/Club Play chart in the 1990s. The group has received three Grammy Awards, four Stellar Awards, one Emmy nomination, the International Time for Peace Award, the International Dance Music Award and an NAACP Image Award nomination. The chief lead singer of the group was Ann Nesby until 1995 when Nesby left the group to pursue a solo career.\nThe group was founded in 1969 by Russell Knight at Macalester College in St. Paul, Minnesota, and the group was called the Macalester College Black Voices. It was in 1971 when current director Gary Hines took leadership over the ensemble, and the group name was officially changed to Sounds of Blackness (SOB). The group had acquired local celebrity status throughout the years though never signed with a record company because of various reasons including the fact that many companies were not comfortable with the group's name. Some companies even suggested to Hines that the group's name be changed to \"The Sounds of Music.\"\nMega-hit producers Jimmy Jam and Terry Lewis, who are also from the Minneapolis/St. Paul area, had become familiar with the group and used their talent as back-up in a few of their productions in the mid 1980s. It was not until January 1989 when Jam and Lewis finally made their decision to sign the group to their new record label, Perspective Records. Janet Jackson, who worked heavily with Jam and Lewis, was a major factor in the pair's decision after the two brought Jackson to an SOB concert in early 1989, and Jackson enthusiastically encouraged Jam and Lewis to sign them.\nThe Sounds of Blackness' first album, The Evolution of Gospel, released in 1991, was a major success and spawned the hit singles, \"Optimistic,\" \"Testify,\" and \"The Pressure.\" The single \"Optimistic\" became the group's biggest hit of all time peaking at #3 on the Billboard R&B chart. The group hit #1 on the Billboard Hot Dance Music/Club Play chart in 1991 with \"The Pressure Pt. 1.\" The song was later featured in the Disney movie \"First Kid\". The immense success of The Evolution of Gospel culminated in a Grammy Award for Best Gospel Album by Choir or Chorus in 1992.\nThe Night Before Christmas: A Musical Fantasy was released in 1992, and also in 1992, the group contributed to the Grammy Award-winning Handel's Messiah: Soulful Celebration album and the Mo' Money soundtrack with the track \"Joy,\" produced by Jam and Lewis.\nIn 1994, SOB released their third album Africa to America: The Journey of the Drum on Perspective Records to much critical acclaim. They topped the dance chart again with \"I Believe\", which also scraped into the Hot 100, peaking at #99. Singles \"Everything is Gonna Be Alright,\" \"I'm Going All the Way,\" and \"The Harder They Are, the Bigger They Fall\" also charted, which featured producer/songwriter James \"Big Jim\" Wright. Also in this year, the group performed for the World Cup. It was after this album that Ann Nesby, lead singer, parted from the group to begin her solo career. Jam and Lewis, the producers responsible for many of the group's greatest hits, also ended their production work with the group after this album.\nSounds Of Blackness released Time for Healing on Perspective Records in 1997 and charted on the Hot 100 Singles Sales chart (#70) with \"Spirit\", a collaboration with hip hop artist Craig Mack. The single \"Hold On (Change is Comin')\" also charted. After seven years with Perspective Records, SOB and director Gary Hines decided to part with the label in 1998. In 1999, the group released Reconciliation on Zinc Records and performed at the White House for a Christmas party.\nIn 2001, A&M Records released a greatest hits compilation entitled The Very Best of Sounds of Blackness. The group formed their own record label in 2002, Sounds of Blackness Records, and released Soul Symphony which was hailed by many as a triumphant comeback for the group.\nThe ensemble released a remake of their Christmas album in 2004 called The Night Before Christmas, Vol. 2 on Atomic K Records. The next year, SOB released Unity on Lightyear Records with the return of Ann Nesby on lead vocals for two songs. The group continues to perform internationally. The Sounds' newest album entitled Kings and Queens: Message Music from the Movement will be released on September 11, 2007.\n\nFormed: 1971\nGenre: Gospel, Reggae\nStyles: World Fusion, Contemporary Gospel, CCM, Urban\nGroup Members:Formed: 1971\n\nGroup Members: Jamecia Bennett, Core Cotton, Robert Edwards, LaSalle Gabriel, Valerie Johnson, Wanda Lewis, Larry Sims, Billy Steele, Jimmy Wright, Lance Alexander, Gary Hines, Jennifer Whitlock, Kevin Whitlock, Shirley Marie Graham, Franklin Wharton, Louis J. Wilson, Trenon Graham, Carrie Harrington, Ann Bennett-Nesby, Terrence Frierson, Patricia Lacy, Beverly Mahto, Dorothy Shelby, Dorothy J. Townes, Cheryl D. Warder-..., David Wright III, Rojeem Taylor, Rev. Joseph Young..., Elizabeth J. Turner, Angela Henderson, Geoffrey Jones, Renee McCall, Alecia Russell, Sandra Harris, Gregory Sears \n\nBiography:\n\nSounds of Blackness, a 40-person choir and ten-piece orchestra led by Gary Hines, combined traditional African music with urban soul to become one of the most distinctive and popular contemporary gospel groups. Over the course of their career, the group won many awards, from organizations as diverse as the Grammies and the NAACP.\n\nRussel Knight formed the group that would prove to be the origins of Sounds of Blackness in 1969 at St. Paul, Minnesota's Macalester College in 1971. It wasn't until 1971, when Gary Hines was hired as their musical director, that the group developed its own identity. Hines opened the group up to the entire community and expanded their musical scope to concentrate on all aspects of black music. He designed the group as a way to embrace all manners of African-American music and create rich, diverse music to celebrate God and the human spirit, as well as make social statements. With their new direction in mind, the group renamed themselves Sounds of Blackness.\n\nFor the first decade and a half of the group's existence, Sounds of Blackness primarily played around Minneapolis, often opening for acts as diverse as the Jackson 5 and Hampton Hawes. They frequently released their own records, which helped them strengthen their local following.\n\nPartially by choice, Sounds of Blackness remained a regional attraction until 1989, when Jimmy Jam and Terry Lewis, the hot Minneapolis-based production team, brought Janet Jackson to one of their concerts. Jackson's enthusiastic response inspired Jam & Lewis, who were already in negotiations with Sounds of Blackness, to sign the group to Perspective/A&M immediately. Before the Perspective deal, any major label interested in the Sounds of Blackness asked the group to streamline their sound to include only gospel or R&B, or asked them to change their name to Sounds of Music; it wasn't until Perspective that they were allowed to keep their style and sound intact.\n <a href=\"https://www.last.fm/music/Sounds+Of+Blackness\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
