{"artist":{"name":"Behemoth","mbid":"69632f9c-31eb-43d5-a864-e73ac72efc66","url":"https://www.last.fm/music/Behemoth","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/83c4bb8ac931427f8cb4fbd28145d02c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/83c4bb8ac931427f8cb4fbd28145d02c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/83c4bb8ac931427f8cb4fbd28145d02c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/83c4bb8ac931427f8cb4fbd28145d02c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/83c4bb8ac931427f8cb4fbd28145d02c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/83c4bb8ac931427f8cb4fbd28145d02c.png","size":""}],"streamable":"0","ontour":"1","stats":{"listeners":"377902","playcount":"30273640"},"similar":{"artist":[{"name":"Belphegor","url":"https://www.last.fm/music/Belphegor","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9329d7a9b222413525f6ceaeb9ffebe8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9329d7a9b222413525f6ceaeb9ffebe8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9329d7a9b222413525f6ceaeb9ffebe8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9329d7a9b222413525f6ceaeb9ffebe8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9329d7a9b222413525f6ceaeb9ffebe8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9329d7a9b222413525f6ceaeb9ffebe8.png","size":""}]},{"name":"Marduk","url":"https://www.last.fm/music/Marduk","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ece11516ba3520509877ad1961b8fe94.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ece11516ba3520509877ad1961b8fe94.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ece11516ba3520509877ad1961b8fe94.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ece11516ba3520509877ad1961b8fe94.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ece11516ba3520509877ad1961b8fe94.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ece11516ba3520509877ad1961b8fe94.png","size":""}]},{"name":"Vader","url":"https://www.last.fm/music/Vader","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0780a53c04f04451c43e294088aa52ed.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0780a53c04f04451c43e294088aa52ed.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0780a53c04f04451c43e294088aa52ed.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0780a53c04f04451c43e294088aa52ed.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0780a53c04f04451c43e294088aa52ed.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0780a53c04f04451c43e294088aa52ed.png","size":""}]},{"name":"Dark Funeral","url":"https://www.last.fm/music/Dark+Funeral","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/40824ad7e6aa46b2b121db4527c92abe.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/40824ad7e6aa46b2b121db4527c92abe.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/40824ad7e6aa46b2b121db4527c92abe.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40824ad7e6aa46b2b121db4527c92abe.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40824ad7e6aa46b2b121db4527c92abe.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40824ad7e6aa46b2b121db4527c92abe.png","size":""}]},{"name":"Satyricon","url":"https://www.last.fm/music/Satyricon","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f5b38f4fb04b44e1bb3be137b765e16e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f5b38f4fb04b44e1bb3be137b765e16e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f5b38f4fb04b44e1bb3be137b765e16e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f5b38f4fb04b44e1bb3be137b765e16e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f5b38f4fb04b44e1bb3be137b765e16e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f5b38f4fb04b44e1bb3be137b765e16e.png","size":""}]}]},"tags":{"tag":[{"name":"death metal","url":"https://www.last.fm/tag/death+metal"},{"name":"black metal","url":"https://www.last.fm/tag/black+metal"},{"name":"Blackened Death Metal","url":"https://www.last.fm/tag/Blackened+Death+Metal"},{"name":"metal","url":"https://www.last.fm/tag/metal"},{"name":"polish","url":"https://www.last.fm/tag/polish"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Behemoth/+wiki"}},"published":"10 Feb 2006, 13:44","summary":"There are multiple artists with this name:\n\n1) Behemoth is a Polish blackened death metal band from Gdańsk. They are considered to have played an important role in establishing the Polish extreme metal underground, alongside bands such as Vader, Decapitated, Vesania and Hate. Over the years Behemoth has moved from traditional black metal into blackened death metal and then into modern death metal with each consecutive release. They have released 9 full length albums so far. <a href=\"https://www.last.fm/music/Behemoth\">Read more on Last.fm</a>","content":"There are multiple artists with this name:\n\n1) Behemoth is a Polish blackened death metal band from Gdańsk. They are considered to have played an important role in establishing the Polish extreme metal underground, alongside bands such as Vader, Decapitated, Vesania and Hate. Over the years Behemoth has moved from traditional black metal into blackened death metal and then into modern death metal with each consecutive release. They have released 9 full length albums so far.\n\nThe band was formed in 1991 as a trio, starting with raw and primitive black metal rehearsal tapes (Endless Damnation) and demos (The Return of the Northern Moon), the most significant of which was the second one—...From the Pagan Vastlands (1993)—showing the growing potential of the then teenage Nergal. Tomasz Wróblewski likes to announce that his metal influences sprung from Black Sabbath for giving him his ideas of \"demonic\" chords.\n\nThis tape was released by Polish label Pagan Records and later on by the American Wild Rags. Signing with a little-known black metal bands from mid-eastern Europe with enormous potential. Consequently, stepping forward, the band (as the three piece with Nergal, Baal, and Les) recorded their second album Grom.\n\nAt the same time they recorded Grom, Behemoth finally got a chance to play live shows in its native country and finally tour around Europe, gaining stage experience as well as positive feedback from the audience. Two years later, the band recorded a third album, titled Pandemonic Incantations which was a \"breakthrough moment\" in Behemoth's short career. The reactions of their ever-increasing fanbase and metal media set a new standard for them. However, due to a lack of promotion, the album was not well-publicized. After another extensive tour, Behemoth signed a two-album deal with Italy's Avantgarde Music in the fall of 1998. The first result of this new collaboration was the successful album Satanica, on which the black metal sound had evolved into blackened death metal.\n\nThe label also secured two European tours for the band in support of Deicide and Satyricon respectively. During that period, Behemoth had to go through some line-up changes and problems with their ex-Polish label. The new members then were Novy (formerly known from Devilyn, now in Vader, Dies Irae) who handled the bass duties and Havok who became the band's guitarist. The new line-up resulted in Behemoth signing with Mystic, a Polish label. The next follow-up release to Satanica was Thelema.6. Massive guitar parts and precise drumming, with influences from different sources, showed that Behemoth were there to offer something really varied and innovative once again[citation needed], complete with characteristic fierce brutality and speed. Arrangements and technical invention on individual compositions made the album an ultimate one for the blackened death metal genre.\n\nThelema.6 has been supported by the worldwide press and media[citation needed], including having their album being officially released in Russia and Brazil for the first time. Continuing the support for Thelema.6, Behemoth appeared in several prestigious live events like Wacken Open Air, With Full Force, Inferno Metal Festival, Mystic Festival, and Mind Over Matter Autumn. They started first headlining tour alongside with Carpathian Forest and Khold, followed by festival tour in Poland (Thrash em All Fest. with Vader and Krisiun, among others).\n\nIn 2001, Behemoth focused on writing new material for a sixth studio album. Meantime, they completed their second headlining tour in Russia, Belarus and Ukraine. Having completed the recording of their new songs, Behemoth entered Hendrix Studio for the second time, with help of their friend and sound engineer Arkadiusz Malczewski, and produced Zos Kia Cultus (Here and Beyond). The result was impressive and overwhelming for their detractors who thought that the band couldn't reach newer heights following Thelema.6.\n\nIn February 2003, the band started their first tour in Norway, playing in cities such as Bergen, Oslo and Stavanger. On March 11, 2003, the American premiere, scheduled by Century Media Records, headlined Behemoth's first appearance in the US continent. The tour started on the 9th of March at the New Jersey's Metalfest and continued with a decent amount[citation needed] of shows across America and Canada, with the company of Deicide, Revenge, Vehemence and Amon Amarth. Shortly after doing their first US tour the band was invited to join the Blackest of the Black Tour by Glenn Danzig. The already legendary festival included acts like Danzig, Superjoint Ritual, Nile, and Opeth. In the fall of 2003, Behemoth flew over to US to complete their third tour with Six Feet Under, Skinless and Black Dahlia Murder. The band did their Finnish debut appearance on the famous Tuska Festival with Ministry, Soulfly, among others. At that time, due to some line up difficulties, Nergal parted his ways with Havok and Novy, who decided to focus on activities with their own bands. Eventually, the band resumed touring in the UK and Europe.\n\nIn 2004, their seventh studio album, Demigod was released to good critical response. Recorded at the Hendrix Studios, the album debuted at number 15 on the national Polish album charts. Music videos for the songs \"Conquer All\" and \"Slaves Shall Serve\" were also shot. In fall 2005 the band headlined the Demigod supremacy Canadian tour 2005 with Necronomicon\n\nIn 2007, the band toured Europe alongside Napalm Death, Moonspell and Dew-Scented. Behemoth released their eighth studio album The Apostasy in July of that year. It was recorded at Radio Gdańsk studio in December, 2006. Shortly after the release of The Apostasy, the band was featured as one of Ozzfest 2007's second stage headliners, one of the four non-US bands playing that year. In October/November 2007, they played their first US headlining tour alongside Job For A Cowboy, Gojira, and Beneath The Massacre. In October/November 2007 the band toured Europe alongside Canadian death metal combo Kataklysm and Belgium's Aborted.\n\nIn February 2008 Behemoth toured Europe headlining over Suicide Silence. In April/May 2008 the band toured North America as part of \"The Invaluable Darkness\" tour with Keep of Kalessin and headliner Dimmu Borgir. Behemoth spent the summer playing a number of prominent festivals all over Europe.\n\nIn October 2008, Behemoth released their first live album, At the Arena ov Aion – Live Apostasy. Also, an EP called Ezkaton was released featuring a re-recorded version of Chant for Eschaton 2000, one new song, two covers, and three live songs. The EP has been released in North America on November 11.\n\nIn August 2009, the band released their newest effort  \"Evangelion\". The album received positive reviews from the metal press.\n\n2) Behemoth was a Swedish black metal band, who released 2 demotapes in 1993/1994.\n\n3) Behemoth was a Swedish heavy metal band, released the 7\" Deathwings in 1982.\n\n\n <a href=\"https://www.last.fm/music/Behemoth\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
