{"artist":{"name":"Spade Cooley","mbid":"2c5485d8-2f98-4033-a693-05da7b073813","url":"https://www.last.fm/music/Spade+Cooley","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/21474689dc5949a0b92947275d3d45cf.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/21474689dc5949a0b92947275d3d45cf.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/21474689dc5949a0b92947275d3d45cf.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21474689dc5949a0b92947275d3d45cf.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21474689dc5949a0b92947275d3d45cf.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21474689dc5949a0b92947275d3d45cf.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"9172","playcount":"50464"},"similar":{"artist":[{"name":"Hank Penny","url":"https://www.last.fm/music/Hank+Penny","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d52191e0e8d24b3f92934f833adceb2f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d52191e0e8d24b3f92934f833adceb2f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d52191e0e8d24b3f92934f833adceb2f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d52191e0e8d24b3f92934f833adceb2f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d52191e0e8d24b3f92934f833adceb2f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d52191e0e8d24b3f92934f833adceb2f.png","size":""}]},{"name":"Al Dexter","url":"https://www.last.fm/music/Al+Dexter","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/56876c6f192e411da758672efb234833.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/56876c6f192e411da758672efb234833.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/56876c6f192e411da758672efb234833.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56876c6f192e411da758672efb234833.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56876c6f192e411da758672efb234833.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56876c6f192e411da758672efb234833.png","size":""}]},{"name":"Floyd Tillman","url":"https://www.last.fm/music/Floyd+Tillman","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e3e5d47313d34771a8b5f037696a7afc.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e3e5d47313d34771a8b5f037696a7afc.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e3e5d47313d34771a8b5f037696a7afc.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e3e5d47313d34771a8b5f037696a7afc.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e3e5d47313d34771a8b5f037696a7afc.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e3e5d47313d34771a8b5f037696a7afc.png","size":""}]},{"name":"Jimmy Wakely","url":"https://www.last.fm/music/Jimmy+Wakely","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2c34f3a8329d4c4385ea7e54e5479156.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2c34f3a8329d4c4385ea7e54e5479156.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2c34f3a8329d4c4385ea7e54e5479156.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c34f3a8329d4c4385ea7e54e5479156.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c34f3a8329d4c4385ea7e54e5479156.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c34f3a8329d4c4385ea7e54e5479156.png","size":""}]},{"name":"Pee Wee King","url":"https://www.last.fm/music/Pee+Wee+King","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/63b80852b8a24a3eb168529fb7c09398.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/63b80852b8a24a3eb168529fb7c09398.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/63b80852b8a24a3eb168529fb7c09398.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/63b80852b8a24a3eb168529fb7c09398.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/63b80852b8a24a3eb168529fb7c09398.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/63b80852b8a24a3eb168529fb7c09398.png","size":""}]}]},"tags":{"tag":[{"name":"western swing","url":"https://www.last.fm/tag/western+swing"},{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"classic country","url":"https://www.last.fm/tag/classic+country"},{"name":"western","url":"https://www.last.fm/tag/western"},{"name":"All","url":"https://www.last.fm/tag/All"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Spade+Cooley/+wiki"}},"published":"04 Oct 2006, 04:18","summary":"Spade Cooley (Donnell Clyde Cooley, Grand, Oklahoma, December 17, 1910 – Oakland, California, November 23, 1969) was an American, Western Swing fiddler, singer and big band leader and also songwriter, actor, and television personality. His career ended in 1961 when he was arrested and convicted for the murder of his second wife, Ella Mae Evans.\n\nCooley,  being part Cherokee,  was sent to the Chemawa Indian School in Salem, Oregon to be educated. Around 1930 his family fled the Dust Bowl for California. <a href=\"https://www.last.fm/music/Spade+Cooley\">Read more on Last.fm</a>","content":"Spade Cooley (Donnell Clyde Cooley, Grand, Oklahoma, December 17, 1910 – Oakland, California, November 23, 1969) was an American, Western Swing fiddler, singer and big band leader and also songwriter, actor, and television personality. His career ended in 1961 when he was arrested and convicted for the murder of his second wife, Ella Mae Evans.\n\nCooley,  being part Cherokee,  was sent to the Chemawa Indian School in Salem, Oregon to be educated. Around 1930 his family fled the Dust Bowl for California.\n\nOne of the groups which played at the Venice Pier Ballroom in Venice, California, was led by Jimmy Wakely with Spade Cooley on fiddle. Several thousand dancers would turn out on Saturday night to swing and hop. When Wakely got a movie contract at Universal, Cooley replaced him as bandleader.\nTo capitalize on the pioneering success of the Bob Wills–Tommy Duncan pairing, Cooley hired vocalist Tex Williams who was capable of the mellow deep baritone sound made popular by Duncan. Cooley's 18-month engagement at Santa Monica's Venice Pier Ballroom was record-breaking for the early half of the 1940s. His \"Shame on You\", released on Columbia's Okeh label, was recorded in December 1944, and was No. 1 on the country charts for two months. A Red Foley / Lawrence Welk collaboration issued by Decca (18698) was No. 4 to Cooley's No. 5 on Billboard's \"Most Played Juke Box Folk Records\" listing in September 1945. Soundies Distributing Corp. of America issued one of their \"music video like\" film shorts of Cooley's band titled \"Shame on You\" in the fall of 1945. \"Shame on You\" was the first in an unbroken string of six Top Ten singles including \"Detour\" and \"You Can't Break My Heart\".\nCooley appeared in 38 Western films, both in bit parts and as a stand-in for cowboy actor Roy Rogers. Billed as Spade Cooley and His Western Dance Gang, he was featured in the soundie Take Me Back to Tulsa released July 31, 1944, along with Tex Williams and Carolina Cotton. Corrine, Corrina was released August 28, 1944 minus Cotton.\nThe film short Spade Cooley: King of Western Swing was filmed in May 1945 and released September 1, 1945. It was followed by Melody Stampede released on November 8, 1945. Spade Cooley & His Orchestra came out in 1949. In 1950, Cooley had significant roles in several films.\nBeginning in June 1948, Cooley began hosting a variety show on KTLA-TV in Los Angeles, California broadcast from the Santa Monica Pier Ballroom. The show became a mainstay of television in the area, and won local Emmy awards in 1952 and 1953. Guests included Frankie Laine, Frank Sinatra and Dinah Shore. The Hoffman Hayride was so popular that an estimated 75 percent of all televisions in the L.A. area were tuned into the show each Saturday night. Making use of video transcriptions, The Spade Cooley Show was viewed coast-to-coast via the Paramount Television Network.\nAlthough by 1956 Lawrence Welk was achieving increasing success at the nearby Aragon Ballroom, Cooley's ratings continued to drop.\nAfter a reputed \"battle of the bands,\" the date of which has not been documented, with Bob Wills and His Texas Playboys at the Venice Pier Ballroom, which Cooley claimed he won, he began to promote himself as the King of Western Swing. Evidently Western swing, not used prior to 1942 for this style of music, was a term thought up by Cooley's then promoter, Forman Phillips. It is worthy to mention that most historians of Western swing agree that Bob Wills and his Texas Playboys is regarded the true 'King of Western Swing', and Fort Worth's Milton Brown and his Musical Brownies is considered the pioneering 'Father of Western Swing'.\nCooley's music was like that of the then-current big band orchestras, and its sound was drawn from those dance-oriented hot bands like Bob Wills and Milton Brown. In contrast to Bob Wills' work, the performances and arrangements of Cooley's orchestra were more big-band Swing than improvised Western.\n\nCooley suspected his second wife, Ella Mae Cooley (née Evans), 38, who was a singer in his band before they married 15 years earlier, of repeatedly being unfaithful. In March 1961, she told a friend she had an affair with Roy Rogers in 1952 or 1953. She soon asked Cooley, who had his own affairs, for a divorce. On March 23, Cooley filed for divorce, citing \"incompatibility\" and seeking custody of their three children, Melody, Donnell Jr. and John.\nOn April 26, 1961, Cooley was indicted by a Kern County grand jury for the murder of his wife on April 3 at the couple's Willow Springs ranch home. Cooley's 14-year-old daughter, Melody, reportedly told the jury she watched in terror as her father beat her mother's head against the floor, stomped on her stomach, then crushed a lighted cigarette against her skin to see whether she was dead. Cooley claimed his wife had been injured by falling in the shower.\nHe was unsuccessfully defended by prominent attorney P. Basil Lambros in what was the longest case in county history at the time; and was convicted of first-degree murder by a Kern County jury on August 21, 1961 after unexpectedly withdrawing an insanity plea. He was spared death in the gas chamber and sentenced to life in prison.\n\nAfter he had served eight years, the state of California agreed to parole him on February 22, 1970. In November 1969, he received 72-hour furlough to play a benefit concert for the Deputy Sheriffs Association of Alameda County at the Oakland Auditorium, now known as the Henry J. Kaiser Convention Center, in Oakland. After the performance, on November 23, Cooley suffered a fatal heart attack in the backstage area. He is interred at Chapel of the Chimes cemetery in Hayward.\n\nJohn Gilmore has written an in-depth portrait of Cooley's life and tragic end in Shame on You, a segment of Gilmore's non-fiction work, L.A. Despair. Cooley is a recurring character in James Ellroy's fiction, including in the story \"Dick Contino's Blues\", which appeared in issue No. 46 of Granta magazine (Winter 1994) and was anthologized in Hollywood Nocturnes.\nHe is referenced in one of the Honeymooners episodes (from Art 'Ed Norton' Carney to Jackie 'Ralph Kramden' Gleason): \"They wouldn't-a won that except some guy slipped in a Spade Cooley record.\"\nRy Cooder's 2008 album I, Flathead features a reference to Cooley on the track \"Steel Guitar Heaven\" (\"There ain't no bosses up in heaven / I heard Spade Cooley didn't make the grade\"), as well as a track named \"Spayed Kooley\", the name of the singer's dog.\n <a href=\"https://www.last.fm/music/Spade+Cooley\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
