{"artist":{"name":"Spitfire","mbid":"f6a5a2d8-d9c5-42bd-bbaa-189dd3dd18d9","url":"https://www.last.fm/music/Spitfire","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7782aad23fe54b95a8c910693592db34.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7782aad23fe54b95a8c910693592db34.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7782aad23fe54b95a8c910693592db34.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7782aad23fe54b95a8c910693592db34.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7782aad23fe54b95a8c910693592db34.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7782aad23fe54b95a8c910693592db34.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"53443","playcount":"896941"},"similar":{"artist":[{"name":"St. Petersburg Ska-Jazz Review","url":"https://www.last.fm/music/St.+Petersburg+Ska-Jazz+Review","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c72345d87d3749b798a23f210b0b26b6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c72345d87d3749b798a23f210b0b26b6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c72345d87d3749b798a23f210b0b26b6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c72345d87d3749b798a23f210b0b26b6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c72345d87d3749b798a23f210b0b26b6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c72345d87d3749b798a23f210b0b26b6.png","size":""}]},{"name":"Distemper","url":"https://www.last.fm/music/Distemper","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1a39f6f5b6bf4daa9e53f1de389bbf7f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1a39f6f5b6bf4daa9e53f1de389bbf7f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1a39f6f5b6bf4daa9e53f1de389bbf7f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1a39f6f5b6bf4daa9e53f1de389bbf7f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1a39f6f5b6bf4daa9e53f1de389bbf7f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1a39f6f5b6bf4daa9e53f1de389bbf7f.png","size":""}]},{"name":"Элизиум","url":"https://www.last.fm/music/%D0%AD%D0%BB%D0%B8%D0%B7%D0%B8%D1%83%D0%BC","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/26371ed1e1564d9b98e2dddedd3d769c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/26371ed1e1564d9b98e2dddedd3d769c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/26371ed1e1564d9b98e2dddedd3d769c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/26371ed1e1564d9b98e2dddedd3d769c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/26371ed1e1564d9b98e2dddedd3d769c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/26371ed1e1564d9b98e2dddedd3d769c.png","size":""}]},{"name":"Шлюз","url":"https://www.last.fm/music/%D0%A8%D0%BB%D1%8E%D0%B7","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/371743e8933c49e3a072b1f5d8097382.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/371743e8933c49e3a072b1f5d8097382.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/371743e8933c49e3a072b1f5d8097382.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/371743e8933c49e3a072b1f5d8097382.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/371743e8933c49e3a072b1f5d8097382.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/371743e8933c49e3a072b1f5d8097382.png","size":""}]},{"name":"Male Factors","url":"https://www.last.fm/music/Male+Factors","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4666061088324bcd93a6ade3ad956e69.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4666061088324bcd93a6ade3ad956e69.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4666061088324bcd93a6ade3ad956e69.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4666061088324bcd93a6ade3ad956e69.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4666061088324bcd93a6ade3ad956e69.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4666061088324bcd93a6ade3ad956e69.png","size":""}]}]},"tags":{"tag":[{"name":"ska punk","url":"https://www.last.fm/tag/ska+punk"},{"name":"ska","url":"https://www.last.fm/tag/ska"},{"name":"russian","url":"https://www.last.fm/tag/russian"},{"name":"hardcore","url":"https://www.last.fm/tag/hardcore"},{"name":"metalcore","url":"https://www.last.fm/tag/metalcore"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Spitfire/+wiki"}},"published":"03 May 2006, 12:37","summary":"There several artists with this name:\n\n1. Ska-core band from St Petersburg.\n2. US Metalcore / mathcore quintet.\n3. Heavy Metal band from Italy.\n4. Early 90's Garage Rock band from Sussex.\n5. 1999 Australian hardcore DJ & producer.\n6. Jazz and funk trio from Asheville, North Carolina.\n7. Duo from Norway.\n8. Heavy Metal band from Greece.\n9. 4 piece rock n' roll band from Burnley, Lancashire.\n10. Japanese hardcore band from Sapporo.\n11. Heavy metal band from Sweden. <a href=\"https://www.last.fm/music/Spitfire\">Read more on Last.fm</a>","content":"There several artists with this name:\n\n1. Ska-core band from St Petersburg.\n2. US Metalcore / mathcore quintet.\n3. Heavy Metal band from Italy.\n4. Early 90's Garage Rock band from Sussex.\n5. 1999 Australian hardcore DJ & producer.\n6. Jazz and funk trio from Asheville, North Carolina.\n7. Duo from Norway.\n8. Heavy Metal band from Greece.\n9. 4 piece rock n' roll band from Burnley, Lancashire.\n10. Japanese hardcore band from Sapporo.\n11. Heavy metal band from Sweden.\n12. Heavy/Speed Metal band from Germany-\n\n1.   At the beginning of 1993, Spitfire played as a garage rockabilly trio, whose music also included some elements of noise. Their first live gig took place during the St.Petersburg Psycho Festival in February '93. The summer '93 brought new ideas and Spitfire began to do more noise/garage, they decided to give up their double bass for an electric bass guitar. While searching for a new sound, they did a program based on covers of '60's garage music. \n\nAt the end of 1993, their music had turned into garage punk and finally into ska-core. Actually, ska had been one of their favourite styles and a big passion for a long time before they decided to play it themselves. A saxophonist and a trumpet player joined the band in the fall '93, and Spitfire transformed from an aggressive punk gang into jolly and humorous mini-orchestra playing punk-ska.  The spring '94 brought both their first recording session and a new bassist. Since mastering that first demo, Spitfire has had a number of very successful concerts at various clubs. All these gigs were full of energy and enthusiasm. \n\nIn the spring '95 they released a song on the compilation called \"United Colours of Ska\", Volume II, on German \"Pork Pie\" label. A year later they recorded an album at St.Petersburg \"Melodia\" studio, which was then mixed in Berlin at Pork Pie. This album, called \"Night Hunting\", was released in the end of 1996. Spitfire has been touring regularly since that time. \n\nIn January 1999 Spitfire had made another recording session at Vielklang studio in Berlin, and the result came out in the spring with new album \"The Coast Is Clear\". \n\nIn the spring '01 a keyboard player joined the band making its sound even more powerful. At the same time Spitfire started a spinoff project St. Petersburg Ska-Jazz Review in collaboration with the members of St.Petersburg-based afro-caribbean-oriented band Markscheider Kunst. The initial idea was to make a single-show program comprised mostly of jazz standards such as \"Sidewinder\", \"Corcovado\", \"Four\" and original ska tunes (\"St. Thomas\", \"Man in the street\") to perform at Sergey Kuryokhin International Festival (SKIF) in April '01. \n\nThe line-up of this band included the bariton-sax and percussion players as well as all members of Spitfire. The show gained much interest and the band went on playing live gigs on Russian club scene. The debut album was recorded in March '02 at Dobrolet studio in St. Petersburg and put out in Russia in the fall '02 on small independent label Zvezda Records. \n\nIn November '01 Spitfire musicians were invited to participate in the recording session of the band Leningrad. This band was (and still is) one of the top acts on Russian music scene. The style of Leningrad music is hard to describe, since the regular play-list of their live show includes numbers stylistically varying from ska and reggae to punk and funky hip-hop. The Leningrad album \"21st Century Pirates\" was released in February '02 and the whole Spitfire line-up was invited to perform at Leningrad album release show at Yubileinyy Sports Palace in St. Petersburg. From that show on Spitfire musicians work together with Leningrad: recorded 4 albums - \"For millions\" (2003), \"Second Magadan\" (2003), \"Babarobot\" (2004), \"Huinya\" (2005, together with London-based cabaret trio Tiger Lillies) and played many gigs in Russia and Europe. \n\nIn November-December '02 Spitfire, St. Petersburg Ska-Jazz Review and Leningrad toured the United States. 15 gigs were performed all over the Atlantic coast from Boston to Miami. All events were of much interest for American audience. The second American tour of Leningrad and Spitfire was in the summer '03. The bands performed live in such cult venues as \"Irving Plaza\" and \"CBGB's\" (New York City), \"Middle East\" (Boston), \"The Knitting Factory\" (Los Angeles). \n\nIn January '04 the third Spitfire album \"Thrills And Kills\" came out both in Europe on German Vielklang label and in Russia on recently opened independent Shnur'OK label. As the previous one \"The Coast Is Clear\", \"Thrills And Kills\" was also recorded and mastered at Vielklang studio in Berlin. This album was more diverse musically and included more tracks which style could be rather referred to as guitar rock with the horn section. The album release was supported by a 5-weeks-long tour: 27 gigs in Germany, Switzerland and Italy. \n\nIn the spring '04 some members of Spitfire were invited to take part in the project called \"The Optymistica Orchestra\". This initial aim of this project was to compose a live soundtrack for the short-cut movies compilation \"10 minutes older: the violin\". As it usually happens, the band went on playing live and even recorded the debut album at St. Petersburg Dobrolet studio. The album is supposed to be released in the spring '05. \n\nAt the moment Spitfire is making a new programme for their fourth album and preparing for a new European tour. \n\n2. Spitfire is a metalcore / mathcore quintet. Originally, the band featured vocalist and guitarist Matt Beck, drummer Chris Raines, and bassist Jimmy Reeves. With this lineup, they released an EP called Straining Towards What's To Come on 2Jake Records and The Dead Next Door on Solid State Records in 1999. Later, having added new vocalist Jon Spencer, Spitfire released a second EP, called The Slideshow Whiplash, for Goodfellow Records. Soon after, in 2001, the band broke up.\n\nIn late 2004, Spitfire re-formed with new members. Reeves left the band, leaving Beck and Raines as the only original members. Spencer was again their vocalist, and they added guitarist Scottie Henry of Norma Jean, and bassist \"Dr. Dan\" Tulloh, formerly of Scarlet. They recorded a new album for Goodfellow Records, titled Self Help; it was released on February 28, 2006. After the recording of Self Help, Ian Sabo joined the band on bass, and Tulloh switched to guitar, giving the band three guitarists.\n\nSo far the bands present and future is unsure, however in mid 2008 the band released Cult Fiction on Goodfellow.\n\n3. Spitfire were born in Verona, Italy, in 1981, following the New Wave of British Heavy Metal spreading all over Europe and America: they can boast the title of the first metal band in their city, and over the years to come they will be the most popular Veronese rock band in Italy.  \nThe original composition of the group, vocals, two guitars, bass guitar and drums, have recorded a live demotape (\"Spitfire\", \"Samurai\", \"Beyond Price\") and also have made themselves known on a national scale thanks to radio programmes, interviews and reviews in fanzines and specialized magazines (the monthly \"Rockerilla \" presented the group as \"the Italian Iron Maiden\").  \nAfter many live concerts SPITFIRE reached in the spring of 1983 a stable line-up, featuring Giacomo Gigantelli on vocals and bass guitar, Stefano Pisani and Stefano Bianchini on guitars, Gaetano Avino on drums.  \nAt the beginning of 1984 SPITFIRE released the 7’’ Blade Runner/A Quiet Man, published and distributed by Minotauro Records, Pavia, a new label interested in the Italian hard rock and heavy metal scene (Strana Officina, Paul Chain, Revenge).  \nThe record was distributed in Italy, Belgium, Holland, France, England, U.S.A., and was positively welcomed by the official and underground press, radio networks and public. This led to a short Italian tour from May to July 1984 reaching Verona, Bergamo, Pavia, Naples (where SPITFIRE played together with Strana Officina and Vanadium in the Palatenda Partenope full of fans); the band played also in some metal festivals. \nCurrently the 7’’ is a rare piece for metal collectors; it was reissued on February 2009 by Minotauro Records.  \nNew troubles slowed down the work of the group during 1985, until the ultimate trio line-up Giacomo Gigantelli (vocals and bass guitar), Stefano Pisani (guitar) and Gaetano Avino (drums).  \nDuring that year there were intense contacts with foreign labels interested in the Italian rock scene (Rave-On Records, Metal Blade, Axe Killer, Concret Warrior, King Classic).  \nThis was the period of SPITFIRE’s full creative maturity: they played live up to the end of 1986 and left as a last inheritance the demo \"Heroes in the Storm\" (\"Hurricane - I'm Free\", \"Merchants of Death\", \"Shadow of the Axe\", \"Stones of Venice\", \"Heroes in the Storm\"), including the sessions for an album that should have been published for the King Classic label, which was never released due to the sudden band’s break-up.  \nIn the meantime, irony of fate, the American magazine \"Aardshock\" defined SPITFIRE as a future star of the metal universe and two months after the break-up they received a proposal to include one of their tracks in an American metal compilation and the album contract from King Classic ready for signing…  \nIn 2002 the independent label Andromeda releases the cd \"Heroes in the Storm\", a collection of all the songs recorded by the band; in 2004 there is a one-night SPITFIRE reunion (Giacomo Gigantelli, Stefano Pisani, Gaetano Avino) for an unique concert on the occasion of the 80's Italian Metal Legion Festival in Domegliara (VR - Italy).\nFrom that concert was issued in the same year the cd \"Live Reunion\".\nAt the beginning of 2008 SPITFIRE join again for the pre-production of \"Time and Eternity\", the next band's release for the label My Graveyard Productions, featuring songs composed between 1982 and 1985, and never recorded.\n\n\n\n4.  Spitfire were an early 90's Garage Rock band from Sussex, signed to Paperhouse Records. They were a 6 piece comprising members, Jeff and Nick Pitcher, Steve Walker, Matt Wise, Justin Welch, and Scott Kenny. The band released a handful of singles, most notably Minimal Love and an album Sex Bomb in 1993.\n \n\n5.  In 1999 Australian hardcore DJ & producer DJ Daydream released Move and Feel This Way as a \"double A-sided\" single under the alias Spitfire. Feel This Way had previously appeared on the 1997 compilation \"Bonkers 3: A Journey Into Madness\".\n\n6) Spitfire is a jazz and funk trio from Asheville, North Carolina.  The band members are Nick Stubblefield, Jordan Harris, and Heath Towson.\n\n7) Spitfire is also a duo from Norway. They are mainly composing music for commercials and TV shows, but they also do everything from small jingles for radio stations to full sized symphonic scores. The duos members are the brothers Audun Skau Hansen and Vegard Dahlin Skau Hansen, and they have been working together on this project since 2000.\n\n8) Heavy Metal band from Greece.\nSpitfire was the first greek band reviewed by Kerrang Magazine. They got 3/5 which was maybe the best review that a Greek band got from Kerrang.The journalist started his review with \"A greek Heavy Metal band??, it is like trying to find a virgin in the tour bus of Motley Crue...\" NOT MUCH TO SAY!\nLine up:\nElias Logginides (guitars)\nHannibal (vox)\nPanos Hatziioanides (guitars)\nNikos Michalakakos (bass)\nManos Matsos (drums)\nHerc (keyboards) \n\n\n\n9) Spitfire is a 4 piece rock n' roll band from Burnley, Lancashire in the North West of England.\n\n10) Spitfire Japanese hardcore band from Sapporo. Played from 1986-1989.\n\n11) Heavy metal band from Sweden. Appeared with two tracks on the legendary 'Scandinavian Metal Attack' sampler, in 1983.\n\n12) A three-piece Speed Metal band from Karlsruhe, Germany. Founded in 2013, self-released s/t-EP in 2014.\n <a href=\"https://www.last.fm/music/Spitfire\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
