{"artist":{"name":"Stanley Clarke","mbid":"5ab6ca23-9e17-43f2-ad92-869d28bdbf11","url":"https://www.last.fm/music/Stanley+Clarke","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/92d39a3cda0d48028d8cb9e1f5221afe.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/92d39a3cda0d48028d8cb9e1f5221afe.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/92d39a3cda0d48028d8cb9e1f5221afe.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/92d39a3cda0d48028d8cb9e1f5221afe.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/92d39a3cda0d48028d8cb9e1f5221afe.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/92d39a3cda0d48028d8cb9e1f5221afe.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"146991","playcount":"1272648"},"similar":{"artist":[{"name":"Marcus Miller","url":"https://www.last.fm/music/Marcus+Miller","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d2f7867b5bd74f6db127bde46e49a072.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d2f7867b5bd74f6db127bde46e49a072.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d2f7867b5bd74f6db127bde46e49a072.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d2f7867b5bd74f6db127bde46e49a072.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d2f7867b5bd74f6db127bde46e49a072.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d2f7867b5bd74f6db127bde46e49a072.png","size":""}]},{"name":"George Duke","url":"https://www.last.fm/music/George+Duke","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/484fe154684e40fbc053a1f657128df6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/484fe154684e40fbc053a1f657128df6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/484fe154684e40fbc053a1f657128df6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/484fe154684e40fbc053a1f657128df6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/484fe154684e40fbc053a1f657128df6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/484fe154684e40fbc053a1f657128df6.png","size":""}]},{"name":"Return to Forever","url":"https://www.last.fm/music/Return+to+Forever","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/13ebd320cfae4eadac1969269156ac98.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/13ebd320cfae4eadac1969269156ac98.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/13ebd320cfae4eadac1969269156ac98.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/13ebd320cfae4eadac1969269156ac98.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/13ebd320cfae4eadac1969269156ac98.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/13ebd320cfae4eadac1969269156ac98.png","size":""}]},{"name":"Victor Wooten","url":"https://www.last.fm/music/Victor+Wooten","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/518f83a89eba45b9851c70649e9dd565.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/518f83a89eba45b9851c70649e9dd565.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/518f83a89eba45b9851c70649e9dd565.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/518f83a89eba45b9851c70649e9dd565.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/518f83a89eba45b9851c70649e9dd565.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/518f83a89eba45b9851c70649e9dd565.png","size":""}]},{"name":"Lenny White","url":"https://www.last.fm/music/Lenny+White","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c8eda676f598405f8db0ab227050ac9d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c8eda676f598405f8db0ab227050ac9d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c8eda676f598405f8db0ab227050ac9d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c8eda676f598405f8db0ab227050ac9d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c8eda676f598405f8db0ab227050ac9d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c8eda676f598405f8db0ab227050ac9d.png","size":""}]}]},"tags":{"tag":[{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"bass","url":"https://www.last.fm/tag/bass"},{"name":"Fusion","url":"https://www.last.fm/tag/Fusion"},{"name":"jazz fusion","url":"https://www.last.fm/tag/jazz+fusion"},{"name":"funk","url":"https://www.last.fm/tag/funk"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Stanley+Clarke/+wiki"}},"published":"20 Jul 2006, 22:26","summary":"Stanley Clarke (June 30, 1951) is an American jazz musician and composer known for his innovative and influential work on double bass and electric bass as well as for his numerous film and television scores. He is best known for his work with the fusion band Return to Forever, and his role as a bandleader in several trios and ensembles.\n\nClarke was born in Philadelphia, Pennsylvania. Having graduated from the Philadelphia Musical Academy, he moved <a href=\"https://www.last.fm/music/Stanley+Clarke\">Read more on Last.fm</a>","content":"Stanley Clarke (June 30, 1951) is an American jazz musician and composer known for his innovative and influential work on double bass and electric bass as well as for his numerous film and television scores. He is best known for his work with the fusion band Return to Forever, and his role as a bandleader in several trios and ensembles.\n\nClarke was born in Philadelphia, Pennsylvania. Having graduated from the Philadelphia Musical Academy, he moved to New York City in 1971 and began working with famous bandleaders and musicians including Horace Silver, Art Blakey, Dexter Gordon, Joe Henderson, Pharoah Sanders, Gil Evans, Stan Getz and Al Di Meola.\n\nReturn to Forever\nDuring this period he joined the jazz fusion group Return to Forever led by pianist Chick Corea. The group became one of the most important fusion groups and released several successful and musically highly varied albums. Clarke also started his solo career in the early 1970s and released a number of albums under his own name. His most famous album is School Days (1976), which along with Jaco Pastorius's self-titled debut is held up as one of the greatest bass albums in the history of Jazz Fusion.\n\nHis albums Stanley Clarke (1974) and Journey to Love (1975) are also notable.\n\nStyle\nClarke's electric bass style is a combination of many factors.\n\nEquipment - Clarke has always been very strongly associated with Alembic basses and the vast majority of his recorded output has been produced with one model of Alembic or another, particularly a dark-wood-colored custom bass in the Series I body style. These basses are handmade neck-through instruments made from a mixture of exotic woods and a proprietary active pickup system that is powered from an external preamplifier. Clarke also utilizes full-range amplification for his basses, more in keeping with a keyboardist's rig than a bassist's or guitarists. As a result, Clarke's tone is full-bodied and woody-sounding, with an organic flavor.\n\nPhysical size - Clarke is a slim 6'3\" and his Alembic basses tend to be short-scale (in this case, 30-3/4\" versus a typical 34\"), so in his hands, the Alembic seems almost like a toy. As a result, having large hands and powerful musculature in his arms and hands gives him extra command over the instrument in terms of power, range, and speed. Many of the figures that Clarke plays are very difficult for a smaller bassist to play on a larger bass.\n\nRight-hand technique - The classic Clarke right-hand posture has his fingers approaching the strings much as they would on an upright bass, but rotated through 90 degrees. To achieve this, his forearm lies above and nearly parallel to the strings, while his wrist is hooked downward at nearly a right angle. For lead and solo purposes, his fingers partially hook underneath the strings so that when releases, the strings snap against the frets, producing a biting percussive attack. In addition to an economical variation on the Larry Graham-style pop-n'-slap technique, Clarke also uses downward thrusts of the entire right hand, striking two or more strings from above with his fingernails (examples include \"School Days,\" \"Rock and Roll Jelly,\" \"Wild Dog,\" and \"Danger Street\").\n\nStanley Clarke is commonly considered among the most important bassists of the jazz-fusion era (c. 1972-1982).\n\nAnimal Logic\nHe formed Animal Logic with rock drummer Stewart Copeland, after the break-up of The Police, and singer-songwriter Deborah Holland. The trio had success with their first album and world tour but the follow-up sold poorly, and the band did not continue.\n\nToday\nHe continues to work and has several film scores as well as a string of albums to his name. In 2005 he started the Acoustic Fusion Supergroup TRIO! with Bela Fleck and Jean-Luc Ponty, which toured the Eastern U.S. and played all of the major Jazz Festivals.\nIn 2006 Clarke reunited with George Duke and toured with him for the first time in fifteen years. The duo formed the Clarke/Duke Project in 1981. They scored a Top 20 hit with \"Sweet Baby\" and recorded three albums.\n\nEarly in 2007, Clarke's own Roxboro Entertainment Group released a DVD entitled Night School: An Evening with Stanley Clarke and Friends (HUDV-7118) through the Heads Up International label. The 90-minute presentation documents the third annual Stanley Clarke Scholarship Concert, recorded at Musicians Institute in Hollywood, CA, in October 2002. The group offers scholarships to students in financial need who excel in music. The Night School DVD scholarship concert features diverse group of musicians that include Stevie Wonder, Wallace Roney, Bela Fleck, Sheila E., Stewart Copeland, the Red Hot Chili Peppers' Flea, Wayman Tisdale, Marcus Miller and others. Night School captures performances that range from straight-ahead jazz to full-tilt rock fusion to a twenty-two-piece string ensemble.\n\nSince the 1980s, Clarke has turned much of his energy to television and film scores. He is credited for the scores for the ABC Family Channel series Lincoln Heights as well as composing the theme song for the show. In October 2006, Clarke was honored with Bass Player magazine's Lifetime Achievement Award. Bassists Marcus Miller and Victor Wooten presented the award at a ceremony at New York City's Millennium Broadway Hotel. Stanley who won a Grammy Award in 1975 was the first \"Jazzman of the Year\" for Rolling Stone magazine, won \"Best Bassist\" from Playboy magazine for 10 straight years, and is a member of Guitar Player magazine's \"Gallery of Greats.\" He was honored with the Key to the city of Philadelphia. In 2004 he was featured in Los Angeles magazine as one of the 50 most influential people.\n\nBET-J launched a series hosted by Clarke entitled On the Road with Stanley Clarke in June 2006. The series consists of seven episodes titled \"Origins of Black Music,\" \"That Philly Sound,\" \"Jazz Beyond the Classroom,\" \"Black Music in Film, Television & Theatre,\" \"Jazz,\" \"Black Music in Film – The Next Generation:\" and \"Bass to Bass.\" Some of his guests include Terence Blanchard, Marcus Miller, George Duke, The Tate Brothers, Gamble and Huff, and academicians Dr. Jacqueline Cogdell DjeDje and Dr. Cheryl Keyes from the Department of Ethnomusicology at UCLA among many others. On the Road with Stanley Clarke episodes were re-broadcast on BET-J in 2007. In 2008, Stanley was presented with a doctorate in fine arts from his alma mater, The University of the Arts. He has three children (Chris and two stepchildren, Natasha and Frank).\n\nClarke's latest records include The Toys of Men in 2007. This was his first release in five years, on October 17, 2007. The first week of release it went to No.2 on Billboard charts' Contemporary Jazz Chart. The 13-track CD examines the issue of war, and it includes performances by vocalist/bassist Esperanza Spalding, keyboardist Ruslan Sirota, percussionist Paulinho da Costa and violinist Mads Tolling. The Toys of Men includes acoustic bass interludes that provide a counterpoint to Clarke's better known electric bass attack. 2009 saw his release of Jazz in the Garden, featuring the Stanley Clarke Trio: with Clarke, pianist Hiromi Uehara, and Lenny White on drums. In 2010, Clarke released the Stanley Clarke Band, with Ruslan Sirota on keyboards and piano and Ronald Bruner, Jr. on drums; the album also features Hiromi on piano (as a guest artist), along with many others. On February 13, the Stanley Clarke Band won the Grammy for Best Contemporary Jazz Album.\n\nInstruments\nStanley Clarke is also the first influential bassist to use piccolo bass prominently. (A piccolo bass is a bass guitar, tuned one octave higher - Clarke's are usually short scale (30.75\"), four string, Carl Thompson or Alembic.)\n\n <a href=\"https://www.last.fm/music/Stanley+Clarke\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
