{"artist":{"name":"Stargarden","mbid":"a48f26f2-49b8-4ce6-9dba-6135de7d5e68","url":"https://www.last.fm/music/Stargarden","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c76f6bcf55a24d869aaee46f91549b4d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c76f6bcf55a24d869aaee46f91549b4d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c76f6bcf55a24d869aaee46f91549b4d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c76f6bcf55a24d869aaee46f91549b4d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c76f6bcf55a24d869aaee46f91549b4d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c76f6bcf55a24d869aaee46f91549b4d.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"7403","playcount":"48036"},"similar":{"artist":[{"name":"Michael Maricle","url":"https://www.last.fm/music/Michael+Maricle","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7c452d2790c5450b8a235578adbaf392.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7c452d2790c5450b8a235578adbaf392.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7c452d2790c5450b8a235578adbaf392.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c452d2790c5450b8a235578adbaf392.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c452d2790c5450b8a235578adbaf392.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c452d2790c5450b8a235578adbaf392.png","size":""}]},{"name":"Tnt Recordings","url":"https://www.last.fm/music/Tnt+Recordings","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a63ca75e339f429382bf426f7b7f2ffa.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a63ca75e339f429382bf426f7b7f2ffa.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a63ca75e339f429382bf426f7b7f2ffa.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a63ca75e339f429382bf426f7b7f2ffa.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a63ca75e339f429382bf426f7b7f2ffa.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a63ca75e339f429382bf426f7b7f2ffa.png","size":""}]},{"name":"Sinq","url":"https://www.last.fm/music/Sinq","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b6348c97255343dfa183aa358e9476ee.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b6348c97255343dfa183aa358e9476ee.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b6348c97255343dfa183aa358e9476ee.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6348c97255343dfa183aa358e9476ee.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6348c97255343dfa183aa358e9476ee.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b6348c97255343dfa183aa358e9476ee.png","size":""}]},{"name":"Sonanaut","url":"https://www.last.fm/music/Sonanaut","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5060b5834aa745f9abf8c7506bb68104.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5060b5834aa745f9abf8c7506bb68104.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5060b5834aa745f9abf8c7506bb68104.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5060b5834aa745f9abf8c7506bb68104.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5060b5834aa745f9abf8c7506bb68104.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5060b5834aa745f9abf8c7506bb68104.png","size":""}]},{"name":"Repose","url":"https://www.last.fm/music/Repose","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e6d8423339da4587a21c7b7061c543b0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e6d8423339da4587a21c7b7061c543b0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e6d8423339da4587a21c7b7061c543b0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e6d8423339da4587a21c7b7061c543b0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e6d8423339da4587a21c7b7061c543b0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e6d8423339da4587a21c7b7061c543b0.png","size":""}]}]},"tags":{"tag":[{"name":"ambient","url":"https://www.last.fm/tag/ambient"},{"name":"chillout","url":"https://www.last.fm/tag/chillout"},{"name":"electronic","url":"https://www.last.fm/tag/electronic"},{"name":"magnatune artist","url":"https://www.last.fm/tag/magnatune+artist"},{"name":"magnatune","url":"https://www.last.fm/tag/magnatune"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Stargarden/+wiki"}},"published":"01 Apr 2008, 21:59","summary":" It all started with a shoebox and rubber bands....\n\nBorn the son of an electronics industry father, Bobby DeVito was exposed to the wonders of computers and electronics at an early age. His parents noticed a certain musical bent when they discovered the young child placing rubber bands on a shoebox in tonal order. Soon the budding musician received a guitar for his birthday.\n\nDuring the early days of his youth, Bobby often accompanied his father to work, marveling at the rooms full of mainframe computers at Control Data. <a href=\"https://www.last.fm/music/Stargarden\">Read more on Last.fm</a>","content":" It all started with a shoebox and rubber bands....\n\nBorn the son of an electronics industry father, Bobby DeVito was exposed to the wonders of computers and electronics at an early age. His parents noticed a certain musical bent when they discovered the young child placing rubber bands on a shoebox in tonal order. Soon the budding musician received a guitar for his birthday.\n\nDuring the early days of his youth, Bobby often accompanied his father to work, marveling at the rooms full of mainframe computers at Control Data. He and his father were electronics hobbyists as well, building a digitally controlled television with remote control in 1976. At this time, Bobby got his hands on his first synthesizer - an Arp Axxe. Running this basic monosynth through an MXR delay and flanger opened new worlds of sonic discovery. Nevertheless, the guitar proved the be his main instrument for many years, with Bobby touring the USA with new wave pioneers The X-Statics. DeVito was able to fulfill his synthesizer jones during these years by toying with lead vocalist/keyboardist Jon Allmightey's analog synths during rehearsals and soundchecks. After seven years of constant touring and performance, the band split up and Bobby headed to South Florida for an unknown musical future.\n\nGathering together a drum machine, 4 track recorded, and some signal processing gear, Bobby recorded his first album \"Guitar Salad\" during this era. This album was more successful than anything he had done previously, being featured on mainstream radio stations all over Florida and garnering a fair amount of press attention. This project set Bobby upon the solo artist path that he has pursued ever since. It was also during this time that academia beckoned, and DeVito managed to get into the prestigious IDS program at St. Petersburg Junior College. After graduating from SPJC, he set his sights on the progressive honors university New College in Sarasota Florida. After making it through the gauntlet of admissions tests and interviews, DeVito was accepted and began to work intensely with Professor Steven Miles, the director of the music program for the college. Miles was a huge influence on the budding electronic music composer, exposing Bobby to a world of sounds, textures, sociological theory, and music history. It was also beneficial that New College had just built an electronic music studio the year DeVito started his studies, as well as hiring an electronic music professor from the Eastman School of Music, Robert Constable. The electronic odyssey had begun. At New College Bobby was exposed to the music and compositional thoughts of composers such as John Cage, Karlheinz Stockhausen, Milton Babbitt, and Iannis Xenakis, as well as philosophers of music such as Walter Benjamin, Simon Frith, and Theodor Adorno. This learning experience helped DeVito to develop his compositional skills and theories, as well as gather an appreciation of electronic music history and conceptual framework.\n\nDuring these halcyon college days, DeVito managed to secure a job working for BMG Distribution as their College Marketing Rep, a position he held for three years that allowed him to get \"real-world\" experience in the music industry. At New College, each student must write a Master's Thesis in order to graduate, and Bobby decided on an ambitious project -- to combine his written thesis with a full length album of ambient music. Starting with Erik Satie, and ending up with modern day composers such as Aphex Twin, DeVito's thesis covers the dawn and progression of ambient music, the ways ambient music is distinguished from Muzak, and the sociological implications of ambient music listener reception by touching on the theories of philosopher Theodor Adorno. DeVito's thesis lives on in Hyperreal's \"Epsilon Ambient Music Archive\".\n\nThe CD portion of his thesis is entitled LVX Nova. This project was a collaboration between DeVito and noted electronic composer Mike Meengs. The thesis project was a success, and DeVito graduated from New College in 1996.\n\nAfter graduation, DeVito set out to get the project released commercially. After releasing the album independently and garnering over 60 pages of press worldwide, three labels presented offers to release the album: R&S Records in Belgium, Subharmonic Records in NYC, and MIRAMAR Records in Seattle. After entertaining all the offers, DeVito decided to sign with MIRAMAR, home to one of his biggest influences Tangerine Dream, and also a part of the BMG Distribution family. LVX Nova received tons of press, critical accolades, and made it to several \"top ten releases\" lists. In addition, the CD won several awards, including the 1999 \"JAMMY\" award in Florida for best electronic act.\n\nHowever, with the instability of MIRAMAR after motion picture company UNAPIX bought out the label in 1999, DeVito was again without a label. After doing some international touring with Atlantic/Code Blue recording artist Sherman Robertson (as bandleader and second guitarist) DeVito once again plunged into the electronic abyss. Stargarden was born at this time. The name stargarden is directly influenced by the underwater life of starfish, who can form huge colonies on the sea floors in a communal form -- sadly, unlike their human counterparts.\n\nHoled up in a loft in Hyde Park Tampa, and later Miami Florida, DeVito creates music entirely for the sake of the process and the enjoyment of his fans. Relying on timbre, repetition, and space, the music of stargarden ranges from drifting ambient space music to beat driven electronica. Bobby cites other artists such as Tangerine Dream, Aphex Twin, Brian Eno, Global Communication, Peter Namlook and FAX artists, John Cage as influences on his particular brand of ambient music. After discovering the then-fledgling MP3.com from his friend. sometime musical partner, and influence Mike Meengs, DeVito placed the first stargarden album on MP3.com, and received thousands and thousand of downloads, as well as quite a few CD sales.\n\nNow, in order to bring electronic music distribution to a new level, DeVito has signed stargarden with Magnatune, believing in their new model of music distribution and intellectual property management. And with new music being released only here on Magnatune, the future of stargarden ambient music is secure.\n\nIf you like this music, please consider buying a CD or two to help the process continue. The quest for ambient beauty continues..... <a href=\"https://www.last.fm/music/Stargarden\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
