{"artist":{"name":"Steve Azar","mbid":"ee1bfbfd-1c2c-46fc-b982-8622f1237c53","url":"https://www.last.fm/music/Steve+Azar","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bf4c4cb05cf04e9ab6b80468b5ab8234.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bf4c4cb05cf04e9ab6b80468b5ab8234.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bf4c4cb05cf04e9ab6b80468b5ab8234.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bf4c4cb05cf04e9ab6b80468b5ab8234.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bf4c4cb05cf04e9ab6b80468b5ab8234.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bf4c4cb05cf04e9ab6b80468b5ab8234.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"39188","playcount":"166834"},"similar":{"artist":[{"name":"Jimmy Wayne","url":"https://www.last.fm/music/Jimmy+Wayne","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cab516d825f04b4aba8ab597441032d9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cab516d825f04b4aba8ab597441032d9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cab516d825f04b4aba8ab597441032d9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cab516d825f04b4aba8ab597441032d9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cab516d825f04b4aba8ab597441032d9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cab516d825f04b4aba8ab597441032d9.png","size":""}]},{"name":"The Lost Trailers","url":"https://www.last.fm/music/The+Lost+Trailers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8bcb212d166a4c8996d774b2ac614c7a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8bcb212d166a4c8996d774b2ac614c7a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8bcb212d166a4c8996d774b2ac614c7a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8bcb212d166a4c8996d774b2ac614c7a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8bcb212d166a4c8996d774b2ac614c7a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8bcb212d166a4c8996d774b2ac614c7a.png","size":""}]},{"name":"Bucky Covington","url":"https://www.last.fm/music/Bucky+Covington","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a15d379ccdbd46d69dd94e0754f0f86a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a15d379ccdbd46d69dd94e0754f0f86a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a15d379ccdbd46d69dd94e0754f0f86a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a15d379ccdbd46d69dd94e0754f0f86a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a15d379ccdbd46d69dd94e0754f0f86a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a15d379ccdbd46d69dd94e0754f0f86a.png","size":""}]},{"name":"Trent Tomlinson","url":"https://www.last.fm/music/Trent+Tomlinson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6d1ac9de66104706a866bcb29009a675.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6d1ac9de66104706a866bcb29009a675.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6d1ac9de66104706a866bcb29009a675.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6d1ac9de66104706a866bcb29009a675.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6d1ac9de66104706a866bcb29009a675.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6d1ac9de66104706a866bcb29009a675.png","size":""}]},{"name":"Trent Willmon","url":"https://www.last.fm/music/Trent+Willmon","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/670f0f7748fc4e26bb09b99877b74a22.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/670f0f7748fc4e26bb09b99877b74a22.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/670f0f7748fc4e26bb09b99877b74a22.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/670f0f7748fc4e26bb09b99877b74a22.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/670f0f7748fc4e26bb09b99877b74a22.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/670f0f7748fc4e26bb09b99877b74a22.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"modern country","url":"https://www.last.fm/tag/modern+country"},{"name":"bluegrass","url":"https://www.last.fm/tag/bluegrass"},{"name":"country pop","url":"https://www.last.fm/tag/country+pop"},{"name":"Brems Tagg radio","url":"https://www.last.fm/tag/Brems+Tagg+radio"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Steve+Azar/+wiki"}},"published":"15 Sep 2008, 00:50","summary":"Steve Azar was born and raised in Greenville, Mississippi at the entrance to the Mississippi Delta. His mother was raised above the family grocery store located on Highway 61 in Clarksdale, MS near the infamous “Crossroads”. “The Crossroads” is the intersection of Route 61 and Route 49, or the 61/49 split as they call it there, in Clarksdale, Mississippi, made famous in the Robert Johnson song, “Cross Road Blues”. This is where Delta Blues <a href=\"https://www.last.fm/music/Steve+Azar\">Read more on Last.fm</a>","content":"Steve Azar was born and raised in Greenville, Mississippi at the entrance to the Mississippi Delta. His mother was raised above the family grocery store located on Highway 61 in Clarksdale, MS near the infamous “Crossroads”. “The Crossroads” is the intersection of Route 61 and Route 49, or the 61/49 split as they call it there, in Clarksdale, Mississippi, made famous in the Robert Johnson song, “Cross Road Blues”. This is where Delta Blues legend Robert Johnson supposedly sold his soul to the Devil in exchange for mastery of the blues, or so the story goes.\n\nMom’s younger brother grew up to be the mayor of Clarksdale, MS. Two of Steve’s cousin’s, Abe and Pat Davis, own and operate the famous Abe’s barbeque. Located right at the 61/49 split, Abe’s is also where you see the famous “Crossroad’s” sign with the huge guitars. Rock and Blues legends from all over the world make the pilgrimage to Clarksdale to stand at the Crossroads, and many stop in for a bite at Abe’s while they are there. Abe’s is famous, and delicious. Steve’s dad owned the first legal liquor store in the state. Behind that liquor store is where Steve first learned about the blues music of the Delta.\n\n“I was hooked on Eugene Powell (Sonny Boy Nelson) who made Blues records back in the 1930’s,” says Steve. “I would hang out behind my dad’s liquor store, sit on a crate and listen to Eugene sing about his day and about his night before. Those were some of my first lyric writing lessons, even though I didn’t know it at the time.”\n\n“It was all around us down there, and I was hooked on what it was they were talking about. Little Milton, Sam Chatmon and Roosevelt (Booba) Barnes all lived, or hung out there. B.B. King was from Itta Bena and Albert King was raised in Indianola, both towns are out on Highway 82 from Greenville. When my early band started growing and we were up to three trucks to carry all the band and gear, Little Milton would say , You really gonna’ do this Little Azar! (that’s what he called me) It wasn’t a question, he was telling me, and he saw me actually doing it. He told me, If you’re gonna’ do this, you gotta’ make it your whole life, you gotta’ work hard everyday at it!” “I work hard at it everyday… I love the work I get to do!”\n\n“Where I grew up in the Delta, there was always something new that came into my life and inspired me to write music. Whether its pain, hope, joy, laughter or sadness, there are always emotions that you experience, we all do. I’ve written about those emotions since I was about 11 years old.”\n\nWhile attending and then graduating from Delta State University, Azar was also busy touring with his band. Steve had become a regional headliner playing the biggest clubs in the Delta, was a regular on the college campus circuit, and played nearly every Blues Festival. It was a sweltering September afternoon during the Delta Blues Festival at Freedom Village in his hometown of Greenville; MS. Steve was humbled to share the stage with Delta Blues music legend, James “Son” Thomas, in a tribute to Stevie Ray Vaughn. Upon finishing the set, Steve walked off the stage, where blues legend Mr. Albert King said to him, “Hey kid, you got it! …. Where ya’ goin’ with it?” Azar said, “Nashville Mr. King.” With a smile, and a bit of sarcasm, Albert exclaimed, “Ahhhhh, the Devil goes to Nashville!”\n\nAzar did move to Nashville and within days had multiple song publishing contract offers. During the time that followed, Steve began working on his own songs, writing with the “who’s who” of Nashville great  songwriters, and developing his unique way of storytelling that led to some classic songs in the following years.\n\nIt took a bit longer to achieve what Steve considers his first “real” recording deal, eventually signing as a performer to major label, Mercury Nashville. His 2002 full-length release, “Waitin’ on Joe” really put Steve on the country music map. “I Don’t Have To Be Me til’ Monday” was the first single from that record and reached #2 nationally on the country radio charts. “I Don’t Have To Be Me til’ Monday” is still a power recurrent at radio today and is one of the Top 5 most played songs of the last decade at country radio. BMI has honored Steve with their “Million-Air” award and “Monday” has received almost 3 million spins on the radio since release. \n\nHis next single was the title track from the record, “Waitin’ on Joe”. “Waitin’ on Joe”, the song, became a Top 10 radio hit and reached #1 on the CMT video charts. “Waitin’ on Joe” reached into Steve’s Mississippi roots for the story of life on the river, and featured his Mississippi friend, Academy Award Winning Actor, Morgan Freeman, to help tell that story of life in Mississippi. There were several years of working radio and touring that followed the release of “Waitin On Joe”. The single “Monday” lasted almost a year on the charts alone.\nThe next few years brought a down time for Steve Azar, due largely to throat surgery which sidelined him from recording and playing live. This hiatus gave Azar time to write songs and do some real soul searching about his career direction.\n\nAfter a long recovery and new-found sense of direction, Steve arrived back with his first release, Indianola (2006). Named after a town just down the road from Steve’s hometown in Mississippi, and the birthplace of the great, Albert King, Indianola was the debut release from his own independent music label, Dang Records. “You Don’t Know a Thing” and “You’re My Life” both enjoyed success at country radio. The video for “You Don’t Know a Thing” featured golfer, John Daly, and was an instant favorite at the country music video channels. “You’re my Life”, is still a strong seller and fan favorite to this day. “Indianola” also received strong critical reviews and landed the album at #1 on the XM Radio “Country Outlaw” channel, bumping Willie Nelson out of the #1 spot, and then giving up the #1 spot to John Mellencamp the next week.\nIn 2007 Azar was personally chosen by Bob Seger to open his U.S. tour which was ranked by Pollstar Magazine the #1 tour in America that year. Steve received many standing ovations from enthusiastic crowds, including one at Madison Square Garden. Reviews of Steve’s show were great, like the Columbus Dispatch reviewer who wrote, “Azar has the inflections and rhythms of a young Bob Dylan…”\n“Slide On Over Here” followed in 2009 and represented the beginning of a new chapter of Steve’s musical journey. “Moo La Moo” was the first single from 13-track effort and both the song and the video enjoy chart success, catapulting Azar back in the Top 40 on the country charts. “Sunshine” soon followed and won not only critical praise, but set a record for highest charting song from a true independent label on the Billboard Activator chart. . It achieved Top 20 success on all the country radio charts and landed the #1 spot on the GAC-TV Top 20 Video Countdown. It also was fan voted at #29 on the “GAC-TV Year End” favorite videos for 2010. Further still, “Sunshine” remained active on the radio charts for nearly 40 weeks, a proud accomplishment for both Steve and his young label. Still in recurrent airplay around the country, “Sunshine” proved Steve’s ability as a songwriter to reach listeners with his lyrics about human emotions. When asked to pick her favorite song of 2010 by People Magazine’s Country Edition, Taylor Swift picked Steve’s song, “Sunshine,” explaining “It’s so sensitive and sweet. It comes from a place of vulnerability, and I love hearing that from a guy”.\n\nOn Memorial Day 2011, Steve released “Soldier Song” a tribute to our soldiers and their families. Instead of another song about war, “Soldier Song” speaks of the personal lives interrupted by those that serve, and their families left behind. “Soldier Song” was chosen by Fox News Channel and used as the theme music behind their Memorial Day special on “Special Report with Bret Baier which featured President Bush’s time spent mountain biking with a group of amazing soldiers. Steve dedicated a portion of the proceeds from this song to the soldiers by joining forces with his friend, NFL star Jared Allen and his charity, “Homes 4 Wounded Warriors.”\n\nSteve has relocated home base back to the “Delta” of Mississippi. More than half of Steve’s live show has always been filled with music of his Delta home, and his songwriting and recording reflects his Delta music upbringing. Steve is especially proud of his on-going connection to Mississippi.\nIn 2003, Governor Ronnie Musgrove and legislature declared March 13 as Steve Azar Day in the great state of Mississippi.\n\nSecond Crossing: Mississippi’s Landmark Bridge is a MS PBS documentary about the rebuilding of this historic bridge following Hurricane Katrina. . The construction of this new crossing over America’s most storied river will be chronicled in the documentary, which Steve, a Greenville native, narrates.\nSteve was one of the stars of Mississippi Rising, a benefit event at Ole Miss for the victims of Hurricane Katrina in 2005. He shared the stage with his old friend Morgan Freeman, plus Sela Ward, Samuel L. Jackson, The Mississippi Mass Choir, Faith Hill, Ray Romano, Jason Alexander and Lance Bass.\nFast forward to today, where Steve currently records with his own label, renamed, Ride Records. The label name “Ride” is derived from some advice Steve received from his friend, Little Milton. He told me, “Little Azar, you’re in for the Ride of your life”, Azar recalls.\n\nComprising a small team of experts with miles of music biz experience, Ride Records continues to go from strength to strength and blazes its own trail in the jungle that is today’s music industry. In early fall of 2011 Steve will release “Delta Soul Volume One”, a collection of songs that are an exceptional mix of Delta blues and rock.\n\nWHAT IS DELTA SOUL? It’s a style of music born in the people that come from the Mississippi Delta. It tells the stories of a hard life, the mixing of cultures and race, poverty and pride. It’s about earning a meager living from the cotton crop, or the long hours on the Mississippi river. The music of the Delta has influenced some of the greatest rock and blues music of all time. Eric Clapton, The Stones, Paul Simon, Led Zeppelin, ZZ Top and so many others have been inspired by the sounds that resonate deep in its very soil.\n\n“Delta Soul” is the music from a man born and raised in the heart of it all. It’s a mix of the sounds and musical lessons he learned growing up in Greenville, MS. It’s honest and pure, the lyrics are a journey through the places he’s been and the people he’s known. It’s the stories shared by family, friends and blues legends.\n\nSteve Azar mixes his Delta roots with blues, rock and soul, and a little touch of twang to create his sound, “Delta Soul”. It’s a collection of songs that take you along on Steve’s musical journey through his life in the Mississippi Delta. Steve Azar, Delta Soul Volume One will be released November 8th, 2011, and the story will continue….. <a href=\"https://www.last.fm/music/Steve+Azar\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
