{"artist":{"name":"Steve Morse","mbid":"6f0d1ab4-a0b8-4d59-acda-5fe3b63058f0","url":"https://www.last.fm/music/Steve+Morse","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/be7ea13991ee4eef96f1d2d15aec17f5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/be7ea13991ee4eef96f1d2d15aec17f5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/be7ea13991ee4eef96f1d2d15aec17f5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/be7ea13991ee4eef96f1d2d15aec17f5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/be7ea13991ee4eef96f1d2d15aec17f5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/be7ea13991ee4eef96f1d2d15aec17f5.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"78327","playcount":"651591"},"similar":{"artist":[{"name":"Steve Morse Band","url":"https://www.last.fm/music/Steve+Morse+Band","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ec658b84293849d1beefd55e53278a52.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ec658b84293849d1beefd55e53278a52.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ec658b84293849d1beefd55e53278a52.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec658b84293849d1beefd55e53278a52.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec658b84293849d1beefd55e53278a52.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec658b84293849d1beefd55e53278a52.png","size":""}]},{"name":"Dixie Dregs","url":"https://www.last.fm/music/Dixie+Dregs","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/90e19aa5936f45ae861206134b33b44a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/90e19aa5936f45ae861206134b33b44a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/90e19aa5936f45ae861206134b33b44a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/90e19aa5936f45ae861206134b33b44a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/90e19aa5936f45ae861206134b33b44a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/90e19aa5936f45ae861206134b33b44a.png","size":""}]},{"name":"Eric Johnson","url":"https://www.last.fm/music/Eric+Johnson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0960e08848e14583a242c6bb3442c482.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0960e08848e14583a242c6bb3442c482.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0960e08848e14583a242c6bb3442c482.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0960e08848e14583a242c6bb3442c482.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0960e08848e14583a242c6bb3442c482.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0960e08848e14583a242c6bb3442c482.png","size":""}]},{"name":"Michael Lee Firkins","url":"https://www.last.fm/music/Michael+Lee+Firkins","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/602ad6ee3c5c4bcecb1915baf5f4635e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/602ad6ee3c5c4bcecb1915baf5f4635e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/602ad6ee3c5c4bcecb1915baf5f4635e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/602ad6ee3c5c4bcecb1915baf5f4635e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/602ad6ee3c5c4bcecb1915baf5f4635e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/602ad6ee3c5c4bcecb1915baf5f4635e.png","size":""}]},{"name":"Andy Timmons Band","url":"https://www.last.fm/music/Andy+Timmons+Band","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5a6779d3803133d04420006980b1c2d8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5a6779d3803133d04420006980b1c2d8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5a6779d3803133d04420006980b1c2d8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a6779d3803133d04420006980b1c2d8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a6779d3803133d04420006980b1c2d8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a6779d3803133d04420006980b1c2d8.png","size":""}]}]},"tags":{"tag":[{"name":"guitar virtuoso","url":"https://www.last.fm/tag/guitar+virtuoso"},{"name":"guitar","url":"https://www.last.fm/tag/guitar"},{"name":"instrumental","url":"https://www.last.fm/tag/instrumental"},{"name":"Progressive rock","url":"https://www.last.fm/tag/Progressive+rock"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Steve+Morse/+wiki"}},"published":"01 Jun 2006, 19:59","summary":"Steve Morse's career has encompassed rock, country, funk, jazz, classical, and fusion of these musical genres. In addition to a thriving solo career, has been (and continues to be) a member of several renowned bands.\n\nSteve was born in Hamilton, Ohio, the son of a minister and a musically talented Mother. Both his Mother and Father were also educational psychologists.  The family soon moved to Tennessee and then Michigan, where the young Morse played in his first band (The Plague) with his older brother, Dave. <a href=\"https://www.last.fm/music/Steve+Morse\">Read more on Last.fm</a>","content":"Steve Morse's career has encompassed rock, country, funk, jazz, classical, and fusion of these musical genres. In addition to a thriving solo career, has been (and continues to be) a member of several renowned bands.\n\nSteve was born in Hamilton, Ohio, the son of a minister and a musically talented Mother. Both his Mother and Father were also educational psychologists.  The family soon moved to Tennessee and then Michigan, where the young Morse played in his first band (The Plague) with his older brother, Dave. The final move brought the family to Augusta, Georgia.\n\nSteve’s parents enrolled Steve in the public school system. While at Richmond Academy. Steve met bassist Andy West in the 10th grade, forming a long-time musical bond. Together, they became the nucleus of Dixie Grit, adding keyboardist Johnny Carr, guitarist/vocalist Frank Brittingham, and drummer Dave Morse. The ambitious band played locally and a little in the Southeast for over a year, and then disbanded.\n\n“At that point,” recalls Steve, “Andy and I were keen to keep on playing instrumental music on our own. So, since we were the only ones left from the group, or the dregs of the group, we called it Dixie Dregs.”\n\nThe University of Miami has played host to a number of future influential musicians, including Bruce Hornsby, Pat Metheny, and Jaco Pastorius. Even at the time, it had a reputation among budding musicians. Steve and Andy enrolled there, and were allowed to create a more rock oriented small group project to contrast the more jazz sounding ensembles that were available at the time. This ensemble appeared in the course schedule as Rock Ensemble II with Steve listed as the instructor. The other members were drummer Bart Yarnald, keyboardist Frank Josephs and violinist Allen Sloan. Morse acted as the group’s writer, bringing attention to both his performing and composing.\n\nFellow student Rod Morgenstein became a fan of the group, later saying, “Steve stuck out like a sore thumb [laughs]. He had long blond hair, and he played a hybrid solid-body Fender Telecaster with a Stratocaster neck…he would change pickups as he was soloing, and his lines didn't sound like stock bebop lines. But his teacher kept asking him, ‘Why can't you sound like this [other] guy?’ Steve was just doing his own thing.”\n\nSteve’s guitar, the Frankenstein Telecaster, was an attraction all to itself. Looking for more sonic variety than his stock Stratocaster, Steve started with a Telecaster body, and then added his familiar Stratocaster neck. He had the neck refretted with jumbo fret wire, and with the addition of a Gibson tune-o-matic bridge, a tailpiece from a pawn shop twelve string, four full pickups and three toggle switches, Steve had his guitar. In time, it evolved into one of the (two) Ernie Ball Musicman Steve Morse model guitars, which Steve plays to this day.\n\nUpon graduation, Morse and West renamed the group Dixie Dregs. Rod Morgenstein, replaced an injured Bart Yarnald and the band commenced performing on a regular basis, interspersing their compositions with covers of John McLaughlin, Frank Zappa, and Allman Brothers. Despite their non-commercial intent, an increasingly busy performance schedule eventually garnered the attention of Allman Brothers Band manager Twiggs Lyndon, who helped signed Dixie Dregs to Capricorn Records.\n\nThe Dreg’s first effort for Capricorn, Free Fall (1977), put the jazz fusion world on notice. Morse was recognized for both his compositional skills (having written all 11 tracks) and his consummate musicianship. Although critically acclaimed as a pivotal jazz fusion album, the album did not chart very high.\n\nWhat If (1978) was released to continued acclaim as Steve’s writing expanded beyond jazz/fusion’s common characteristics. Southern rock, classical, folk and country elements combined to form a cohesive and complex blend of passionate and accessible music. Though supported by a tour, record sales remained modestly, but gained Morse and the band an invitation to perform at Montreux Jazz Festival. The resulting show was released on their final album for Capricorn, Night of the Living Dregs (1979).\n\nJust as things were looking up for the band, Capricorn declared bankruptcy. Arista Records jumped right in, though, and signed the band for three albums. Production control was handed to Morse, and Dregs of the Earth (1980) was released. All eight tracks were written by Morse, and the album peaked at number 27 on Billboard's Jazz Album Chart.\n\nDespite increased sales, Artista pressured the band to change their name to simply \"The Dregs\" in an attempt to increase the band's visibility in the public eye. Unsung Heroes (1981) brought eight additional Morse compositions forward, and was nominated for the Best Instrumental Performance Grammy. This did little to address Arista's concerns, though, and the Dregs were compelled to add guest vocalists to their next effort, aptly titled Industry Standard (1982). This was co-produced by Eddie Offord, of Yes, and featured a classical duet with one of Steve's influences, Steve Howe.\n\nMorse's compositions on Industry Standard brought his evolving sound to a new level, and the album received a Grammy nomination for Best Rock/Jazz Instrumental Performance. (Morse’s work went on to receive six Grammy nominations.) It was also voted \"Best Guitar Album\" by readers of Guitar Player magazine in their annual reader's poll that year. \n\nBut the pressure to sell more albums continued, and combined with seemingly unending touring, brought things to the brink. “Our edge slipped away,” laments Steve. “We did three gigs in a row that were miserable for me…I just decided that I would rather cut people's yards or drive a bulldozer than do this.\" Shortly thereafter, Dixie Dregs disbanded. Steve did try his hand at hiring out tractor and dozer work while rethinking his next move.\n\nDuring this period of restructuring, he picked up the pen. In 1983, Morse published the first article for his long-running column, “Open Ears” in Guitar for the Practicing Musician. Several years later, two volumes of his 100 columns were published. \n\nLooking back, Steve sums up his writing. “My essays have always leaned more toward the philosophy of being a musician rather than just technique. As a writer, I am a novice, but I feel my goal will have been achieved if a positive thought is illuminated when you read what I’ve got to say. In the long run, I believe that a musician’s quality is equal only to his quality as a person.”\n\nWhen the call of music returned, Steve opted for a smaller group and a desire for creative freedom. The Steve Morse band was formed with Jerry Peek on Bass and Doug Morgan on drums. Doug drummed for Steve until Rod Morgenstein returned from a tour with Paul Barrere. Morse signed with Elektra Records and released The Introduction (1984). The album was a success, scoring a minor hit with the song (and music video), “Cruise Missle.” The blistering bluegrass track, “General Lee,” (featuring Albert Lee) quickly became a fan favorite.\n\nWhile the Dixie Dregs showcased Morse’s compositional skills, the Steve Morse Band brought his guitar work front and center. His second album, Stand Up, led him to the opening slot on Rush’s 1986 North American tour.\n\nBut a shake up at Elektra resulted in changed priorities at the label. As part of the fall-out, the album was not released on CD. Steve and his band were devastated, but Morse was becoming increasingly used to the fickle, unpredictable nature of the industry. With some members under pressure to have a predictable income, the band started to come unraveled.\n\nMorse began to perform some solo concerts as well as tour with the all-acoustic guitar trio of Al DiMeola, John McLaughlin, and Paco De Lucia. His next direction was to inadvertently join an existing band.. He ran into Kansas drummer, Phil Ehart, at a Robert Plant show. Kansas was one of Steve’s favorite bands, highlighted by one of his favorite songwriters (and guitarists), Kerry Livgren. But both lead singer Steve Walsh and Livgren had left the now-defunct band.\n\nEhart mentioned that he was putting the band back together with Steve Walsh returning for the first time since leaving the band.  Steve offered to help in any way he could. After a number of successful writing sessions with the group, Phil’s response was to invite him to join the band for an album and follow up tour.  Recognizing the potential, Steve accepted.\n\nSteve recorded two releases releases with Kansas: Power (1985) and In the Spirit of Things (1986). As with Kerry, he acted as lead guitarist and a primary songwriter. Livgren responded with praise, beginning a friendship that continues to this day.\n\nSteve contributed to the band's last hit (thus far), \"All I Wanted,\" which reached the Billboard Top 20 and received heavy rotation on MTV. As before, though, the record company (this time MCA) was not satisfied with sales.\n\nThey pressured the group, long known for its inventive songwriting, to hire external songwriters to score another big hit. The collective stress splintered the group. Once again, Steve found himself cut short by an industry that seemed only tangentially related to music, and made a difficult decision at the end of their tour. He was not in Kansas any more.\n\nMorse was not satisfied unless he was being challenged, and if it wasn’t through music, he would find something. He became a commercial airline pilot. Morse had been flying for years, it continues to be a passion and escape for him to this day.\n\n\"It was a fantastic experience to jump through all the hoops, pass the selection tests, go through the training, and finally put on a uniform and be judged only on how well I did my job. I would recommend a career change for anybody that wants to really find out where their passion lies\". He missed performing though, and an invitation to perform as a guest on a live recording with Lynyrd Skynyrd reminded Morse of his true calling.\n\nSteve commenced with both a new solo album and a Dregs reunion. For his own band, he was joined by Rod Morgenstein, T. Lavitz and Jerry Peek on Bass. High Tension Wires (1989) was more thoughtful and introspective than Morse’s previous releases. \n\nThe Dregs reunion saw Morgenstein, Lavitz and Sloan return. West had had moved on, and a new bassist, Dave LaRue, took up the reins. The compilation album released at the same time, Divided We Stand (1989) ranked among the Dreg’s best selling to date. Morse was back with a vengeance, and the guitar world took notice. That year, he was voted “Best Overall Guitarist” by the readers of Guitar Player magazine. \n\nWhen it came time to tour in support of High Tension Wires, Morgenstein was unavailable, having joined Winger. LaRue suggested Van Romaine, a friend who had graduated from the University of Miami ten years after Steve. Romaine aced the audition. The Steve Morse band was reborn, and the trio continues to this day.\n\nSouthern Steel (1991) was Steve’s next album with his trio, and it represented a slightly heavier musical direction. The hard-rocking album burned, soared, and flowed with passion and precision. The next year saw another Steve Morse Band album, Coast to Coast (1992), a new Dregs tour, and a resulting double live album, Bring ‘em Back Alive (1992). The next year, Steve didn’t release any albums, but was awarded “Best Overall Guitarist” anyway. At this point, it had been five years in a row, and Guitar Player took him out of the running.\n\nThe tour went so well that the Dregs reconvened for their first studio album in ten years, Full Circle. In another homage to the past, they signed with a resurrected Capricorn records. This time, the band was firmly in charge and released their final album (thus far) exactly as intended.\n\nBefore the ink was dry, Steve was already working on his next solo release, Structural Damage (1995). In classic Morse style, the album fused together multiple genres—funk, hard rock and classic—into a unique musical landscape.\n\nIn 1994, Steve's longtime manager, Frank Solomon, called him and asked if he liked Deep Purple. Morse responded curiously, \"Yes…why?\" The metal juggernaut had lost guitarist Ritchie Blackmore mid-tour, who was temporarily replaced with Joe Satriani. When it came time to search for a permanent replacement, Morse was at the top of everyone’s list.  Morse and the band booked some trial show, and after the first one, in Mexico City, Morse was asked to join.\n\nThe group commenced work on a new album, Purpendicular (1996). The album, even though much later than the band’s classic work, was welcomed by fans as one of the band’s best. Steve wrote with the other members, completing a creative unit. \n\n“It's amazing how little talking is needed to put a tune together with these guys,” enthuses Steve. “Just after going through a progression a few times, Ian Paice puts together a bunch of different possibilities for the different parts, and you don't need to say anything to him. Roger, the bass player, has been the band's producer and co-songwriter for so long now, he just naturally figures out what works and what doesn’t. All of a sudden, he'll give a cue to the band, and we’ll pick up on it instantly.”\n\nBy 2003, Steve had recorded two more successful studio albums with Purple, Abandon (1998) and Bananas (2003). In addition, they had recorded five live albums and two concert videos. With nearly constant year-round touring (including the first tour of China by a western rock band), Deep Purple reestablished itself as one of the world’s premier rock groups, and Steve had finally found a band that fused with his musicality, without compromises.\n\nBut Steve wasn’t done with his own music. Just two years after he joined Purple, he released another solo album, titled (understandably), Stressfest (1996). This was followed by Major Impacts (2000), Split Decision (2002) and Major Impacts 2 (2004).\n\nIn 2003, Jimmy Barnes asked Morse to join Bob Daisley, Lee Kerslake and (Deep Purple organist) Don Airey for his project, Living Loud. They recorded a studio album by the same name (2003), and released a live concert video and 2CD set, Live in Sidney (2004).\n\nMeanwhile, Dee Purple was collectively writing and recording their next studio release, Rapture of the Deep (2005). Continued touring throughout the end of the decade yielded two more live releases and a new concert video.\n\nIn 2009, the Steve Morse Band released Outstanding in Their Field, their first release in five years. The critically acclaimed album was supported by a US east coast tour during October-November, and west coast tour in January.\n\nSeveral dates on the tour featured Steve performing as an opening act, with Sarah Spencer, as Angelfire. Steve had begun working with the young singer several years back, culminating in the release of an album by the same name on June 22nd, 2010. Angelfire was a first even for Morse, who has defined his career by exploring and combining numerous genres in novel ways. Stylistically, the album combines folk rock, pop, classical crossover and new age to form a textural, harmony-laden and unique work.\n\nThe new decade also saw Steve revisit his collaboration with Jimmy Barnes and company, writing several new songs with them. His continuing practice of guest appearances included John Wetton and Sharon Isbin. A particularly unique collaboration occurred with Steve’s participation in a tribute to (former Deep Purple guitarist) Tommy Bolin. Steve played on several tracks containing unreleased recordings of the late Bolin, with he and Steve trading solos.\n\nEven after 47 albums, Morse continues to push boundaries and take chances. In addition to his continuing solo endeavors, collaborative projects, and further work with Deep Purple—Steve can look back on an extraordinary career, and forward to near-infinite possibilities. <a href=\"https://www.last.fm/music/Steve+Morse\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
