{"artist":{"name":"Sugar Ray","mbid":"ecc5119f-2ce2-4561-8c36-3aa4dd49e281","url":"https://www.last.fm/music/Sugar+Ray","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f4188a3f7e9049cb82a58228e3ac2d49.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f4188a3f7e9049cb82a58228e3ac2d49.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f4188a3f7e9049cb82a58228e3ac2d49.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f4188a3f7e9049cb82a58228e3ac2d49.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f4188a3f7e9049cb82a58228e3ac2d49.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f4188a3f7e9049cb82a58228e3ac2d49.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"629012","playcount":"5914779"},"similar":{"artist":[{"name":"Gin Blossoms","url":"https://www.last.fm/music/Gin+Blossoms","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/261795b5b4b643de9b3026275f075917.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/261795b5b4b643de9b3026275f075917.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/261795b5b4b643de9b3026275f075917.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/261795b5b4b643de9b3026275f075917.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/261795b5b4b643de9b3026275f075917.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/261795b5b4b643de9b3026275f075917.png","size":""}]},{"name":"Everclear","url":"https://www.last.fm/music/Everclear","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/586bd34d90c84dfaade283235a750fe3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/586bd34d90c84dfaade283235a750fe3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/586bd34d90c84dfaade283235a750fe3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/586bd34d90c84dfaade283235a750fe3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/586bd34d90c84dfaade283235a750fe3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/586bd34d90c84dfaade283235a750fe3.png","size":""}]},{"name":"Vertical Horizon","url":"https://www.last.fm/music/Vertical+Horizon","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bb1724ee426c4e30836fef3a58fa624c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bb1724ee426c4e30836fef3a58fa624c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bb1724ee426c4e30836fef3a58fa624c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb1724ee426c4e30836fef3a58fa624c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb1724ee426c4e30836fef3a58fa624c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb1724ee426c4e30836fef3a58fa624c.png","size":""}]},{"name":"Hootie & The Blowfish","url":"https://www.last.fm/music/Hootie+&+The+Blowfish","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e6d3fb283b094c3783f56ce4bace51be.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e6d3fb283b094c3783f56ce4bace51be.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e6d3fb283b094c3783f56ce4bace51be.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e6d3fb283b094c3783f56ce4bace51be.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e6d3fb283b094c3783f56ce4bace51be.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e6d3fb283b094c3783f56ce4bace51be.png","size":""}]},{"name":"Smash Mouth","url":"https://www.last.fm/music/Smash+Mouth","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cf197bc9289f4e75b475fe38547d895b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cf197bc9289f4e75b475fe38547d895b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cf197bc9289f4e75b475fe38547d895b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf197bc9289f4e75b475fe38547d895b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf197bc9289f4e75b475fe38547d895b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf197bc9289f4e75b475fe38547d895b.png","size":""}]}]},"tags":{"tag":[{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"},{"name":"alternative rock","url":"https://www.last.fm/tag/alternative+rock"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"90s","url":"https://www.last.fm/tag/90s"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Sugar+Ray/+wiki"}},"published":"07 May 2006, 17:53","summary":"Sugar Ray is a rock band from Orange County, California. The band formed in 1992 with the name Shrinky Dinx, later changing it to Sugar Ray after the boxer Sugar Ray Leonard. They originally were a funk metal band, however later releases abandoned this genre in favour of pop rock.\n\nTheir debut album, Lemonade and Brownies, was released in 1995. It failed to produce a major hit. Their early work was strongly influenced by funk, punk, alternative rock and straight-up rhythm and blues, not a particularly fashionable combination at the time. <a href=\"https://www.last.fm/music/Sugar+Ray\">Read more on Last.fm</a>","content":"Sugar Ray is a rock band from Orange County, California. The band formed in 1992 with the name Shrinky Dinx, later changing it to Sugar Ray after the boxer Sugar Ray Leonard. They originally were a funk metal band, however later releases abandoned this genre in favour of pop rock.\n\nTheir debut album, Lemonade and Brownies, was released in 1995. It failed to produce a major hit. Their early work was strongly influenced by funk, punk, alternative rock and straight-up rhythm and blues, not a particularly fashionable combination at the time.\n\nSugar Ray's first mainstream hit came in the summer of 1997 with their song \"Fly\", which was released on the album Floored and featured notable reggae artist Super Cat. \"Fly\" was notable for not sounding anything at all like the rest of the tracks on the album and received frequent (some called it \"constant\") radio play. As a result of the success of \"Fly\", Floored sold extremely well and was certified double platinum. By the end of 1997, critics, skeptical that the band could put out another successful song, had labeled Sugar Ray as a one-hit wonder.\n\nThe band's sardonic reply to these accusations was given in the form of their 1999 album, 14:59; the album's title, with a  \"fame clock\" reading 14:59, implied that their fifteen minutes of fame were not quite up. The song \"Every Morning\", which received widespread comparisons to \"Fly\", rose to similar success in late 1998, while their follow-up single, \"Someday\", received extensive airplay during 1999. This album, which outsold its predecessor and was certified triple platinum, proved that Sugar Ray was not a one-hit wonder after all. Though Sugar Ray was also set to play at Woodstock '99, they had to cancel due to illness.\n\nTheir 2001 self-titled album Sugar Ray produced another hit with \"When It's Over\" and reached the same level as their previous singles. Sugar Ray's 2003 effort In the Pursuit of Leisure, and the first single from that album, \"Mr. Bartender (It's So Easy)\" received a lukewarm reception. In 2005, Sugar Ray released a greatest hits album, with two new songs, including the single \"Shot of Laughter\".\n\nAfter a five year hiatus, Sugar Ray returned with Music For Cougars, reiterating the band’s signature sound. As ever, musical styles – from dancehall to disco, punk to pure pop – are mixed and matched, resulting in a collection that is distinctively Sugar Ray, including songs such as the first single, “Boardwalk,” and the Rivers Cuomo-penned “Love Is the Answer”.  “I’m not going to say we made the best record of our career,” beams singer Mark McGrath.  “That’s just so clichéd.  But we did!”\n\nSince their 1995 Lemonade And Brownies debut, Sugar Ray had become stuck in a biennial cycle of touring and recording, touring and recording. 1997’s RIAA double platinum-certified sophomore effort, Floored, and its follow-up, 1999’s triple platinum 14:59 were trailed by 2001’s self-titled collection and 2003’s In The Pursuit Of Leisure. By the release of 2005’s The Best Of Sugar Ray, the band had earned a break. \n\nHaving devoted themselves to the band since its 1986 inception as The Shrinky Dinks, each member took the time to explore new creative terrain – McGrath stayed in the spotlight as co-host of the nationally syndicated entertainment news program, Extra. Craig “DJ Homicide” Bullock relocated to Florida, where became a hugely in-demand club DJ; drummer Stan Frazier worked as a songwriter and A+R exec; bassist Murphy Karges became a video director; and guitarist Rodney Sheppard taught music to neighborhood kids. Perhaps more importantly, Sheppard, Karges, and Frazier started families, with all living within a two mile radius from one another in their hometown of Newport Beach. “It was just the natural course to sort of lay back for a while,” Sheppard says, “We had a good run up to that time and we’d gotten to the point where we welcomed a break.  It just ended up being a bit longer than we thought.”\n\nSugar Ray was quite active during their hiatus, busting out hits at private corporate events, county fairs, and countless summer festivals. By 2008, the band was itching to get back into the studio.  In July, McGrath left Extra in order to devote more of his time to Sugar Ray. At the same time, the band’s longtime friend, producer Josh Abraham (Velvet Revolver, Limp Bizkit, and Linkin Park), invited them to cut a new album for his just-launched label, Pulse Recordings. “All the stars lined up for us,” Sheppard says. “We always said we would never force ourselves back on the public, but everything just fell together nicely. It was an opportunity for us to make some new music again so we grabbed it.” With Abraham at the helm, the band immediately set to work at the producer’s Pulse Recordings in Los Angeles. The producer pushed the band to reach down deep and refine their songwriting, penned, as ever, in various combinations of band members.  \n\nPerhaps more importantly, Abraham hooked Sugar Ray up with Pulse in-house producer/songwriter Luke Walker (The Deftones, Alkaline Trio, Filter, Elliot Yamin, and From First to Last), whom the band enthusiastically credits for helping to both energize and focus the album. “The guy’s a genius,” McGrath enthuses. “He’s an amazing songwriter and he really infused a new attitude, a new creativity, a new way to get songs done and get ‘em done quickly. Luke is the MVP of the whole project.” “We really clicked with Luke,” Sheppard says, “separately and together. A lot of time in the past, the band would come up with a song and get it three-quarters of the way there. With Luke, we were able to realize all our ideas. He was an important ingredient in the song-crafting.”\n\nThe sessions spanned close to a year, a leisurely process that enabled Sugar Ray to take their time with both songs and sonics. “Being the underdog again really frees up your creativity,” McGrath explains. “We had so much fun making the record. There was no pressure. It was purely about the love of songwriting and getting into the studio.” \n\nMusic For Cougars sees the band ping-ponging though pop’s innumerable permutations. “Love 101” is classic El Lay harmony pop a la Ricky Nelson, while “She’s Got The…” recalls the days when rock giants like Kiss and the Kinks dared to dip a toe into disco’s forbidden waters. Elsewhere, the band displays their mastery of cross-pollinated island rhythms and raps with the delightful “Girls Were Made To Love.”  The track – built upon a sample from the 1962 hit, “(Girls, Girls, Girls) Made To Love,” written by Phil Everly and performed by child star Eddie Hodges – was an instant favorite among the bandmates, though they all sensed it needed something more to push it into classic status.  McGrath suggested reaching out to Bermuda-based dancehall star Collie Buddz. The band sent the unfinished track to their friend Native Wayne, host of Indie 103.1’s “Native Wayne’s Reggae Smoke-In,” and within days, Buddz had promised to record his parts at the next earliest convenience. True to his word, Collie spent an April afternoon at Pulse, laying down his rapid-fire rhymes. “It’s amazing that when you reach out to people they sometimes actually say yes,” Sheppard says, “To have him on the record, it’s an honor.  I think it’s the best song on the record now.  The guy just came through big time.” “It’s something people would expect to hear from us,” McGrath says of the track, “but updated. I know there are people who are gonna say, ‘Oh great, Sugar Ray is doing dancehall again. Whatever.’ But to me, you can never have enough songs that sound like ‘Fly.’”\n\nSugar Ray has always reveled in teaming with fellow artists spanning a wide swath of genres, counting hip-hop heroes like Run DMC and KRS-One, reggae/dancehall superstars Shaggy and Super Cat, alternative rock musician Nick Hexum from 311, and pop royalty The Wilson Sisters. Along with the aforementioned Collie Buddz, Music For Cougars features a number of new alliances, including “Going Nowhere,” co-written with Tim Pagnotta of Sugarcult, and “Dance Like No One's Watchin',” a collaboration with surfing singer/songwriter Donavon Frankenreiter – an old friend of the band’s and Sheppard’s cousin by marriage. Perhaps the album’s most striking partnership is “Love Is The Answer,” an original song gifted to the band by Weezer honcho Rivers Cuomo. \n\nSugar Ray can claim credit for some of the most indelible pop hits of the previous decade, including the unforgettable #1 smashes, “Fly” and “Every Morning”. McGrath is proud of the band’s body of work. “I’ll be self-deprecating about myself and about the band,” he says, “but we wrote some fucking amazing songs. We wrote songs that people fell in love to, that people got married to, that people had sex to for the first time. The songs became bigger than the band. They’re the world’s property now and we need to be humbled by that.”\n\nSugar Ray are now getting set to take their classic songs – both new and old – on the road for their first full-scale tour in years. Music For Cougars allows the band to live up to its mission statement from the very beginning – to hang out together and make high-energy rock ‘n’ roll. “We have no misconceptions about what this record may do,” McGrath says.  “It was strictly about making another record because we had great new material and the fact that we still enjoy playing together. “This is my life’s work,” he notes.  “People say, ‘You’re still in the band?’  This is what I do!  I’m gonna be in Sugar Ray till I die! I’ve been lucky enough to fit a uniform, I’m gonna wear it till the wheels fall off!” <a href=\"https://www.last.fm/music/Sugar+Ray\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
