{"artist":{"name":"Suicidal Tendencies","mbid":"e9e2a634-984f-4c10-bf7b-7970179e1ef1","url":"https://www.last.fm/music/Suicidal+Tendencies","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/21014fde6b1244de961d672416741486.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/21014fde6b1244de961d672416741486.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/21014fde6b1244de961d672416741486.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21014fde6b1244de961d672416741486.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21014fde6b1244de961d672416741486.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21014fde6b1244de961d672416741486.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"355797","playcount":"9074625"},"similar":{"artist":[{"name":"D.R.I.","url":"https://www.last.fm/music/D.R.I.","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3314f2ff195446af9af0cad479b1fb3d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3314f2ff195446af9af0cad479b1fb3d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3314f2ff195446af9af0cad479b1fb3d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3314f2ff195446af9af0cad479b1fb3d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3314f2ff195446af9af0cad479b1fb3d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3314f2ff195446af9af0cad479b1fb3d.png","size":""}]},{"name":"Nuclear Assault","url":"https://www.last.fm/music/Nuclear+Assault","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c5f58704aab740b5a1a6c2f3349d8654.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c5f58704aab740b5a1a6c2f3349d8654.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c5f58704aab740b5a1a6c2f3349d8654.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c5f58704aab740b5a1a6c2f3349d8654.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c5f58704aab740b5a1a6c2f3349d8654.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c5f58704aab740b5a1a6c2f3349d8654.png","size":""}]},{"name":"Municipal Waste","url":"https://www.last.fm/music/Municipal+Waste","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d14bc73054eb48b6a5b0baeb7e310b67.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d14bc73054eb48b6a5b0baeb7e310b67.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d14bc73054eb48b6a5b0baeb7e310b67.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d14bc73054eb48b6a5b0baeb7e310b67.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d14bc73054eb48b6a5b0baeb7e310b67.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d14bc73054eb48b6a5b0baeb7e310b67.png","size":""}]},{"name":"Dr. Living Dead","url":"https://www.last.fm/music/Dr.+Living+Dead","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e52929b105d949a0af2751c99f1d9ec2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e52929b105d949a0af2751c99f1d9ec2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e52929b105d949a0af2751c99f1d9ec2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e52929b105d949a0af2751c99f1d9ec2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e52929b105d949a0af2751c99f1d9ec2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e52929b105d949a0af2751c99f1d9ec2.png","size":""}]},{"name":"Agnostic Front","url":"https://www.last.fm/music/Agnostic+Front","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3e92d89bf9744dc1869b3c14b62a3deb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3e92d89bf9744dc1869b3c14b62a3deb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3e92d89bf9744dc1869b3c14b62a3deb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e92d89bf9744dc1869b3c14b62a3deb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e92d89bf9744dc1869b3c14b62a3deb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e92d89bf9744dc1869b3c14b62a3deb.png","size":""}]}]},"tags":{"tag":[{"name":"hardcore","url":"https://www.last.fm/tag/hardcore"},{"name":"crossover","url":"https://www.last.fm/tag/crossover"},{"name":"thrash metal","url":"https://www.last.fm/tag/thrash+metal"},{"name":"punk","url":"https://www.last.fm/tag/punk"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Suicidal+Tendencies/+wiki"}},"published":"26 Feb 2006, 01:07","summary":"\n\n\nEarly Career, Controversy, & First Hiatus (1981–1986)\n\nSuicidal Tendencies formed in 1981 as a punk band in Venice, California. The original lineup of the band consisted of Mike Muir on vocals, Mike Ball on guitar, Carlos \"Egie\" Egert on drums, and Mike Dunnigan on bass. After the recording of their first demo, Carlos Egert left the band and was replaced by Dunnigan's brother, Sean. Muir, at the time a student at Santa Monica College, originally only intended Suicidal Tendencies as a \"party band\" <a href=\"https://www.last.fm/music/Suicidal+Tendencies\">Read more on Last.fm</a>","content":"\n\n\nEarly Career, Controversy, & First Hiatus (1981–1986)\n\nSuicidal Tendencies formed in 1981 as a punk band in Venice, California. The original lineup of the band consisted of Mike Muir on vocals, Mike Ball on guitar, Carlos \"Egie\" Egert on drums, and Mike Dunnigan on bass. After the recording of their first demo, Carlos Egert left the band and was replaced by Dunnigan's brother, Sean. Muir, at the time a student at Santa Monica College, originally only intended Suicidal Tendencies as a \"party band\", but as they grew in notoriety he soon found the band at the center of his life. Suicidal Tendencies had a rough start including being voted \"Worst Band/Biggest Assholes\" in Flipside in 1982 but the following year were voted \"Best New Band\". There were many rumors of the band members as well as their friends and followers being involved with gangs (especially the Venice White Boyz), with Muir's trademark blue bandanna and violence at the band's performances as evidence. In their original lineup photo, which can be seen inside their self-titled debut album, drummer Amery Smith is wearing a flipped up hat and under the bill are the markings \"V13\", which are initials for the gang Venice 13. Though there were probably a handful of V13 members who also became ST fans, Amery was not a member of V13 but bassist Louiche Mayorga's brother Steve Mayorga was (and that's whose hat he's wearing for the photo). Eventually an entire gang sprung up around the group, the Suicidal Cycos (also known as the Suicidals, Suis or Suicidal Boyz) with chapters in Venice, Long Beach, Santa Monica, Orange County, Oceanside, San Diego and even a chapter in San Antonio, Texas.\n\nSuicidal Tendencies quickly gained a following and began performing at larger gigs. They recorded a demo in 1982 and were featured on the Slamulation compilation LP on Mystic Records. The song featured was \"I Saw Your Mommy\", which was later featured on their self-titled debut album. The Dunnigan brothers quit after these recordings, with Mike Dunnigan later joining Tony Alva's band The Skoundrelz to be back with Mike Ball on guitar and Bela Horvath on drums. Ball stayed in the band for 2½ years before joining The Skoundrelz and was replaced by Dunnigan. Guitarist Rick Battson recorded the demo before the first album. Grant Estes learned that demo replacing him on guitar and playing on Suicidal's first record.\n\nAll this controversy helped the band gain label attention, and in 1983 Suicidal signed with the independent label Frontier Records and released their self-titled debut. It was described by critic Steve Huey as \"Fast, furious, and funny... Mike Muir proves himself an articulate lyricist and commentator, delving into subjects like alienation, depression, and nonconformist politics with intelligence and humor.\" It contained the song \"Institutionalized\", which featured a music video that became one of the first hardcore punk videos to receive substantial MTV airplay, and greatly expanded the band's fan base. The song was featured in the 1984 film Repo Man, as well as in a 1986 episode of the TV show Miami Vice (Free Verse, which also featured a cameo appearance of the group performing in a new wave/punk club) and in the 2008 film Iron Man, where the song plays in the background as Tony Stark works on his car. Soon after the release of their debut album in 1983, Estes left the band and was replaced by Jon Nelson, former manager of the Venice-based band Neighborhood Watch. Nelson played with Suicidal on all the early punk shows from 1983 to 1984 contributing the music for future songs like: \"War Inside My Head\",“You Got, I Want”, \"Human Guinea Pig\", \"You Are Forgiven\" and Look Up...(The Boy's Are Back), the latter ending up on the bands compilation record Welcome to Venice Though Nelson never appeared on any of the Suicidal releases, there are some live recordings of the song \"War Inside My Head\" as well as others. All the music written by Jon Nelson was purchased by Muir upon his departure from the band for a small amount of money and a Flying V guitar. He is credited on the albums only as written by (Suicidal Tendencies) and in 1987 was erroneously listed as guitarist on the reissue of their debut album \"Suicidal Tendencies\" which was soon corrected to appropriately credit Grant Estes.\n\nThat same year was the beginning of Suicidal’s four-year recording hiatus and Mike Muir and bassist Louiche Mayorga formed the Label “Suicidal Records” as well as the band Los Cycos Jon Nelson left the group and Suicidal Tendencies were banned from playing L.A. shows from an Incident at Perkins Palace (their fans tore out ten rows of seats and promoters couldn’t get the proper insurance to hire them) Muir was also about to try his hand at producing as well as starting the new label. Los Cycos was originally Mike Muir (Vocals), Bob Heathcote (bass), Anthony Gallo (Guitars) and Amery Smith (drums). After a few rehearsals Amery Smith left the line up to join Jon Nelson in starting their own band (The Brood). Los Cycos eventually included Grant Estes on lead guitar and original choices Bob Heathcote and Amery Smith were replaced by Louiche Mayorga (bass) and Sal Troy (drums). They recorded the song \"It's Not Easy\" written by Muir. \"Welcome to Venice\" was the first record to be released on Suicidal Records, unfortunately the original masters were destroyed in a fire. In 1989 Suicidal Tendencies re-recorded \"It's Not Easy\" for their 1989 release \"Controlled By Hatred/Feel Like Shit... DejaVu\" album. The other Los Cycos track \"A Little Each Day\" which never made it to the album, was re-recorded for the 1987 Suicidal Tendencies release \"Join the Army\" and again on \"Still Cyco After All These Years\" released in 93. In 2000 it resurfaced on the FNG compilation and a fourth time on 2008s (split) album Lights...Camera...Revolution!/Still Cyco After All These Years. Suicidal Tendencies played on the track Look Up...(The Boys are Back) which was the introduction of guitarist Rocky George and drummer RJ Herrera. The band finally found a new label in Caroline Records in 1986.\n\n\nFirst Comeback (1987–1988)\n\nWith the line-up of Muir, Louiche Mayorga, George, and Herrera, the band released their second album, Join the Army, in 1987 (see 1987 in music). The album was met with a mixed reaction from long-time fans due to its considerably more metal-oriented sound (an element brought to the table by Rocky George), as they were expecting another punk album. Nonetheless, Join the Army featured classic tracks such as \"War Inside My Head\" and \"Possessed to Skate\" (which featured a video, originally intended for an unsuccessful skateboard movie, which featured Timothy Leary).\n\nShortly afterwards, the band made some major changes. Rocky George's metal influences (reflected in his Motörhead-esque songwriting contributions to Join the Army) began in turn influencing Muir, who replaced Keven Guercio as singer for Mike Clark's speed metal band No Mercy prior to this. Muir hired No Mercy's guitarist Mike Clark as a rhythm guitarist for Suicidal. Clark helped handle much of the band's songwriting, which progressed into a more thrash oriented musical direction. Then he fired Mayorga, who had been trying to keep the band in punk territory, and was replaced briefly by No Mercy bassist Ric Clayton, who was replaced by Bob Heathcote. Shortly after the band was picked up by Anthrax producer Mark Dodson and signed to the Columbia subsidiary Epic Records. The stylistic changes and signing to a major label outraged a few long-time fans, but Suicidal began to pick up more fans from the heavy metal community as well.\n\nThe band's first release with Epic was How Will I Laugh Tomorrow When I Can't Even Smile Today, released in 1988 (see 1988 in music). The album was almost completely stripped of the band's punk and hardcore roots, instead featuring a thrash-oriented sound with more complex song structures and a greater emphasis on instrumental skill than the band had ever shown previously. However, the album was considerably more melodic than most thrash metal albums, perhaps a lasting influence of the bands punk past. Singles and music videos were released for \"Trip at the Brain\" and the title track, which were successful and helped expand the bands audience. That same year the band was thanked by country musician Hank Williams Jr. at the 1988 CMA Awards. Williams' son was apparently a big fan of Suicidal.\n\n\n\n\n\nTrujillo-Era & Second Hiatus (1989–1996)\n\nWith their popularity and media attention obviously increasing, Suicidal released a compilation of two EPs, Controlled By Hatred/Feel Like Shit...Déjà Vu in 1989. With yet another new member (future Metallica bassist Robert Trujillo, credited as Stymee), the album featured two versions of \"How Will I Laugh Tomorrow\": the video version (the original song cut down for radio/video airplay) and the \"heavy emotion\" version (a semi-unplugged, more mellow version of the song). All the rest of the songs on the album came from previously released EPs except \"Just Another Love Song\" and \"Feel Like Shit...Deja Vu,\" with the remaining songs being No Mercy and Los Cycos covers. The album featured the hit \"Waking the Dead,\" which at 7 minutes was one of the most progressive tracks the band had released to date.\n\nControlled By Hatred... eventually went gold, the first of three Suicidal albums to do so.\n\nIn 1990 Suicidal Tendencies released the album that many fans consider to be their masterpiece, and the album that almost broke them into the rock mainstream, Lights...Camera...Revolution! This album featured the same line-up as Controlled By Hatred..., with Trujillo now using his real name. The songs were much more complex than on any other Suicidal album, some songs bordering on progressive metal, but also showed a new influence courtesy of Trujillo, funk.\n\nThe album was a smash hit. It featured \"You Can't Bring Me Down\" as well as \"Send Me Your Money\", and the melodic thrash song \"Alone\" – all released as singles and music videos. All three singles were successful (especially You Can't Bring Me Down), and helped Lights...Camera...Revolution! also reach gold status, and the band gained a heavy audience in the thrash metal community despite being commonly accused of \"selling out\" in the hardcore circle. Today, Lights... is widely considered to be a thrash classic. The band's 1991 tour with Queensrÿche, their first show in Los Angeles in years,[citation needed] and their appearance on the Clash of the Titans tour helped expand their popularity. They also released the Lights...Camera...Suicidal! home video in 1991.\n\nMuir eventually became very interested in the funk music that Trujillo had brought to the table of Suicidal's influences. As a result, the two formed a funk metal side project in the vein of early Red Hot Chili Peppers called Infectious Grooves. Also recruiting ex-Jane's Addiction drummer Stephen Perkins and Excel guitarist Adam Siegel, Infectious Grooves released their debut, The Plague That Makes Your Booty Move...It's the Infectious Grooves, which featured Ozzy Osbourne singing the line \"therapy\" in the song \"Therapy\" in 1991. This helped expand Suicidal's fan base into an even wider audience that included members of the alternative rock community (funk-metal was a popular alt-metal style at the time).\n\nHerrera left Suicidal Tendencies in 1991 due to personal differences. The rest of the band continued as an incomplete 4-piece for about a year, drafting now-famous drummer Josh Freese to record their new album which would become Art of Rebellion, released in 1992 (see 1992 in music). The album was very different than anything Suicidal Tendencies had done before, but it was actually their most melodic, accessible album to date. It lessened the bands thrash influences, instead focusing on a unique, almost alternative metal sound, with more emphasis on funk and progressive rock, as well as traditional metal guitars. Although different, the album was greeted warmly by most fans and many critics.\n\nThe album was also the band's most commercially successful album. The first single, \"Asleep at the Wheel\", did moderately well, but was followed by two smash hits. The metal ballad \"Nobody Hears\" and the crossover hit \"I'll Hate You Better\", both of which managed to chart on the modern rock radio Billboards. The album debuted on number 52 on the Billboard Top 100 charts (ST's highest charting album ever) and has since gone gold. The band began performing large stadium shows, touring with some mainstream rock staples as Metallica, Queensrÿche, and Danzig, where they earned a wide reputation as an excellent live act. By the end of the year Suicidal had finally found a permanent replacement for Herrera, former White Lion and Y&T drummer Jimmy DeGrasso.\n\nNow at their commercial peak, Suicidal Tendencies released Still Cyco After All These Years in 1993 (see 1993 in music). The album was a re-recording of Suicidal's then out-of-print self-titled debut album with 3 additional songs (two re-recordings of Join the Army tracks, and the B-side to the 1990 \"Send Me Your Money\" single). It featured singles for the new versions of \"Institutionalized\" and \"I Saw Your Mommy\", which managed to do well, as did the album. That same year also saw the release of another Infectious Grooves album, Sarsippius' Ark, which included new tracks as well as demo recordings of old songs, and live tracks.\n\nHowever, disturbed by their recent commercial success and fame, and fear that the band was no longer relevant in the underground, Suicidal Tendencies released Suicidal for Life in 1994 (see 1994 in music). The album was intended by the band to be the least accessible album they had ever released, starting out by having 4 consecutive songs with the word \"fuck\" in the title, and switching to a more aggressive style than on their previous studio album. Suicidal for Life was widely considered to be a disappointing album by critics, many of which claimed Muir had \"dumbed down\" his lyrical approach from previous albums. Fans also had a generally mixed reaction, although their reaction was more favorable than critics.\n\nMuir's strategy worked, however. The album did not sell nearly as well as the past four Suicidal records (although it did sell decently on the band's reputation alone) and the only major single, \"Love Vs. Loneliness\", featured a gloomy music video that hurt the song's airplay.\n\nUnfortunately it was also around this time the band, whose contract with Epic Records had expired, began to fall apart, and folded after a tour in 1995. Muir and Trujillo continued Infectious Grooves, releasing Groove Family Cyco later that year (this album was released before Suicidal Tendencies split), but they eventually folded as well, with Trujillo joining Ozzy Osbourne's band (and later Metallica) and Muir performing as Cyco Miko, releasing Lost My Brain! (Once Again). Rocky George formed the group Samsara and played in 40 Cycle Hum and Cro-Mags after Suicidal's breakup, eventually joining Fishbone. Mike Clark joined a band called Creeper, while Jimmy DeGrasso joined Dave Mustaine's side project MD.45, and eventually replaced Nick Menza in Megadeth who recruited guitarist Anthony Gallo (Suicidal Tendencies, Los Cycos) for his solo record entitled \"Life After Deth\".\n\nA greatest hits compilation, Prime Cuts, was released in 1997, apparently against the band's will.\n\n\n\n\n\nSecond Comeback (1997–2001)\n\nTo the excitement of many, Suicidal Tendencies returned in 1997. However, Rocky George, Robert Trujillo, and Jimmy DeGrasso were all unable to rejoin as they were busy with other projects. Muir and Clark brought in new lead guitarist Dean Pleasants (formerly of Infectious Grooves), new bassist Josh Paul and new drummer Brooks Wackerman (formerly of Bad4Good and Infectious Grooves, now with Bad Religion) to replace them.\n\nThe band released their first new material in almost half a decade, the Six the Hard Way EP in 1998, which also included two live tracks. Released on Suicidal Records, this EP saw the band switching back to their original punk metal and skatepunk style (with songs originally recorded by Cyco Miko covered). This, along with the absence of George and Trujillo, upset many of the bands metal-era fans, but fans of the older punk Suicidal warmly welcomed the new style.\n\nThe band stuck to a similar formula for Freedumb, released in 1999 (see 1999 in music). Despite generally bad reviews from critics (who claimed that the band had \"dumbed themselves down\" not only lyrically, but musically as well) it was considered by fans of the band as their \"comeback album\", with the title track, \"Cyco Vision\" and \"We Are A Family\" becoming fan favorites (although no singles from the album were released).\n\nThe following year Suicidal Tendencies released Free Your Soul and Save My Mind. Unlike its predecessor, which was more straightforward hardcore, this album saw the band covering most of the styles they had dabbled with in the past. Some songs were punk, but many of them were also thrash-oriented, and this was by far Suicidal's funkiest album yet. Fans and even critics greeted the album warmly, and a new single, \"Pop Song\", was released.\n\nInfectious Grooves released their fourth and comeback album Mas Borracho in 2000, followed by Muir's second solo album as Cyco Miko, Schizophrenic Born Again Problem Child, in 2001.\n\nSuicidal Tendencies featured a new song on the Friends & Family, Vol. 2 compilation in 2001, but after then the band fell silent again.\n\n\nThird Hiatus & Recent History (2002–present)\n\nPaul and Wackerman (who had just joined Bad Religion) had left Suicidal Tendencies by 2002, while the band was on a temporary hiatus, and were replaced by brothers Steve and Ron Bruner on bass and drums, respectively. The band toured during 2003, but were forced take another hiatus in 2004 due to Mike Muir requiring surgery for a back injury.\n\nWhile the band failed to release an album with material, independently or otherwise, Suicidal Tendencies have continued to tour consistently since 2005. On October 29 of that year their live performance at the Grand Olympic Auditorium in Los Angeles was filmed. Suicidal Tendencies secured a spot in the metal/punk-rock Soundwave Festival in Australia in February and March 2007, taking in Brisbane, Sydney and Perth. They performed at the Artefact Festival in France on April 29, 2007, and performed in Istanbul, Turkey on May 29. They also headlined the Tuborg Stage at the Download Festival, held at Donington Park, UK on Friday June 8, 2007, and closed select shows for the Sounds of the Underground tour in San Jose, California on August 3, Irvine, California on August 4, and Mesa, Arizona on August 5. On August 1, 2008, Suicidal Tendencies headlined the Porão do Rock Festival in Brasília in front of 15,000 people. By this stage Eric Moore had replaced Dave Hidalgo on drums. During the fall of 2008, the band toured with Whole Wheat Bread, Madball, Terror, and Death by Stereo, opening select dates. During this tour Year of the Cycos – a compilation album featuring Suicidal Tendencies, Infectious Grooves, Cyco Miko and No Mercy – was available for the first time for purchase exclusively at the concerts or from their official website. From the album, the original track \"Come Alive\" was released as a video clip, and is still their latest video clip to date. The band replaced As I Lay Dying on the first five shows of the No Fear Energy Music Tour with Lamb of God. Suicidal Tendencies toured Europe from June through July 2009.\n\nThe first-ever Suicidal Tendencies DVD Live at the Olympic Auditorium, featuring the full show recorded in Los Angeles back in 2005, was finally released on January 26, 2010 by Fontana Distribution via the band's own imprint, Suicidal Records. On the same day, a best of compilation was released as part of the Playlist music album series issued by Sony BMG.\n\nIn September 2010, Suicidal Tendencies released the album No Mercy Fool!/The Suicidal Family which consists of re-recordings of tracks from the Join the Army album and of old No Mercy songs, plus the previously released \"Come Alive\". In support of the album the band toured the US in October and November, including performing at Tucson, Arizona KFMA radio station's Fall Ball 2010 on October 24 at Pima County Fairgrounds.\n\nSuicidal Tendencies released 13, their first album with all-new material in 13 years, on March 26, 2013.\n\nOn March 11, 2014, Thomas Pridgen (former drummer of The Mars Volta) confirmed on his Instagram and Facebook page that he has joined Suicidal Tendencies.\n\nOn August 27, 2014, Suicidal Tendencies announced that bassist Tim Williams had passed away. <a href=\"https://www.last.fm/music/Suicidal+Tendencies\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
