{"artist":{"name":"Suicide","mbid":"a641ecb0-9cd3-47b4-b7f1-e82c50b45484","url":"https://www.last.fm/music/Suicide","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/930720f98c10414d98c490dfcf6feb8c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/930720f98c10414d98c490dfcf6feb8c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/930720f98c10414d98c490dfcf6feb8c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/930720f98c10414d98c490dfcf6feb8c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/930720f98c10414d98c490dfcf6feb8c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/930720f98c10414d98c490dfcf6feb8c.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"268269","playcount":"3648208"},"similar":{"artist":[{"name":"Alan Vega","url":"https://www.last.fm/music/Alan+Vega","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/395cc1b8e7194e84a2d5be49b103bc14.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/395cc1b8e7194e84a2d5be49b103bc14.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/395cc1b8e7194e84a2d5be49b103bc14.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/395cc1b8e7194e84a2d5be49b103bc14.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/395cc1b8e7194e84a2d5be49b103bc14.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/395cc1b8e7194e84a2d5be49b103bc14.png","size":""}]},{"name":"Pere Ubu","url":"https://www.last.fm/music/Pere+Ubu","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0a22db3e3dfa4d038be772d87b00f553.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0a22db3e3dfa4d038be772d87b00f553.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0a22db3e3dfa4d038be772d87b00f553.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0a22db3e3dfa4d038be772d87b00f553.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0a22db3e3dfa4d038be772d87b00f553.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0a22db3e3dfa4d038be772d87b00f553.png","size":""}]},{"name":"This Heat","url":"https://www.last.fm/music/This+Heat","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/42f036979523404e918f5574d493cfa3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/42f036979523404e918f5574d493cfa3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/42f036979523404e918f5574d493cfa3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/42f036979523404e918f5574d493cfa3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/42f036979523404e918f5574d493cfa3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/42f036979523404e918f5574d493cfa3.png","size":""}]},{"name":"The Pop Group","url":"https://www.last.fm/music/The+Pop+Group","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ec2966f2604c402587a243d8f5cbe77d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ec2966f2604c402587a243d8f5cbe77d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ec2966f2604c402587a243d8f5cbe77d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec2966f2604c402587a243d8f5cbe77d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec2966f2604c402587a243d8f5cbe77d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec2966f2604c402587a243d8f5cbe77d.png","size":""}]},{"name":"Chrome","url":"https://www.last.fm/music/Chrome","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/37823cf2d78c437ec3c49c8bd8ada4fa.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/37823cf2d78c437ec3c49c8bd8ada4fa.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/37823cf2d78c437ec3c49c8bd8ada4fa.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37823cf2d78c437ec3c49c8bd8ada4fa.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37823cf2d78c437ec3c49c8bd8ada4fa.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37823cf2d78c437ec3c49c8bd8ada4fa.png","size":""}]}]},"tags":{"tag":[{"name":"post-punk","url":"https://www.last.fm/tag/post-punk"},{"name":"experimental","url":"https://www.last.fm/tag/experimental"},{"name":"electronic","url":"https://www.last.fm/tag/electronic"},{"name":"punk","url":"https://www.last.fm/tag/punk"},{"name":"noise","url":"https://www.last.fm/tag/noise"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Suicide/+wiki"}},"published":"12 Feb 2006, 04:47","summary":"There are multiple artists bands with this name: \n\n1) An American synth punk duo of the '70s.\n2) A death metal band from Turkey, who pioneered the Turkish death metal scene.\n3) A darkstep DJ from Russia. 4)\nA grunge / hardcore band from Milevsko, Czech Republic. 5) A Croatian rapper.\n\n1) Suicide is an American electronic proto-punk musical duo, intermittently active since 1970 and composed of vocalist Alan Vega and Martin Rev on synthesizers and drum machines. They are an early synthesizer/vocal musical duo. <a href=\"https://www.last.fm/music/Suicide\">Read more on Last.fm</a>","content":"There are multiple artists bands with this name: \n\n1) An American synth punk duo of the '70s.\n2) A death metal band from Turkey, who pioneered the Turkish death metal scene.\n3) A darkstep DJ from Russia. 4)\nA grunge / hardcore band from Milevsko, Czech Republic. 5) A Croatian rapper.\n\n1) Suicide is an American electronic proto-punk musical duo, intermittently active since 1970 and composed of vocalist Alan Vega and Martin Rev on synthesizers and drum machines. They are an early synthesizer/vocal musical duo.\nNever widely popular amongst the general public, Suicide are highly influential: critic Wilson Neate argues that Suicide \"would prove as influential as The Clash. Listening to their self-titled 1977 debut from the vantage point of late 2002, it's all so obvious: The synthpop, techno, and industrial dance sounds of the '80s and '90s, and now the new New Wave of electroclash, all gesture back to that foundational album.\nIn a November 1970 flyer the band was the first ever to use the phrase \"punk music\" to advertise a concert.\nSuicide took their name from the title of a Ghost Rider comic book titled Satan Suicide, a favorite of Alan Vega. Rev's simple keyboard riffs, (initially played on a battered Farfisa organ combined with effects units, before changing to a synthesizer), were accompanied by primitive drum machines, providing a pulsing, minimalistic, electronic backdrop for Vega's murmuring and nervy vocals. They were the first band to use the term punk to describe themselves, which they had adopted from an article by Lester Bangs. Some of their earliest posters use the terms \"punk music\" and \"punk music mass\".\nSuicide emerged alongside the early glam punk scene in New York, with a reputation for their confrontational live shows. Many of their early shows were at the Mercer Arts Center, alongside bands like the New York Dolls and Eric Emerson and the Magic Tramps. David Johansen once played harmonica with Suicide in an early show there. Vega and Rev both dressed like arty street thugs, and Vega was notorious for brandishing a length of motorcycle drive chain onstage. Vega once stated \"We started getting booed as soon as we came onstage. Just from the way we looked they started giving us hell already. This sort of audience confrontation was inspired by Vega's witnessing of an Iggy and the Stooges concert at the New York State Pavilion in August 1969, which he later described as \"great art\". After the collapse of the Mercer Arts Center in 1973, Suicide played at Max's Kansas City and CBGB, often sharing the bill with emerging punk bands. Their first album was reissued with bonus material, including \"23 Minutes Over Brussels\", a recording of a Suicide concert that deteriorated into a riot.\nTheir first album, Suicide (1977), is regarded a classic. One critic writes: \"'Che\", \"Ghost Rider\"—these eerie, sturdy, proto-punk anthems rank among the most visionary, melodic experiments the rock realm has yet produced.\" Of note is the ten-minute \"Frankie Teardrop\", which tells the story of a poverty-stricken young factory worker, pushed to the edge. Critic Emerson Dameron writes that the song is \"one of the most terrifying, riveting, absurd things I’ve ever heard. Nick Hornby in his book 31 Songs described \"Frankie Teardrop\" as something you would listen to \"Only once\".\nSuicide's albums of the late 1970s and early 1980s are regarded as some of the most influential recordings of their time and helped shape the direction of indie rock, industrial music and dance music. Among others, Steve Albini (Shellac, Rapeman, Big Black), Panthére, Gang Gang Dance, The Jesus and Mary Chain, The Sisters of Mercy, She Wants Revenge, Henry Rollins, Joy Division/New Order, Soft Cell, Nick Cave, Cassandra Complex, Sigue Sigue Sputnik, Radiohead, Kap Bambino, Spacemen 3, Spiritualized, Angel Corpus Christi (covers of Dream Baby Dream and Cheree with Alan Vega guest vocals), Michael Gira, MGMT, Sonic Boom, Loop, The Fleshtones (both of whom have recorded cover versions of \"Rocket USA\"), Ric Ocasek of The Cars, Mi Ami, R.E.M. and The Kills have all listed Suicide as an influence. Bruce Springsteen was also influenced by the band, as evident by the song \"State Trooper\" from his album Nebraska. Furthermore, Springsteen also used a solo keyboard version of \"Dream Baby Dream\" to close the concerts on his 2005 Devils & Dust Tour.\nIn 1986, Alan Vega collaborated with Andrew Eldritch of The Sisters of Mercy on the 'Gift' album, released under the name of 'The Sisterhood'. Vega and Rev have both released solo albums, and Suicide released their first album in over a decade with 2002's American Supreme. Sales, however, were slow and critical reception was mixed.\nIn 2005, SAF Publishing put out Suicide No Compromise, a \"docu-biography\" by David Nobahkt, which featured extensive interviews with Vega and Rev as well as many of their contemporaries and famous fans.\nIn 2008, Blast First Petite released a monthly, limited edition series of 10\" Vinyl EP's and downloads by major artists, honoring Alan Vega's 70th birthday. Among those paying tribute were Bruce Springsteen, Primal Scream, Peaches, Grinderman, Spiritualized, The Horrors, Sunn 0))+Pansonic, Julian Cope, Lydia Lunch, Vincent Gallo, LIARS, & The Klaxons. The label also released \"Suicide: 1977-1978\", a 6 CD box-set, the same year.\nIn September 2009, the group performed their debut LP live in its entirety as part of the All Tomorrow's Parties-curated Don't Look Back series.\nIn mid-2009, the band The Horrors released a cover of the song \"Shadazz\" as part of a tribute to Alan Vega and his work. They've performed it many times live, along with another Suicide song, \"Ghost Rider\". Later that year, Primal Scream and Miss Kittin covered the song \"Diamonds, Fur Coat, Champagne\" for a limited-edition 10-inch vinyl pressing. A total of 3,000 copies were pressed and released on March 30, 2009.\n\"Ghost Rider\" was recently featured in a sixth season episode of HBO's Entourage. \"Ghost Rider\" is featured in movies Finisterrae and Attenberg. The riff from \"Ghost Rider\" was sampled extensively in M.I.A.'s single, \"Born Free\", released in April 2010.\n\"Ghostrider\" was covered by the garage punk band The Gories and released on the Cheapo Crypt Sampler No. 2.\nIn May 2010 the band performed the entire first album live at two London concerts, double billed with Iggy & The Stooges performing Raw Power.\nIn April 2012, Neneh Cherry released a cover of the song \"Dream Baby Dream\" which will appear on her album, The Cherry Thing.\n\n2) Suicide is a band from Ankara, Turkey, considered to be the pioneers of the Turkish death metal scene. Suicide was founded by guitarist Erkan Tatoglu and his friends in 1989. Their first concert was at Talip Cinema in Ankara in 1991, where the band played to an audience of approximately 1300 people. After many changes in the line up, Erkan moved to vocals and Hakan Kuscu joined the band as the lead guitarist in 1994. Esad Erbil joined in 1995 as the bass guitar player. The band's current line up was completed after Caglar Yurut joined them in 2003. In Turkey, the band took stage in more than 50 concerts mostly in Ankara, Eskisehir, Istanbul, Bursa, Izmir, Kayseri and Mersin. The band, also known as the \"Death Metal Titans\" in Turkey have released an EP called \"Spiritual Mess\" (2000), a split CD containing the \"Spiritual Mess\" EP and an album called \"One of Your Neighbours\" (2004). The debut album \"One of Your Neighbours\" contains 15 years of experience in 14 songs, that devastate the trends in today's death metal while combining the pieces from old school death metal to technical and brutal death.\n\n3) Suicide is a darkstep / DnB DJ from the Russian Federation. Official Myspace: http://www.myspace.com/suicidespb <a href=\"https://www.last.fm/music/Suicide\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
