{"artist":{"name":"Sweet","mbid":"dc73bb40-b697-4df9-a2ec-0555bebdba75","url":"https://www.last.fm/music/Sweet","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d192133e91ad40aeb7c2ad4160980a2f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d192133e91ad40aeb7c2ad4160980a2f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d192133e91ad40aeb7c2ad4160980a2f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d192133e91ad40aeb7c2ad4160980a2f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d192133e91ad40aeb7c2ad4160980a2f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d192133e91ad40aeb7c2ad4160980a2f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"505407","playcount":"4544527"},"similar":{"artist":[{"name":"Slade","url":"https://www.last.fm/music/Slade","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2975d4c658b343499cb9c98bf15e8105.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2975d4c658b343499cb9c98bf15e8105.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2975d4c658b343499cb9c98bf15e8105.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2975d4c658b343499cb9c98bf15e8105.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2975d4c658b343499cb9c98bf15e8105.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2975d4c658b343499cb9c98bf15e8105.png","size":""}]},{"name":"Suzi Quatro","url":"https://www.last.fm/music/Suzi+Quatro","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/358107e0661c42fea3b3687a639370a2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/358107e0661c42fea3b3687a639370a2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/358107e0661c42fea3b3687a639370a2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/358107e0661c42fea3b3687a639370a2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/358107e0661c42fea3b3687a639370a2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/358107e0661c42fea3b3687a639370a2.png","size":""}]},{"name":"MUD","url":"https://www.last.fm/music/MUD","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/80599010bea145dfc50b01b4d7e216a1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/80599010bea145dfc50b01b4d7e216a1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/80599010bea145dfc50b01b4d7e216a1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/80599010bea145dfc50b01b4d7e216a1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/80599010bea145dfc50b01b4d7e216a1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/80599010bea145dfc50b01b4d7e216a1.png","size":""}]},{"name":"Status Quo","url":"https://www.last.fm/music/Status+Quo","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dfafe0fc0bcf4f58b96ec7eebf1323ce.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dfafe0fc0bcf4f58b96ec7eebf1323ce.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dfafe0fc0bcf4f58b96ec7eebf1323ce.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dfafe0fc0bcf4f58b96ec7eebf1323ce.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dfafe0fc0bcf4f58b96ec7eebf1323ce.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dfafe0fc0bcf4f58b96ec7eebf1323ce.png","size":""}]},{"name":"Gary Glitter","url":"https://www.last.fm/music/Gary+Glitter","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1980fc9b43074e548717235c89035fb2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1980fc9b43074e548717235c89035fb2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1980fc9b43074e548717235c89035fb2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1980fc9b43074e548717235c89035fb2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1980fc9b43074e548717235c89035fb2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1980fc9b43074e548717235c89035fb2.png","size":""}]}]},"tags":{"tag":[{"name":"glam rock","url":"https://www.last.fm/tag/glam+rock"},{"name":"classic rock","url":"https://www.last.fm/tag/classic+rock"},{"name":"70s","url":"https://www.last.fm/tag/70s"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"hard rock","url":"https://www.last.fm/tag/hard+rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Sweet/+wiki"}},"published":"13 Mar 2006, 17:58","summary":"Sweet (referred to as The Sweet on albums before 1974 and singles before 1975) were a popular 70s-era British rock band. Although  largely known for their glam rock image, having outlandish costumes on and off the stage, and several hit singles— many of them being so-called teenage anthems— Sweet also released several acclaimed albums in their initial ten year career. The extent of the band's domination of the European charts resulted in eight number one singles in Germany <a href=\"https://www.last.fm/music/Sweet\">Read more on Last.fm</a>","content":"Sweet (referred to as The Sweet on albums before 1974 and singles before 1975) were a popular 70s-era British rock band. Although  largely known for their glam rock image, having outlandish costumes on and off the stage, and several hit singles— many of them being so-called teenage anthems— Sweet also released several acclaimed albums in their initial ten year career. The extent of the band's domination of the European charts resulted in eight number one singles in Germany, Sweet playing upbeat pop songs such as \"Co Co\", \"Little Willy\", and \"Wig Wam Bam\".\n\nSweet's success continued with more glam rock and power pop oriented tunes, such as \"Blockbuster\", \"Hellraiser\", \"Ballroom Blitz\", \"Teenage Rampage\", and \"Fox On The Run\", which showed that the band had an arena-friendly side reminiscent of contemporaries such as The Who. Sweet had a world-wide following, clocking up no less than 18 top 20 hit singles, and the guys were most notably popular in Australia, Germany, and most especially their native U.K. The classic Sweet line-up consisted of vocalist Brian Connolly, drummer Mick Tucker, bassist Steve Priest, and guitarist Andy Scott.\n\nThe group's members are perhaps best remembered for their very 'glam' outfits, featuring a lot of glitter, platform boots, chain mail shirts, and plenty of makeup. The group practically defining the camp extreme of the glam rock look, Andy Scott would later say it only happened because they needed an excuse to meet 'Top of the Pops' dancers Pan's People and reasoned that going to the make-up room a lot was a good method of doing so. Their origins go back to the 60s rock and soul boom in the U.K., with musicians  Connolly and Tucker going through various outfits before forming \"The Sweetshop\" together in January 1968.\n\nSweet signed a new record contract with EMI's Parlophone label around two years later, mutating as a group along the way and only finally picking up the iconic Connolly-Priest-Scott-Tucker line-up in 1971. 'Funny How Sweet Co-Co Can Be', Sweet's debut album, came out in November 1971 on RCA Records. Months before its release, singles such as the aforementioned \"Co Co\" made it big on the charts. The group pursued a musical path combining both bubblegum pop in the vein of The Archies with contemporary rock n roll groups. The next several years brought them commercial success and a growing fan-base, particularly among rebellious teenagers, with the band under the influence of famous songwriters Nicky Chinn and Mike Chapman.\n\nDespite becoming commercial superstars and having acclaimed live performances, the band's members grew apart from each other as well as from their record industry people (such as the often domineering Chinn-Chapman duo), with their hard-partying lifestyles taking a big toll. Singles such as the aforementioned \"Blockbuster\" and \"Ballroom Blitz\" showed their desires to take a more hard rock direction, and the guys also pushed for more songwriting control. At the same time, the parallel rise of other glam-inspired artists such as Gary Glitter and Slade on the charts took place.\n\nBy December 1974, the Chinn-Chapton connection had been totally severed and they were writing their songs pretty much by themselves. Their momentum went on, the band embarking on its first ever three-month U.S. tour in late 1975, yet troubles remained on the horizon. In late 1978, Sweet stayed at 'The Town House' studio, Shepherds Bush, London, to write new material for their next album. Just before Brian Connolly announced his departure, his vocals were erased from the recorded material for the ensuing album, titled 'Cut Above The Rest'. Two album tracks titled \"That Girl\" and \"Stay With Me\" featuring Connolly on lead vocals remain from the late 1978 Cut Above The Rest recording sessions.\n\nOn February 23, 1979, Brian Connolly left the band under acrimonious circumstances, and neither he, nor the band, fully recovered. Connolly was particularly suffering from the effects of heavy alcohol drinking. Although all the Sweet members lived the extreme rock lifestyle during the 70s - with alcohol, drugs, and women, among other things - the others weren't as severely affected as Brian. After Connolly's departure, Sweet continued as a trio, with Scott and Priest now both handling lead vocals. Keyboard player Gary Moberley completed the four-piece line-up. Two more studio albums, Water's Edge, and Identity Crisis were recorded in 1979 and 1980 before the group finally disbanded in 1981. Sweet performed their last live show at Glasgow University on March 20, 1981. In 1982, Identity Crisis was only released in Germany.\n\nIn 1985, Andy Scott and Mick Tucker re-formed Sweet with various new vocalists and bass players, the most notable being a 1986 reunion featuring Paul Mario Day (the first singer of Iron Maiden), keyboardist Phil Lanzon, and bass player Malcolm McNulty (who is now lead singer for fellow glam rock band Slade). Steve Priest was asked to join Tucker and Scott for the 1985 Australian tour, but declined at the last moment. Vocalist and bass player Jeff Brown joined in 1988. In 1991, Mick Tucker departed due to ill health, leaving Andy Scott as the only original member. He was replaced by German Bodo Schopf. After Tucker's departure, Andy Scott changed the band's name to 'Andy Scott's Sweet'. Brian Francis [McManus] Connolly died from liver failure and repeated heart attacks, attributed to his chronic alcoholism, on 9 February 1997, aged 51, having been content in his final years to appear in retrospective documentaries demonstrating the damage he had inflicted upon himself. He was cremated after a ceremony at Most Holy Name Roman Catholic Church at Old Mill Lane, Denham, Buckinghamshire and his ashes were scattered over the water by his adult daughters Nicola and Michelle. He also left an ex-wife, Marilyn, and a two-year-old son called Brian Junior (BJ) by his girlfriend Jean.\n\nMichael Thomas (Mick) Tucker died 14 February 2002 in Welwyn Garden City, Hertfordshire from leukemia, aged 54; his funeral took place 25 February 2002. He is buried in an un-named grave in Chorleywood House cemetery. It is marked by a sleeping angel. A wooden bench with a brass plaque funded by fans as a dedication to Mick is also positioned in the grave's vicinity.[2] He left behind a widow, Jan, and a daughter Ayston from his first marriage to Pauline (†1979). According to Steve Priest: \"He was the most underrated drummer that ever came out of England. He was the powerhouse of the band. He was technically marvellous. His timing was impeccable, but he had a lot of soul as well and he really felt what he was playing.\"\n\nAt least one of Sweet's two remaining members is still active in the music industry. Andy Scott currently continues to tour as 'Andy Scott's Sweet'. February 2006 saw the release of a new Suzi Quatro album, Back To The Drive, which was produced by Scott. March 2006 saw the U.S. release of a new AS Sweet album, Sweetlife (from 2002).[3] [4] In October 2006, Scott staged a performance of AS Sweet to help save his home town football team, which was experiencing serious financial difficulty.[5]\n\nPriest resides with his family in Los Angeles, California. He has published his autobiography, Are You Ready Steve?, which was a raw expose of his time with Sweet and in 2006 released Priest's Precious Poems, a CD of tracks largely comprised of his more recent material. <a href=\"https://www.last.fm/music/Sweet\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
