{"artist":{"name":"Swim","mbid":"b82c55d4-c2ce-4a74-a9e4-b916b5f916cf","url":"https://www.last.fm/music/Swim","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1b70adaba5efb06146c3361707f898de.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1b70adaba5efb06146c3361707f898de.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1b70adaba5efb06146c3361707f898de.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1b70adaba5efb06146c3361707f898de.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1b70adaba5efb06146c3361707f898de.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1b70adaba5efb06146c3361707f898de.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"12486","playcount":"55494"},"similar":{"artist":[{"name":"Deftones","url":"https://www.last.fm/music/Deftones","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0ec2c7af18f15fc604345e65be025585.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0ec2c7af18f15fc604345e65be025585.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0ec2c7af18f15fc604345e65be025585.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0ec2c7af18f15fc604345e65be025585.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0ec2c7af18f15fc604345e65be025585.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0ec2c7af18f15fc604345e65be025585.png","size":""}]},{"name":"Jane Air","url":"https://www.last.fm/music/Jane+Air","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bb94dc296914478daa7fd3f9a6a790dc.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bb94dc296914478daa7fd3f9a6a790dc.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bb94dc296914478daa7fd3f9a6a790dc.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb94dc296914478daa7fd3f9a6a790dc.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb94dc296914478daa7fd3f9a6a790dc.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb94dc296914478daa7fd3f9a6a790dc.png","size":""}]},{"name":"Thanks","url":"https://www.last.fm/music/Thanks","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5a8fd3fe7fc2c960bd3d9b827b1f70d5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5a8fd3fe7fc2c960bd3d9b827b1f70d5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5a8fd3fe7fc2c960bd3d9b827b1f70d5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a8fd3fe7fc2c960bd3d9b827b1f70d5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a8fd3fe7fc2c960bd3d9b827b1f70d5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a8fd3fe7fc2c960bd3d9b827b1f70d5.png","size":""}]},{"name":"Norbert Kristóf","url":"https://www.last.fm/music/Norbert+Krist%C3%B3f","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5fbd2a2aaa394c409faf1324794df5ca.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5fbd2a2aaa394c409faf1324794df5ca.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5fbd2a2aaa394c409faf1324794df5ca.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5fbd2a2aaa394c409faf1324794df5ca.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5fbd2a2aaa394c409faf1324794df5ca.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5fbd2a2aaa394c409faf1324794df5ca.png","size":""}]},{"name":"Merci Beaucoup","url":"https://www.last.fm/music/Merci+Beaucoup","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]}]},"tags":{"tag":[{"name":"Nu Metal","url":"https://www.last.fm/tag/Nu+Metal"},{"name":"Nu-metal","url":"https://www.last.fm/tag/Nu-metal"},{"name":"groove metal","url":"https://www.last.fm/tag/groove+metal"},{"name":"rapcore","url":"https://www.last.fm/tag/rapcore"},{"name":"alternative rock","url":"https://www.last.fm/tag/alternative+rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Swim/+wiki"}},"published":"26 Aug 2006, 01:10","summary":"Swim is a name of at least six bands:\n\n[1] The story of swedish duo Swim began online. A producer’s desire to meet a compatible voice and songwriter landed in an exchange of ideas and music between Erika Rosén and Carl Nordström (Affictionados). After years of touring, record producing and songwriting with various other projects the two musicians channeled their experiences into incipient ideas and visions that were exchanged via cyberspace. A year passed without a meeting between the two <a href=\"https://www.last.fm/music/Swim\">Read more on Last.fm</a>","content":"Swim is a name of at least six bands:\n\n[1] The story of swedish duo Swim began online. A producer’s desire to meet a compatible voice and songwriter landed in an exchange of ideas and music between Erika Rosén and Carl Nordström (Affictionados). After years of touring, record producing and songwriting with various other projects the two musicians channeled their experiences into incipient ideas and visions that were exchanged via cyberspace. A year passed without a meeting between the two, but all along music was being created and Swim was coming alive. Erika and Carl have conspired to create music for your late evenings, precious moments of solitude, drives along the seaside and the last throbbing hour on the dance floor. One can sense chillwave in the pumping bass line, soft guitar and intimate, soothing vocals. The lyrics divulge compelling and direct encounters with people, travel, sex, lies and pulsating love. Swim’s dreamy and accessible sound is reinvented and given new dimensions through their dark, even intimidating, aesthetics. Light and dark are wielded not as opposites, but as two sides of the same thing. With self-crafted masks, black attire and a dark visual expression, Erika and Carl have created a project that desires to be discovered and rediscovered again and again. Swim - Next To Me | November 20th Next To Me is Swim’s first debut single - a warm and alluring soundscape dashed with Swedish melancholy. The contrasts of intimacy and distance are depicted through a strumming bass enriched by playful, melodic synths and Erika’s heavy-hearted vocals. Through its beautiful and complex composition ‘Next To Me’ evokes a sense of happiness spotted by dark dots. Swim - Next To Me (Boeoes Kaelstigen Remix) | November 27th Swedish Grammy nominees and FM veterans Boeoes Kaelstigen take ‘Next To Me’ on a journey through the duo’s characteristic soundscape of minimal trance & melodic techno. By bringing the original track up to DJ-friendly 109 BPM and adding layers of deep dark bass, club friendly percussions and hypnotic synthesizers they create a apocalyptic revelation. Early James Holden sound anyone? --- ‘Next To Me’ and the Boeoes Kaelstigen Remix are released on swedish imprint With Love Recordings [WLR], a sub-label to the electronic wonderlabel HMWL. The vision of WLR is to focus on forward thinking electronica without limitations of genre or style. WLR is also home of CANVAS and Neeco Delaf. Swim EP is to follow in December 2015.\n\n[2]  In the last twelve months they evolved from a studio project into a passionate, four-piece collective. They self-released and self-produced three singles (and the accompanying videos) and, with line-up cemented, began a series of gigs culminating in a headline show at Camden Barfly at the end of the year. \n\nAs well as catching the attention of Nike, Sky, Topshop, H&M and more, they've had features in the likes of Time Out, Les Inrocks and Artrocker (\"New Blood 2014\") all without a major label. With the prospect of a stack of new releases and headline gigs already booked; 2014 promises to be even busier.\n\nReleases include, singles:  \"Ride\" (Nov 2012, Bad Life) and \"Creeper\" (May 2013, Bad Life).\n\n2013 releases are planned to include of their début EP, \"Distractions\", lead by summer single \"Let It Go\".\n\nSites:  Discogs.\n\n[3]  A New York City, NY, USA, band (aka Joshua Kobak and Swim), led by Joshua Kobak, with releases including:  \"Sample the Nerve\" (1999, Shade), \"Bodhisattva\" (2000, Orchard), \"Above and Beneath\" (2001, Liilaa) and \"Learn How to Swim\" (2009).\n\nNamed with 'engagement in live' in mind, the music of Swim might be characterized as a hybrid of Jeff Buckley and Bono singing, songs written/arranged by Peter Gabriel and Sting, and produced by Pink Floyd.  Swim has been in existence since 1995 and has evolved into the six-member band who created the album above and beneath. They are a group of elevationists called \"an excellent ensemble\" by Relic magazine after their 1998 performance in Amsterdam, Holland.\n\nAfter much growth and evolution over the past six years, swim melded into the perfect union of artists to complete above and beneath in 2001. Joshua Kobak leads the way as the singer/songwriter frontman using his passionate vocals and visionary lyrics as a canvas for his bandmates. Adding bold colors to the music, Katy Pfaffl (Katy Pfaffl Band) joins swim as a violinist, pianist and guitarist sharing her spirit through intense improvisation and angelic vocals. As the backbone of swim, Sean Dixon's (The Chesterfields) creative approach to the drums brings a symphonic texture to every song where bassist Danton Boller (Jazz Mandolin Project) exists deep in the pocket in effortless harmony. Together they create vast landscapes and original grooves. Taking the music to a new level, Dan Johnson on tabla and Sebastian Guerrero on numerous South American percussion instruments add a world of influential beats and colors to Joshua's melodic songwriting. \n\nJoshua Kobak is a New Yorker by way of Cincinnati, Milwaukee, and his hometown of Medina Ohio. Armed with his guitar and pen, he has traveled cross-continentally on motorcycles, swung sledgehammers in factories, ridden subway cars in the earliest hours of the morning, and has been on the brightest stages in front of thousands and in the smallest clubs for less than a dozen. Along the way, he picked up the rhythms of those trains, the clang of the hammers, the wind on the roads and a following of people across the country who have heard him do what he does best. \n\nRecently, he toured with the Broadway show RENT for a year and a half as Roger/swing. \"Kobak exhibits a stunning vocal range as the down and out guitarist\" (Arkansas Democrat Gazette). He performed in Canada and Japan as well as the United States. Following his truest passion, Joshua would arrive in a new city each week and find himself a solo gig for the weekend. He did this in nearly 40 cities and as the RENT tour came to a close in July of 2001, Joshua booked a six week 33 performance tour on his own starting at The Railway Club, in Vancouver, BC and ending at CBGB'S 313 NYC. The tour was a success and now the mailing list extends coast to coast. While in Chicago, at Uncommon Grounds Coffee House Joshua was asked to return in November 2001 to play the annual Jeff Buckley tribute concert. Where \"Josh sang from the depth of his soul, connecting every chord and word in soft, sensitive recurrences of Jeff's work. He was able to keep the same harmony and flow that Buckley did, while still spilling his own emotion through the music.\" (Kylee Nelson, jeffbuckley.com Nov. 2001) \n\nJoshua has done something rare and courageous with swim, he has stepped out into the center of the arena to open his unique sound to the world. swim is a band of creative artists who are committed to telling the story of Joshua's journey in words and music. They share knowledge gained from Joshua's experience in a way that is open, immediate and above all truthful. The vibrations of the sound are clear, above and beneath, now there is only one thing to do...swim.\n\n[4]  A pseudonym of Brooklyn, NY, USA, pop / hip-hop artist Alex Campedelli (b. 1981, in Savignano Sul Rubicone, FC, Italy), which released Lo e Rodo al Bar (Jul 2008, Do It Yourself Italia / Made In Etaly).\n\nSites:  YouTube and Facebook.\n\n[5]  A defunct Cincinnati, OH, USA, alternative rock band (previously Vice, later July for Kings), founded by Joe Hedges (vocals, guitar), Sam Dobrozsi (drums), Travis Delaney (guitar), Jason Morgan (bass) and T Miller (cello, guitar).  The band was forged 1997, in Middletown, OH (a steel town between Dayton and Cincinnati) and was known for its melodic guitar-heavy sound and Hedges' introspective, sometimes quirky, lyrics.  Releases included \"Safe Unless\" (1999, self-released) and EP \"The Laughter and the Noise\" (2000, self-released).\n\n[6] Noise project dealing with drugs, addiction, and the struggle to get & remain clean. Started in 2009 by 騒動(soudou), SWIM is an acronym which stands for for 'Someone Who Isn't Me' and is widely used on drug forums to avoid admission of illegal acts. Free downloads: http://soudou.bandcamp.com <a href=\"https://www.last.fm/music/Swim\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
