{"artist":{"name":"Taking Back Sunday","mbid":"350bce49-c21b-4137-b50a-0766ded07e4d","url":"https://www.last.fm/music/Taking+Back+Sunday","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6b26ea9bafd24e0a8f29fd0acadb989c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6b26ea9bafd24e0a8f29fd0acadb989c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6b26ea9bafd24e0a8f29fd0acadb989c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6b26ea9bafd24e0a8f29fd0acadb989c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6b26ea9bafd24e0a8f29fd0acadb989c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6b26ea9bafd24e0a8f29fd0acadb989c.png","size":""}],"streamable":"0","ontour":"1","stats":{"listeners":"1219069","playcount":"49239425"},"similar":{"artist":[{"name":"Straylight Run","url":"https://www.last.fm/music/Straylight+Run","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c214ee25cc124f17b1055b535fda69c9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c214ee25cc124f17b1055b535fda69c9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c214ee25cc124f17b1055b535fda69c9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c214ee25cc124f17b1055b535fda69c9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c214ee25cc124f17b1055b535fda69c9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c214ee25cc124f17b1055b535fda69c9.png","size":""}]},{"name":"Senses Fail","url":"https://www.last.fm/music/Senses+Fail","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1ed6207ce38e4461bd9038c0485c596c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1ed6207ce38e4461bd9038c0485c596c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1ed6207ce38e4461bd9038c0485c596c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ed6207ce38e4461bd9038c0485c596c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ed6207ce38e4461bd9038c0485c596c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ed6207ce38e4461bd9038c0485c596c.png","size":""}]},{"name":"Brand New","url":"https://www.last.fm/music/Brand+New","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f2025cd60cef444386702df47589d6ba.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f2025cd60cef444386702df47589d6ba.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f2025cd60cef444386702df47589d6ba.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2025cd60cef444386702df47589d6ba.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2025cd60cef444386702df47589d6ba.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2025cd60cef444386702df47589d6ba.png","size":""}]},{"name":"The Starting Line","url":"https://www.last.fm/music/The+Starting+Line","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6a2bdd1ed0a848f280e053bb022eeef1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6a2bdd1ed0a848f280e053bb022eeef1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6a2bdd1ed0a848f280e053bb022eeef1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6a2bdd1ed0a848f280e053bb022eeef1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6a2bdd1ed0a848f280e053bb022eeef1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6a2bdd1ed0a848f280e053bb022eeef1.png","size":""}]},{"name":"Dashboard Confessional","url":"https://www.last.fm/music/Dashboard+Confessional","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d9d968c3369e49c4be0d80ca0264cf5d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d9d968c3369e49c4be0d80ca0264cf5d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d9d968c3369e49c4be0d80ca0264cf5d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d9d968c3369e49c4be0d80ca0264cf5d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d9d968c3369e49c4be0d80ca0264cf5d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d9d968c3369e49c4be0d80ca0264cf5d.png","size":""}]}]},"tags":{"tag":[{"name":"emo","url":"https://www.last.fm/tag/emo"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"},{"name":"punk","url":"https://www.last.fm/tag/punk"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Taking+Back+Sunday/+wiki"}},"published":"11 Feb 2006, 04:36","summary":"Taking Back Sunday are an alternative rock band originally formed in Long Island, New York in 1999. The band has gone through several lineup changes. Their first release came in 2001 with the Taking Back Sunday EP, and featured Antonio Longo on vocals, John Nolan on guitar and backing vocals, Eddie Reyes on guitar (the original founder of the band), Jesse Lacey, Adam Lazzara and Mark O'Connell replaced Stevie D) they released the follow-up album Tell All Your Friends, which was produced by Sal Villaneuva. <a href=\"https://www.last.fm/music/Taking+Back+Sunday\">Read more on Last.fm</a>","content":"Taking Back Sunday are an alternative rock band originally formed in Long Island, New York in 1999. The band has gone through several lineup changes. Their first release came in 2001 with the Taking Back Sunday EP, and featured Antonio Longo on vocals, John Nolan on guitar and backing vocals, Eddie Reyes on guitar (the original founder of the band), Jesse Lacey, Adam Lazzara and Mark O'Connell replaced Stevie D) they released the follow-up album Tell All Your Friends, which was produced by Sal Villaneuva. The album gave the band a first taste of success in the scene. After the release, they played with bands such as Brand New (formed by former bassist Jesse Lacey) and The Used, as well as performing as a short stint on the 2003 Vans Warped Tour. Another change in their lineup occurred when singer/guitarist John Nolan and bassist Shaun Cooper left the band and formed what is now Straylight Run. Because of these departures, the band's future was in doubt for some time. However, with the additions of guitarist/vocalist Fred Mascherino and bassist Matt Rubano, the band became stabilized.\n\nThe year 2004 proved to be a successful year for Taking Back Sunday, with the band opening for Blink-182 and being one of the main headliners for the Vans Warped Tour. In addition, their second album, titled Where You Want To Be, was released on July 27, 2004 on Victory Records. This album had a different sound than Tell All Your Friends. Propelled by the single A Decade Under the Influence, Where You Want to Be went on to debut at the #3 spot on the Billboard 200 albums chart, with sales of around 163,000 copies. Taking Back Sunday received even more mainstream exposure by appearing (on the day of Where You Want to Be's release) on the late night talk shows Jimmy Kimmel Live and Loveline, and by contributing the song This Photograph Is Proof (I Know You Know) to the soundtrack for Spider-Man 2. They also contributed the song Your Own Disaster to the Elektra soundtrack, and the original version of Error: Operator to both the Fantastic Four soundtrack and tie-in video game, where it served as Mr. Fantastic's theme. An instrumental version is also used as background music within the game.\n\nOn April 25, 2006, Taking Back Sunday released their third album, entitled Louder Now, on Warner Bros. Records. It nearly mirrors the first two albums in style and message, yet delivers with a more polished sound. Louder Now was leaked onto the Internet in its entirety on April 19, 2006. Taking Back Sunday received mainstream exposure by appearing on the late night talk shows The Tonight Show, Jimmy Kimmel Live, and Late Night With Conan O'Brien.\n\nIn April 2006, Taking Back Sunday took part in the 2-day Give It a Name indoor rock festival in England. The band played at Manchester Evening News Arena on Saturday, April 29 and London Earls Court on Sunday, April 30. During the first song of their set at the Earls Court show, Adam Lazzara kissed Matt Rubano on the lips. Later on during the festival he hit Matt while swinging his microphone and knocked him out cold. He was rushed backstage for medical treatment. Rubano later returned to the stage sporting a large head-bandage and a noticeable amount of blood on his face. Following his return to the stage, Rubano continued to play while sitting down. In a less noted incident, during the band's last song at the MEN show, the pedal to the bass drum broke, and the band had to stall whilst a replacement was found and installed.\n\nThe band released the follow-up single to MakeDamnSure, Twenty-Twenty Surgery, on August 21 2006 in the UK. The video depicts Lazzara as Johnny Cash.\n\nTaking Back Sunday embarked on their North American Tour on February 22, 2007 at Bryce Jordan Center in University Park, PA with supporting bands Underoath and Armor for Sleep. This tour was sort of a throw back where they featured older songs from previous albums, and they played the song Brooklyn (If You See Something, Say Something) for the first time live.\n\nIn April 2007, the band supported Lostprophets on their UK arena tour along with Aiden.\n\nOn May 6, 2007 the band was Linc's special guest for the Bamboozle Festival.\n\nIn October 2007, Fred Mascherino, the lead guitarist and backup vocalist left the band. He has recently started up his solo project, The Color Fred, and released an album at the end of October 2007, \"Bend To Break\" by Equal Vision Records.\n\nThe band has currently recruited guitarist and vocalist Matt Fazzi formerly of Facing New York and have just released their fourth album, New Again.\n\nIn August 2009, Taking Back Sunday performed at the Virgin Mobile FreeFest at the Merriweather Post Pavilion in Columbia, Maryland. This is their second year in a row playing at the festival with great reviews. The previous year the festival was held at Pimlico Race Course in Baltimore, MD. \n\nIn late 2009, Alternative Press Magazine named Taking Back Sunday's new album, \"New Again\", album of the year.\nwww.takingbacksunday.com\n\nIn early 2010 Matt Fazzi and Matt Rubano posted on the Taking Back Sunday official site that they were leaving the band and the site had an image reminiscent of an early promo shoot including original members John Nolan and Shaun Cooper.On March 30, 2010 Eddie Reyes did an interview with 103.9 WRCN and confirmed a line-up change; however, he did not confirm the new members. He also mentioned the band's intentions of recording soon.On March 31st, 2010, tbsnewagain tweeted a link to a video announcing the new lineup of the band. On April 12, the band made an official announcement confirming John Nolan and Shaun Cooper have re-joined the band. It was announced that they will soon begin the recording process of their fifth studio album with Louder Now producer Eric Valentine.[20]  On the same day, Adam Lazzara did an interview with Alternative Press, in which he discussed how the original line-up got back together and how both Matt Rubano and Matt Fazzi were not fired, but rather \"let go\". The band has recently finished writing in El Paso with around 15 songs completed, according to Mark O'Connell's Twitter.[citation needed] In a live chat on May 5, John Nolan and Adam Lazzara revealed that their new album will most likely be self-titled <a href=\"https://www.last.fm/music/Taking+Back+Sunday\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
