{"artist":{"name":"Taking Dawn","mbid":"5398d761-d75e-4fbf-ba73-013347eb1a17","url":"https://www.last.fm/music/Taking+Dawn","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/93c3eb4928eb414b9091088dd2953ef9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/93c3eb4928eb414b9091088dd2953ef9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/93c3eb4928eb414b9091088dd2953ef9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/93c3eb4928eb414b9091088dd2953ef9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/93c3eb4928eb414b9091088dd2953ef9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/93c3eb4928eb414b9091088dd2953ef9.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"23891","playcount":"379324"},"similar":{"artist":[{"name":"Black Tide","url":"https://www.last.fm/music/Black+Tide","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d5815587fef041068b44dceeee1fc9db.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d5815587fef041068b44dceeee1fc9db.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d5815587fef041068b44dceeee1fc9db.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d5815587fef041068b44dceeee1fc9db.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d5815587fef041068b44dceeee1fc9db.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d5815587fef041068b44dceeee1fc9db.png","size":""}]},{"name":"Hell or Highwater","url":"https://www.last.fm/music/Hell+or+Highwater","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6cb7b495289d4264a4af947faff97d79.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6cb7b495289d4264a4af947faff97d79.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6cb7b495289d4264a4af947faff97d79.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cb7b495289d4264a4af947faff97d79.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cb7b495289d4264a4af947faff97d79.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cb7b495289d4264a4af947faff97d79.png","size":""}]},{"name":"Sister Sin","url":"https://www.last.fm/music/Sister+Sin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1637ea3661c0454f95ad3286986dae41.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1637ea3661c0454f95ad3286986dae41.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1637ea3661c0454f95ad3286986dae41.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1637ea3661c0454f95ad3286986dae41.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1637ea3661c0454f95ad3286986dae41.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1637ea3661c0454f95ad3286986dae41.png","size":""}]},{"name":"Heaven's Basement","url":"https://www.last.fm/music/Heaven%27s+Basement","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7c6670a4505c4179a7be440faae1846b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7c6670a4505c4179a7be440faae1846b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7c6670a4505c4179a7be440faae1846b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c6670a4505c4179a7be440faae1846b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c6670a4505c4179a7be440faae1846b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7c6670a4505c4179a7be440faae1846b.png","size":""}]},{"name":"Jettblack","url":"https://www.last.fm/music/Jettblack","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/32ab7b5c71ce47099fd84c665ac53d58.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/32ab7b5c71ce47099fd84c665ac53d58.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/32ab7b5c71ce47099fd84c665ac53d58.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/32ab7b5c71ce47099fd84c665ac53d58.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/32ab7b5c71ce47099fd84c665ac53d58.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/32ab7b5c71ce47099fd84c665ac53d58.png","size":""}]}]},"tags":{"tag":[{"name":"heavy metal","url":"https://www.last.fm/tag/heavy+metal"},{"name":"hard rock","url":"https://www.last.fm/tag/hard+rock"},{"name":"metal","url":"https://www.last.fm/tag/metal"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"Power metal","url":"https://www.last.fm/tag/Power+metal"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Taking+Dawn/+wiki"}},"published":"05 Nov 2009, 17:33","summary":"The members of Taking Dawn grew up surrounded by the glitz and glam, the bright lights and big city of constant vice. This LasVegas upbringing helped shaped the band into what it is today: a rock 'n roll timebomb just waiting to explode on an unsuspecting public with its Roadrunner debut, Time to Burn.\n\n\"We've spent our whole lives in Las Vegas and we're the only people from Las Vegas who didn't turn into smack dealers,\" says vocalist/guitarist Chris Babbitt, showcasing his signature humor. <a href=\"https://www.last.fm/music/Taking+Dawn\">Read more on Last.fm</a>","content":"The members of Taking Dawn grew up surrounded by the glitz and glam, the bright lights and big city of constant vice. This LasVegas upbringing helped shaped the band into what it is today: a rock 'n roll timebomb just waiting to explode on an unsuspecting public with its Roadrunner debut, Time to Burn.\n\n\"We've spent our whole lives in Las Vegas and we're the only people from Las Vegas who didn't turn into smack dealers,\" says vocalist/guitarist Chris Babbitt, showcasing his signature humor. Babbitt and guitarist Mikey Cross were born at the same hospital and brought into this world by the same doctor. It's as though the stars were aligned and the duo were destined to be in a band. Babbitt recalls the band's coming together, saying, \"Alan and I met sophomore year in high school when I started playing guitar. I met Mike senior year, after I had been trying to put a band together for many years and it finally happened when we were 21.\" Babbitt fell into the frontman role, in what turns out to have been a happy accident. \"No one could sing so I was going to have to step it up. Everyone sucked and I happened to suck less,\" he says, tongue planted firmly in cheek. Babbitt admits the band started \"screwing around\" at a local haunt – Roberto's Taco Shop— and everything spiraled from there.\n\nBabbitt and Cross also worked security at the Hard Rock Hotel, which helped them remain surrounded by and immersed in rock 'n roll. This rough 'n tumble day job led the duo to appear as the star security guards on True TV's Rehab show. Babbitt laughs about his role on the reality show, saying, \"I save a lot of lives, kick a lot of ass!\"\n\nOne other way Taking Dawn kicks a lot of ass is in their band. \"All the glitz and being immersed by constant vice has steered us in the other direction,\" Babbitt admits. \"We don't drink a lot, smoke or do drugs. We're just about the music and the girls that come with it!\" While most of the members were just born when Guns N' Roses was tearing up the Sunset Strip in L.A., Taking Dawn got up to speed and on the quick, with their steadfast rock 'n roll dedication and education. Chris' dad was a rocker and a hippie, and his son was predisposed to a life of loving Black Sabbath and Deep Purple. \"He played Sabbath while he vacuumed around my crib. When I got picked up from kindergarten, he'd ask me what track was playing,\" he remembers. Babbitt also learned to love the rock early and that's something he's taken with him into his '20s and within his local scene. He says, \"Las Vegas is represented by The Killers and Panic At The Disco. There is no real rock 'face' here anymore. Slaughter was the last rock band, so I feel like we have a lot to carry on that end, as a rock band, to bring attention to the scene.\"\n\nWhile Taking Dawn are by no means a throwback to 80s glam metal, the band is certainly inspired by the era gone by and have chosen to take the foundation of that sound and scene and update it in a thoroughly modern way: by shredding, soloing and creating melody in their music. \"I don’t get people who don't like Bon Jovi and Skid Row and other classic bands,\" he says. \"We want to bring it to the kids, for them to understand it in a modern context. We don't want to imitate. We want to do our own thing. We want the balls and the attitude.\"\n\nTime To Burn has the desired cojones and a whole lotta attitude. The title track was the one that attracted the attention of Roadrunner, due to the fact that it's fast, oozes energy and makes a big statement. \"It goes, 'Homicidal, kill your idols / Your heroes are whores and your only God is you.' It's a big statement about what we want to say. We don't want to look like \"some\" part or image and we're saying you don't have to do drugs and be complete fuck up to still rock harder than the rest of them.\" Amen to that! The band is particularly proud of the song, saying, \"We can write an aggressive, catchy song that shreds.\" The song even has a part where the band sings, 'Halle-Fucking-lujah.' Of that moment, Babbitt offers further explanation, saying, \"It builds differently, instead of being the same formulaic, pseudo-anti-establishment and anti-organized religion song. It has religious innuendo. You know, it's the one word Ozzy never said! I needed one word he didn't already use. It's liberating and fun as fuck to sing. We almost didn't keep that part but it's the hook of the song.\"\n\n\"Take Me Away\" is a playful romp about a lady of the night, so to speak, and sonically, it lives at the other end of the spectrum of the band's style: it has a metallic edge dosed with the catchy pop the band cops to liking. \"We like songs that are classics and that have hooks. We want to connect with people,\" Babbitt says. \"Everyone agrees on the same top 50 songs that make up the musical canon. We want to slide into that 50. This song is rock 'n roll with the baddest guitars around and it's catchier than herpes.\" While it's a bold statement for the band to make, it's hard to argue with confidence and bravado when there is talent and skill to back it up.\n\nThe band also shows off its non-standard side by covering Fleetwood Mac's \"The Chain.\" They originally planned to do their own rendition of WASP's \"Fuck Like a Beast,\" but decided to switch gears. Babbitt says, \"We wanted to do something more ambitious, even though that song summed up the band and we want to give that song limelight. Then we started thinking of alternatives and we didn't want to be pigeonholed by the 80s scene even though we love bands from that era. Mike was rolling through songs and that is our favorite Fleetwood Mac song. We have the opportunity to do what Metallica did for 'Turn the Page' and make it our own while retaining the original audience.\"\n\nThe band demoed with Jason Suecof (Trivium, All That Remains) and eventually recorded with Elvis Baskette (Chevelle, Incubus). In the end, Babbitt wants to write songs that sound like Randy Rhoads meets Marty Friedman, merging the classic rock and modern metal sounds into their own unique blend. He admits, \"We're not trying to write other people's songs. We're trying to write songs that kick your fucking ass but have a vintage feel.\" He also eschews genre classification, saying, \"Our music is about attitude and being open to rocking out to a song. That goes far for us. The genre barrier bullshit is not for us. You can do both. You don't have to be a savior or a martyr. That kills music.\"\n\nGenres, compartmentalization and safe rock 'n roll be damned. <a href=\"https://www.last.fm/music/Taking+Dawn\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
