{"artist":{"name":"Tammy Wynette","mbid":"26fe36eb-fd75-4799-bf0f-fa502a7bcfe8","url":"https://www.last.fm/music/Tammy+Wynette","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"208046","playcount":"1210241"},"similar":{"artist":[{"name":"George Jones","url":"https://www.last.fm/music/George+Jones","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/68a9b55c3e204cedb9f51d2b95da7cad.png","size":""}]},{"name":"Loretta Lynn","url":"https://www.last.fm/music/Loretta+Lynn","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dcb65264fc564f248f5af68bbad269d6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dcb65264fc564f248f5af68bbad269d6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dcb65264fc564f248f5af68bbad269d6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dcb65264fc564f248f5af68bbad269d6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dcb65264fc564f248f5af68bbad269d6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dcb65264fc564f248f5af68bbad269d6.png","size":""}]},{"name":"Charley Pride","url":"https://www.last.fm/music/Charley+Pride","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f766a108a3034a2886cbc993fbb6df77.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f766a108a3034a2886cbc993fbb6df77.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f766a108a3034a2886cbc993fbb6df77.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f766a108a3034a2886cbc993fbb6df77.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f766a108a3034a2886cbc993fbb6df77.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f766a108a3034a2886cbc993fbb6df77.png","size":""}]},{"name":"Conway Twitty","url":"https://www.last.fm/music/Conway+Twitty","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2605666eebf14ed4ad35a891e213c46e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2605666eebf14ed4ad35a891e213c46e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2605666eebf14ed4ad35a891e213c46e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2605666eebf14ed4ad35a891e213c46e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2605666eebf14ed4ad35a891e213c46e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2605666eebf14ed4ad35a891e213c46e.png","size":""}]},{"name":"Barbara Mandrell","url":"https://www.last.fm/music/Barbara+Mandrell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/37f5084537fa441db2f77bad6f41eb8b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/37f5084537fa441db2f77bad6f41eb8b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/37f5084537fa441db2f77bad6f41eb8b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37f5084537fa441db2f77bad6f41eb8b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37f5084537fa441db2f77bad6f41eb8b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37f5084537fa441db2f77bad6f41eb8b.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"classic country","url":"https://www.last.fm/tag/classic+country"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"60s","url":"https://www.last.fm/tag/60s"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Tammy+Wynette/+wiki"}},"published":"21 Sep 2006, 18:45","summary":"Tammy Wynette (May 5, 1942 – April 6, 1998) was an American country singer and songwriter. She was known as the \"First Lady of Country Music\" and one of her best-known songs was \"Stand by Your Man,\" which was one of the biggest selling hit singles by a woman in the history of the music genre. Tammy Wynette was born Virginia Wynette Pugh near Tremont, Mississippi, the only child of William Hollis Pugh (died February 13, 1943) and Mildred Faye Russell (1922–1991). <a href=\"https://www.last.fm/music/Tammy+Wynette\">Read more on Last.fm</a>","content":"Tammy Wynette (May 5, 1942 – April 6, 1998) was an American country singer and songwriter. She was known as the \"First Lady of Country Music\" and one of her best-known songs was \"Stand by Your Man,\" which was one of the biggest selling hit singles by a woman in the history of the music genre. Tammy Wynette was born Virginia Wynette Pugh near Tremont, Mississippi, the only child of William Hollis Pugh (died February 13, 1943) and Mildred Faye Russell (1922–1991). She was always called Wynette (pronounced Win-net), or Nettie, instead of Virginia.\n\nHer father was a farmer and local musician. He died of a brain tumor when Wynette was nine months of age. Her mother worked in an office, as a substitute school teacher, as well as on the family farm. After the death of Hollis Pugh, she left Wynette in the care of her parents, Thomas Chester and Flora A. Russell, and moved to Memphis to work in a World War II defense plant. In 1946, she married Foy Lee, a farmer from Mississippi.\n\nWynette was raised on the Itawamba County farm of her maternal grandparents where she was born. The place was partly on the border with Alabama. She has often claimed that the state line ran right through their property. she jokingly said \"my top half came from Alabama and my bottom half came from Mississippi\" As a youngster, she worked in the fields picking cotton alongside the hired crews to get in the crop. She grew up with her aunt, Carolyn Russell, who was only five years older than she was. Wynette sang gospel tunes with her grandmother, learned to play the piano and the guitar.\n\nAs a child and teenager, country music provided an escape from her hard life. Wynette grew up idolizing Hank Williams, Skeeter Davis, Patsy Cline, and George Jones and would play their records over and over on the inexpensive children's record player she owned, dreaming of one day being a star herself.\n \nTammy Wynette's 1969 Greatest Hits collection was the first album by a female country artist to sell over one million copies.\n\nShe attended Tremont High School, where she was an all-star basketball player. A month before graduation, she married her first husband. He was a construction worker and they moved several times. Her early jobs included working as a waitress, a receptionist, a barmaid, and in a shoe factory. In 1963, she attended beauty school in Tupelo, Mississippi, and became a hairdresser; she would renew her cosmetology license every year for the rest of her life, just in case she should have to go back to a daily job. Her first husband, whom she left before the birth of their third daughter, was not supportive of her ambition to become a country singer, and, is said by Wynette to have told her, \"Dream on, Baby.\"\n\nHer baby developed spinal meningitis and Wynette tried to make extra money by performing at night. In 1965, Wynette sang on the Country Boy Eddie Show on WBRC-TV in Birmingham, Alabama, which led to some appearances with Porter Wagoner. In 1966, she moved with her three girls from Birmingham to Nashville, Tennessee, where she pounded the pavement to get a recording contract. After being turned down repeadedly by every other record company she'd met with, she auditioned for producer Billy Sherrill, who signed her to Epic Records.\n\nOnce signed to Epic, Sherrill suggested she consider changing her name to something that might make more of impression with the public. According to her 1979 memoir, \"Stand by Your Man,\" during their meeting, Wynette was wearing her long, blonde hair in a ponytail, and Sherill noted that she put him in mind of Debbie Reynolds in the film \"Tammy and the Bachelor,\" and suggested \"Tammy\" as a possible name; thus she became Tammy Wynette.\n\nHer first single, \"Apartment #9\" (written by Johnny Paycheck), was released in late 1966, and reached the top forty on the U.S. country charts. In 1967 she had hits with \"Your Good Girl's Gonna Go Bad,\" \"My Elusive Dreams\" (a duet with David Houston), and \"I Don't Wanna Play House,\" all of which reached the country top ten.\n\nWynette had three number one hits in 1968: \"Take Me to Your World,\" \"D-I-V-O-R-C-E,\" and her best known song, \"Stand by Your Man\" (which she said she wrote in fifteen minutes). In 1969, she had two additional number one hits: \"Singing My Song\" and \"The Ways to Love a Man.\" That same year, Wynette earned a Gold record (awarded for albums selling in excess of one million copies) for \"Tammy Wynette's Greatest Hits.\" She was the first female country artist to do so.\n\nDirector Bob Rafelson used a number of her songs in the soundtrack of his 1970 film Five Easy Pieces. Her chart success continued into the 1970s with such hits as \"Good Lovin' (Makes it Right)\" (1971), \"He Loves Me All the Way\" (1971), \"Bedtime Story\" (1972), \"Kids Say the Darndest Things\" (1973), \"Woman to Woman\" (1974), \"You and Me\" (1976), \"'Til I can Make it on My Own\" (1976), and \"Womanhood\" (1978).\n\nShe married her second husband shortly after her first divorce became final. While still married to him, however, she began a relationship with George Jones, a legendary country performer who was known to have a problem with alcoholism. (They first became involved somewhere around 1968.) Eventually Wynette parted with her second husband and married Jones in Ringgold, Georgia, with whom she had a daughter, Georgette (born in 1970.) It was a difficult marriage, however, due largely to Jones' drinking, and they were divorced in 1975; During their years together, they recorded a number of duet albums, starting in 1971, the first being the Top-10 hit \"Take Me\" (...to your darkest room, bolt every window and lock every door). They would continue to record together, even after their divorce, through the mid 1990s.\n\nAside from her music, Wynette's private life was as tumultuous as many of her songs. Over the course of her life, she had had five husbands: Euple Byrd (married 1959–divorced 1966); Don Chapel (married 1967–annulled 1968); George Jones (married 1969–divorced 1975); Michael Tomlin (married 1976–annulled 1976); and George Richey (married 1978–her death 1998).\n\nShe and Byrd had three children, Gwendolyn Lee (\"Gwen\") Byrd (born 1961), Jacquelyn Faye (\"Jackie\") Byrd (born 1962) and Tina Denise Byrd (born 1965), and she and Jones had one child, Tamala Georgette Jones (born 1970).\n\nTammy had a well publicized relationship with actor Burt Reynolds in the 1970s. Her fourth marriage, to Michael Tomlin, lasted only six weeks. She then married George Richey, who became her manager and lasting love of her life. In 1978, she was mysteriously abducted by a masked man at a Nashville shopping center, driven 80 miles south in her luxury car, beaten and released. No one was ever arrested or identified. But it is has been suspected for many years by Tammy herself, that George Jones had one of his men do that.\n\nShe also had a number of serious physical ailments beginning in the 1970s, including operations on her gall bladder, kidney and on the nodules on her throat.\n\nDuring the late 1960s and early 1970s, Wynette dominated the country charts. She had seventeen number one hits. Along with Loretta Lynn and Dolly Parton, she helped redefine the role and place of female country singers. Beginning in the early 1980s, however, her chart success began to wane. While her singles and albums continued to reach the country top forty, they occurred with less frequency than the previous decade. Meanwhile, her medical problems continued, including inflammations of her bile duct. In 1986, she acted on the CBS TV soap opera Capitol. In 1988, she filed for bankruptcy as a result of a bad investment in two Florida shopping centers. Her 1987 album \"Higher Ground\" broke through with a new contemporary sound, broadening her audience..\n\nShe recorded a song with the British electronica group The KLF in late 1991 titled \"Justified and Ancient (Stand by the JAMs),\" which became a number one hit in eighteen countries the following year. In the video, scrolling electronic titles said that \"Miss Tammy Wynette is the first lady of country music.\" Wynette appeared in the video seated on a throne. Although some saw the inclusion of Wynette as a novel ploy for attention[citation needed] to the song - The KLF were well known for scams and stunts - her inclusion was a mark of respect from The KLF and not an after-thought or marketing ploy.[citation needed] Wynette's vocal performance was exceptional and the song was probably one of the better dance songs of the early 1990s in terms of melodic construction and performance.[citation needed]\n\nIn 1992, future First Lady Hillary Rodham Clinton said during a 60 Minutes interview that she wasn't \"some little woman, standing by my man, like Tammy Wynette.\" The remark set off a firestorm of controversy and Wynette demanded, and received, an apology from Clinton. (Hillary Clinton's remark aside, Wynette was nonetheless a Clinton supporter, and later performed at a Clinton fundraiser.)\n\nThe 1993 album Honky Tonk Angels gave her a chance to record with Dolly Parton and Loretta Lynn for the first time; though yielding no hit singles, the album did well on the country charts. The following year, she released Without Walls, a collection of duets with a number of country, pop and rock and roll performers, including Wynonna Judd, Elton John, Lyle Lovett, Aaron Neville, Smokey Robinson, Sting and a number of others.\n\nWynette also designed and sold her own line of jewelry in the 1990s. In 1994, she suffered an abdominal infection that almost killed her. She was in a coma for six days. In 1995, she and George Jones recorded their first new duet album in thirteen years. They last performed together in 1997 at Concerts in the Country Lanierland, Georgia\n\nWynette lent her vocals on the UK #1 hit Perfect Day in 1997, which was written by Lou Reed.\n\nAfter years of medical problems, numerous hospitalizations, approximately twenty-six major surgeries and an addiction to large doses of pain medication, Tammy Wynette died at age fifty-five while sleeping on the couch in her living room in Nashville, Tennessee. The coroner declared that she died of natural causes. She is interred in Woodlawn Memorial Park Cemetery, Nashville.\n\n\nIn 2002, she was ranked #2 on CMT's 40 Greatest Women in Country Music behind one of her childhood idols, Patsy Cline.\n\nIn 2003 a survey of country music writers, producers and stars listed Stand by Your Man as the top country song of all time. Country Music Television broadcast a special for the top 100 songs, with the #1 song performed by Martina McBride.\n\nJudson Baptist Church, who neighbors Wynette's house, purchased the house, which belonged to Hank Williams before he died, and the land for a little over a million dollars. The Wynette house is used as a Youth Center as well as a guest house.\n\nFrom Wikipedia, the free encyclopedia <a href=\"https://www.last.fm/music/Tammy+Wynette\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
