{"artist":{"name":"Teena Marie","mbid":"98cb2d05-0b47-4bc6-b345-792eecbe8449","url":"https://www.last.fm/music/Teena+Marie","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9054a0f55fb740fdad2822393e30f38d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9054a0f55fb740fdad2822393e30f38d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9054a0f55fb740fdad2822393e30f38d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9054a0f55fb740fdad2822393e30f38d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9054a0f55fb740fdad2822393e30f38d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9054a0f55fb740fdad2822393e30f38d.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"197674","playcount":"1225725"},"similar":{"artist":[{"name":"Stephanie Mills","url":"https://www.last.fm/music/Stephanie+Mills","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1278cecffc534433b6cb52ea26702a17.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1278cecffc534433b6cb52ea26702a17.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1278cecffc534433b6cb52ea26702a17.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1278cecffc534433b6cb52ea26702a17.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1278cecffc534433b6cb52ea26702a17.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1278cecffc534433b6cb52ea26702a17.png","size":""}]},{"name":"Phyllis Hyman","url":"https://www.last.fm/music/Phyllis+Hyman","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/01e927245ba440cca73dfc0e86906877.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/01e927245ba440cca73dfc0e86906877.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/01e927245ba440cca73dfc0e86906877.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/01e927245ba440cca73dfc0e86906877.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/01e927245ba440cca73dfc0e86906877.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/01e927245ba440cca73dfc0e86906877.png","size":""}]},{"name":"Rick James","url":"https://www.last.fm/music/Rick+James","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4e0385c1a3cf4be8a5527c05db22158b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4e0385c1a3cf4be8a5527c05db22158b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4e0385c1a3cf4be8a5527c05db22158b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4e0385c1a3cf4be8a5527c05db22158b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4e0385c1a3cf4be8a5527c05db22158b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4e0385c1a3cf4be8a5527c05db22158b.png","size":""}]},{"name":"Stacy Lattisaw","url":"https://www.last.fm/music/Stacy+Lattisaw","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/664e5c5e4a284dca815160721b54cd58.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/664e5c5e4a284dca815160721b54cd58.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/664e5c5e4a284dca815160721b54cd58.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/664e5c5e4a284dca815160721b54cd58.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/664e5c5e4a284dca815160721b54cd58.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/664e5c5e4a284dca815160721b54cd58.png","size":""}]},{"name":"Deniece Williams","url":"https://www.last.fm/music/Deniece+Williams","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/676887490bd24438a74a65b9eadf6d8b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/676887490bd24438a74a65b9eadf6d8b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/676887490bd24438a74a65b9eadf6d8b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/676887490bd24438a74a65b9eadf6d8b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/676887490bd24438a74a65b9eadf6d8b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/676887490bd24438a74a65b9eadf6d8b.png","size":""}]}]},"tags":{"tag":[{"name":"soul","url":"https://www.last.fm/tag/soul"},{"name":"funk","url":"https://www.last.fm/tag/funk"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"80s","url":"https://www.last.fm/tag/80s"},{"name":"rnb","url":"https://www.last.fm/tag/rnb"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Teena+Marie/+wiki"}},"published":"08 Oct 2006, 14:34","summary":"Teena Marie (March 5, 1956 - December 26th, 2010) was an American Grammy Award-nominated singer–songwriter–producer. (Born Mary Christine Brockert) Marie, nicknamed Lady T, was a protegée of the late funk legend Rick James, and is notable as one of the few successful multi-ethnic performers of R&B. She sang R&B with big, robust vocals, and played rhythm guitar, keyboards and congas. She also had written, produced, sung and arranged virtually all of her songs since her 1980 release Irons in the Fire. <a href=\"https://www.last.fm/music/Teena+Marie\">Read more on Last.fm</a>","content":"Teena Marie (March 5, 1956 - December 26th, 2010) was an American Grammy Award-nominated singer–songwriter–producer. (Born Mary Christine Brockert) Marie, nicknamed Lady T, was a protegée of the late funk legend Rick James, and is notable as one of the few successful multi-ethnic performers of R&B. She sang R&B with big, robust vocals, and played rhythm guitar, keyboards and congas. She also had written, produced, sung and arranged virtually all of her songs since her 1980 release Irons in the Fire. She has quoted this as being her favorite album. She is survived by a daughter named Alia Rose who, as of 2009, sings under the name Rose Le Beau.\n\nEarly Life\nMarie was born in Santa Monica, California. She is of Belgian, Portuguese, Irish, Italian, and Native American ancestry. Marie grew up in Oakwood, a neighborhood in West Los Angeles. As a child, she had an acting role on The Beverly Hillbillies, credited as Tina Marie Brockert. She also sang at the wedding of actor Jerry Lewis's son when she was 10 years old.\n\nMarie worked briefly at Pup 'n' Taco in the mid 1970s while attending Venice High School, where she joined the Summer Dance Production, and also had a role in the school's production of The Music Man.\n\n1979–1981: Motown era\nMarie signed with Motown Records in 1976, having gained an introduction to staff producer Hal Davis (best known for his work with The Jackson 5) and then auditioned, with her then band, for label boss Berry Gordy. She recorded unreleased material with a number of different producers, including Kerner and Wise, but was then spotted by Rick James, who effectively became her mentor. (Some of the earlier unreleased material has since been made available on compilation albums.) Her debut album release, Wild and Peaceful, was originally conceived as a project to be produced by James for Diana Ross, but James preferred to work with Marie. The album was at one point due to be credited to \"Tina Tryson\", but ultimately was put out under Marie's now-established stage name. It scored Marie her first top-ten R&B hit, \"I'm Just a Sucker for Your Love\" (#8 Black Singles Chart), which was a duet with James. Neither the album sleeve nor other packaging showed a picture of Marie, apparently on the theory that black audiences might be reluctant to buy an album by a white artist. In fact, many radio programmers wrongly assumed Marie was African American during the earliest months of her career. This myth was dispelled when, in 1980, her sophomore album, Lady T, sported a picture of her on the cover.\n\nMarie's second album is noted for having production from Richard Rudolph (husband of R&B singer Minnie Riperton who passed a year earlier). Marie had asked Berry Gordy to contact Rudolph and secure his input as Rick James was unavailable and she did not feel quite ready yet to be sole producer of her own material. Rudolph intended for the song he penned, \"Now That I Have You\", to be sung by his wife, but was later given to Marie. Rudolph also co-composed the single \"Behind The Groove\", which reached number 21 on the black singles chart. The song was also included on the soundtrack of Grand Theft Auto: Vice City on the Fever 105 station. Another notable track, \"Too Many Colors,\" featured Rudolph and Riperton's then 7-year-old daughter, Maya Rudolph, who became Teena Marie's god-daughter.\n\nAlso in 1980, Marie released her third LP, Irons in The Fire, in which she handled all writing and production herself, including the horn and rhythm arrangements of her band and all backing vocals. The single \"I Need Your Lovin'\" (#37 Pop, #9 Black Singles) brought Teena her first top 40 hit. That same year, Teena Marie appeared on James' hugely successful album Street Songs with the steamy duet \"Fire and Desire.\" The two would perform the single at the 2004 BET Awards, which would be the two's last TV appearance with one another as Rick James passed later that year.\n\nMarie continued her success with Motown in 1981 with the release of It Must Be Magic (#2 Black Albums Chart), her first gold record, which included her then biggest hit on R&B, \"Square Biz\" (#3 Black Singles). Other notable tracks include \"Portuguese Love\" (featuring a brief, uncredited cameo by James, #54 Black Singles), the title track \"It Must be Magic\" (#30 Black Singles), and album only track \"Yes Indeed\" which Marie cites as a personal favorite.\n\nIn 1982, Marie got into a heated legal battle with Motown records over her contract and disagreements on releasing her new material. The shuffle resulted in \"The Brockert Initiative\", which makes it illegal for a record company to keep an artist under contract without releasing new material for that artist. The artist would then be able to sign and release with another label instead of being held back by an unsupportive one. Teena Marie commented on the law in an LA Times article, saying, \"It wasn't something I set out to do. I just wanted to get away from Motown and have a good life. But it helped a lot of people, like Luther Vandross and the Mary Jane Girls and a lot of different artists, to be able to get out of their contracts\".\n\n\n1983-1991: Epic Records\nAfter leaving Motown in 1982, Marie signed with Epic Records in 1983 and released the concept album Robbery, which featured the hit \"Fix It\" (#21 R&B), as well as \"track artist=Teena Marie]Shadow Boxing\" and \"Casanova Brown.\" The latter was one of a number of tracks Marie would write over the years about her real-life romance with one-time mentor Rick James. The relationship had ended by that point, but the two would continue a sometimes tempestuous friendship until James's death. In 1984, Marie released her biggest-selling album, Starchild. It yielded the singles \"Lovergirl\" and \"Out on a Limb,\" the former of which became Marie's highest-peaking single to date on the US pop charts, peaking at #4, while peaking at #9 on the R&B charts. \"Out on a Limb\" was not as successful as \"Lovergirl\" on the R&B Charts, however, peaking only at #56. Also in 1985, \"14k\" (R&B #87) was featured on the soundtrack of the film Goonies.\n\nIn 1986, Marie released a rock-music-influenced concept album titled Emerald City. It was controversial with her established fan base and not as successful as its predecessors. She also recorded another rock-influenced track, \"Lead Me On\", co-produced by Georgio Moroder, for the soundtrack of the box office hit film Top Gun that year. In 1988, however, she returned to her R&B and funk roots releasing the critically-acclaimed album Naked to the World. That album contained the hit \"Ooo La La La,\" which reached the top of Billboard's Hot R&B/Hip-Hop Singles & Tracks chart, and remains her only #1 single on that chart to date.\n\nMarie released Ivory in the fall of 1990. Despite the success of the first two singles, \"Here's Looking at You\" (#11 R&B) and \"If I Were a Bell\" (#8 R&B), Epic Records was not totally pleased with sales of the album, so Marie and her label mutually agreed to go their separate ways.\n\n\nMid 90s Hiatus: Passion Play and Black Rain\nDuring the 1990s, Marie's classic R&B, soul and funk records were either sampled by hip-hop artists or covered by R&B divas. Marie herself is regarded as something of a pioneer in helping to bring hip-hop to the mainstream by becoming one of the first and only artists of her time to rap one of her singles—the aforementioned \"Square Biz.\" In the hip-hop portion of that song, she mentions some of her inspirations: Sarah Vaughn, Johann Sebastian Bach, Shakespeare, Maya Angelou, and Nikki Giovanni, \"just to name a few,\" as she said. In 1996, The Fugees paid tribute to her by interpolating the chorus of her 1988 hit \"Ooo, La, La, La\" on their own \"Fu-Gee-La,\" which was a huge hit.\n\nIn the fall of 1994, Marie released Passion Play on her own independent label, Sarai. Lacking the backing of a major label, this album sold less well than her earlier work, but was well received by fans.\n\nSubsequently Marie devoted most of her time to raising her daughter Alia Rose (who has since adopted the name Rose Le Beau and is pursuing her own singing career). During the late 1990s, she made appearances (as herself) on the TV sitcoms The Steve Harvey Show and The Parkers. She also began work on a new album, entitled Black Rain. She was unable to secure a major label deal for this, and did not want to put it out on her own Sarai label in light of the modest sales of Passion Play. However, a version pressed for promotional purposes was widely bootlegged amongst fans. This contained the tracks: \"The Mackin Game\", \"I'll Take the Pressure\", \"Baby I'm Your Fiend\", \"My Body's Hungry\", \"Ecstasy\", \"I'm On Fire\", \"Watcha Got 4 Me\", \"Black Rain\", \"1999\", \"Butterflies\", \"Spanish Harlem\", \"Blackberry Playa\", \"The Perfect Feeling\" and \"Rainbow Outro\". Some of these tracks have resurfaced on the later albums La Doña, Sapphire and Congo Square, in some cases (e.g. \"The Mackin Game\") in significantly reworked versions. Although there have been rumours of other tracks recorded during the Black Rain sessions, including one called \"Underneath the Covers\" and another (allegedly a duet with Rick James) entitled \"Pretty Tony\", these would appear to be apocryphal.\n\n\n2004-2006: La Doña and Sapphire\nAfter a 14-year sabbatical from the national spotlight, Marie returned to her musical career by signing with the Classics sub-label of the successful hip-hop label Cash Money Records, and she released her comeback album, La Doña, in 2004, and follow up Sapphire, in 2006. La Doña became a gold-certified success (and the highest-charting album of her career, peaking at #6 on the Billboard 200 chart) on the basis of the Al Green-sampled \"I'm Still In Love\" (#23 R&B, #70 Pop) and a duet with the late Gerald Levert, \"A Rose by Any Other Name.\" Marie was nominated for a 2005 Grammy Award for Best R&B Female Vocal Performance for \"Still in Love.\" Marie quickly followed this success with the release of Sapphire in 2006. While sales were not as great this time around (the album peaked at #24 on the Pop Chart), the release did give Marie yet another R&B Top-40 hit, \"Ooh Wee\" (#32); it also reunited her (on \"God Has Created\" and \"Cruise Control\") with Smokey Robinson, the early Motown mentor whose style she had emulated on early hits such as \"Young Love.\" Marie parted ways with Ca$h Money records after the release of Sapphire.\n\n2009-present: Congo Square\nOn September 19, 2008, Teena performed in concert at BB King's restaurant in NYC. Marie took this time to play a couple of finished tracks from her upcoming album, Congo Square, and she received a positive response from the crowd. Congo Square was released on June 9, 2009 on the Stax Records/Concord Music label. She has described the album as \"personal and spiritual\" and indicated that it is more jazz-influenced than most of her previous work. \"Can't Last a Day\", a duet with Faith Evans, leaked to the internet in March 2009. Teena Marie says of Evans, \"It was after I had recorded the song (Can't Last a Day) I got the idea to put Faith on it. I’ve always loved Faith and her vocal style. She reminds me of me. Her correlation with Biggie — having a career with him and without him — reminds me of me and Rick (Rick James). I feel like she’s a younger me. Of the younger ladies, she’s the one I love most.” The album proved another success, reaching the Top 20 on Billboard's Top 200, and giving Teena Marie yet another Top 10 R&B chart entry <a href=\"https://www.last.fm/music/Teena+Marie\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
