{"artist":{"name":"The Almost","mbid":"92e1f515-fc89-4577-9f77-addacdaf7559","url":"https://www.last.fm/music/The+Almost","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a800e89457304abb8cb8c1bdeec71980.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a800e89457304abb8cb8c1bdeec71980.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a800e89457304abb8cb8c1bdeec71980.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a800e89457304abb8cb8c1bdeec71980.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a800e89457304abb8cb8c1bdeec71980.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a800e89457304abb8cb8c1bdeec71980.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"267113","playcount":"5833745"},"similar":{"artist":[{"name":"Aaron Gillespie","url":"https://www.last.fm/music/Aaron+Gillespie","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/93a041b9489940a0c049e586708a1b48.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/93a041b9489940a0c049e586708a1b48.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/93a041b9489940a0c049e586708a1b48.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/93a041b9489940a0c049e586708a1b48.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/93a041b9489940a0c049e586708a1b48.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/93a041b9489940a0c049e586708a1b48.png","size":""}]},{"name":"The Classic Crime","url":"https://www.last.fm/music/The+Classic+Crime","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/38d874b8c29d4a0b85d83fdb085a990d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/38d874b8c29d4a0b85d83fdb085a990d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/38d874b8c29d4a0b85d83fdb085a990d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/38d874b8c29d4a0b85d83fdb085a990d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/38d874b8c29d4a0b85d83fdb085a990d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/38d874b8c29d4a0b85d83fdb085a990d.png","size":""}]},{"name":"Emery","url":"https://www.last.fm/music/Emery","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1fd831ed394b4508ae92b5505763eedf.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1fd831ed394b4508ae92b5505763eedf.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1fd831ed394b4508ae92b5505763eedf.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1fd831ed394b4508ae92b5505763eedf.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1fd831ed394b4508ae92b5505763eedf.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1fd831ed394b4508ae92b5505763eedf.png","size":""}]},{"name":"Underoath","url":"https://www.last.fm/music/Underoath","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1ad7951d936f4e23863d289c2079b6bd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1ad7951d936f4e23863d289c2079b6bd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1ad7951d936f4e23863d289c2079b6bd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ad7951d936f4e23863d289c2079b6bd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ad7951d936f4e23863d289c2079b6bd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1ad7951d936f4e23863d289c2079b6bd.png","size":""}]},{"name":"Ivoryline","url":"https://www.last.fm/music/Ivoryline","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bfbbec9971734368836f259eb000af45.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bfbbec9971734368836f259eb000af45.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bfbbec9971734368836f259eb000af45.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bfbbec9971734368836f259eb000af45.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bfbbec9971734368836f259eb000af45.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bfbbec9971734368836f259eb000af45.png","size":""}]}]},"tags":{"tag":[{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"post-hardcore","url":"https://www.last.fm/tag/post-hardcore"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"},{"name":"alternative rock","url":"https://www.last.fm/tag/alternative+rock"},{"name":"emo","url":"https://www.last.fm/tag/emo"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Almost/+wiki"}},"published":"05 Mar 2006, 19:30","summary":"The Almost is the band of Aaron Gillespie, the former drummer/clean vocalist  of Underoath from Clearwater, Florida, United States started in 2005. Aaron stated that this band is much more of a traditional rock project than Underoath.\n\nA Monster Monster is on the loose.\n\nThe Almost’s second album for Tooth & Nail/Virgin Records began taking shape just as soon as the band came off the road after touring for their 2007 debut, Southern Weather, including a stint on that summer’s Warped tour. <a href=\"https://www.last.fm/music/The+Almost\">Read more on Last.fm</a>","content":"The Almost is the band of Aaron Gillespie, the former drummer/clean vocalist  of Underoath from Clearwater, Florida, United States started in 2005. Aaron stated that this band is much more of a traditional rock project than Underoath.\n\nA Monster Monster is on the loose.\n\nThe Almost’s second album for Tooth & Nail/Virgin Records began taking shape just as soon as the band came off the road after touring for their 2007 debut, Southern Weather, including a stint on that summer’s Warped tour.\n\nThat album, which debuted at 39 on Billboard’s Top 200, earned them a Top 10 single at Alternative radio, and a spot on MTV’s Discover & Download, was essentially the work of a single individual—Underoath drummer Aaron Gillespie, who wrote all the songs, played all the instruments and then recruited a band to play them live, starting with fellow Floridian Jay Vilardi, a veteran of several well-known area bands like Metal Blade’s Phoenix Mourning and Orlando-based Hand to Hand.\n\n“My job was to teach everyone the songs,” explains Vilardi, who describes himself as the band’s musical director. The addition of Philadelphia-based guitarist Dusty Redman, himself a veteran of Tooth & Nail bands like Beloved and Dead Poetic and Salt Lake City bassist Alex Aponte rounded out the line-up.\n\nThe now thoroughly road-tested band was intent to make their latest a completely collaborative effort, melding their talents into a whole that was more than the sum of its individual parts. The process began with Vilardi, Redmon and Aponte e-mailing files back and forth to Gillespie, who was busy penning lyrics and coming up with musical ideas of his own while touring with Underoath, before all four of them got together in the studio to jam and work out the arrangements.\n\nIt was a system that resulted in a powerfully cohesive album that melds their diverse songwriting skills, from the thudding, Raw Power-like stomp of the title track and “Young Again,” to the stark acoustic blues and closing psychedelic jam of “Monster,” the techno-rock laced with tribal drums of “Books & Books” and the melodic Coldplay/U2/Kings of Leon arena-rock anthem, “Hands.”\n\n“It turned out to be a really good process because we wound up with a tremendous amount of material we can use,” says Vilardi.\n\n“We jammed on these tracks for hours before we actually laid anything down,” nods Gillespie. “This now feels like a real band. Everyone gave up a piece of his own agenda for the good of the final result. And that’s how you end up with something special. It was a relief for me because it took a lot of the weight off my shoulders. They supplied the bricks and we built the house together.”\n\nThe guys also enlisted the help of steel guitarists Chris Scruggs (grandson of bluegrass legend Earl Scruggs) and John Davis (Superdrag vocalist/guitarist) while in the studio. Both Scruggs and Davis helped they guys broaden their musical pallets on a few tracks like “West” and “Hand Grenade.”\n\n“It was whatever each of us could do for the song,” agrees Redmon. “There were no ego issues, no one screaming, ‘I’m Eddie Van Halen!’”\n\nGillespie says the songs are about the dark side of the human condition, battling your demons to come out the other side, starting with the album’s title.\n\n“I’m giving in to you,” he roars in “Lonely Wheel,” though in “No I Don’t,” which segues from an acoustic beginning to an anthemic rock chorus, he admits, “I’m learning how to wait.” The hard-hitting “Young Again” and the country-flavored “Hand Grenade” (“Oh to be young/It sounds like so much fun”) are both about lost innocence, while “Souls on Ten,” with its piano flourish and urgent intensity, has a Springsteen feel and the grungy garage-rock of “Summer Summer” offers an elegiac nod to vintage Neil Young with Crazy Horse.\n\n“It didn’t start out as a concept album, but by accident, I think it became one,” says Aaron. “It’s about the ‘monster’ that lives inside of all of us, which we have to fight to get rid of. It’s a battle you live with every day. In the end, when that stops, the question remains, can you now live your life? Can you get all of who you are, can you find a place that makes you happy?”\n\nThat catharsis comes across loud and clear in the final song on the album, dubbed “Monster,” which starts with Gillespie alone, accompanied by a single dobro. “Learning how to see/In this weird change of space/I’m learning to believe in this life… I feel you helping me.” The song builds until, about two-thirds of the way through, the rest of The Almost come in, embarking on a spontaneous acid-soaked jam, recorded live, that provides the ultimate release.\n\n“Everybody needs that,” says Gillespie. “For some people, it’s drinking, others run, some throw baseballs. I play music. That’s what I do. That gets rid of the garbage in my life.”\n\n“It’s about how terrible we can be at times,” says Vilardi. “It’s hard to be a person today who stands for something. It doesn’t make you better… sometimes it even makes you worse.”\n\nOn “Hands,” the band prove they can create an arena- and radio-ready rock anthem, with its martial beat, chiming keyboards and lush ‘80s new wave fizz.\n\n“It’s like an Achtung Baby vibe,” nods Dusty. “That song came out of nowhere. We demoed it, then got into the studio and started playing it and just got real excited.”\n\n“I like working with a song structure,” says Gillespie. “In Underoath, that’s not what we do. We create moments, which is important, but The Almost is something different.”\n\n“Monster Monster” and “Young Again” demonstrate Jay and Dusty’s love of classic garage punk, like The Stooges and The Velvet Underground\n. “We really want to put the middle finger back in rock,” says Vilardi. “We love the attitude of bands like Guns N' Roses.”\n\nAnd that’s strange, because it turns out that rebellion doesn’t conflict with being on Tooth & Nail, where the support of community is almost as important as the religious implications.\n\n“Music should reflect who you are,” says Aaron. “I believe there’s hope in finding who you are. That’s my conviction. At the same time, I want anybody, no matter their affiliation, to react to the music in the same way. I don’t want people to feel they’re being judged.”\n\nWith the addition of drummer Joe Musten (Gillespie played all the drums on the album), The Almost is ready to hit the road and do what they do best, play for their increasing fan base around the country.\n\n“We plan on hitting it as hard as we can,” laughs Vilardi. “We’d like to leave and not come back for two years.”\n\n“We’re just beginning now to establish our identity,” concludes Dusty. “There were a lot of people now who are finding out about Underoath through The Almost.”\n\nNow there’s a transformation for you.  <a href=\"https://www.last.fm/music/The+Almost\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
