{"artist":{"name":"The Bruisers","mbid":"ad439368-4054-45f6-a285-cce3a9bf65ad","url":"https://www.last.fm/music/The+Bruisers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3e844d35fc4d4da69c1ce6e056621831.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3e844d35fc4d4da69c1ce6e056621831.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3e844d35fc4d4da69c1ce6e056621831.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e844d35fc4d4da69c1ce6e056621831.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e844d35fc4d4da69c1ce6e056621831.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3e844d35fc4d4da69c1ce6e056621831.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"28176","playcount":"302363"},"similar":{"artist":[{"name":"Hudson Falcons","url":"https://www.last.fm/music/Hudson+Falcons","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/59b16090f1f345198ce8d7e64d93117f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/59b16090f1f345198ce8d7e64d93117f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/59b16090f1f345198ce8d7e64d93117f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/59b16090f1f345198ce8d7e64d93117f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/59b16090f1f345198ce8d7e64d93117f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/59b16090f1f345198ce8d7e64d93117f.png","size":""}]},{"name":"The Ducky Boys","url":"https://www.last.fm/music/The+Ducky+Boys","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6e12ea6d63974f7183d24bd029be00f2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6e12ea6d63974f7183d24bd029be00f2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6e12ea6d63974f7183d24bd029be00f2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6e12ea6d63974f7183d24bd029be00f2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6e12ea6d63974f7183d24bd029be00f2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6e12ea6d63974f7183d24bd029be00f2.png","size":""}]},{"name":"Brassknuckle Boys","url":"https://www.last.fm/music/Brassknuckle+Boys","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0002f9bdcc9f4918b433d780a9946e7f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0002f9bdcc9f4918b433d780a9946e7f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0002f9bdcc9f4918b433d780a9946e7f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0002f9bdcc9f4918b433d780a9946e7f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0002f9bdcc9f4918b433d780a9946e7f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0002f9bdcc9f4918b433d780a9946e7f.png","size":""}]},{"name":"Anti-Heros","url":"https://www.last.fm/music/Anti-Heros","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ac8a90c8ad3f4f90bd7f762ec3734945.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ac8a90c8ad3f4f90bd7f762ec3734945.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ac8a90c8ad3f4f90bd7f762ec3734945.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ac8a90c8ad3f4f90bd7f762ec3734945.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ac8a90c8ad3f4f90bd7f762ec3734945.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ac8a90c8ad3f4f90bd7f762ec3734945.png","size":""}]},{"name":"Everybody Out!","url":"https://www.last.fm/music/Everybody+Out%21","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f1d6bc34eed94544b1207b390adb2926.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f1d6bc34eed94544b1207b390adb2926.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f1d6bc34eed94544b1207b390adb2926.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f1d6bc34eed94544b1207b390adb2926.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f1d6bc34eed94544b1207b390adb2926.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f1d6bc34eed94544b1207b390adb2926.png","size":""}]}]},"tags":{"tag":[{"name":"Oi","url":"https://www.last.fm/tag/Oi"},{"name":"street punk","url":"https://www.last.fm/tag/street+punk"},{"name":"punk","url":"https://www.last.fm/tag/punk"},{"name":"Skinhead","url":"https://www.last.fm/tag/Skinhead"},{"name":"hardcore","url":"https://www.last.fm/tag/hardcore"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Bruisers/+wiki"}},"published":"29 Sep 2006, 02:04","summary":"The Bruisers were pioneers of the American streetpunk/oi! movement, formed in Portsmouth, New Hampshire in 1988. Vocalist Al Barr and bassist Scotty Davies were old friends from the scene who had been playing in separate bands for years. Al Barr was singing for Portsmouth area band DVA featuring future members of 5 Balls of Power, the Radicts and L.E.S. Stitches. Scotty Davies had played bass with VFW and was still playing bass in Newburyport, MA hardcore band NPD with future Bruisers guitarist Jeff Morris <a href=\"https://www.last.fm/music/The+Bruisers\">Read more on Last.fm</a>","content":"The Bruisers were pioneers of the American streetpunk/oi! movement, formed in Portsmouth, New Hampshire in 1988. Vocalist Al Barr and bassist Scotty Davies were old friends from the scene who had been playing in separate bands for years. Al Barr was singing for Portsmouth area band DVA featuring future members of 5 Balls of Power, the Radicts and L.E.S. Stitches. Scotty Davies had played bass with VFW and was still playing bass in Newburyport, MA hardcore band NPD with future Bruisers guitarist Jeff Morris, drummer Dan Connors who would join the Bruisers in 1990 and Steve O'Sullivan who would play drums for a few live shows with the Bruisers in the early 90's.\n\nThe scene north of Boston was thriving on punk and hardcore bands, but there was nothing close to the Oi! style that they both enjoyed. Al Barr and Scotty Davies started writing songs for their new band that would become the Bruisers once drummer Rodger Shosa and guitarist Jeff Morris were added later that year.\n\nAfter a few months rehearsing in Scotty Davies' basement in Eliot, ME just over the bridge from Portsmouth, the band moved into the 5th floor recording studio in Portsmouth called the Bunkhouse for a long, hot day of recording 7 songs including 6 originals and a cover of The Oppressed's \"Work Together\".\n\nAfter a few gigs playing parties in the Portsmouth area, the band's first club gig came in June of 1989 at the Pyramid Club in New York City with old friends the Radicts who had moved to the city the previous year. The cover photo of 1990's Independence Day EP cassette was taken at this show.\n\nBy now there was an underground current in the scene for the Bruisers, and plenty of cassette copies of their 7 song demo were circulating. Ex-NPD drummer Dan Connors was working the summer of 1989 on Cape Cod with his girlfriend, where they met Jen Kelly, wife of Jack \"Choke\" Kelly of Slapshot. Jen brought home one of the band's demos and Jack was impressed enough to sign the band to his new American Oi! Label, Patriot Records. The Bruisers 1st four song EP was released in the summer of 1989 on Patriot Records.\n\nLater that year the three Patriot bands, Stars and Stripes, Forced Reality and the Bruisers would join together to play a show at Bunratty's in Allston, MA. Since Jack needed a second guitarist and bass player for Stars and Stripes to play live he asked Jeff Morris and Scotty Davies to practice with them and play the show, which they did. Since the Bruisers played first that day both of them were half in the bag on Bass Ale by the time they went on with Stars and Stripes, but the show went off without a hitch.\n\nIn late 1989 Rodger Shosa left the band and was replaced by ex-NPD drummer Dan Connors. A new guitarist named Crash was added to fill out the bands sound and in the summer of 1990 the band went back to Bunkhouse Studio to record what would eventually be released as the Independence Day EP cassette.\n\nThis lineup only played a handful of shows together, but one highlight was the Oi! Fest in Newark, NJ with Niblick Henbane, Wretched Ones, The Glory, Forced Reality and others.\n\nIn 1990 Scotty Davies left the band to pursue his schooling in motorcycle mechanics and was replaced by Todd Sealy on bass. Crash also left and was replaced by \"Sik Rik\" Rick Wimert on guitar.\n\nThis new lineup would record 1991's American Night EP at Bobcat Studios in Seabrook, NH. This recording was released on local label, Sonic Aggression which also released projects by North Carolina's Patriot, Detroit's Pist N' Broke, Boston's Wrecking Crew and Portsmouth's The System. This label was owned and run by a friend of the band, the same friend that released the previous Independence Day EP cassette under the name Nirvana Records.\n\nAfter the release of American Night EP Todd Sealy was replaced by Keith \"Ritchie\" Richards on bass and the band recorded their first full length release, 1993's Cruisin' For A Bruisin' CD/Cassette for Primitive Records, another spin-off of Sonic Aggression.\n\nThis era was the band's most active to date and during this time they began playing shows all over New England with Agnostic Front, Madball, Sheer Terror, Bad Brains, The Business and others.\n\nSometime in 1994 Bird Records of France released a three song EP titled Clobberin' Time EP that included the rest of the bands first recording session that wasn't used on the first Patriot Records release.\n\nAround this time the band went to Europe for their 1st tour with Madball. Because of family commitments Jeff Morris couldn't go with the band and Todd Sealy filled in on guitar for that tour.\n\nWhen the band returned they recorded the Gates Of Hell EP for longtime band friend Laurent Hees of Bird Records in France.\n\nIn 1995 \"Sik Rik\" Rick Wimert left the band and was replaced by Robert Garceau. This lineup recorded 1996's Up In Flames CD release for Lost & Found Records of Germany.\n\nAfter the release of 1996's Up In Flames CD original member Jeff Morris, guitarist Robert Garceau and bassist Keith \"Ritchie\" Richards left the band and were replaced by Scott Vierra, formerly of The System, ex-Bruisers bassist/guitarist Todd Sealy on guitar and Johnny Rioux on bass guitar. This new lineup recorded 1997's Still Standing Up CD/EP for Lost & Found Records and went on tour in Europe again in support of Madball.\n\nAround this time the band was shocked by the death of former guitarist and brother \"Sik Rik\" Rick Wimert. Although \"Sik Rik\" Rick Wimert had left the band he never left the Bruisers family and his death shook the band to the core.\n\nShortly thereafter drummer Dan Connors left the band and was replaced by John Dicicco. Finally Keith \"Ritchie\" Richards came back to replace Todd on guitar. This final lineup recorded 1998's Molotov CD/EP for Cyclone Records.\n\nBy 1998 Al Barr was the only remaining original member of the band, and having reached his own personal milestone as the only member to see the 10 year mark he decided to disband the Bruisers and pursue his new role as singer for Boston's Dropkick Murphys.\n\nSource:  thebruisers.net\n\nIn 2005 the band or at least parts of the and reunited for a one time reunion show at the roxy in Boston.   <a href=\"https://www.last.fm/music/The+Bruisers\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
