{"artist":{"name":"Bescenta","mbid":"92d446a1-7d4b-4cd2-bfb9-92400ff2f59a","url":"https://www.last.fm/music/Bescenta","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0c6782d68d564e7e96a0eaffb301f286.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0c6782d68d564e7e96a0eaffb301f286.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0c6782d68d564e7e96a0eaffb301f286.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0c6782d68d564e7e96a0eaffb301f286.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0c6782d68d564e7e96a0eaffb301f286.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0c6782d68d564e7e96a0eaffb301f286.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"8415","playcount":"28590"},"similar":{"artist":[{"name":"Jah Mali","url":"https://www.last.fm/music/Jah+Mali","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ae9a9114d23e4519b3dae4273a9fa146.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ae9a9114d23e4519b3dae4273a9fa146.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ae9a9114d23e4519b3dae4273a9fa146.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ae9a9114d23e4519b3dae4273a9fa146.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ae9a9114d23e4519b3dae4273a9fa146.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ae9a9114d23e4519b3dae4273a9fa146.png","size":""}]},{"name":"Norris Man","url":"https://www.last.fm/music/Norris+Man","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ee2bd28dc1e441fca7ca21ec72860080.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ee2bd28dc1e441fca7ca21ec72860080.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ee2bd28dc1e441fca7ca21ec72860080.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee2bd28dc1e441fca7ca21ec72860080.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee2bd28dc1e441fca7ca21ec72860080.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ee2bd28dc1e441fca7ca21ec72860080.png","size":""}]},{"name":"Ginjah","url":"https://www.last.fm/music/Ginjah","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7d9863bce9d84dac9a2788870b37ac75.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7d9863bce9d84dac9a2788870b37ac75.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7d9863bce9d84dac9a2788870b37ac75.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7d9863bce9d84dac9a2788870b37ac75.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7d9863bce9d84dac9a2788870b37ac75.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7d9863bce9d84dac9a2788870b37ac75.png","size":""}]},{"name":"Natty King","url":"https://www.last.fm/music/Natty+King","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d0139215748e4ca7b620d92ee3512e66.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d0139215748e4ca7b620d92ee3512e66.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d0139215748e4ca7b620d92ee3512e66.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d0139215748e4ca7b620d92ee3512e66.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d0139215748e4ca7b620d92ee3512e66.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d0139215748e4ca7b620d92ee3512e66.png","size":""}]},{"name":"Natural Black","url":"https://www.last.fm/music/Natural+Black","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e5b69fbc5685483aa0baad343400b0da.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e5b69fbc5685483aa0baad343400b0da.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e5b69fbc5685483aa0baad343400b0da.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5b69fbc5685483aa0baad343400b0da.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5b69fbc5685483aa0baad343400b0da.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5b69fbc5685483aa0baad343400b0da.png","size":""}]}]},"tags":{"tag":[{"name":"reggae","url":"https://www.last.fm/tag/reggae"},{"name":"Rasta","url":"https://www.last.fm/tag/Rasta"},{"name":"dancehall","url":"https://www.last.fm/tag/dancehall"},{"name":"roots reggae","url":"https://www.last.fm/tag/roots+reggae"},{"name":"All","url":"https://www.last.fm/tag/All"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Bescenta/+wiki"}},"published":"06 Jul 2009, 21:34","summary":"This artiste is the epitome of what the roots of reggae music is all about. Armed with a barrage of strong and prolific songs this youth is as refreshing as the rivers running through the cool St Andrew hills where he hails from. \n\nBorn Bryden Bescenta Wilkins, Bescenta is a product of the above rocks district in the St Andrew Hills, birthplace of another reggae great Nadine Sutherland. This youth has the ability to create very socially conscious songs that immediately relate to the mainstream.  <a href=\"https://www.last.fm/music/Bescenta\">Read more on Last.fm</a>","content":"This artiste is the epitome of what the roots of reggae music is all about. Armed with a barrage of strong and prolific songs this youth is as refreshing as the rivers running through the cool St Andrew hills where he hails from. \n\nBorn Bryden Bescenta Wilkins, Bescenta is a product of the above rocks district in the St Andrew Hills, birthplace of another reggae great Nadine Sutherland. This youth has the ability to create very socially conscious songs that immediately relate to the mainstream. \n\nHe is a voice for the oppressed with soul soothing melodies that are as haunting as they are unforgettable. Bescenta is a one in a million artiste and a youth that will rightfully take his place in the dancehall with other great acts who preceeded him. \n\nAmbition never ends with the first hit song. The pursuit of excellence is the driving force behind reggae artiste Bescenta, who is a rare combination of intensity, quiet confidence and humility. He is a man who has the courage of his convictions, and who is sticking steadfastly to his mission of universal peace and love in the world. \n\nBorn Bryden Bescenta Craig Wilkins on April 12, 1975, he grew up in the Salisbury Plain area, close to Stony Hill in St. Andrew. He attended Almond Hill All Age, then Oberlin High, before graduating from St. Andrew Technical High School (S.T.A.T.H.S) in Kingston. Immediately after high school, he learned the electrician trade, and to support himself, even did odd jobs like painting houses. \n\nI can even wire a house, and install lights if it come to the test. I am a pretty good electrician, he said. However, it has always been about the music, while I was in high school, I was hunting for the truth in music, but when I got out in the real world, I knew I had to make a living, so I didnt watch the type of work I was doing, as long as when weekend come, mi ting put together, he said. \n\nHowever, eventually, the influence of music began to exert itself in his life, and he began to record his first songs with Peter Sweetness Nembhard on Auntie Boom Records. At that time, he had formed a group called Cornerstone with two other men where he sang the lead vocals. Together, they did a couple of projects but these failed to generate much publicity or record sales. \n\nEventually, in 2001, Bescenta met with producer Computer Paul Henton, and they formed a successful partnership. \n\nHe saw the talent and wanted to work with me as a solo actthe other men in the group allowed me to leave, and I began to do singles for him, and during that time, I recorded World Is in Trouble in 2004, and I entered it in the festival song contest, he said. \n\nNow, the World Is in Trouble is a song carved in reggae oak: solid. With Bescentas rich vocals and lyrical stylings, the song became an anthem for residents of the islands tough inner city areas, and its end-of-days theme became a stirring call for action and change to arrest the killings and violence that afflict Bescentas homeland. The song enjoyed a lot of airplay during the Summer of 2004 during the annual Jamaica Cultural Development Commission (JCDC) Popular Song contest, and eventually finished second overall. \n\nIt was not about winning, the money or the forward, it was the message of love and non-violence that I was trying to convey to the people, and I really wanted them to hear me, so I went with a current, an energy, and it worked, because the people dem love it, a video was done, the children saw it, and the song just tek the road, he said. \n\nThe song stayed at the pole position on the Roots FM chart, and won a free music video, and created a big buzz on Bescenta, catapulting him into the limelight in no uncertain terms, and he has not looked back since. \n\nI never saw World Is in Trouble as a festival song, and I was still at Computer Paul waiting on the next move. I had recorded the song on Alozades Binghi Trod rhythm, and Ray X-ray Stephens from Vertex heard the song, was impressed and called me. I met him, and reason on some musical topics, and we just hit it off, he said. \n\nSo in late 2004, Bescenta parted ways with Computer Paul. \n\nI appreciate what Computer Paul did for me, I entered his establishment with my own current, and then I added that to his current, and we made some great music together. He had to do what he had to do, and I had to do what I had to do, focus on my career. As an artiste, you like to see things ah step, and it didnt work out, but I am pressing on, he said. \n\nBescentas star has begun to shine brilliantly with his new focused and efficient management structure. \n\nSince 2005, he has recorded songs such as the popular Can You Handle It? with an accompanying video. That single entered the New York reggae charts, and also did well in Mexico. Other standout singles include Mama Told Me which enjoyed heavy rotation, and lately, Universal Love has captivated the hearts and minds of reggae fans, so much so that song is climbing up the B-mobile MegaJamz chart. The song is also doing well in Japan, and Europe. Other singles which were recently released are AIDS, a social commentary on the ravages of the deadly immuno-deficiency disease, and Dont Be a Fool.\n <a href=\"https://www.last.fm/music/Bescenta\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
