{"artist":{"name":"The Dillinger Escape Plan","mbid":"1bc41dff-5397-4c53-bb50-469d2c277197","url":"https://www.last.fm/music/The+Dillinger+Escape+Plan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a2fcbbd622ae4189ac82b44b8198c990.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a2fcbbd622ae4189ac82b44b8198c990.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a2fcbbd622ae4189ac82b44b8198c990.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a2fcbbd622ae4189ac82b44b8198c990.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a2fcbbd622ae4189ac82b44b8198c990.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a2fcbbd622ae4189ac82b44b8198c990.png","size":""}],"streamable":"0","ontour":"1","stats":{"listeners":"418528","playcount":"22585780"},"similar":{"artist":[{"name":"Converge","url":"https://www.last.fm/music/Converge","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/310c20aadd6d49cd9d714771a44590b9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/310c20aadd6d49cd9d714771a44590b9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/310c20aadd6d49cd9d714771a44590b9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/310c20aadd6d49cd9d714771a44590b9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/310c20aadd6d49cd9d714771a44590b9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/310c20aadd6d49cd9d714771a44590b9.png","size":""}]},{"name":"Car Bomb","url":"https://www.last.fm/music/Car+Bomb","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a5db9ef757c3414f93dbd3994b788a6b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a5db9ef757c3414f93dbd3994b788a6b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a5db9ef757c3414f93dbd3994b788a6b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a5db9ef757c3414f93dbd3994b788a6b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a5db9ef757c3414f93dbd3994b788a6b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a5db9ef757c3414f93dbd3994b788a6b.png","size":""}]},{"name":"Norma Jean","url":"https://www.last.fm/music/Norma+Jean","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/50efaffe340441d1bda704ef89e76866.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/50efaffe340441d1bda704ef89e76866.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/50efaffe340441d1bda704ef89e76866.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50efaffe340441d1bda704ef89e76866.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50efaffe340441d1bda704ef89e76866.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/50efaffe340441d1bda704ef89e76866.png","size":""}]},{"name":"Every Time I Die","url":"https://www.last.fm/music/Every+Time+I+Die","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/232eac1bafadb3f4e81c24e1cb8e3298.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/232eac1bafadb3f4e81c24e1cb8e3298.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/232eac1bafadb3f4e81c24e1cb8e3298.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/232eac1bafadb3f4e81c24e1cb8e3298.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/232eac1bafadb3f4e81c24e1cb8e3298.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/232eac1bafadb3f4e81c24e1cb8e3298.png","size":""}]},{"name":"Botch","url":"https://www.last.fm/music/Botch","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/96133a31e1a3474583975c563990540a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/96133a31e1a3474583975c563990540a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/96133a31e1a3474583975c563990540a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/96133a31e1a3474583975c563990540a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/96133a31e1a3474583975c563990540a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/96133a31e1a3474583975c563990540a.png","size":""}]}]},"tags":{"tag":[{"name":"mathcore","url":"https://www.last.fm/tag/mathcore"},{"name":"hardcore","url":"https://www.last.fm/tag/hardcore"},{"name":"experimental","url":"https://www.last.fm/tag/experimental"},{"name":"metalcore","url":"https://www.last.fm/tag/metalcore"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Dillinger+Escape+Plan/+wiki"}},"published":"10 Feb 2006, 13:42","summary":"The Dillinger Escape Plan is a band from Morris Plains, New Jersey, United States. The group originated in 1997 after the disbanding of Arcane, a hardcore punk trio consisting of Ben Weinman, Dimitri Minakakis, and Chris Pennie. The band performs a fast-tempo, technically proficient style of heavy music popularly known as mathcore. The band recorded their second EP with Relapse Records in 1998 entitled Under the Running Board. A year later, this was followed with the album Calculating Infinity <a href=\"https://www.last.fm/music/The+Dillinger+Escape+Plan\">Read more on Last.fm</a>","content":"The Dillinger Escape Plan is a band from Morris Plains, New Jersey, United States. The group originated in 1997 after the disbanding of Arcane, a hardcore punk trio consisting of Ben Weinman, Dimitri Minakakis, and Chris Pennie. The band performs a fast-tempo, technically proficient style of heavy music popularly known as mathcore. The band recorded their second EP with Relapse Records in 1998 entitled Under the Running Board. A year later, this was followed with the album Calculating Infinity, which was met with great acclaim from both underground and mainstream press. The band were renowned in the hardcore scene for the intensity of their performances, which have at times incorporated extensive light shows, fireworks, fire breathing, and other special effects.\n\nThe band’s lineup has changed over the years, in part due to a variety of injuries. Guitarist Ben Weinman and former drummer Chris Pennie have been present in many of the lineups. After the departure of vocalist Dimitri Minakakis in 2000, the band held a nationwide search and selected Greg Puciato as the new singer. The band has since released four full length albums with Puciato on vocals: 2004’s Miss Machine, 2007’s Ire Works, 2010's Option Paralysis, and 2013's One of Us Is the Killer.\n\nEarly years (1996–1998)\nThe band’s beginnings can be traced back to a hardcore band called Arcane. Previous to Arcane, Adam Doll, John Fulton and Chris Pennie played together in the bands Samsara and Malfactor from 1992–1997. Managed by longtime friend Tom Apostolopoulos and guitarist Ben Weinman, Arcane recorded a self-titled demo under the name The Dillinger Escape Plan which Now or Never Records offered to release on CD. Shortly before their first tour under the new name, guitarist Derek Brantley left the group and was replaced by John Fulton.\nThe band gained notoriety in the hardcore scene for the intensity of their performances. This notoriety drew the attention of Relapse Records representatives, who attended one of the band’s shows in Pennsylvania, ultimately resulting in the signing of a multi-record deal. The band recorded Under the Running Board on Relapse, but shortly after its release, Fulton left the band.\n\nCalculating Infinity (1999–2001)\nThe three-song EP release served to bolster anticipation for their 1999 full-length release, Calculating Infinity. Before the recording of Calculating Infinity, bassist Adam Doll was involved in a car accident that left him paralyzed from the chest down. The accident was a minor fender bender, but because Doll had leaned over to pick up a CD beneath the stereo, the accident caused a small fracture in his spine, inducing paralysis. Guitarist Weinman played both guitar and bass on the album, though liner notes credited Doll as providing a great deal of help.\nShortly before touring began for the new album, former Jesuit guitarist Brian Benoit auditioned for the band, taking the place of the departed John Fulton; Jeff Wood, former M.O.D. bassist, took the place of the injured Adam Doll. Calculating Infinity was met with great acclaim from both underground and mainstream press, even drawing the attention of former Faith No More vocalist Mike Patton, who asked Dillinger Escape Plan to tour with his band Mr. Bungle. Over time, their notoriously intense shows grew more so, incorporating samples, a light show, fireworks, fire breathing, and other antics.\nAfter several months of touring, including appearances on the Warped Tour and March Metal Meltdown, the band and Wood parted ways, with Wood moving on to his own project, Shat. Liam Wilson, also bassist for Starkweather, took his place. In 2000, Now or Never Records re-released the band’s self-titled EP with added bonus tracks. Later that same year, the band parted ways with Minakakis.\n\nIrony Is a Dead Scene (2002–2003)\nWithout a vocalist, The Dillinger Escape Plan began a nationwide search for a replacement via their website, releasing an instrumental version of “43% Burnt” from Calculating Infinity and inviting prospective vocalists to record and submit their own vocal tracks.\nIt was during this time period the band found itself in a transitory period, with no set future course. Among the band’s lead hopefuls was Andrew Field-Pickering of Redline and The Chase fame.\nWhile the search was underway, vocal duties were handled by a number of the band’s friends, including Sean Ingram of Coalesce and Mike Patton, who agreed to help the band produce an EP. The plan to record with Patton was in place before a replacement vocalist had been found. By the time Mike Patton had recorded vocals and the EP was released, the band had been touring with Minakakis’s replacement, Greg Puciato, for nearly a year.\nReleased in August 2002 via Epitaph Records, Irony Is a Dead Scene featured Weinman, Pennie, Benoit, Wilson, and Mike Patton on vocals, with ex-bassist Adam Doll helping with keyboards and samples. It marked Doll’s last appearance with the band. The four-song EP contained, among others, a cover of IDM artist Aphex Twin’s “Come to Daddy”. Buddyhead Records released a limited vinyl version.\n\nMiss Machine (2004–2005)\nIn late 2001, Dillinger Escape Plan met Greg Puciato, one of many would-be vocalists who had submitted a recording to the band. Puciato included both a faithful version of “43% Burnt” (in the style of Calculating Infinity) and the same song with his own personal spin. The band offered him the job after two practice sessions. He accepted, first appearing at the 2001 CMJ Music Festival in New York City. Soon after, Puciato and the band recorded two songs for a Black Flag tribute compilation.\nIn 2003, the band appeared on the soundtrack for the motion picture Underworld with the song “Baby’s First Coffin”, their first original song with Greg Puciato on vocals. They also recorded a cover of “My Michelle” for the Guns N’ Roses tribute album Bring You To Your Knees, released in March 2004.\nIn July 2004, Relapse Records released the band’s first full-length album with Puciato, entitled Miss Machine. Miss Machine sold 12,000 copies its first week, becoming the bands biggest selling release. The album polarized the Dillinger Escape Plan audience; some fans were critical of the band’s increasing artistic and musical departures from their earlier efforts, while others preferred them.\nFollowing the controversial release, Dillinger Escape Plan began a two year touring cycle, headlining tours of their own or occasionally providing support for acts such as Slipknot, System of a Down, and Megadeth. These tours were replete with injuries; in late 2004, guitarist Benoit suffered nerve damage (brachial plexus neuritis) in his left hand, and other than a short return to the stage in 2005, he has not played with the band since. Former Fenix TX guitarist James Love ended up playing most shows in the late 2004–2006 period. In 2005, the band was forced to drop out of Dave Mustaine’s “Gigantour” slightly early due to a rotator cuff injury guitarist Weinman sustained in a car accident, despite the best efforts of the bands touring masseur, Jason Hamacher (of Frodus Conglomerate International).\n\nPlagiarism (2005–2006)\nIn June 2006 the band released both an iTunes exclusive EP of cover songs entitled Plagiarism. The title is a reference to the fact that four of the EP’s six tracks are covers faithful to the original songs. And their first DVD, a short accompanying piece to Miss Machine (entitled Miss Machine: The DVD).\nFour shows before the end of the 2006 tour with Coheed, Weinman flew home for undisclosed personal reasons and the band played on for a while as a quartet.\nIn late 2006 the band contributed a track to We Reach: The Music Of The Melvins, a compilation tribute to The Melvins [6]. It would be their last recording with drummer and founding member, Chris Pennie.\n\nIre Works (2007–2009)\nIre Works was produced by Steve Evetts at his studio Omen Room in Los Angeles. Drums were recorded at Sonikwire Studios in Irvine, California. On June 15, the band announced the departure of Chris Pennie (now with Coheed and Cambria). Gil Sharone of Stolen Babies handled drum duties for the album. Ire Works was released on November 13, 2007. The album debuted on the Billboard 200 at #142 with 7,000 copies scanned, but was later corrected when it was revealed that Relapse somehow forgot to scan the pre-release album sales, which made the first week total actually around 11,000.\nAlso missing from the new line up was guitarist Brian Benoit who had left the band due to injury. Although assured his place in the band is secure should he ever be able to perform again, Jeff Tuttle (formerly of Heads Will Roll and Capture the Flag) will be taking his place on stage for the foreseeable future. Tuttle, however does not make an appearance on the record.\n\nOption Paralysis (2010-2012)\nOption Paralysis is the fourth full-length studio album by American mathcore band The Dillinger Escape Plan, released on March 23, 2010. After having fulfilled their contract with Relapse Records (and reportedly dissatisfied with Relapse's handling of their previous album, Ire Works), the band released the album through Party Smasher, Inc., their own new imprint in collaboration with French record label Season of Mist.  It marks the first Dillinger Escape plan release to feature Billy Rymer on drums, since Gil Sharone left the band in January 2009 due to the frequent touring schedule and to focus on his brother's band Stolen Babies.\n\nOne of Us Is the Killer (2013-Present)\nOne of Us Is the Killer is the fifth full-length studio album by American mathcore band The Dillinger Escape Plan, released on May 14, 2013.  The album is the second release under their Party Smasher, Inc. imprint, as well as release through Sumerian Records. Sumerian Records. It is also their second recording with drummer Billy Rymer. <a href=\"https://www.last.fm/music/The+Dillinger+Escape+Plan\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
