{"artist":{"name":"The Everly Brothers","mbid":"091ec508-877f-4e3c-92a3-10903bbbc7ad","url":"https://www.last.fm/music/The+Everly+Brothers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c9bfd651532f4d3eb73db6b2efa4d9ad.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c9bfd651532f4d3eb73db6b2efa4d9ad.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c9bfd651532f4d3eb73db6b2efa4d9ad.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9bfd651532f4d3eb73db6b2efa4d9ad.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9bfd651532f4d3eb73db6b2efa4d9ad.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9bfd651532f4d3eb73db6b2efa4d9ad.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"546816","playcount":"4835011"},"similar":{"artist":[{"name":"Eddie Cochran","url":"https://www.last.fm/music/Eddie+Cochran","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/06214e09bfaf4b8fb4638159f42072bf.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/06214e09bfaf4b8fb4638159f42072bf.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/06214e09bfaf4b8fb4638159f42072bf.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06214e09bfaf4b8fb4638159f42072bf.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06214e09bfaf4b8fb4638159f42072bf.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06214e09bfaf4b8fb4638159f42072bf.png","size":""}]},{"name":"Ricky Nelson","url":"https://www.last.fm/music/Ricky+Nelson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d09a5f067ddc4d8ba4d2db60a728d28c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d09a5f067ddc4d8ba4d2db60a728d28c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d09a5f067ddc4d8ba4d2db60a728d28c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d09a5f067ddc4d8ba4d2db60a728d28c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d09a5f067ddc4d8ba4d2db60a728d28c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d09a5f067ddc4d8ba4d2db60a728d28c.png","size":""}]},{"name":"The Drifters","url":"https://www.last.fm/music/The+Drifters","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4aedabc1e22c436db8b1d0d42f58a731.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4aedabc1e22c436db8b1d0d42f58a731.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4aedabc1e22c436db8b1d0d42f58a731.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4aedabc1e22c436db8b1d0d42f58a731.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4aedabc1e22c436db8b1d0d42f58a731.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4aedabc1e22c436db8b1d0d42f58a731.png","size":""}]},{"name":"Buddy Holly","url":"https://www.last.fm/music/Buddy+Holly","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4198418e52514c3185f858a4e35ad376.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4198418e52514c3185f858a4e35ad376.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4198418e52514c3185f858a4e35ad376.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4198418e52514c3185f858a4e35ad376.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4198418e52514c3185f858a4e35ad376.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4198418e52514c3185f858a4e35ad376.png","size":""}]},{"name":"Bobby Vee","url":"https://www.last.fm/music/Bobby+Vee","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3325df228bfc47339c983b41ea172d36.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3325df228bfc47339c983b41ea172d36.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3325df228bfc47339c983b41ea172d36.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3325df228bfc47339c983b41ea172d36.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3325df228bfc47339c983b41ea172d36.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3325df228bfc47339c983b41ea172d36.png","size":""}]}]},"tags":{"tag":[{"name":"oldies","url":"https://www.last.fm/tag/oldies"},{"name":"60s","url":"https://www.last.fm/tag/60s"},{"name":"rock n roll","url":"https://www.last.fm/tag/rock+n+roll"},{"name":"Rock and Roll","url":"https://www.last.fm/tag/Rock+and+Roll"},{"name":"pop","url":"https://www.last.fm/tag/pop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Everly+Brothers/+wiki"}},"published":"23 Feb 2006, 05:35","summary":"The Everly Brothers was an American (Muhlenberg County, Kentucky, USA) duo of singing brothers: Don and Phil, (Don Everly, born Isaac Donald Everly February 1, 1937, Brownie, Kentucky; Phil Everly, born Phillip Everly, January 19, 1939, Chicago, Illinois, died January 3, 2014, in Burbank, California). The pair of male siblings became top-selling country-influenced rock and roll performers, best known for their steel-string guitar playing and close harmony singing. <a href=\"https://www.last.fm/music/The+Everly+Brothers\">Read more on Last.fm</a>","content":"The Everly Brothers was an American (Muhlenberg County, Kentucky, USA) duo of singing brothers: Don and Phil, (Don Everly, born Isaac Donald Everly February 1, 1937, Brownie, Kentucky; Phil Everly, born Phillip Everly, January 19, 1939, Chicago, Illinois, died January 3, 2014, in Burbank, California). The pair of male siblings became top-selling country-influenced rock and roll performers, best known for their steel-string guitar playing and close harmony singing. Their greatest period of chart success came between 1957 and 1961. Overall, they had 35 US Billboard Top 100 singles, 26 in the top 40. They hold the record for the most US Top 100 singles by any duo. They were elected to the Rock and Roll Hall of Fame in 1986.\n\nDon, the older brother was born in Brownie, a now-defunct coal mining town located outside of Central City, Kentucky. Phil Everly was born in Chicago. The sons of country musicians, Margaret Embry and Isaac Milford (\"Ike\") Everly, Jr.,[1] the Everly Brothers grew up in Iowa. They performed with their parents on live radio and in small-market live shows in the midwest.\n\nIn addition to both being competent guitarists, the brothers used a style of close harmony singing in which each brother sang a tune that could often stand on its own as a plausible melody line. This is in contrast to classic harmony lines which, while working well alongside the melody, would sound strange if heard by themselves. One of the best examples of their close-harmony work is their recording of \"Devoted to You\".\n\nThe duo's approach to harmony singing had a strong influence on the rock and roll groups of the 1960s. For example, both The Beatles and The Beach Boys developed their early singing style by performing Everlys covers. The Beatles based the vocal arrangement of their song \"Please Please Me\" directly upon that of \"Cathy's Clown\".\n\nThe Everly Brothers recorded their own first single, \"Keep A' Lovin' Me,\" in 1956, under the aegis of Chet Atkins, but it flopped. However their next single, \"Bye Bye Love,\" (which had been rejected by 30 other acts, including Elvis Presley), became an across-the-board smash, reaching #2 on the pop charts, and #1 on both the Country, and the R & B charts. The song, written by the husband-and-wife songwriting team of Felice and Boudleaux Bryant, became the Everly Brothers' first million-seller.\n\nThey soon became known as the stalwarts of Archie Bleyer's Cadence Records label. Working with the Bryants, the harmonic duo had a number of hits in the U.S. and the UK, the biggest of which were \"Wake Up Little Susie,\" \"All I Have to Do Is Dream,\" and \"Bird Dog.\"\n\nIn 1960, when they signed with Warner Bros. Records, they continued to have hits. Their first with WB, 1960's \"Cathy's Clown,\" launched the brothers back to the top of the charts. It was released as number WB1, the first release in the United Kingdom by Warner Brothers Records. Other singles followed, such as \"Crying In The Rain\" (1963) and \"The Ferris Wheel\" (from 1964), but the years after 1962 saw the Everly Brothers selling many fewer records than before. Their enlistment in the United States Marine Corps in 1963, to meet military obligations, took them out of the spotlight immediately before The Beatles broke loose in the United States and changed the pop-music landscape.\n\nWarner Brothers released a \"Golden Hits\" album in 1962, which included their Warner Brothers hits, from \"Cathy's Clown\" to \"That's Old-Fashioned\" (their last Top 10 hit) in 1962. The 1964 album \"The Very Best Of The Everly Brothers\" included new versions of six of their Cadence hits (re-recorded in Nashville), along with six of the original Warner Brothers hits. Some of these re-recordings are sometimes played and mistaken for the originals, such as \"Devoted to You\" and \"Til I Kissed You.\" In 1963, Cadence released a more complete album of those original hits, titled \"15 Everly Hits.\"\n\nAfter their army experience the brothers regained a moderate level of success for a few more years. Singles and albums continued to be released. They had somewhat more success in Britain and Canada in that period. Some fans find their mid-60s music most impressive, the songs \"The Price of Love\" and \"Love Is Strange\" being good examples. The album title \"In Our Image\" referred to their influence on a new era of singers like the Beatles, who were inspired by their harmony. The album \"Two Yanks In England\" was recorded there with backup by the Hollies and is a reflection of their success there, and a gesture of camaraderie with the new wave. The album \"Roots\" is touted by some formal critics as superior, but from a music fan's standpoint it was not special. Their contract with Warner Bros lapsed after its ten years.\n\nThe duo split in 1973, but reformed in 1983 with a new album produced by Dave Edmunds. \"On the Wings of a Nightingale\", written by Paul McCartney for the brothers, became a hit single in both the US and UK, and their 1983 Reunion Concert at the Royal Albert Hall in London, which was instigated by English virtuoso guitarist Albert Lee (who was also the musical director), resulted in both a well-received CD and video. They then earned a final charting country-music hit with \"Born Yesterday.\"\n\nAt around the same time, Phil enjoyed some success as a soloist, with an album Phil Everly, recorded mainly in London, and including musicians such as Dire Straits guitarist Mark Knopfler, Rockpile drummer Terry Williams, and evergreen session keyboard player Pete Wingfield. \"She Means Nothing To Me\", featuring Cliff Richard as co-lead vocalist, was a Top 10 hit in the UK, and \"Louise\" reached the Top 50 in 1983. In 1994, a new recording of \"All I Have to Do Is Dream,\" featuring Cliff Richard and Phil sharing vocals, was a UK Top 20 hit.\n\nEven though the brothers have not produced any new studio albums since 1989's \"Some Hearts,\" they continue to tour and perform. Throughout their careers they have collaborated extensively with other performers, usually singing either backup vocals or duets. For example, Don Everly recorded a duet with Emmylou Harris in 1979, \"Everytime You Leave\", on her album \"Blue Kentucky Girl\" In 2006, Phil Everly sang a duet, \"Sweet Little Corrina\", with country singer Vince Gill on his much acclaimed album These Days.[6] He previously supplied harmony vocals on J.D. Souther's \"White Rhythm and Blues\" on his 1979 album \"You're Only Lonely\".\n\nThe Everly Brothers have had a total of 26 Billboard Top 40 singles. In 1986, they were among the first 10 artists inducted into the Rock and Roll Hall of Fame. In 1997, they were awarded the Grammy Lifetime Achievement Award. In addition, they were inducted into the Country Music Hall of Fame in 2001 and the Vocal Group Hall of Fame in 2004.[7] Their pioneering contribution to the genre has been recognized by the Rockabilly Hall of Fame. The Everly Brothers have a star on the Hollywood Walk of Fame at 7000 Hollywood Blvd. In 2004, Rolling Stone Magazine ranked The Everly Brothers #33 on their list of the 100 Greatest Artists of All Time [9]. They are also #43 on the list of UK Best selling singles artists of all time.\n\nThey were also accomplished songwriters, penning a number of their own hits, including \"Till I Kissed You\" (Don), \"Cathy's Clown\" (Don and Phil), and \"When Will I Be Loved\" (Phil). \"Cathy's Clown\" and \"When Will I Be Loved\" later became hits for Reba McEntire and Linda Ronstadt, respectively; (for the latter, the Everly Brothers even sang the back up chorus). Also, the Norwegian band a-ha covered \"Crying In The Rain\" in 1990 for their fourth album, East of The Sun, West of The Moon.\n\nThey still perform occasionally, despite having declared their retirement from both touring and the studio more than once. Most notably, they joined Simon and Garfunkel as the featured act in the Simon and Garfunkel reunion tour of 2003 and 2004. As a special tribute to the Everly Brothers, they were not the opening act, rather Simon and Garfunkel opened their own show and had the Everlys come out in the middle for three or four songs. For Paul Simon, it was not the first time he had performed prominently with his heroes. In 1986, The Everlys sang background vocals on the hit title track of Simon's landmark album Graceland.\n\nOn January 3, 2014, Phil Everly, a lifelong smoker, died in the Los Angeles suburb of Burbank at the age of 74. The cause of his death was complications attributed to chronic obstructive pulmonary disease. <a href=\"https://www.last.fm/music/The+Everly+Brothers\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
