{"artist":{"name":"The Exies","mbid":"97e3f316-ec68-47f2-b870-bb4bd0a61f08","url":"https://www.last.fm/music/The+Exies","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b88535be882d4790905da50b3a4fde5f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b88535be882d4790905da50b3a4fde5f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b88535be882d4790905da50b3a4fde5f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b88535be882d4790905da50b3a4fde5f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b88535be882d4790905da50b3a4fde5f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b88535be882d4790905da50b3a4fde5f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"317345","playcount":"3873336"},"similar":{"artist":[{"name":"Earshot","url":"https://www.last.fm/music/Earshot","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ed2972bc90c444ffb5ea9f85a7fc07f0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ed2972bc90c444ffb5ea9f85a7fc07f0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ed2972bc90c444ffb5ea9f85a7fc07f0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed2972bc90c444ffb5ea9f85a7fc07f0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed2972bc90c444ffb5ea9f85a7fc07f0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed2972bc90c444ffb5ea9f85a7fc07f0.png","size":""}]},{"name":"Smile Empty Soul","url":"https://www.last.fm/music/Smile+Empty+Soul","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c648e0d28a414d199cce6c94380d8548.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c648e0d28a414d199cce6c94380d8548.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c648e0d28a414d199cce6c94380d8548.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c648e0d28a414d199cce6c94380d8548.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c648e0d28a414d199cce6c94380d8548.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c648e0d28a414d199cce6c94380d8548.png","size":""}]},{"name":"The Veer Union","url":"https://www.last.fm/music/The+Veer+Union","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/910e9926dedb41edc1757f356fbbdb83.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/910e9926dedb41edc1757f356fbbdb83.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/910e9926dedb41edc1757f356fbbdb83.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/910e9926dedb41edc1757f356fbbdb83.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/910e9926dedb41edc1757f356fbbdb83.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/910e9926dedb41edc1757f356fbbdb83.png","size":""}]},{"name":"Evans Blue","url":"https://www.last.fm/music/Evans+Blue","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/30a3e942f9ab4156afba3b3732cc5ee5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/30a3e942f9ab4156afba3b3732cc5ee5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/30a3e942f9ab4156afba3b3732cc5ee5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/30a3e942f9ab4156afba3b3732cc5ee5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/30a3e942f9ab4156afba3b3732cc5ee5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/30a3e942f9ab4156afba3b3732cc5ee5.png","size":""}]},{"name":"Art of Dying","url":"https://www.last.fm/music/Art+of+Dying","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/74eabf6afb854b0a944c52ac8b1bbd4b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/74eabf6afb854b0a944c52ac8b1bbd4b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/74eabf6afb854b0a944c52ac8b1bbd4b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/74eabf6afb854b0a944c52ac8b1bbd4b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/74eabf6afb854b0a944c52ac8b1bbd4b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/74eabf6afb854b0a944c52ac8b1bbd4b.png","size":""}]}]},"tags":{"tag":[{"name":"alternative rock","url":"https://www.last.fm/tag/alternative+rock"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"post-grunge","url":"https://www.last.fm/tag/post-grunge"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"},{"name":"hard rock","url":"https://www.last.fm/tag/hard+rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Exies/+wiki"}},"published":"08 Jul 2006, 03:55","summary":"The Exies are a U.S. alternative rock band from Los Angeles, California. The band formed in 1997. Their name, \"The Exies,\" is short for \"The Existentialists.\" Their two Virgin Records releases, Inertia (2003) and Head for the Door (2004), have sold over 400,000 copies combined. On May 8th, 2007 The Exies released their fourth studio album titled \"A Modern Way of Living with the Truth\" with their single \"Different Than You\" already getting airplay. <a href=\"https://www.last.fm/music/The+Exies\">Read more on Last.fm</a>","content":"The Exies are a U.S. alternative rock band from Los Angeles, California. The band formed in 1997. Their name, \"The Exies,\" is short for \"The Existentialists.\" Their two Virgin Records releases, Inertia (2003) and Head for the Door (2004), have sold over 400,000 copies combined. On May 8th, 2007 The Exies released their fourth studio album titled \"A Modern Way of Living with the Truth\" with their single \"Different Than You\" already getting airplay. Their second (non-album) single is \"God We Look Good (Going Down In Flames)\", their latest single is titled \"These Are the Days\".\n\nThe band released their self-titled debut album in 2000 on Ultimatum Records. The album can be difficult to obtain, but can often be found on eBay. Many fans of the band have described this album as perhaps The Exies' best work.\n\nAfterwards the band signed to Virgin Records and in January 2003 they released their second album, Inertia. The album received wide distribution, and their first single, \"My Goddess\", received a fair amount of radio play.\n\nAfter touring for over a year in support of 2003's Inertia, the Exies returned to Los Angeles and wasted no time beginning work on new material. But rather than take a more-of-the-same or stick-to-what-works approach, the band set out to carve a new sound, one with more impact and intensity. The next album had to be fueled by the live energy of their shows, showcasing the band's presence on stage. On their latest release, Head For The Door, the Exies deliver.\n\n\"We really wanted to get back to basics on this album,\" says vocalist Scott Stevens. \"We had experimented quite a bit with programming, complex arrangements, and exorbitant amounts of tracks on Inertia, and just felt like this one should be more stripped down, more organic.\"\n\nSo the band recruited the talents of Grammy-winning rock producer Nick Raskulinecz (Foo Fighters, Velvet Revolver) to help hone the new songs. \"We're all huge Foo Fighters fans,\" recounts drummer Dennis Wolfe. \"He produced their last record, and that album was really blowing up big while we were out touring. We thought, 'Man, that's the sound we want--big drums and punchy, tight guitars, and obviously this guy knows how to get 'em.'\" The band clicked immediately with Nick at their first meeting, and went straight into pre-production in Los Angeles.\n\nCrafting a more aggressive, more forceful sound was a notion shared by all, but a concept that was largely born on the road. Fans would frequently comment on how the live show gave the music so much more power and energy, and the band set out to capture that in the studio. \"We learned a lot from that year on the road,\" says Stevens. \"We just felt we could simplify things and make them hit a little harder.\"\n\nThe twelve tracks which comprise \"Head For The Door\" feature the band at its edgiest, loudest, and most explosive. Big riffs and guitar solos abound, but nothing gets in the way of the melody or the message. Their first single \"Ugly\" showcases Stevens' dynamic vocal range as it moves from a whisper to a snarl, and contemplates both the ugliness within and all around us. \"It's partly about feeling ugly yourself and being unsettled inside,\" Stevens says. \"But the song is also about how we turn a blind eye to the unpleasant things we see every day, things that are disturbing yet so easy to ignore.\"\n\n\"What You Deserve\" charges out of the gate with bitter self-loathing and karmic retribution as the primary themes, while \"Hey You\" recalls an old friend bent on self-destruction. But it's not all doom and gloom for the Exies. The soaring, melodic chorus in \"Tired Of You\" makes everything seem right, and \"F.S.O.S.\" grooves with attitude and swagger. From start to finish, the album delivers sharp hooks, passionate performances, and a sense that the band has found its sound.\n\n\"We had a blast making this record,\" says guitarist David Walsh. \"We had a very clear idea of what we wanted going in, and Nick had the production chops to get it done. Now we just have to get it out there.\"\n\nThe Exies formed in the summer of 1997 in Los Angeles, the product of mutual friends and former members of various local bands who shared the same musical sensibilities. The first batch of songs came quickly and soon Stevens was shopping their demo around town, hoping for some label interest. Little did he know, it would be all about the shoes.\n\n\"I was working as a runner for a studio in L.A., and there was an industry guy there that I wanted to listen to our stuff,\" recalls the frontman. \"As I'm handing him the demo, he comments on how cool my shoes are, saying, 'Well, this demo's gotta be good, coming from someone with such good taste in shoes.' And sure enough, he passed it along to some friends and things just started taking off. Those shoes cost me a buck at a thrift store. Seriously.\"\n\nAs the A&R community started swirling around the band, they knew they were on to something, and eventually signed with independent Ultimatum Records. Their eponymous debut hit shelves in the spring of 2000, driven by the radio-friendly single \"Baby's Got A New Revelation.\" That's when things started getting difficult.\n\n\"Well, we had two big problems,\" says bassist Freddy Herrera. \"One, the label did not have a huge budget for touring or promotion, so the songs weren't taking off like they should, and we didn't get any major tours. Two, things with our original drummer weren't working out.\" It was during one of their lowest points on the road that the most unlikely of circumstances proved to be the turning point.\n\n\"Worst gig ever,\" recounts Stevens. \"We were playing this wretched club in Miami, with nothing but a few drunks and addicts hanging around. No soundman, and a dinky P.A. which we had to run ourselves from the stage. I mean, it was awful. So we did like six songs, and said 'Screw this.' As we were packing up, this guy comes up to us and says, 'I really like your band. You got a CD? I want to send it to somebody.'\"\n\nThat somebody was Grammy-winning producer and label head Matt Serletic. From that point on, things just got better and better for the Exies.\n\nAs soon as the band got back from the road, they set out to find a new drummer. A want-ad in the local music magazine caught Stevens' eye, and sure enough, it was for current drummer Dennis Wolfe. \"He was the first guy we called,\" says Walsh. \"Scott brought him a demo of 'My Goddess,' which sold him on the band. One phone call, one audition, one new drummer. That never happens.\"\n\nThe new lineup began rehearsing and writing relentlessly, yielding the body of work that would become Inertia. By the spring of 2001, the Exies had a new album's worth of material and a new record deal on a major label. \"What a difference a year makes,\" laughs Herrera. The band holed up in various L.A. studios for the rest of 2001 with Serletic at the console.\n\nReleased in January of 2003, Inertia launched the band into the mainstream with their break-through hit \"My Goddess.\" The song drew major rotation at rock radio nationwide, and the video careened to the top 10 at MTV2. Performances on David Letterman and Last Call With Carson Daly helped spread the word, and the Exies found themselves on the road for a year, sharing the stage with some of the biggest bands at the time. \"That year was nuts\", recalls Wolfe. \"You really start to appreciate a little quiet time at home once you've been on tour for a year. But I'm stoked to get back out there.\"\n\nCurrent members as of 2007\nScott Stevens - vocals, guitar (1997- present) \nFreddy Herrera - bass, vocals (1997- present) \nChris Skane - guitar, vocals (1997, 2006- present) \nHoss Wright- Drums\n\nPast members \nDavid Walsh - guitar (1997-2006) \nDennis Wolfe - drums (1997-2006)  <a href=\"https://www.last.fm/music/The+Exies\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
