{"artist":{"name":"The Five Stairsteps","mbid":"42700164-abe3-4b45-b627-f4c8deca5e82","url":"https://www.last.fm/music/The+Five+Stairsteps","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8dadc810995d4a4890f3bc2cc70f6027.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8dadc810995d4a4890f3bc2cc70f6027.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8dadc810995d4a4890f3bc2cc70f6027.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8dadc810995d4a4890f3bc2cc70f6027.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8dadc810995d4a4890f3bc2cc70f6027.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8dadc810995d4a4890f3bc2cc70f6027.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"196059","playcount":"904983"},"similar":{"artist":[{"name":"Redbone","url":"https://www.last.fm/music/Redbone","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/845dfbe7204d4c128411bdceb460d14b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/845dfbe7204d4c128411bdceb460d14b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/845dfbe7204d4c128411bdceb460d14b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/845dfbe7204d4c128411bdceb460d14b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/845dfbe7204d4c128411bdceb460d14b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/845dfbe7204d4c128411bdceb460d14b.png","size":""}]},{"name":"Marvin Gaye & Tammi Terrell","url":"https://www.last.fm/music/Marvin+Gaye+&+Tammi+Terrell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8489ef1082cc462f8450f189d4ca9a19.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8489ef1082cc462f8450f189d4ca9a19.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8489ef1082cc462f8450f189d4ca9a19.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8489ef1082cc462f8450f189d4ca9a19.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8489ef1082cc462f8450f189d4ca9a19.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8489ef1082cc462f8450f189d4ca9a19.png","size":""}]},{"name":"Sam & Dave","url":"https://www.last.fm/music/Sam+&+Dave","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1c5d77e129384fb59ffd97ceb323d6ef.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1c5d77e129384fb59ffd97ceb323d6ef.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1c5d77e129384fb59ffd97ceb323d6ef.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1c5d77e129384fb59ffd97ceb323d6ef.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1c5d77e129384fb59ffd97ceb323d6ef.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1c5d77e129384fb59ffd97ceb323d6ef.png","size":""}]},{"name":"The O'Jays","url":"https://www.last.fm/music/The+O%27Jays","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b12f08679b7c4e08ce2abe3ce9505726.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b12f08679b7c4e08ce2abe3ce9505726.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b12f08679b7c4e08ce2abe3ce9505726.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b12f08679b7c4e08ce2abe3ce9505726.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b12f08679b7c4e08ce2abe3ce9505726.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b12f08679b7c4e08ce2abe3ce9505726.png","size":""}]},{"name":"The Impressions","url":"https://www.last.fm/music/The+Impressions","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7d3fb24b9deb4e02a460b2d1126351f3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7d3fb24b9deb4e02a460b2d1126351f3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7d3fb24b9deb4e02a460b2d1126351f3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7d3fb24b9deb4e02a460b2d1126351f3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7d3fb24b9deb4e02a460b2d1126351f3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7d3fb24b9deb4e02a460b2d1126351f3.png","size":""}]}]},"tags":{"tag":[{"name":"soul","url":"https://www.last.fm/tag/soul"},{"name":"funk","url":"https://www.last.fm/tag/funk"},{"name":"northern soul","url":"https://www.last.fm/tag/northern+soul"},{"name":"oldies","url":"https://www.last.fm/tag/oldies"},{"name":"rnb","url":"https://www.last.fm/tag/rnb"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Five+Stairsteps/+wiki"}},"published":"11 Jan 2007, 23:38","summary":"The Five Stairsteps, known as \"The First Family of Soul\", were an rnb group from Chicago, Illinois  made up five of Betty and Clarence Burke Sr.'s six children: Alohe, Jean, Clarence Jr., James, Dennis, and Kenneth (or \"Keni\") as well as, briefly, Cubie. They are best known for the 1970 song \"O-o-h Child\", a soul hit that was listed #392 on Rolling Stone's list of the 500 Greatest Songs. The group was dubbed \"First Family of Soul\" because of their successful five-year chart run; the moniker was later passed on to The Jackson 5. <a href=\"https://www.last.fm/music/The+Five+Stairsteps\">Read more on Last.fm</a>","content":"The Five Stairsteps, known as \"The First Family of Soul\", were an rnb group from Chicago, Illinois  made up five of Betty and Clarence Burke Sr.'s six children: Alohe, Jean, Clarence Jr., James, Dennis, and Kenneth (or \"Keni\") as well as, briefly, Cubie. They are best known for the 1970 song \"O-o-h Child\", a soul hit that was listed #392 on Rolling Stone's list of the 500 Greatest Songs. The group was dubbed \"First Family of Soul\" because of their successful five-year chart run; the moniker was later passed on to The Jackson 5. Their work continues to receive major airplay.\n\nInitially a teenage five-member association made up of the children of Betty and Clarence Burke, the brothers and sister vocal group took on the title \"The Five Stairsteps\" from Mrs. Burke, who thought her kids looked like stair steps when lined up according to their age. The association featured lead singer Clarence Jr., Alohe, James, Dennis, and 13-year-old Kenneth (\"Keni\"). Most of the members attended Harlan High School. Clarence Sr. was a detective for the Chicago Police Department. He backed the group on bass guitar, managed them, and co-wrote songs with Clarence Jr. and Gregory Fowler.\n\nAfter winning first prize in a talent contest at the Regal Theater, The Five Stairsteps received recording contract offers. A close neighbor and family friend was Fred Cash of The Impressions, who introduced the group to Curtis Mayfield. Signed to Mayfield's Windy City imprint, which was distributed by the Philadelphia based Cameo Parkway record label, their first single was Gregory Fowler's ballad \"You Waited Too Long\" b/w \"Don't Waste Your Time,\" a Mayfield song. A double-sided hit in Chicago, the A-side, \"You Waited Too Long,\" charted number 16 in the Billboard R&B chart in spring of 1966. Around the end of 1967, Cameo-Parkway folded and Windy City switched to Buddah Records through former Cameo-Parkway executive Neil Bogart, who joined the new label as co-president. The group's second album, Family Portrait (complete with a montage of Burke family photos), was recorded and produced in Chicago by Clarence Jr. With the addition of their three-year-old brother, the group became The Five Stairsteps & Cubie. Family Portrait yielded two hit singles, \"Something's Missing\" and a cover of Jimmy Charles and the Revelletts' hit \"A Million to One.\" The group often toured with the Impressions. After signing with Buddah Records, the group was once again known as The Five Stairsteps.\n\nIn the spring of 1970, the group released their biggest hit, \"O-o-h Child\" (written by Stan Vincent), which hit number 14 R&B and number eight on the Billboard Hot 100. This disc sold over one million copies, and received a gold disc awarded by the R.I.A.A. on August 1970.[2] The flip side of the single, a cover of Lennon–McCartney's \"Dear Prudence,\" charted at number 49 R&B. The following year, the group resurfaced as The Stairsteps with two charting Buddah singles: \"Didn't It Look So Easy\" and \"I Love You-Stop.\"\n\nThe group appeared in the 1970 movie The Isley Brothers Live At Yankee Stadium, a documentary of a benefit concert filmed at the famous home of the New York Yankees featuring The Isley Brothers, The Brooklyn Bridge and various other Buddah Records affiliated artists. In the early 1970s, the group was known simply as The Stairsteps. Alohe was still with the group. Cubie never really sang with the group, but would grow up to be a popular dancer with the Dance Theater of Harlem etc. Billy Preston introduced The Stairsteps to The Beatles, and the group signed with George Harrison's Dark Horse label distributed by A&M Records. Alohe left the group in 1972 to begin a spiritual journey, and later would attend college, graduate and work at Emory University at which she was also a guest speaker.\n\nAn album, Second Resurrection, was released in February 1976, produced by Preston, Robert Margouleff, and the Stairsteps. \"From Us to You,\" written by Clarence Jr. and Keni Burke, was the group's biggest hit since \"Ooh Child,\" peaking at number ten R&B in early 1976. The follow-up single, \"Pasado\", also covered by the group Pockets, received airplay in Chicago, New York, and other markets. Keni sang, played bass, and wrote both songs on the third single, \"Tell Me Why\" b/w \"Salaam.\"s of All Time.\n\nAlohe changed her name to Ramijimar S. Habeeb-Ullah in 1980 in Oneonta, New York. Clarence Newton Burke, Jr. still writes and produces and has begun touring. James M. is drawing and painting. Dennis has a recording studio in his home. Keni is still writing and producing others and also has begun touring, and Cubie is teaching dance. In 1982, Cubie released the 12-inch single, \"Dance For Double\" on the Rissa Chrissa label. Clarence N. Burke, Sr. (Papa Stairstep) is a property manager and recently appeared in a play of Driving Miss Daisy. Plans for a possible reunion with at least 3 of the brothers are currently being discussed.\n\nOn May 26, 2013, it was reported by Keni Burke on WBLS Sunday Classics that Clarence Burke, Jr., had passed away.\n\n\nBefore assuming the name the Dramatics, the vocal sextet comprised of Rob Davis, Ron Banks, Larry Reed, Robert Ellington, Larry \"Squirrel\" Demps, and Elbert Wilkens initially released two singles as the Dynamics on the Wingate imprint that saw no chart action. The group became a quintet upon Ellington's exit, and also changed their name to the Dramatics. They migrated to the Sport label and in 1967 released their first single to hit the charts, \"All Because of You,\" which peaked at number 42 on the R&B charts. However, in spite of the exposure and limited record sales, some groupmembers became discouraged, which facilitated a major personnel change. William \"Wee Gee\" Howard replaced lead singer Reed, and Willie Ford of the Capitols replaced bass Rob Davis. Also during this time, the Dramatics had signed with producer Don Davis' production company. \n\n Even though the group managed to stay together, the ensuing years were unproductive for chart action and sales. Between 1967 and 1971, the Dramatics made very little noise on the national scene. By the end of 1971, Davis summoned the group to the studio to record producer/songwriter Tony Hester's \"Watcha See Is Watcha Get.\" The single was the Dramatics' first major national hit, peaking at number three on the R&B charts, and sustaining chart action for 15 weeks. That single was followed by the R&B Top Ten single \"Get Up and Get Down.\" \n\n The following year the Dramatics released \"In the Rain,\" which was also penned by Hester. The single torpedoed its way to the number one spot on the R&B charts, maintaining that position for four consecutive weeks; the single also peaked at number five on the pop charts. Ironically, in spite of the national attention the group was receiving, another personnel shuffle was simmering. \n\nLarry \"L.J.\" Reynolds, who had been a member of Chocolate Syrup and was pursuing a solo career during this time, met Dramatics member Banks at the Apollo following a performance by the group. It just so happened that Howard was absent that night. Reynolds auditioned for Banks backstage; it was not too long afterwards that Reynolds, who was also signed to Don Davis' production company, began to occasionally sit in with the Dramatics during Howard's absences. \n\n In 1973, Howard's decision to leave the group opened the door for Reynolds' entrance; Reynolds' vocal presence and permanent entry into the group was manifested with the release of the R&B Top Ten single \"Hey You! Get Off My Mountain.\" And while Reynolds was replacing Howard, Lenny Mayes was replacing Wilkens, which spelled out identity problems for the remainder of the group. Wilkens formed his own version of the Dramatics and began touring. During this time and pending legal procedures, the name of the group was changed to Ron Banks & the Dramatics. \n\n The Dramatics' success continued with mainly R&B Top 20 hits during the heyday of disco, cracking the R&B Top Ten just once more with \"Welcome Back Home\" in 1980. In 1981, Reynolds went solo; the group disband after Banks went solo in 1983. The group managed to stay active, reuniting to record new material every three or four years since the early '80s. They occasionally reunite for concert events. ~ Craig Lytle, Rovi <a href=\"https://www.last.fm/music/The+Five+Stairsteps\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
