{"artist":{"name":"The Jackson Southernaires","mbid":"4f91f760-85f6-4603-9b60-15789000e256","url":"https://www.last.fm/music/The+Jackson+Southernaires","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"2981","playcount":"19361"},"similar":{"artist":[{"name":"Slim & the Supreme Angels","url":"https://www.last.fm/music/Slim+&+the+Supreme+Angels","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d221f26d51ea4e298d9561a224bc868c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d221f26d51ea4e298d9561a224bc868c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d221f26d51ea4e298d9561a224bc868c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d221f26d51ea4e298d9561a224bc868c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d221f26d51ea4e298d9561a224bc868c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d221f26d51ea4e298d9561a224bc868c.png","size":""}]},{"name":"Lee Williams And The Spiritual QC's","url":"https://www.last.fm/music/Lee+Williams+And+The+Spiritual+QC%27s","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/11f72f89a39541ba8638d36b75c00858.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/11f72f89a39541ba8638d36b75c00858.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/11f72f89a39541ba8638d36b75c00858.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11f72f89a39541ba8638d36b75c00858.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11f72f89a39541ba8638d36b75c00858.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11f72f89a39541ba8638d36b75c00858.png","size":""}]},{"name":"Luther Barnes & The Sunset Jubilaires","url":"https://www.last.fm/music/Luther+Barnes+&+The+Sunset+Jubilaires","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3b132152b217417d8794e964fe2638d7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3b132152b217417d8794e964fe2638d7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3b132152b217417d8794e964fe2638d7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3b132152b217417d8794e964fe2638d7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3b132152b217417d8794e964fe2638d7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3b132152b217417d8794e964fe2638d7.png","size":""}]},{"name":"Eddie Ruth Bradford","url":"https://www.last.fm/music/Eddie+Ruth+Bradford","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/75bd6170b6d14c0fba5253c2dc8af9c1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/75bd6170b6d14c0fba5253c2dc8af9c1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/75bd6170b6d14c0fba5253c2dc8af9c1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/75bd6170b6d14c0fba5253c2dc8af9c1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/75bd6170b6d14c0fba5253c2dc8af9c1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/75bd6170b6d14c0fba5253c2dc8af9c1.png","size":""}]},{"name":"Neal Roberson","url":"https://www.last.fm/music/Neal+Roberson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4d2e5f54ad6c44a9a6611f5c227daed0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4d2e5f54ad6c44a9a6611f5c227daed0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4d2e5f54ad6c44a9a6611f5c227daed0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4d2e5f54ad6c44a9a6611f5c227daed0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4d2e5f54ad6c44a9a6611f5c227daed0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4d2e5f54ad6c44a9a6611f5c227daed0.png","size":""}]}]},"tags":{"tag":[{"name":"Traditional Gospel","url":"https://www.last.fm/tag/Traditional+Gospel"},{"name":"jackson southernaires","url":"https://www.last.fm/tag/jackson+southernaires"},{"name":"quartet gospel","url":"https://www.last.fm/tag/quartet+gospel"},{"name":"the jackson southernaires - stand up","url":"https://www.last.fm/tag/the+jackson+southernaires+-+stand+up"},{"name":"the jackson southernaries","url":"https://www.last.fm/tag/the+jackson+southernaries"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Jackson+Southernaires/+wiki"}},"published":"23 Jan 2009, 20:15","summary":"Huey Williams\n\nHuey (Paul) Williams, Sr., a native Mississippian, is the son of the late Leon “Pop” Williams and Mrs. Amanda Williams, who resides in Smithdale, Mississippi. Huey is thankful to God for being first in his life. He is especially grateful to God for having two loving parents who encouraged and pushed him forward in all of his efforts toward serving the Lord and making a meaningful profession of singing and praising God. He loves <a href=\"https://www.last.fm/music/The+Jackson+Southernaires\">Read more on Last.fm</a>","content":"Huey Williams\n\nHuey (Paul) Williams, Sr., a native Mississippian, is the son of the late Leon “Pop” Williams and Mrs. Amanda Williams, who resides in Smithdale, Mississippi. Huey is thankful to God for being first in his life. He is especially grateful to God for having two loving parents who encouraged and pushed him forward in all of his efforts toward serving the Lord and making a meaningful profession of singing and praising God. He loves his parents for bringing him and his siblings up in the church and keeping them on their knees and keeping God on their minds and in their hearts. Huey also thanks his immediate family - - wife Mamie Williams, son Huey Paul Williams II, and daughters Dee Dee, Wanda, Shononda and Joy for standing behind him in his gospel and spiritual endeavors. Huey began singing the gospel with his brothers during his early years, and although he is the only Williams of the original group started by his late Father, by God’s grace he has led the Southernaires to become one of the top gospel recording artist in the State of Mississippi, throughout the United States and abroad. Thanks to the radio and television angels who have stood beside the Southernaires through the good and the bad times, the Southernaires are still top performers in the gospel industry, and have remained in the top 20s on the gospel music charts. Fans young and old have always loved and bought the Southernaires music. Writing, arranging and singing is Huey Williams, Sr. Huey loves hunting and fishing when he is not on the move for Jesus, and thinks that he is pretty good at both. \n\nMaurice Surrell, Sr.\n\nMaurice Surrell, Sr. a.k.a. “The Godfather” of Quartet and Gospel Drummers, was born December 14, 1954, in Jackson, MS, he is the son of Mr. David Surrell Sr. (a former member of the Jackson Southernaires) and Mrs. Gloria Lea; he is a graduate of C.M. & I High School in Jackson, MS He began his career in 1968 at the age of 13 with the renowned Williams Brothers of Smithdale, Mississippi; he played drums and sang with themfor over 14 years. He joined the Jackson Southernaires in 1982 and has been a faithful member and drummer for over 20 years, he is also Assitant Manager, Business Manager, Secretary, Treasurer, Fasion Coordinator and Tenor Singer. He is also owner of LLERRUS Music Publishing. He ia a member of Word of Faith Christian Center where Bishop Kevin E. Wright is pastor; he is also a member of the Praise Team and Voices of Faith Choir. His motto is: “Have Faith in God, for with God, All things are possible” Maurice became one of Malaco Records in house studio drummers in the early 1980’s, his dexterity and showmanship as a percussionist has gained him signature drumsticks since the early 1990’s and he is currently pursuing an endorsement with a major drumstick company. He has achieved recognition for such Special Achievement awards as Mississippi Gospel Music Award (Musician of the Year), Gospel Music Workshop of America (Quartet Division Award), and the California State Assembly (Certificate of Recognition). His personal successes with the Southernaires are endless. Maurice is married to Janice Boyd-Surrell and he is the father of two, Maurice, Jr. and Erica Surrell. My advice to upcoming groups: “Seek ye first the Kingdom of God and his righteousness and all these things shall be added unto you” – Matthew 6:33 \n\nJames Burks\n\nJames Burks was born in Jackson, Mississippi, and at a young age moved to Milwaukee, Wisconsin. He was born into a family that God had anointed and blessed with various musical gifts. In the summer of 1967, James returned to Jackson. He was feeling a call on his life to use his gifts to help spread God’s word through song and praise. He is blessed to have musical talent, and is able to play both lead and bass guitars, and some keyboard also. He is also blessed to be a singer with the ability to sing in various voices. He first joined a local group but was not with them long before he was to become a Jackson Southernaire. He has been with the Southernaires for 34 years. Putting God first in his life has enabled him to continue on the glorious path. When at home, James enjoys attending church, fishing, other outdoor activities and just relaxing with his wife, family and friends. James thanks his family, fans, and friends for all of the years of support and prayers. God’s blessings are extended to you all. \n\nChris Forrest\n\nAll praises and glory be to God. Chris Forrest of Winona, Mississippi, was born December 18, 1973, and is the son of Reverend Jimmy L. Forrest and Minister Rosie L. Forrest. He was raised in the church, and is thankful to his parents for providing a loving and spiritual home during his childhood. He is especially grateful to God for allowing him to continue to follow after his godly teachings from his early stages of life until now. Chris’s parents introduced him to gospel music at a very early age. He began to follow his father at the age of two years old as he traveled with Willie Banks and the Messengers. By the age of three, Chris was playing drums for The Forrest Brothers quartet group, which was his first group he played for in the gospel music profession. Chris gives God the glory and praise, for he is still a vessel for God and still loves playing gospel music. Chris is the father of three beautiful daughters - - Ashley, Kirsten and Aniya. It has always been Chris’s lifelong dream to change the world, with his gift of music. Chris counts it a blessing and a privilege to be a part of the Jackson Southernaires Gospel organization. He also thanks the Jackson Southernaires for having faith in him as well as his God-given talent for music. \n\nTodd Vaughan\n\nTodd Vaughan, the son of Prentiss and Dorothy Vaughan, was born in Yazoo City, Mississippi May 17, 1980. Todd grew up in the church, and every Sunday he had to be in somebody’s church. During childhood Todd and his sister Dana would often play church at his grandmother’s house, so it is no surprise that he would be in church and playing gospel music. Todd has been playing music since the age of five. The first instrument that he learned was the drums. In 1996, God saw fit to give him another gift, which is playing the piano, his first gift being an ear for music. It has always been Todd’s dream to play for a top gospel group, never thinking it would come so soon. In November 2003, Todd was given the opportunity to play for the Jackson Southernaires, which later resulted in his becoming a musician for the Southernaires in February 2004. Todd thanks God for everything that has happened in his life, and he acknowledges that it is all because of God. He would also like to thank his parents, family, “Jlov” and friends for their support, and for never giving up his dreams. This is just the beginning of greater things to come. \n\nPaul Williams\n\nPaul Williams, aka Huey Paul Williams II, is the son of Huey Williams, Sr. and Mamie Williams, born September 16, 1970 in Jackson, Mississippi. He is also the grandson of the late Leon “Pop” Williams, father of the renowned Jackson Southernaires and the Williams Brothers and Mrs. Amanda Williams. Paul attended public school in Franklin County, but graduated from Crystal Springs High School in Crystal Springs, Mississippi. After graduating from High School, Paul enrolled in Alcorn State University, but decided that he would rather follow after and share in what he envisioned as a successful endeavor with his dad. Paul is married to Sharita Danett Williams and the proud father of three multi-talented children- -Huey “Little Paul”, III, Roderic Devine and Taylor Makallah Genae. Paul is the Bus Driver for the Jackson Southernaires and handles road and travel matters, booking and contracts for the Southernaires. He is the driving force behind the organization of the recording company known as “JS” Records, established before the latest recording of the Southernaires. He is also responsible for helping the Southernaires to realize a long-time dream of recording on their own label. He is the founder of Huey and Huey Entertainment, which is a joint venture of the Southernaires established in 2004, and operated by Paul and Sharita Williams in Smithdale, Mississippi. Paul is proud of the accomplishments that are unfolding for his dad and the Southernaires. He loves his parents, wife, children and siblings very much. He attributes his success, in part, to the support he receives all around from family. Paul believes that love, faith in God, and support of family are linked closely together, and all of them together equals true success. The greatest rewards outside of making it to heaven is seeing happiness and joy among those you love. God makes it all possible. <a href=\"https://www.last.fm/music/The+Jackson+Southernaires\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
