{"artist":{"name":"The Jordanaires","mbid":"42b93918-afa2-4f77-b231-b1244606900d","url":"https://www.last.fm/music/The+Jordanaires","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/975848f5d5114d959e23afc353c86fd5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/975848f5d5114d959e23afc353c86fd5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/975848f5d5114d959e23afc353c86fd5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/975848f5d5114d959e23afc353c86fd5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/975848f5d5114d959e23afc353c86fd5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/975848f5d5114d959e23afc353c86fd5.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"6832","playcount":"25174"},"similar":{"artist":[{"name":"Bobby Angelo & The Tuxedos","url":"https://www.last.fm/music/Bobby+Angelo+&+The+Tuxedos","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/31fcafd2b503400d83bb7260cfe08866.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/31fcafd2b503400d83bb7260cfe08866.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/31fcafd2b503400d83bb7260cfe08866.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31fcafd2b503400d83bb7260cfe08866.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31fcafd2b503400d83bb7260cfe08866.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/31fcafd2b503400d83bb7260cfe08866.png","size":""}]},{"name":"Billie Anthony","url":"https://www.last.fm/music/Billie+Anthony","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/65f1ba2a74e046e9943a09c6ac664b82.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/65f1ba2a74e046e9943a09c6ac664b82.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/65f1ba2a74e046e9943a09c6ac664b82.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/65f1ba2a74e046e9943a09c6ac664b82.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/65f1ba2a74e046e9943a09c6ac664b82.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/65f1ba2a74e046e9943a09c6ac664b82.png","size":""}]},{"name":"Shane Fenton & The Fentones","url":"https://www.last.fm/music/Shane+Fenton+&+The+Fentones","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/11fa1589298a4310986c15f0ca55991a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/11fa1589298a4310986c15f0ca55991a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/11fa1589298a4310986c15f0ca55991a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11fa1589298a4310986c15f0ca55991a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11fa1589298a4310986c15f0ca55991a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11fa1589298a4310986c15f0ca55991a.png","size":""}]},{"name":"Bobby Vee & The Crickets","url":"https://www.last.fm/music/Bobby+Vee+&+The+Crickets","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/aaf3040922b741269b75eee3e3f0f309.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/aaf3040922b741269b75eee3e3f0f309.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/aaf3040922b741269b75eee3e3f0f309.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aaf3040922b741269b75eee3e3f0f309.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aaf3040922b741269b75eee3e3f0f309.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aaf3040922b741269b75eee3e3f0f309.png","size":""}]},{"name":"The Mudlarks","url":"https://www.last.fm/music/The+Mudlarks","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9c752d6d112b450d9cca7b79b33d4990.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9c752d6d112b450d9cca7b79b33d4990.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9c752d6d112b450d9cca7b79b33d4990.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c752d6d112b450d9cca7b79b33d4990.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c752d6d112b450d9cca7b79b33d4990.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c752d6d112b450d9cca7b79b33d4990.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"oldies","url":"https://www.last.fm/tag/oldies"},{"name":"classic country","url":"https://www.last.fm/tag/classic+country"},{"name":"Elvis Presley","url":"https://www.last.fm/tag/Elvis+Presley"},{"name":"elvis comp","url":"https://www.last.fm/tag/elvis+comp"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Jordanaires/+wiki"}},"published":"17 Feb 2009, 13:30","summary":"Members\nThe group formed in 1948, with members Bill Matthews (first tenor), Bob Hubbard (second tenor/lead), Bill's brother Monty Matthews (baritone), Culley Holt (bass), and pianist Bob Money. After three years, Money was replaced by new pianist Gordon Stoker. This lineup lasted until 1952; at that time, Bob Hubbard was drafted and was replaced by Hoyt Hawkins. Later that year, Monty and Bill Matthews left. Hawkins switched to baritone, and new lead Neal Matthews, Jr. <a href=\"https://www.last.fm/music/The+Jordanaires\">Read more on Last.fm</a>","content":"Members\nThe group formed in 1948, with members Bill Matthews (first tenor), Bob Hubbard (second tenor/lead), Bill's brother Monty Matthews (baritone), Culley Holt (bass), and pianist Bob Money. After three years, Money was replaced by new pianist Gordon Stoker. This lineup lasted until 1952; at that time, Bob Hubbard was drafted and was replaced by Hoyt Hawkins. Later that year, Monty and Bill Matthews left. Hawkins switched to baritone, and new lead Neal Matthews, Jr. was recruited. Don Bruce came in as a new first tenor; however, he was drafted the next year. The group narrowed to a quartet, with Stoker taking over as first tenor.\n\nThe lineup changed again in 1954, with Cully Holt leaving and new bass Hugh Jarrett (later a disc jockey) coming in. Jarrett remained until 1958; at that time, he was replaced by Ray Walker. This lineup, consisting of Gordon Stoker, first tenor and manager, Neal Matthews, Jr., second tenor and lead, Hoyt Hawkins, baritone, and Ray Walker, bass, would be the group's most stable lineup, lasting throughout the 1960s and 70s.\n\nThe group changed again in 1982, when Hoyt Hawkins died. His replacement was Duane West, formerly of Sonny James' backup group, the Southern Gentlemen. The lineup remained constant for another two decades, with West leaving due to illness in 1999 (he died in 2002). His replacement was Louis Nunley.\n\nNeal Matthews died the next year. He was replaced by new lead Curtis Young.\n\nHugh Jarrett died at 78 on May 31, 2008, from injuries sustained in an auto accident in March.\n\n\nWith Elvis Presley\nOne Sunday afternoon in 1955, the Jordanaires played a show in Memphis with Eddy Arnold to publicize their new syndicated TV series Eddy Arnold Time (on the program the group used the name Gordonaires). They sang \"Peace In The Valley,\" and when the show was over, a young man, blond, quiet and courteous, with plenty of combed-back hair, came backstage to meet them. He was Elvis Presley, a practically unheard of singer just getting his start in the area. There were a few polite exchanges, then Presley said, \"If I ever get a recording contract with a major company, I want you guys to back me up.\" [1] He was on Sun Records at that time.\n\nOn January 10, 1956, Elvis recorded his first session for RCA with Scotty, Bill and D. J.. That day, \"I Got A Woman\", \"Heartbreak Hotel\" and \"Money Honey\" were recorded. True to his word, Elvis asked his new label RCA Victor if The Jordanaires could appear on the recordings. The next day Gordon Stoker was called by Chet Atkins to do a session with a new kid, named Elvis. RCA had also just signed \"The Speer Family\". Chet asked Gordon to sing with Ben and Brock Speer so he could use them. On that day, \"I'm Counting On You\" and \"I Was The One\" made history by being the first recording session that Elvis did with vocal background. By April 1956, \"Heartbreak Hotel\" was No. 1.\n\nAfter having done several more recording sessions in New York with Scotty, Bill and D. J., Elvis flew to Nashville on April 14, 1956, to record \"I Want You, I Need You, I Love You\". Gordon was called again, to sing a vocal trio with Ben and Brock. After the session, Elvis took Gordon aside and told him (not knowing, at the time, why all the Jordanaires were not there) that he had wanted \"The Jordanaires.\" This time, Stoker saw to it - and Elvis used the Jordanaires on nearly every one of his recording sessions for the next 14 years. At a time when no backing musicians, producers, or engineers received a name recognition on any records, Elvis insisted[citation needed] that he have \"with the Jordanaires\" on the label of his records. The reflected glory was enough to earn the Jordanaires \"Group of the Year\" awards well into the Beatles era.\n\nThey also appeared in Elvis' movies, and on many of his landmark television appearances.\n\n\nMusical influence\nThe Jordanaires have been one of country music's premier backup vocal groups, working with artists such as Patsy Cline, Johnny Horton, Ferlin Husky, Tammy Wynette, Kenny Rogers, Tennessee Ernie Ford, Dolly Parton, Red Foley, Jim Reeves, Willie Nelson, and George Jones. They also served as backup vocalists for pop music artists such as Steve Lawrence & Eydie Gorme, Connie Francis and Julie Andrews.\n\nThey are best known across the world as the backup vocalists for a number of Elvis Presley's hit singles, with whom they performed for more than fifteen years and backed up on well over 100 different songs (singles and album cuts, on television and in a number of films). In addition to singing backup for other musicians, the group toured extensively around the world plus they recorded a number of music albums on their own, They continue to record: \"On The Jericho Road\", A Friend We Have in Jesus and others.\n\n\nSpecial Guests\nThe Jordainaires have been appreciated by a whole new generation and performed with many modern recording artists as well as recent sessions with Country music legends.\n\nAppear on multiple tracks of Johnny Cash's 1978 album I Would Like To See You Again.\n\nThey sang the harmonies on Ringo Starr's second album, Beaucoups of Blues. \nThe Jordanaires also provided vocal support for Ricky Nelson on \"Poor Little Fool,\" \"Lonesome Town,\" \"It's Late,\" and other hit recordings. \nThe Jordanaires appear on the second album by The Grascals, on the song \"Did You Forget God Today?\" \nSung with The Tractors (of Steve Ripley) \nIn 1996. they lent their vocal talents to the Ween album, 12 Golden Country Greats. \nIn 1997, they sang Who'll Be The One If Not Me for the off-Broadway musical Violet. \nIn 2007, they recorded \"Save Your Dreams\" by Americana artist Shark (Wild Colonials) \nIn 2006 & 2007 they are featured on Park Lane Drive Records. Friends of Henry Golis Wish You A Merry Christmas with The Jordanaires & Henry Golis Presents Good Music With Friends featuring The Jordanaires. \n\nAwards\nGrammy Award in the category of Best Southern, Country, or Bluegrass Album. \nSpecial awards from RCA for contributions Elvis Presley's Recordings \nNashville Music Association Masters Award \nNational Academy of Recording Arts and Sciences award for having sung on more, top-ten recordings than any other group. \nMembers of world famous Grand Ole Opry for 13 years. \nRecognized for eight years, by readers of England's Record Mirror and New Musical Express magazines as one of the world's top ten vocal groups. \ninducted, in 1998, into the Gospel Music Hall of Fame. \ninducted, in 1998, into the Country Music Hall of Fame. \ninducted, in 1999, into the NACMAI Hall Of Fame (North America Country Music Associations International). \ninducted, in 2000, into the Rockabilly Hall Of Fame. \ninducted, in 2004, into The Vocal Group Hall of Fame. \ninducted,in 2007 into the Southern Legends Entertainment & Performing Arts Hall of Fame \ninducted in 2007 into the \"Christian Music Hall Of Fame\" \nGordon Stoker-inducted in 2006 into the \"SOUTHERN GOSPEL PIANO ROLL OF HONOR\"** \n <a href=\"https://www.last.fm/music/The+Jordanaires\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
