{"artist":{"name":"Big Joe Turner","mbid":"b123ba15-c4a5-4281-8117-2e57f8f02496","url":"https://www.last.fm/music/Big+Joe+Turner","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/575ba9f646abe05438b41087c7c6fd0a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/575ba9f646abe05438b41087c7c6fd0a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/575ba9f646abe05438b41087c7c6fd0a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/575ba9f646abe05438b41087c7c6fd0a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/575ba9f646abe05438b41087c7c6fd0a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/575ba9f646abe05438b41087c7c6fd0a.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"138611","playcount":"687676"},"similar":{"artist":[{"name":"Wynonie Harris","url":"https://www.last.fm/music/Wynonie+Harris","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bee9f085b30148ada1a7002c28e20620.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bee9f085b30148ada1a7002c28e20620.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bee9f085b30148ada1a7002c28e20620.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bee9f085b30148ada1a7002c28e20620.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bee9f085b30148ada1a7002c28e20620.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bee9f085b30148ada1a7002c28e20620.png","size":""}]},{"name":"LaVern Baker","url":"https://www.last.fm/music/LaVern+Baker","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0b17150db8ea4114b734c3966de38110.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0b17150db8ea4114b734c3966de38110.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0b17150db8ea4114b734c3966de38110.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0b17150db8ea4114b734c3966de38110.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0b17150db8ea4114b734c3966de38110.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0b17150db8ea4114b734c3966de38110.png","size":""}]},{"name":"Amos Milburn","url":"https://www.last.fm/music/Amos+Milburn","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8d3b1ede398d49ea9d00e270b23ff0f3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8d3b1ede398d49ea9d00e270b23ff0f3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8d3b1ede398d49ea9d00e270b23ff0f3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8d3b1ede398d49ea9d00e270b23ff0f3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8d3b1ede398d49ea9d00e270b23ff0f3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8d3b1ede398d49ea9d00e270b23ff0f3.png","size":""}]},{"name":"Chuck Willis","url":"https://www.last.fm/music/Chuck+Willis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a3569522d3f38c091e0b1243615a0591.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a3569522d3f38c091e0b1243615a0591.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a3569522d3f38c091e0b1243615a0591.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a3569522d3f38c091e0b1243615a0591.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a3569522d3f38c091e0b1243615a0591.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a3569522d3f38c091e0b1243615a0591.png","size":""}]},{"name":"Ruth Brown","url":"https://www.last.fm/music/Ruth+Brown","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2b8c548b4227454ab65cc50e2e8bfeb4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2b8c548b4227454ab65cc50e2e8bfeb4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2b8c548b4227454ab65cc50e2e8bfeb4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2b8c548b4227454ab65cc50e2e8bfeb4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2b8c548b4227454ab65cc50e2e8bfeb4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2b8c548b4227454ab65cc50e2e8bfeb4.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"rhythm and blues","url":"https://www.last.fm/tag/rhythm+and+blues"},{"name":"Rock and Roll","url":"https://www.last.fm/tag/Rock+and+Roll"},{"name":"jump blues","url":"https://www.last.fm/tag/jump+blues"},{"name":"jazz","url":"https://www.last.fm/tag/jazz"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Big+Joe+Turner/+wiki"}},"published":"25 Sep 2006, 07:00","summary":"Big Joe Turner (Joseph Vernon Turner Jr., Kansas City, Missouri, May 18, 1911 –  Inglewood, California, November 24, 1985) was an American blues shouter. \n\nAlthough he came to his greatest fame in the 1950s with his pioneering rock and roll recordings, particularly \"Shake, Rattle and Roll\", Turner's career as a performer stretched from the 1920s into the 1980s.\n(for stride pianist Joseph H. Turner (3.11.07-21.7.90) > Joe Turner)\n\nKnown variously as The Boss of the Blues <a href=\"https://www.last.fm/music/Big+Joe+Turner\">Read more on Last.fm</a>","content":"Big Joe Turner (Joseph Vernon Turner Jr., Kansas City, Missouri, May 18, 1911 –  Inglewood, California, November 24, 1985) was an American blues shouter. \n\nAlthough he came to his greatest fame in the 1950s with his pioneering rock and roll recordings, particularly \"Shake, Rattle and Roll\", Turner's career as a performer stretched from the 1920s into the 1980s.\n(for stride pianist Joseph H. Turner (3.11.07-21.7.90) > Joe Turner)\n\nKnown variously as The Boss of the Blues, and Big Joe Turner (due to his 6'2\", 300+ lbs stature), Turner was born in Kansas City and first discovered his love of music through involvement in the church. Turner's father was killed in a train accident when Joe was only four years old. He began singing on street corners for money, leaving school at age fourteen to begin working in Kansas City's club scene, first as a cook, and later as a singing bartender. He eventually became known as The Singing Barman, and worked in such venues as The Kingfish Club and The Sunset, where he and his piano playing partner Pete Johnson became resident performers. The Sunset was managed by Piney Brown. It featured \"separate but equal\" facilities for white patrons. Turner wrote \"Piney Brown Blues\" in his honor and sang it throughout his entire career.\n\nAt that time Kansas City was a wide-open town run by \"Boss\" Tom Pendergast. Despite this, the clubs were subject to frequent raids by the police, but as Turner recounts, \"The Boss man would have his bondsmen down at the police station before we got there. We'd walk in, sign our names and walk right out. Then we would cabaret until morning\".\n\nHis partnership with boogie-woogie pianist Pete Johnson proved fruitful. Together they headed to New York in 1936, where they appeared on a bill with Benny Goodman, but as Turner recounts, \"After our show with Goodman, we auditioned at several places, but New York wasn't ready for us yet, so we headed back to K.C.\". Eventually they were spotted by the talent scout, John H. Hammond in 1938, who invited them back to New York to appear in one of his \"From Spirituals to Swing\" concerts at Carnegie Hall, which was instrumental in introducing jazz and blues to a wider American audience.\n\nDue in part to their appearance at Carnegie Hall, Turner and Johnson scored a major hit with \"Roll 'Em Pete\". The track contained one of the earliest recorded examples of a back beat. It was a song which Turner recorded many times, with various combinations of musicians, over the ensuing years.\n\nIn 1939, along with boogie players Albert Ammons and Meade Lux Lewis, they began a residency at Café Society, a club in New York City, where they appeared on the same bill as Billie Holiday and Frank Newton's band. Besides \"Roll 'Em, Pete\", Turner's best-known recordings from this period are probably \"Cherry Red\", \"I Want A Little Girl\" and \"Wee Baby Blues\".\n\nIn 1941, he headed to Los Angeles where he performed in Duke Ellington's revue Jump for Joy in Hollywood. He appeared as a singing policeman in a sketch called \"He's on the Beat.\" Los Angeles became his home base for a time, and in 1944 he worked in Meade Lux Lewis's Soundies musical films. Although he sang on the soundtrack recordings, he was not present for the filming, and his vocals were mouthed by comedian Dudley Dickerson for the camera. In 1945 Turner and Pete Johnson opened their own bar in Los Angeles, The Blue Moon Club.\n\nTurner made lots of records, not only with Johnson but with the pianists Art Tatum and Sammy Price and with various small jazz ensembles. He recorded on several record labels, particularly National Records, and also appeared with the Count Basie Orchestra. In his career, Turner successively led the transition from big bands to jump blues to rhythm and blues, and finally to rock and roll. Turner was a master of traditional blues verses and at the legendary Kansas City jam sessions he could swap choruses with instrumental soloists for hours.\n\nIn 1951, while performing with the Count Basie Orchestra at Harlem's Apollo Theater as a replacement for Jimmy Rushing, he was spotted by Ahmet and Nesuhi Ertegün, who signed him to their new recording company, Atlantic Records. Turner recorded a number of hits for them, including the blues standards, \"Chains of Love\" and \"Sweet Sixteen\". Many of his vocals are punctuated with shouts to the band members, as in \"Boogie Woogie Country Girl\" (\"That's a good rockin' band!\", \"Go ahead, man! Ow! That's just what I need!\" ) and \"Honey Hush\" (he repeatedly sings \"Hi-yo, Silver!\", probably in reference to The Treniers singing the phrase in their Lone Ranger parody \"Ride, Red, Ride\"). Turner's records shot to the top of the rhythm-and-blues charts; although they were sometimes so earthy that some radio stations wouldn't play them, the songs received heavy play on jukeboxes and records.\n\nTurner hit it big in 1954 with \"Shake, Rattle and Roll\", which not only enhanced his career, turning him into a teenage favorite, but also helped to transform popular music. The song is fairly raw, as Turner yells at his woman to \"get outa that bed, wash yo' face an' hands\" and comments that she's \"wearin' those dresses, the sun comes shinin' through!\" He sang the number on film in the 1955 theatrical feature Rhythm and Blues Revue.\n\nAlthough the cover version of the song by Bill Haley and His Comets, with the risqué lyrics incompletely cleaned up, was a bigger hit, many listeners sought out Turner's version and were introduced thereby to the whole world of rhythm and blues. Elvis Presley showed he needed no such introduction. His version of \"Shake, Rattle and Roll\" combined Turner's lyrics with Haley's arrangement, but was not successful as a single.\n\nIn addition to the rock 'n' roll songs, he found time to cut the classic Boss of the Blues album.\n\nAfter a number of hits in this vein, Turner left popular music behind and returned to his roots as a singer with small jazz combos, recording numerous albums in that style in the 1960s and 1970s. In 1966, Bill Haley helped revive Turner's career by lending him the Comets for a series of popular recordings in Mexico (apparently no one thought of getting the two to record a duet of \"Shake, Rattle and Roll\", as no such recording has yet surfaced). In 1977 he recorded a version of Guitar Slim's song, \"The Things I Used to Do\".\n\nIn the 1960s and 1970s he was reclaimed by jazz and blues, appearing at many festivals and recording for the impresario Norman Granz's Pablo label, once with his friendly rival, Jimmy Witherspoon. He also worked with the German boogie-woogie pianist Axel Zwingenberger.\n\nIt is a mark of his dominance as a singer that he won the Esquire magazine award for male vocalist in 1945, the Melody Maker award for best 'new' vocalist in 1956, and the British Jazz Journal award as top male singer in 1965. His career thus stretched from the bar rooms of Kansas City in the 1920s (at the age of twelve when he performed with a pencilled moustache and his father's hat), on to the European jazz music festivals of the 1980s.\n\nIn 1983, only two years before his death, Turner was inducted into the Blues Hall of Fame.\n\nHe died in Inglewood, California in November 1985, at the age of 74 of a heart attack, having suffered the earlier effects of arthritis, a stroke and diabetes. Big Joe Turner was posthumously inducted into the Rock and Roll Hall of Fame in 1987.\n\nTribute\nThe late, New York Times music critic Robert Palmer, said: \"...his voice, pushing like a Count Basie solo, rich and grainy as a section of saxophones, which dominated the room with the sheer sumptuousness of its sound.\n\n\n Most famous recordings\n\"Roll 'Em, Pete\" - 1938; (available in many versions over the years. Used for the million-dollar first scene in Spike Lee's film, Malcolm X).\n\"Chains Of Love\" - 1951 † (this was Turner's first million seller. The song was written by 'Nugetre' (words) - Ahmet Ertegün, Van Wallis (music), and the disc reached the million by 1954). \n\"Honey Hush\" - 1953 † \n\"Shake, Rattle and Roll\" - 1954 \n\"Flip Flop And Fly\" - 1955 † (has sold a million through the years. The song was written by Charles Calhoun and Turner, although credited to the latter's wife, Lou Willie Turner). \n\"Cherry Red\" - 1956 \n\"Corrine, Corrina\" - 1956 † (the fourth million seller...with adaption by J. Mayo Williams, Mitchell Parish and Bo Chatmon in 1932. This disc was #41, and spent 10 weeks in the Billboard chart).\n\"Wee Baby Blues\" - 1956; (a song Turner had been singing since his Kingfish Club days) \n\"Love Roller Coaster\" 1956 \n\"Midnight Special\" - 1957 \nTracks marked as † were million selling discs.\n\n Select discography\nBig Joe Rides Again (1956) \nThe Boss of the Blues (1956)\nBosses of the Blues, Vol. 1 (1969) \nTexas Style (1971) \nFlip, Flop & Fly (1972) \nLife Ain't Easy (1974) \nThe Trumpet Kings Meet Joe Turner (1974)\n  <a href=\"https://www.last.fm/music/Big+Joe+Turner\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
