{"artist":{"name":"The Mills Brothers","mbid":"fb1080d4-aaf7-430e-b588-6a6ce79e2eb3","url":"https://www.last.fm/music/The+Mills+Brothers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7fb3a2d59beb490b95a3f7faa835acdd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7fb3a2d59beb490b95a3f7faa835acdd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7fb3a2d59beb490b95a3f7faa835acdd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7fb3a2d59beb490b95a3f7faa835acdd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7fb3a2d59beb490b95a3f7faa835acdd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7fb3a2d59beb490b95a3f7faa835acdd.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"153571","playcount":"1121616"},"similar":{"artist":[{"name":"The Boswell Sisters","url":"https://www.last.fm/music/The+Boswell+Sisters","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6719b92f69a84354a0fab4bd21ff362e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6719b92f69a84354a0fab4bd21ff362e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6719b92f69a84354a0fab4bd21ff362e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6719b92f69a84354a0fab4bd21ff362e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6719b92f69a84354a0fab4bd21ff362e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6719b92f69a84354a0fab4bd21ff362e.png","size":""}]},{"name":"The Ink Spots","url":"https://www.last.fm/music/The+Ink+Spots","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5a18882ee5b24131bd0fb571cc7c75b0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5a18882ee5b24131bd0fb571cc7c75b0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5a18882ee5b24131bd0fb571cc7c75b0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a18882ee5b24131bd0fb571cc7c75b0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a18882ee5b24131bd0fb571cc7c75b0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a18882ee5b24131bd0fb571cc7c75b0.png","size":""}]},{"name":"The Andrews Sisters","url":"https://www.last.fm/music/The+Andrews+Sisters","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ed9feeb4d8434e6bb7111a53855b855f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ed9feeb4d8434e6bb7111a53855b855f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ed9feeb4d8434e6bb7111a53855b855f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed9feeb4d8434e6bb7111a53855b855f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed9feeb4d8434e6bb7111a53855b855f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ed9feeb4d8434e6bb7111a53855b855f.png","size":""}]},{"name":"Fred Astaire","url":"https://www.last.fm/music/Fred+Astaire","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3d3e19aa1e6d4a61a81f219be1daad60.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3d3e19aa1e6d4a61a81f219be1daad60.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3d3e19aa1e6d4a61a81f219be1daad60.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d3e19aa1e6d4a61a81f219be1daad60.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d3e19aa1e6d4a61a81f219be1daad60.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d3e19aa1e6d4a61a81f219be1daad60.png","size":""}]},{"name":"Tommy Dorsey","url":"https://www.last.fm/music/Tommy+Dorsey","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/60f16c2a5c354e799da6bbf236b92201.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/60f16c2a5c354e799da6bbf236b92201.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/60f16c2a5c354e799da6bbf236b92201.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/60f16c2a5c354e799da6bbf236b92201.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/60f16c2a5c354e799da6bbf236b92201.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/60f16c2a5c354e799da6bbf236b92201.png","size":""}]}]},"tags":{"tag":[{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"vocal jazz","url":"https://www.last.fm/tag/vocal+jazz"},{"name":"40s","url":"https://www.last.fm/tag/40s"},{"name":"30s","url":"https://www.last.fm/tag/30s"},{"name":"50s","url":"https://www.last.fm/tag/50s"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Mills+Brothers/+wiki"}},"published":"28 Sep 2006, 02:37","summary":"The Mills Brothers, sometimes billed as The Four Mills Brothers, were a U.S. jazz and pop vocal quartet.\n\nThe group was originally composed of four brothers all born in Piqua, Ohio: John Jr (1911-1936) basso and guitarist, Herbert (1912-1989) tenor, Harry (1913-1982) baritone, and Donald (1915-1999) lead tenor.  Their father owned a barber's shop, and founded a barbershop quartet called the Four Kings of Harmony.  As the boys grew older, they began <a href=\"https://www.last.fm/music/The+Mills+Brothers\">Read more on Last.fm</a>","content":"The Mills Brothers, sometimes billed as The Four Mills Brothers, were a U.S. jazz and pop vocal quartet.\n\nThe group was originally composed of four brothers all born in Piqua, Ohio: John Jr (1911-1936) basso and guitarist, Herbert (1912-1989) tenor, Harry (1913-1982) baritone, and Donald (1915-1999) lead tenor.  Their father owned a barber's shop, and founded a barbershop quartet called the Four Kings of Harmony.  As the boys grew older, they began singing in the choir of the Cyrene African Methodist Episcopal Church and in the Park Avenue Baptist Church in Piqua. After their lessons at the Spring Street Grammar School, they would gather in front of their father's shop on Public Square or at the corner of Greene and Main to sing and play the kazoo to passersby.\n\nThey entered an amateur contest at Piqua's Mays Opera House, but while on stage Harry discovered he had lost his kazoo. He cupped his hands to his mouth and imitated a trumpet. The success of his imitation led to all the brothers taking on instruments to imitate and created their early signature sound. John Jr accompanied the four-part harmony first with a ukulele and then a guitar. They practised imitating orchestras they heard on the radio. John, as the bass, would imitate the tuba, Harry, a baritone, imitated the trumpet, Herbert became the second trumpet, and Donald the trombone. They entertained on the Midwest theatre circuit, at house parties, tent shows, music halls, and supper clubs throughout the area, and became well known for their close harmonies, mastery of scat singing, and their ability to imitate musical instruments with their voices.\n\nIn 1928, after playing May's Opera House in Piqua between Rin Tin Tin features, the brothers accompanied the Harold Greenameyer Band to Cincinnati for an audition with radio station WLW. The band was not hired, but the Mills brothers were. With the help of Seger Ellis, WLW Cincinnati D.J. and a music legend of the 1920s, they quickly became local radio stars and got their major break when Duke Ellington and his Orchestra played a date in Cincinnati. When the youngsters sang for Duke, he called Tommy Rockwell at Okeh Records, who signed them and took the group to New York.\n\nIn September 1930, Ralph Wonders urged broadcasting executive William S. Paley, at CBS Radio in New York, to turn on his office speaker and listen to an audition of four young men. For the audition they were \"The Mills Brothers\", but they had been known by many other names. They were billed as \"The Steamboat Four\" when they sang for Sohio, and had been called the \"Four Boys and a Guitar\" on their Sunday shows. When Paley heard their performance, he immediately went downstairs and put them on the air. The next day, the Mills Brothers signed a three-year contract and became the first black group to have a network show on radio.\n\nTheir first recording for Brunswick Records, a cover of the Original Dixieland Jass Band standard \"Tiger Rag\" became a nationwide best-seller and a number-one hit on the charts in a version with lyrics by Harry DaCosta. Other hits followed: \"Goodbye Blues\", their theme song, \"Nobody's Sweetheart\", \"Ole Rockin' Chair\", \"Lazy River\", \"How'm I Doin'\", and others. They remained on Brunswick until late 1934, when they signed with Decca, where they stayed well into the 1950s. On all of their Brunswick records, as well as the early Deccas, the label stated:\n\n\"No musical instruments or mechanical devices used on this recording other than one guitar.\"\n\nThey were a hit on CBS in 1930–1931, particularly when they co-starred on the widely popular The Fleischmann's Yeast Hour hosted by Rudy Vallee. They had their own popular radio series in 1932–1933, one of the earliest built around a black act, billed as the \"Four Boys and a Guitar\".  Before their show announcers commonly explained to listeners that the only instrument was a guitar, as the vocal effects made many listeners think they were hearing a muted trumpet, saxophone, and string bass or tuba.\n\nThe Mills Brothers were sponsored by some of the largest advertisers in early radio; Standard Oil, Procter & Gamble, Crisco, and Crosley Radio. They began appearing in films. Their first, The Big Broadcast (1932) was an all-star radio revue that included Bing Crosby, Cab Calloway, and the Boswell Sisters. They also made three \"bouncing ball\" cartoon shorts for the Fleischer Brothers. In 1934, the brothers starred with Crosby for Woodbury Soap, and recorded their classics \"Lazy Bones\", \"Sweet Sue\", \"Lulu's Back in Town\", \"Bye-Bye Blackbird\", \"Sleepy Head\", and \"Shoe Shine Boy\". Their film appearances included Twenty Million Sweethearts (1934) and Broadway Gondolier (1935).\n\nIn 1934, The Mills Brothers became the first U.S. black musicians to give a command performance before British royalty. They performed at the Regal Theatre for a special audience: King George V, Queen Mary, and their mother. While performing in England, John Jr became ill. It took him months to recover from battling pneumonia. Before he was completely well, the brothers returned to England. John Jr once again became sick and died at the beginning of 1936.\n\nThe remaining brothers considered breaking up, but their mother told them John Jr would have wanted them to continue. They followed her suggestion and their father, John Sr, replaced John Jr as the baritone and tuba. At this time, Norman Brown joined the Brothers as their guitar player.\n\nThrough 1939 the group enjoyed remarkable success in Europe. In the period between John Jr's death and their return to the States, they re-recorded \"Lazy River\". It was followed by \"Someday You'll Want Me to Want You\", \"Swing Is the Thing\", \"Long about Midnight\", \"Organ Grinder's Swing\", and \"The Song is Ended\". They honoured Duke Ellington with a swing version of his \"Caravan\", and then produced a series of classic recordings: \"South of the Border\", which they performed in a tour of South America, along with \"Ain't Misbehavin'\", \"It Don’t Mean a Thing\", \"Jeepers Creepers\", \"Three Little Fishies\", and \"Basin Street Blues\".\n\nDuring this era, there was also a brief time when the group performed with a non‑family singer. Gene Smith served as a stand-in for one year when Harry was drafted into the Army. Although Smith's solo singing did not particularly resemble the group's usual sound, he was able to harmonise well until the fourth brother's return. Smith is very noticeable in a number of the Mills Brothers' film appearances.\n\nReturning to the States, the Brothers were anxious for a hit and recorded \"I'll be Around\" in 1943. Donald Mills chose \"Paper Doll\" as the B-side of the record. \"I'll Be Around\" became a popular hit, then a disk jockey turned the record over. \"Paper Doll\", recorded in fifteen minutes, sold six million copies and became the group's biggest hit.\n\nThe rise of rock and roll in the early 1950s did little to decrease the Mills Brothers' popularity. \"Glow Worm\" jumped to number one on the pop charts in 1952. The track also reached number ten in the U.K. singles chart in January 1953. \"Opus One\", an updated version of the Tommy Dorsey hit, was soon in the charts as well, followed by \"You're Nobody 'til Somebody Loves You\", \"The Jones Boy\", \"Yellow Bird\", \"Standing on the Corner\", and \"If I Had My Way\".\n\nIn 1957, John Sr, who was then sixty-eight, stopped touring with the group. As a trio, the Mills Brothers were frequent guests on The Jack Benny Show, The Perry Como Show, The Tonight Show, The Pat Boone Chevy Showroom, The Dean Martin Show, and The Hollywood Palace. A move from Decca to Dot Records brought a moderate 1958 hit, a cover of the Silhouettes' \"Get a Job\" that made explicit the considerable influence on doo-wop that the early Mills Brothers records had exerted. The Mills Brothers also charted \"Yellow Bird\" two years before Arthur Lyman's top-ten hit remake.\n\n\"Cab Driver\", recorded in 1968, was their last hit. It was written by songwriter C. Carson Parks, who also wrote \"Somethin' Stupid\", a hit the previous year for Frank Sinatra and his daughter Nancy.\n\nThe Mills Brothers' fiftieth anniversary in show business was celebrated in 1976 with a tribute at the Dorothy Chandler Pavilion in Los Angeles, hosted by Bing Crosby. At the time, Harry was now almost blind as a result of diabetes.\n\nAs a trio, Herbert, Harry, and Donald continued performing on the oldies circuit until Harry's death in 1982. Herbert and Donald continued until Herbert's death in 1989. Then Donald began performing with the third generation of the family, his son, John III. In 1998 the Recording Academy recognised the Mills family's contributions to popular music when it presented Donald, as the sole surviving member, with a Grammy Award for Lifetime Achievement.\n\nAfter Donald's death of pneumonia on the 13th November 1999, John III began touring under the name \"The Mills Brothers\" with Elmer Hopper, who had previously sung lead with Paul Robi's Platters.\n\nAltogether, the group recorded more than 2,000 recordings, selling more than fifty million copies and gaining them at least three dozen gold records. The Mills Brothers were inducted into The Vocal Group Hall of Fame in 1998.\n <a href=\"https://www.last.fm/music/The+Mills+Brothers\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
