{"artist":{"name":"The Oak Ridge Boys","mbid":"1089f50b-10c3-47ef-8b21-b0b899c827d8","url":"https://www.last.fm/music/The+Oak+Ridge+Boys","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6c3c0e9dd62a44e78baedca09046be7f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6c3c0e9dd62a44e78baedca09046be7f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6c3c0e9dd62a44e78baedca09046be7f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c3c0e9dd62a44e78baedca09046be7f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c3c0e9dd62a44e78baedca09046be7f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c3c0e9dd62a44e78baedca09046be7f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"56509","playcount":"440979"},"similar":{"artist":[{"name":"Alabama","url":"https://www.last.fm/music/Alabama","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5f44aad63b474bde90df895c85fc64a0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5f44aad63b474bde90df895c85fc64a0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5f44aad63b474bde90df895c85fc64a0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f44aad63b474bde90df895c85fc64a0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f44aad63b474bde90df895c85fc64a0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f44aad63b474bde90df895c85fc64a0.png","size":""}]},{"name":"Johnny Lee","url":"https://www.last.fm/music/Johnny+Lee","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/56c95c19a38846d09197b1f8ddca10e2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/56c95c19a38846d09197b1f8ddca10e2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/56c95c19a38846d09197b1f8ddca10e2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56c95c19a38846d09197b1f8ddca10e2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56c95c19a38846d09197b1f8ddca10e2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56c95c19a38846d09197b1f8ddca10e2.png","size":""}]},{"name":"The Statler Brothers","url":"https://www.last.fm/music/The+Statler+Brothers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2f714e4825d4484b815d7dd2791751f9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2f714e4825d4484b815d7dd2791751f9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2f714e4825d4484b815d7dd2791751f9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2f714e4825d4484b815d7dd2791751f9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2f714e4825d4484b815d7dd2791751f9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2f714e4825d4484b815d7dd2791751f9.png","size":""}]},{"name":"John Anderson","url":"https://www.last.fm/music/John+Anderson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/54ecb39151874f37a0eb299c69f3e89c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/54ecb39151874f37a0eb299c69f3e89c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/54ecb39151874f37a0eb299c69f3e89c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/54ecb39151874f37a0eb299c69f3e89c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/54ecb39151874f37a0eb299c69f3e89c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/54ecb39151874f37a0eb299c69f3e89c.png","size":""}]},{"name":"Randy Travis","url":"https://www.last.fm/music/Randy+Travis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/745f411a3ef44671b997989f59f3cebe.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/745f411a3ef44671b997989f59f3cebe.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/745f411a3ef44671b997989f59f3cebe.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/745f411a3ef44671b997989f59f3cebe.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/745f411a3ef44671b997989f59f3cebe.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/745f411a3ef44671b997989f59f3cebe.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"gospel","url":"https://www.last.fm/tag/gospel"},{"name":"classic country","url":"https://www.last.fm/tag/classic+country"},{"name":"christian","url":"https://www.last.fm/tag/christian"},{"name":"70s","url":"https://www.last.fm/tag/70s"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Oak+Ridge+Boys/+wiki"}},"published":"05 Nov 2007, 03:06","summary":"THE TRADITION CONTINUES ...    \n      \n Theirs is one of the most distinctive and recognizable sounds in the music industry. The four-part harmonies and upbeat songs of The Oak Ridge Boys have spawned dozens of country hits and a #1 pop smash, earned them Grammy, Dove, CMA and ACM awards and garnered a host of other industry and fan accolades. Every time they step before an audience, the Oaks bring 15 years of hits and 50 years of tradition to bear on a stage show widely acknowledged as among the most exciting anywhere. <a href=\"https://www.last.fm/music/The+Oak+Ridge+Boys\">Read more on Last.fm</a>","content":"THE TRADITION CONTINUES ...    \n      \n Theirs is one of the most distinctive and recognizable sounds in the music industry. The four-part harmonies and upbeat songs of The Oak Ridge Boys have spawned dozens of country hits and a #1 pop smash, earned them Grammy, Dove, CMA and ACM awards and garnered a host of other industry and fan accolades. Every time they step before an audience, the Oaks bring 15 years of hits and 50 years of tradition to bear on a stage show widely acknowledged as among the most exciting anywhere. And, each remains as enthusiastic about the process as they have ever been.\n\n\"When I go on stage, I get the same feeling I had the first time I sang with The Oak Ridge Boys,\" says lead singer Duane Allen. \"This is the only job I've ever wanted to have.\"\n\n\n\"Like everyone else in the group,\" adds bass singer extraordinaire Richard Sterban, \"I was a fan of the Oaks before I became a member. I'm still a fan of the group today. Being in The Oak Ridge Boys is the fulfillment of a lifelong dream.\"\n\n\nThe two, along with tenor Joe Bonsall and baritone William Lee Golden, comprise one of country's truly legendary acts. Their string of hits includes the pop chart-topper \"Elvira,\" as well as \"Bobbie Sue,\" \"Dream On,\" \"Thank God For Kids,\" \"American Made,\" \"I Guess It Never Hurts To Hurt Sometimes,\" \"Fancy Free,\" \"Gonna Take A Lot Of River\" and many others. They've scored ten gold, three platinum and one double platinum album, one double platinum single, and had more than a dozen national #1 singles.\n\n\nThe Oaks represent a tradition that extends back to 1943, before Hank Williams had a career. The original group, based in Knoxville, TN, began performing country and gospel music in nearby Oak Ridge where the atomic bomb was being developed. They called themselves the Oak Ridge Quartet, and they began regular Grand Ole Opry appearances in the fall of '45. In the mid-'50s, they were featured in Time magazine as one of the top drawing gospel groups in the nation.\n\n\nBy the late '60s, with more than 30 members having come and gone, they had a lineup that included Duane Allen, William Lee Golden, Noel Fox and Willie Wynn. Among the Oaks' many acquaintances in the gospel field were Bonsall, a streetwise Philadelphia kid who embraced gospel music wholeheartedly, and Sterban, who was singing in quartets and holding down a job as a men's clothing salesman. Both admired the distinctive, highly-popular Oaks.\n\n\n\"They were the most innovative quartet in gospel music,\" says Bonsall. \"They performed gospel with a rock approach, had a full band, wore bell-bottom pants and grew their hair long ... things unheard of at the time.\"\n\n\nThe four became friends, and when the Oaks needed a bass and tenor, in '72 and '73 respectively, Sterban and Bonsall got the calls. The group remained a highly popular mainstay on the gospel circuit, and it was there they refined the strengths that would soon make them such an across-the-board attraction.\n\n\n\"We did a lot of package shows,\" said Bonsall, \"and there was an incredible amount of competition. You had to blow people away to sell records and get invited back.\"\n\n\nTheir gospel sound had a distinct pop edge to it, and while it made for excitement and popularity, it also ruffled purist feathers and left promoters unsure about the Oaks' direction. Then, in 1975, the Oaks were booked to open a number of dates for Roy Clark, whose manager was floored by their abilities.\n\n\n\"He came backstage and told us we were three-and-a-half minutes ' meaning one hit record ' away from being a major act,\" says Bonsall. \"He said we had one of the most dynamic stage shows he'd ever seen, but that we had to start singing country songs.\"\n\n\nThey took his advice, and the result was a breakthrough.\n\n\n\"Those who came to country music with or after the New Traditionalists of the mid-'80s cannot possibly imagine the impact the Oaks had in 1977 when they lit up the sky from horizon to horizon with \"Y'All Come Back Saloon,\" said Billboard's Ed Morris, who added \"... the vocal intensity the group brought to it instantly enriched and enlivened the perilously staid country format. These guys were exciting.\"\n\n\nWithin a year, Paul Simon would tap them to sing backup for his hit \"Slip Slidin' Away,\" and they would go on to record with George Jones, Brenda Lee, Johnny Cash, Roy Rogers, Billy Ray Cyrus and others. They would appear before three presidents, produce one of the first country music videos (\"Easy,\" in 1977, which wasn't released in the U.S. but hit #3 in Australia), take part in the first headline tour of the USSR, and become one of the most enduringly-successful touring groups anywhere.\n\n\nThey did it with a consistently upbeat musical approach and terrific business savvy.\n\n\n\"We always look for songs that have lasting value and that are uplifting,\" says Allen. \"You don't hear us singing 'cheating' or 'drinking' songs, but 'loving' songs, because we think that will last. We also don't put music in categories, except for 'good' or 'bad.' When we get through with it, it's probably going to sound like an Oak Ridge Boys song no matter what it is.\"\n\n\nThey proved their business acumen in any number of ways, including such steps as declining the chance to sit on the couch during their many appearances on the Tonight Show.\n\n\n\"We said, 'If you're going to give us four minutes on the couch with Johnny, we'd rather have four minutes to give you another song that lets people know what got us here,'\" says Allen. \"We didn't get here talking; we got here singing,\" They also proved themselves to be capable and tireless advocates of charitable and civic causes, serving as spokesmen and/or board members of fundraisers for the Boy Scouts of America, the National Committee for Prevention of Child Abuse, Feed The Children, and many more.\n\n\nThe group's first personnel change in many years occurred in 1987 when Steve Sanders, who had been playing guitar in The Oaks Band, replaced William Lee as the baritone singer. Late in '95, Steve resigned from the Oaks and exactly one minute after midnight on New Year's Eve, Duane, Joe and Richard surprised the packed house at Holiday Star Theatre in Merrillville, IN, by welcoming William Lee on stage and back in group. The hitmakers were finally together again!\n\n\nThe Oaks' high-energy stage show remains the heart and soul of what they do, and they refine it several times a year, striving to keep it fresh well into the future.\n\n\n\"We're not willing to rest on our laurels,\" Golden says. \"That gets boring. As a group, we do things constantly to challenge ourselves, to try to do something different or better than the last time we did it.\"\n\n\n\"I feel like I can do what I do on stage just as good now as I could 20 years ago,\" says Bonsall. \"in fact, if anything, I'm in better shape now than I was 20 years ago. I plan to be rockin' my tail off out there as long as I'm healthy and don't look stupid doing it. The people who come out, who bring their families to see us, deserve everything I've got.\"\n\n\n\"We've experienced a lot of longevity,\" adds Sterban, \"and I think the reason is the love we have for what we do - the desire, the longing to actually get up there and do it. We love to sing together ... to harmonize together. It's what our lives are all about.\"\n  \n \n <a href=\"https://www.last.fm/music/The+Oak+Ridge+Boys\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
