{"artist":{"name":"The Perrys","mbid":"3fb669c6-ab73-44f8-b2d5-52a5fde6f494","url":"https://www.last.fm/music/The+Perrys","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ea9884cbc0504c2a985d80eaed4fbe21.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ea9884cbc0504c2a985d80eaed4fbe21.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ea9884cbc0504c2a985d80eaed4fbe21.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ea9884cbc0504c2a985d80eaed4fbe21.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ea9884cbc0504c2a985d80eaed4fbe21.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ea9884cbc0504c2a985d80eaed4fbe21.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"4822","playcount":"72951"},"similar":{"artist":[{"name":"Florida Boys","url":"https://www.last.fm/music/Florida+Boys","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/361250c3a6b240a0881bf12312eca9fe.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/361250c3a6b240a0881bf12312eca9fe.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/361250c3a6b240a0881bf12312eca9fe.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/361250c3a6b240a0881bf12312eca9fe.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/361250c3a6b240a0881bf12312eca9fe.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/361250c3a6b240a0881bf12312eca9fe.png","size":""}]},{"name":"Hoppers","url":"https://www.last.fm/music/Hoppers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8b56a1044b8c4baba64a620c9bba0d63.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8b56a1044b8c4baba64a620c9bba0d63.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8b56a1044b8c4baba64a620c9bba0d63.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8b56a1044b8c4baba64a620c9bba0d63.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8b56a1044b8c4baba64a620c9bba0d63.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8b56a1044b8c4baba64a620c9bba0d63.png","size":""}]},{"name":"Legacy Five","url":"https://www.last.fm/music/Legacy+Five","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/935a2700e0774c2b8935de0566cc470a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/935a2700e0774c2b8935de0566cc470a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/935a2700e0774c2b8935de0566cc470a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/935a2700e0774c2b8935de0566cc470a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/935a2700e0774c2b8935de0566cc470a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/935a2700e0774c2b8935de0566cc470a.png","size":""}]},{"name":"Booth Brothers","url":"https://www.last.fm/music/Booth+Brothers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/881fdf760b5647dd97c2a300fe0e5ea5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/881fdf760b5647dd97c2a300fe0e5ea5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/881fdf760b5647dd97c2a300fe0e5ea5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/881fdf760b5647dd97c2a300fe0e5ea5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/881fdf760b5647dd97c2a300fe0e5ea5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/881fdf760b5647dd97c2a300fe0e5ea5.png","size":""}]},{"name":"Palmetto State Quartet","url":"https://www.last.fm/music/Palmetto+State+Quartet","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1aad7e127b534317b190a52c91bbf18d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1aad7e127b534317b190a52c91bbf18d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1aad7e127b534317b190a52c91bbf18d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1aad7e127b534317b190a52c91bbf18d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1aad7e127b534317b190a52c91bbf18d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1aad7e127b534317b190a52c91bbf18d.png","size":""}]}]},"tags":{"tag":[{"name":"Southern Gospel","url":"https://www.last.fm/tag/Southern+Gospel"},{"name":"The Perrys","url":"https://www.last.fm/tag/The+Perrys"},{"name":"hymn","url":"https://www.last.fm/tag/hymn"},{"name":"christian","url":"https://www.last.fm/tag/christian"},{"name":"Christian Music","url":"https://www.last.fm/tag/Christian+Music"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Perrys/+wiki"}},"published":"03 May 2010, 16:23","summary":"The Perrys are a professional Southern Gospel quartet based in Gallatin, TN.\n\nThe group formed on December 25, 1970 with Randy Perry and his sisters Debbie and Libbi in Georgia. In the mid-80's, the group signed with former pianist for the Happy Goodman Family, Eddie Crook on his, then new, Morning Star Records label. Also during this time Libbi met and married Tracy Stuffle who would become the group's bass singer.\n\nEventually Debbie left the group to rear her family and the Perrys were joined by soprano singer Denise Helton. <a href=\"https://www.last.fm/music/The+Perrys\">Read more on Last.fm</a>","content":"The Perrys are a professional Southern Gospel quartet based in Gallatin, TN.\n\nThe group formed on December 25, 1970 with Randy Perry and his sisters Debbie and Libbi in Georgia. In the mid-80's, the group signed with former pianist for the Happy Goodman Family, Eddie Crook on his, then new, Morning Star Records label. Also during this time Libbi met and married Tracy Stuffle who would become the group's bass singer.\n\nEventually Debbie left the group to rear her family and the Perrys were joined by soprano singer Denise Helton. During this time the Perrys experienced enormous growth in their popularity with such songs as \"I Remember The Day\", \"I'll Go On\", \"The Mountain\", \"He Knows How\", \"Get Involved\", \"This Is Just What Heaven Means To Me\" (a remake of a classic Happy Goodman Family song) and \"The Rock of Ages\".\n\nIn the mid-90's, shortly after the release of the very popular \"Grace\" album, Randy Perry left the road to concentrate more on evangelistic work and Denise Helton would also leave the group to pursue other ventures. Nicole Watts and Barry Scott would come in to fill these spots. Barry Scott soon left the group and was replaced by Mike Bowling, a former member of the New Hinsons. In 1997, the group made a record label transition from their home of a dozen years, MorningStar Records, to Daywind records owned by Dottie Leonard Miller. They also signed an exclusive booking agreement with Harper and Associates. Their debut album on Daywind, \"Crossings\", included their first two #1 songs on the Singing News charts, \"Not Even a Stone\" and \"By Faith I Can Touch Him Now.\"\n\nMike would also leave to join with the The Crabb Family and also pursue his own solo career; and Nicole Watts married and departed the group shortly after Mike's departure. David Hill joined the Perrys and held the lead position for approximately nine months. His only album with the group was, \"Absolutely, Positively, Live!\", which featured the #1 hit, \"Praise God, It's Settled, I'm Saved.\" Loren Harris, formerly of the Wilburns, took the lead position shortly afterward. After Nicole's departure, this time marked a turning point for the Perrys.\n\nHaving always been a quartet consisting of two females and two males, the group was faced with a decision that many had been anticipating for some time. The group decided to not fill the position of Nicole Watts with another soprano but to turn that position over to a male- hence the hiring of baritone Curt Davis.The group has since became a 3 male, one female group and has gained very high status in the southern gospel community. After the departure of group pianist Dennis Horton in 2000, Adam Harman joined the group. Adam departed the group in 2002 to join the Dollywood based quartet, the Kingdom Heirs. It was during this time that the Perrys had their fourth #1 song, \"I Rest My Case at the Cross\" written by the great master songwriter Kyla Rowland. Justin Ellis, formerly of the Accords, took the pianist position and remained with the group until July 2004. In August 2003, Curt Davis resigned his baritone position with the Perrys. After the fill-in from the Perrys' producer Wayne Haun including National Quartet Convention 2003, the Perrys hired Joseph Habedank for the baritone position. Soon after Joseph Habedank joined the group, patriarch of the Perrys, George Perry, died in November 2003. Though this was a time of testing for Libbi and all of the Perrys, they managed to keep on singing for God's kingdom. After the departure of Justin Ellis to perform with the Crabb Family, the Perrys hired Matthew Holt as the group's pianist in September 2004 at the National Quartet Convention. It was around this time that the Perrys had their fifth and latest #1 song, \"I Wish I Could Have Been There.\" Mr. Holt was hired as pianist approximately one day before the Perrys were awarded their first Singing News Fan Award for Favorite Mixed Quartet of the Year.\n\nFans and the Southern Gospel Music industry showed the Perrys support for their hard work by honoring them Singing News Fan Awards for the 2004, 2005, and 2006 Mixed Quartet Of The Year. The Perrys also received the Harmony Honors Awards for Favorite Album of the Year, This Is the Day, and for Favorite Song of the Year, I Wish I Could Have Been There written by Wayne Haun and Joel Lindsey. Libbi Perry Stuffle was awarded Singing News Fan Awards for the 2005 Female Vocalist and Alto Singer Of The Year and the 2006 Alto Singer of the Year. The Perrys were also awarded the Singing News Fan Award for Album of the Year in 2006 for their album Remembering the Happy Goodmans.\n\nIn August of 2006, the Perrys announced that longtime lead vocalist, Loren Harris, had resigned his position with the group in order to spend more time at home with his family. The decision was made by the Perrys to move Joseph Habedank to the vacant lead position and bring in Nick Trammell (son of legendary baritone Mark Trammell) to fill the baritone position. The first recording, entitled \"Look No Further\", under the new line-up was released in September 2007 at the National Quartet Convention. In addition to the release of the album, Nick Trammell received the Horizon Individual award by the Singing News Fans for 2007. Several months later in July 2008, Matthew Holt announced his departure from the group to pursue other interests. Bryan Elliott, formerly of the Anchormen and the Palmetto State Quartet, joined the Perrys as pianist in August 2008. His first concert with the group was August 8, 2008.\n\nIt was announced February 24 that Nick Trammell was departing as baritone singer. Former sound engineer Troy Peach was hired as Trammell's replacement. After Troy joined the vocal lineup of the Perrys, the group began work on a new album for Daywind Records. The album, \"Almost Morning\", features songs from the pens of Joseph Habedank, Rodney Griffin, Lonnie Combs, Kyla Rowland, Matthew Holt, Joel Lindsey, and Wayne Haun. Little did the group know that the first single, \"If You Knew Him\", would land the #1 position for December 2009 according to the Singing News magazine. In the meantime while at the 2009 National Quartet Convention, Libbi Perry Stuffle and Joseph Habedank were voted Favorite Alto and Favorite Young Artist respectively in the 2009 Singing News Fan Awards.\n <a href=\"https://www.last.fm/music/The+Perrys\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
