{"artist":{"name":"Big Mike Griffin","mbid":"4d8163d2-e020-40c3-bf45-d6532e3cd44f","url":"https://www.last.fm/music/Big+Mike+Griffin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3a20e539de3a4c44b8138281d3404849.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3a20e539de3a4c44b8138281d3404849.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3a20e539de3a4c44b8138281d3404849.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a20e539de3a4c44b8138281d3404849.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a20e539de3a4c44b8138281d3404849.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a20e539de3a4c44b8138281d3404849.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"2000","playcount":"14011"},"similar":{"artist":[{"name":"Miller Brothers Band","url":"https://www.last.fm/music/Miller+Brothers+Band","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Rose City Kings","url":"https://www.last.fm/music/Rose+City+Kings","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/95f2996f177b4de5ab6725f02e0efa62.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/95f2996f177b4de5ab6725f02e0efa62.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/95f2996f177b4de5ab6725f02e0efa62.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95f2996f177b4de5ab6725f02e0efa62.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95f2996f177b4de5ab6725f02e0efa62.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95f2996f177b4de5ab6725f02e0efa62.png","size":""}]},{"name":"Jeff Scheetz Band","url":"https://www.last.fm/music/Jeff+Scheetz+Band","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/76713854ad4046c79df5530695c07d46.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/76713854ad4046c79df5530695c07d46.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/76713854ad4046c79df5530695c07d46.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76713854ad4046c79df5530695c07d46.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76713854ad4046c79df5530695c07d46.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/76713854ad4046c79df5530695c07d46.png","size":""}]},{"name":"The Bluescasters","url":"https://www.last.fm/music/The+Bluescasters","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2b4528afc2d1448ea8a9d6acf2b03cf0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2b4528afc2d1448ea8a9d6acf2b03cf0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2b4528afc2d1448ea8a9d6acf2b03cf0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2b4528afc2d1448ea8a9d6acf2b03cf0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2b4528afc2d1448ea8a9d6acf2b03cf0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2b4528afc2d1448ea8a9d6acf2b03cf0.png","size":""}]},{"name":"Shawn Kellerman","url":"https://www.last.fm/music/Shawn+Kellerman","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/26949bedbfb5464dbf2535692461e716.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/26949bedbfb5464dbf2535692461e716.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/26949bedbfb5464dbf2535692461e716.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/26949bedbfb5464dbf2535692461e716.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/26949bedbfb5464dbf2535692461e716.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/26949bedbfb5464dbf2535692461e716.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"blues rock","url":"https://www.last.fm/tag/blues+rock"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"All","url":"https://www.last.fm/tag/All"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Big+Mike+Griffin/+wiki"}},"published":"28 Jul 2011, 17:54","summary":"Big Mike Griffin grew up in southern Oklahoma, where he was introduced to music at an early age. \" My Dad played so there was always a guitar or fiddle laying around the house. It seems like I've been playing as long as I've been alive.\" Later, he began listening to blues artists like T-Bone Walker, Paul Butterfield, and Mike Bloomfield. His blues education was further enhanced by late night highway trips to Texas to catch legends like Freddie King, Albert King, and Albert Collins. <a href=\"https://www.last.fm/music/Big+Mike+Griffin\">Read more on Last.fm</a>","content":"Big Mike Griffin grew up in southern Oklahoma, where he was introduced to music at an early age. \" My Dad played so there was always a guitar or fiddle laying around the house. It seems like I've been playing as long as I've been alive.\" Later, he began listening to blues artists like T-Bone Walker, Paul Butterfield, and Mike Bloomfield. His blues education was further enhanced by late night highway trips to Texas to catch legends like Freddie King, Albert King, and Albert Collins.\n\nWhen the economy faltered in Oklahoma, Griffin set out for Nashville where he began playing wherever he could while finding players along the way who would make up the nucleus of the Unknown Blues Band. As their popularity grew, the band began to appear in front of larger audiences and to perform at such prestigious festivals as the King Biscuit Blues Festival and the W.C. Handy Festival. They also expanded their regular touring schedule, travelled to the East Coast and then out West. \n\nIn 1992 his Back on the Streets Again debut served to further advance the band which was on the road to building a reputation as an original blues ensemble. They have appeared with such great names as Ray Charles, Lonnie Mack, and Clarence \"Gatemouth\" Brown.  \n\nIn 1993, Gimme What I Got Comin' brought the band further acclaim as a solid force on the blues scene. The album grabbed the attention of blues fans, critics, and DJs and snagged a high-ranking spot on Living Blues Magazine's national radio chart. \n\nFifth of Whiskey, Case of the Blues, a song from the album, was nominated as Song Of The Year for the 1994 W.C. Handy Awards. \n\nMajor touring dates on both U.S. coasts and Canada, as well as Europe, served as a catalyst to broaden the fan base for the band. Griffin also played on the month-long \"Malaco Europe '93\" musical extravaganza, where he shared the stage with legends like Little Milton, Denise LaSalle, and Latimore. He then worked with Artie \"Blues Boy\" White, laying down tracks for his \"Different Shades of Blue\" release, as well as providing explosive guitar work on James Peterson's \"Don't Let The Devil Ride\" album.  \n\nIn 1996 came his third release, Sittin' Here With Nothing, a refreshingly contemporary approach to the time-honored tradition of the blues. From start to finish, it captures the incredible power of Mike Griffin's brilliant guitar work, smoky vocals and finely tuned songwriting talents. \"He plays a Les Paul guitar, but it looks like a ukulele in his hands,\" says Claypool, who also is on the board of directors of the Beale Street Blues Society. \"We've been trying for a long time to find him a T-shirt big enough to put the Blues Society logo on. I know he wears a 5X shirt. \"He's a good guitarist, and he's got a good voice,\" Claypool says. \"And of course, he's got that great stage presence.\"  Sittin' Here With Nothing features five original compositions, a couple of Little Milton Campbell songs and a few others from the Waldoxy publishing arm. Griffin receives great backup from the Unknown Blues Band, which features Clayton Ivey on piano and Hammond organ, David Hood on bass and Memphian Pat O'Connor on drums.  \n\nIn 1997 Griffin started thinking about the fascinating idea of recording an album just for Harley Davidson fans. He always wanted to do a biker's project, but it was the driving force of his brother and the stimulation of his own gang that finally got the ball rollin'. \n\nEntitled \"Harley in the Rain\", Griffin recorded a well-balanced mixture of originals and all-time classics like Lowell George's \"Willin'\" and Alain Toussaint's \"Get Out Of My Life Woman\". With a no-nonsense production and a strict four piece line-up he offers the 10 numbers in a direct muscular guitar sound that is equally suited to blues, soul, rock and funk. \"Harley in the Rain\" marks the stunning crossover release of the artist Big Mike Griffin that truly confirms him as a major talent on the current scene. \n \n\"Twin Brothers of Different Mothers\" is our second release. It features the hard hitting biker anthem \"Twin Brothers\", and the mournful \"Love will never die\". One of our biggest sellers!! \n \n\"LIVIN' LARGE\" is the third release from Chrome Link Records featuring a mix of original and standard blues tunes as well as a few surprises. Buddy Miles( Jimmy Hendrix, the Electric Flag, Buddy Miles Express) makes a guest appearance on \"Down in Hollywood\", \"Blues for Mr. B\" and the Albert King standard \"Pretty Woman\". \n \n\"Live at the Full Moon Saloon\" is the live show that was recorded during Bike Week. Includes the hits \"Cool Guitar\" and \"I'd Rather Go Blind\" Power trio on steroids!! One of our best sellers. \n \n\"Two Lane Road\" takes a look back at Big Mike's Oklahoma roots. \"Two Lane road\" and \"The 62\" are based on true events and give a nod to the wild west that Big Mike grew up in. Freddie Kings \"Pack it up\" is the stellar cut that features Killer guitar and rythm section featuring Funk Brothers bassist Bob Babbitt. \n \n\"All My Runnin'\" is Big Mikes latest release featuring the title cut written by Big Mike's childhood friend, Byrd Taulbee. \"Iron City Blues\" and \"Shoal Creek\" is featured from the soundtrack of the award-winning documetary \"Iron City Blues\". A \"must have\" for Big Mike fans!! \n \n\"Iron City Blues\" is the award-winning documetary featuring Big Mike as well as an original soundtrack written by Griffin. Blues music and a lawless Tennesee town. Does it get any better than that? You better watch your back!!!! 60 minutes and a bonus Soundtrack CD included.\n\nOfficial Website: Big Mike Griffin <a href=\"https://www.last.fm/music/Big+Mike+Griffin\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
