{"artist":{"name":"Big Rich","mbid":"e397d973-8f9b-4062-b16a-1b32c5cbc81a","url":"https://www.last.fm/music/Big+Rich","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9c9a5150bd6b4920bff20137c538a849.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9c9a5150bd6b4920bff20137c538a849.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9c9a5150bd6b4920bff20137c538a849.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c9a5150bd6b4920bff20137c538a849.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c9a5150bd6b4920bff20137c538a849.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c9a5150bd6b4920bff20137c538a849.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"11730","playcount":"44928"},"similar":{"artist":[{"name":"Beeda Weeda","url":"https://www.last.fm/music/Beeda+Weeda","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b35cdf4314c040d19379138c51cd6ff5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b35cdf4314c040d19379138c51cd6ff5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b35cdf4314c040d19379138c51cd6ff5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b35cdf4314c040d19379138c51cd6ff5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b35cdf4314c040d19379138c51cd6ff5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b35cdf4314c040d19379138c51cd6ff5.png","size":""}]},{"name":"Dem Hoodstarz","url":"https://www.last.fm/music/Dem+Hoodstarz","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fd8caa3ced894e9ba83a1fee15fca430.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fd8caa3ced894e9ba83a1fee15fca430.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fd8caa3ced894e9ba83a1fee15fca430.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fd8caa3ced894e9ba83a1fee15fca430.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fd8caa3ced894e9ba83a1fee15fca430.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fd8caa3ced894e9ba83a1fee15fca430.png","size":""}]},{"name":"Guce","url":"https://www.last.fm/music/Guce","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4cfa42537b0045aabf386be74897af3f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4cfa42537b0045aabf386be74897af3f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4cfa42537b0045aabf386be74897af3f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4cfa42537b0045aabf386be74897af3f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4cfa42537b0045aabf386be74897af3f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4cfa42537b0045aabf386be74897af3f.png","size":""}]},{"name":"AP.9","url":"https://www.last.fm/music/AP.9","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d0e2000d6229496f8bc7965e355f19b1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d0e2000d6229496f8bc7965e355f19b1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d0e2000d6229496f8bc7965e355f19b1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d0e2000d6229496f8bc7965e355f19b1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d0e2000d6229496f8bc7965e355f19b1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d0e2000d6229496f8bc7965e355f19b1.png","size":""}]},{"name":"J-Diggs","url":"https://www.last.fm/music/J-Diggs","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cf691210d9634a759e28db2a8523433f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cf691210d9634a759e28db2a8523433f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cf691210d9634a759e28db2a8523433f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf691210d9634a759e28db2a8523433f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf691210d9634a759e28db2a8523433f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf691210d9634a759e28db2a8523433f.png","size":""}]}]},"tags":{"tag":[{"name":"Bay Area","url":"https://www.last.fm/tag/Bay+Area"},{"name":"hyphy","url":"https://www.last.fm/tag/hyphy"},{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"san francisco","url":"https://www.last.fm/tag/san+francisco"},{"name":"West Coast Rap","url":"https://www.last.fm/tag/West+Coast+Rap"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Big+Rich/+wiki"}},"published":"03 Mar 2007, 17:20","summary":"Richard Bougere Jr. aka Big Rich was born and raised in the slums of the world famous Fillmore district in San Francisco California. Fillmore, once a thriving community of black owned businesses in the mid 50s has completly evolved. Now its a place where drug dealing, prostitution, and murder is extraordinarily common. Rich grew up in the Banneker Homes Housing Projects which is the heart of the murder and crime infested neighborhood. Rich has lost over 50 friends and family members to the streets. <a href=\"https://www.last.fm/music/Big+Rich\">Read more on Last.fm</a>","content":"Richard Bougere Jr. aka Big Rich was born and raised in the slums of the world famous Fillmore district in San Francisco California. Fillmore, once a thriving community of black owned businesses in the mid 50s has completly evolved. Now its a place where drug dealing, prostitution, and murder is extraordinarily common. Rich grew up in the Banneker Homes Housing Projects which is the heart of the murder and crime infested neighborhood. Rich has lost over 50 friends and family members to the streets. \"Funerals are so common to me now. I dont even cry or feel sad anymore, my feelings are numb\" says Rich. He found hip hop at age 9 when him and his cousins Noot Rich and Mark D started rapping in their uncle's garage. Rich who was the youngest out of the crew wasnt able to keep up lyrically. Still determined to rap, Rich got help from a \"young mc\" who lived around the corner from his uncle's house. He wrote Rich's first rhyme and they recorded the song \"king of the stage.\" This \"young mc\" went on to become the Bay Area rap legend San Quinn. \n\nShortly after recording the song with his cousins Rich lost interest in music and gained interest in sports. But at age 12 music re-entered Rich's life and never left again. He began rapping with his boys from the same housing projects and they crafted their skills in Rich's bedroom/mini recording studio. \"Man, we started out recording on a karaoke machine my mom bought me for christmas, says Rich.\" At this time, Rich became more interested in producing than being a MC. He also had the aspirations of owning his record company so he decided to start BRP (Big Rich Productions). From 1993 to 1998 every aspiring young rapper to established local rappers came to Big Rich's 3rd floor apartment in the Banneker Homes. Devo, who was Rich's number 1 rapper in the crew went on to become the founding member of the successful Bay area rap group Tha Gamblaz. Rich polished his skills as a producer and started writing rhymes for actually the first time in his life. By the time Rich was 16 he began producing and recording his own solo demo tape. \n\nAt around the same time he began doing music with childhood friends Bailey (San Quinn's little brother) and an aspiring rapper named Toriano. Shortly there after they decided to form a group (Fully Loaded) and called on San Quinn and his manager Charles Kelley for guidance. Instanly, Quinn and Charles took interest in the group and began to develop the three hungry rappers. In May of 1998 Charles and Quinn started a record label that eventually took the Bay Area by storm and Fully Loaded was the catalyst. \"Yeah its crazy how quinn wrote my first verse not knowing that years later he would comeback and put me in the game\" says Rich. Big Rich and his group released 2 successful independent albums, \"Millennium Attitude\" in 2000 and \"Reloaded\" in 2001. Both albums have sold a combined 50,000 units. Big Rich and his group also teamed up with Bay Area rap legends San Quinn and Willie Hen to form the Super Group \"Done Deal Fam\" and released the album \"...Runs in the Family\" in 2002. Later that year Big Rich and The Done Deal Fam recorded a record that would change the Bay Area rap scene forever. The record was called \"Welcome to the Bay\" a response to Jermaine Dupre and Ludacris' smash hit \"Welcome to Atlanta.\" This song caught the attention of 106.1 KMEL's radio personality Big Von Johnson and become an instant HIT! \"Welcome to the Bay\" was the number one requested song in the bay for over 6 weeks and stayed in heavy rotation for almost a year. Now a young pioneer in the Bay Area rap scene Big Rich went on to appear and collaborate on many successful albums and mixtapes throughout the Bay Area. Some of these are San Quinn's \"I Give You My Word,\" Mac Dre Presents... \"Thizz Nation,\" Mac Dre Presents... \"The Rompalation 2 & 3,\" \"Mind Motion Rocks The Done Deal Party,\" \"E-40 Presents The Bay Bridges Compilation\" and over 20 other albums and mixtapes. Fast Forward to 2005. Big Rich set out on his first solo journey. He released a mixtape titled \"Who The Fuck Is Big Rich?\" which was a Hood classic. \n\nHis imprint label 3 Story Muzik in conjunction Street Cred Music Group distributed by Koch Records will be releasing Big Rich's debut solo album in March 2006 titled \"FILLMORE RICH.\" The album includes features such as San Quinn, E-40, Messy Marv, Lil Scrappy, Clyde Carson of the Team, Stress of The Federation Fully Loaded, Ya Boy, Devo. With production by Sean T, Droop E (E-40's son), Mal Amazing, D-Cyde, Rashaad Wiggins, Cello Mac, King Cydal, and Drastic Matter. This album will also include a full length DVD for free with the first 10 thousand copies. This DVD is a documentary on the history of Big Rich. Also, it will show the journey of Big Rich recording and promoting his debut album. Plus, live performances, XXX-rated footage, cameos by E-40, B-Legit, San Quinn, Nate Dogg, and others. Last but not least, The Legendary Hoods of San Francisco. <a href=\"https://www.last.fm/music/Big+Rich\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
