{"artist":{"name":"The Sir Douglas Quintet","mbid":"b2b3eed6-d9b2-4d1a-bf9b-0160e401720e","url":"https://www.last.fm/music/The+Sir+Douglas+Quintet","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fc35fa1fbf4f424682072dcb0a5f0981.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fc35fa1fbf4f424682072dcb0a5f0981.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fc35fa1fbf4f424682072dcb0a5f0981.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fc35fa1fbf4f424682072dcb0a5f0981.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fc35fa1fbf4f424682072dcb0a5f0981.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fc35fa1fbf4f424682072dcb0a5f0981.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"44108","playcount":"269330"},"similar":{"artist":[{"name":"Doug Sahm","url":"https://www.last.fm/music/Doug+Sahm","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1f0404568caf4a598fd2b2e40b579f74.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1f0404568caf4a598fd2b2e40b579f74.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1f0404568caf4a598fd2b2e40b579f74.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1f0404568caf4a598fd2b2e40b579f74.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1f0404568caf4a598fd2b2e40b579f74.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1f0404568caf4a598fd2b2e40b579f74.png","size":""}]},{"name":"The Shadows of Knight","url":"https://www.last.fm/music/The+Shadows+of+Knight","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7eb2faf712264296ace8619407a81d88.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7eb2faf712264296ace8619407a81d88.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7eb2faf712264296ace8619407a81d88.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7eb2faf712264296ace8619407a81d88.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7eb2faf712264296ace8619407a81d88.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7eb2faf712264296ace8619407a81d88.png","size":""}]},{"name":"The Beau Brummels","url":"https://www.last.fm/music/The+Beau+Brummels","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/da2157bfef9d4bff49dd7786bc05c8df.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/da2157bfef9d4bff49dd7786bc05c8df.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/da2157bfef9d4bff49dd7786bc05c8df.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/da2157bfef9d4bff49dd7786bc05c8df.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/da2157bfef9d4bff49dd7786bc05c8df.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/da2157bfef9d4bff49dd7786bc05c8df.png","size":""}]},{"name":"The Leaves","url":"https://www.last.fm/music/The+Leaves","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dce77ba44c5d4f4b86fc8f2ef7ef6c8a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dce77ba44c5d4f4b86fc8f2ef7ef6c8a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dce77ba44c5d4f4b86fc8f2ef7ef6c8a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dce77ba44c5d4f4b86fc8f2ef7ef6c8a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dce77ba44c5d4f4b86fc8f2ef7ef6c8a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dce77ba44c5d4f4b86fc8f2ef7ef6c8a.png","size":""}]},{"name":"Jerry Jeff Walker","url":"https://www.last.fm/music/Jerry+Jeff+Walker","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/38e23feec0244e5bb02c5bba2a4e8ae6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/38e23feec0244e5bb02c5bba2a4e8ae6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/38e23feec0244e5bb02c5bba2a4e8ae6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/38e23feec0244e5bb02c5bba2a4e8ae6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/38e23feec0244e5bb02c5bba2a4e8ae6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/38e23feec0244e5bb02c5bba2a4e8ae6.png","size":""}]}]},"tags":{"tag":[{"name":"oldies","url":"https://www.last.fm/tag/oldies"},{"name":"tex-mex","url":"https://www.last.fm/tag/tex-mex"},{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"Garage Rock","url":"https://www.last.fm/tag/Garage+Rock"},{"name":"texas","url":"https://www.last.fm/tag/texas"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Sir+Douglas+Quintet/+wiki"}},"published":"15 Jul 2007, 01:17","summary":"The Sir Douglas Quintet was an American rock band active in the late 1960s and early 1970s. Despite their British sounding name, they came out of San Antonio, Texas and are perhaps best known for their 1965 hit single written by Doug Sahm, the 12-bar blues \"She's About a Mover\" named the number one 'Texas' song by Texas Monthly. The Sir Douglas Quintet is considered a pioneering influence in the history of rock and roll for incorporating Tex-Mex and Cajun styles into rock music. <a href=\"https://www.last.fm/music/The+Sir+Douglas+Quintet\">Read more on Last.fm</a>","content":"The Sir Douglas Quintet was an American rock band active in the late 1960s and early 1970s. Despite their British sounding name, they came out of San Antonio, Texas and are perhaps best known for their 1965 hit single written by Doug Sahm, the 12-bar blues \"She's About a Mover\" named the number one 'Texas' song by Texas Monthly. The Sir Douglas Quintet is considered a pioneering influence in the history of rock and roll for incorporating Tex-Mex and Cajun styles into rock music.\n\nA Lone Star original with a German surname, an Edwardian suit, a Beatles haircut, a loving knowledge of the blues and r&b, Western swing and Tex-Mex sounds, a voice like a flayed and tanned hide, a deliriously eclectic bag of tunes, a bare handful of nationally charting hits, and a cult that includes admirers Jerry Wexler, Bod Dylan, Elvis Costello, and Joe \"King\" Carrasco? Nothing about Douglas Wayne Sahm is quite what it appears to be.\n\nBorn in San Antonio on November 6, 1941, Sahm descended from \"squareheads\", as the German settlers who contributed the accordion to border music are known in Texas: at the turn of the century his grandfather had what Sahm calls \"a German oom-pah-pah band\".\n\nDoug himself started playing tripleneck steel guitar at the tender age of six. When he was nine, his father began taking him to local joints like The Barns to see stars like Webb Pierce, Hank Williams and Bob Wills. \" I used to watch the steel players\", he grins. \"Before I even had a guitar I took a box and drew strings on it, and when the radio would come on with fifteen minutes of country bands I'd fantasize that I was playing the steel over the radio\".\n\nBy his teens he was past-fantasy, gigging around in local bar bands on guitar and fiddle, playing the time's typical stew of r&b stompers, rockabilly rave-ups, roadhouse blues, and Western-swing and two step rhythms. Sahm recalls, \"I was listening to Hank Ballard and Chuck Berry, Webb Pierce and Howlin' Wolf, The Drifters and Hank Williams and Johnny Ace, all that '50s stuff. Little Richard was my favorite. The music really incensed a lot of parents, although it wasn't very racial at all. The east side of San Antonio, where I grew up, was predominantly black then -now it's all black-. San Antonio's very racially mixed, always has been; the older people mix really well. So parents just knew there was something in that black music that the kids loved. They had no idea what was coming\". Neither did the kids themselves, \"When I saw Elvis in '56 it just blew my mind. I put the pompadour up, got in front of the mirror, and started to practice shaking\".\n\nThe Sir Douglas Quintet is considered a pioneering influence in the history of rock and roll for incorporating Tex-Mex and Cajun styles into rock music. Early influences on the band's emerging Texas style were even broader than this, and included ethnic and pop music from the 1950s and 1960s, such as doo-wop, electric blues, soul music, and British Invasion. The Quintet brought the older styles into a contemporary context, for instance by adapting the doo-wop feel, beat, and chord progressions. Perhaps even more off-beat for a late 1960s rock band than some inclusion of doo-wop type songs was that the band also played in styles like Western swing and polka (a Country & Western form and rhythmic style, from the Texas Hill Country, rather than a straight European style). They approached these styles with an instrumental line-up that was typical of blues bands: one guitarist, keyboardist, bassist, and drummer, and a member who could play either trumpet or saxophone.\n\nIn the mid 1960s, the band relocated to the San Francisco Bay Area and absorbed features of the San Francisco Sound, including the loud and lush electric bass tone and freer percussion and guitar stylings. Band members also explored musical elements specific to modern jazz at that time. For studio recordings, they sometimes added an extra session musician or two, often to flesh out the brass dimension of a track's sound. Good examples of what they achieved when they absorbed the new jazz and psychedelic elements into their music can be found on the album, Sir Douglas Quintet + 2.\n\nIn live performances, blues, often with swing or shuffle beats, was usually a substantial component of the set. Besides doing their own original material, the Quintet revived several classics such as Jimmie Rodgers' \"In the Jailhouse Now\" and Freddy Fender's \"Wasted Days and Wasted Nights\" to be found on the albums Son of San Antonio and Texas Fever, respectively.\n\nIn addition to their best-known song \"She's About a Mover,\" (1965) the band is known for its songs \"Mendocino,\" (1968) \"Can You Dig My Vibrations?\" (1968) and \"Dynamite Woman\" (1969). \"Mendocino\" was released in December 1968, and reached #14 in the U.S. Billboard Hot 100 by early 1969, spending 15 weeks in the chart. It was even more successful in Europe, selling over three million copies.\n\nIn addition to Sahm and Meyers, original Sir Douglas Quintet members included Jack Barber on bass, Frank Morin on saxophone, trumpet and keyboards and Johnny Perez, Ernie Durawa and T.J. Ritterbach on drums. In 1969 Harvey Kagan joined the Quintet on bass, forming their most familiar line up - Kagan, Morin, Perez, Sahm, and Meyers. Bassist Jim Stallings also contributed to several albums during this period of shifting personnel which included, among others, guitarist Tom Nay of Sarasota, Florida (who played with the group for about a year), and John York, who later replaced Chris Hillman in The Byrds. \n\nIn 1972 the group split up when Sahm contracted to produce a solo album. Meyers, Perez, Morin, and Stallings briefly regrouped as The Quintet, with Farlow taking Sahm's place. In 1973 several Sir Douglas Quintet outtakes were released in their final album from the group's classic era, Rough Edges.\n\nDoug Sahm and several members of the Sir Douglas Quintet released the album 'Texas Tornado' in 1973 as The Sir Douglas Band.\n\nSahm and Meyers continued to work together throughout the late 1970s and rejoined with Perez in 1980 for a reunion tour and album.\n\nSahm and Meyers were also members of the Texas Tornados in the early 1990s.\n\nIn 2005 The Sir Douglas Quintet were among the new class of musicians chosen for the nominating ballot to the Rock and Roll Hall of Fame.\n\nTaken from The Best Of Doug Sahm & The Sir Douglas Quintet's booklet, (Mercury, 1990) by Gene Santoro. <a href=\"https://www.last.fm/music/The+Sir+Douglas+Quintet\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
