{"artist":{"name":"The Suicide Machines","mbid":"c6d2cbdf-30e7-4233-a1b4-e892f116ada1","url":"https://www.last.fm/music/The+Suicide+Machines","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a7ede71e76c944478ec30f33b91f8ca7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a7ede71e76c944478ec30f33b91f8ca7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a7ede71e76c944478ec30f33b91f8ca7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a7ede71e76c944478ec30f33b91f8ca7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a7ede71e76c944478ec30f33b91f8ca7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a7ede71e76c944478ec30f33b91f8ca7.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"242610","playcount":"4604023"},"similar":{"artist":[{"name":"Big D And The Kids Table","url":"https://www.last.fm/music/Big+D+And+The+Kids+Table","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a9bb767a6d2444418e074eda16e853bd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a9bb767a6d2444418e074eda16e853bd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a9bb767a6d2444418e074eda16e853bd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a9bb767a6d2444418e074eda16e853bd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a9bb767a6d2444418e074eda16e853bd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a9bb767a6d2444418e074eda16e853bd.png","size":""}]},{"name":"Mustard Plug","url":"https://www.last.fm/music/Mustard+Plug","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/85c7d405bf124b678d58c270b9b13ac1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/85c7d405bf124b678d58c270b9b13ac1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/85c7d405bf124b678d58c270b9b13ac1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85c7d405bf124b678d58c270b9b13ac1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85c7d405bf124b678d58c270b9b13ac1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/85c7d405bf124b678d58c270b9b13ac1.png","size":""}]},{"name":"Catch 22","url":"https://www.last.fm/music/Catch+22","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9371ee631cab4dc3a719f6f5e79029d2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9371ee631cab4dc3a719f6f5e79029d2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9371ee631cab4dc3a719f6f5e79029d2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9371ee631cab4dc3a719f6f5e79029d2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9371ee631cab4dc3a719f6f5e79029d2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9371ee631cab4dc3a719f6f5e79029d2.png","size":""}]},{"name":"Less Than Jake","url":"https://www.last.fm/music/Less+Than+Jake","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9ca965480e5049a193117055ba01bad8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9ca965480e5049a193117055ba01bad8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9ca965480e5049a193117055ba01bad8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9ca965480e5049a193117055ba01bad8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9ca965480e5049a193117055ba01bad8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9ca965480e5049a193117055ba01bad8.png","size":""}]},{"name":"Operation Ivy","url":"https://www.last.fm/music/Operation+Ivy","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7e03788884f14af181dcdd66453da990.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7e03788884f14af181dcdd66453da990.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7e03788884f14af181dcdd66453da990.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7e03788884f14af181dcdd66453da990.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7e03788884f14af181dcdd66453da990.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7e03788884f14af181dcdd66453da990.png","size":""}]}]},"tags":{"tag":[{"name":"punk","url":"https://www.last.fm/tag/punk"},{"name":"ska punk","url":"https://www.last.fm/tag/ska+punk"},{"name":"ska","url":"https://www.last.fm/tag/ska"},{"name":"punk rock","url":"https://www.last.fm/tag/punk+rock"},{"name":"skacore","url":"https://www.last.fm/tag/skacore"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Suicide+Machines/+wiki"}},"published":"23 Feb 2006, 23:59","summary":"The Suicide Machines were a band formed in 1991 in Detroit, Michigan under the original name Jack Kevorkian and the Suicide Machines. The band's original lineup consisted of Jason Navarro on vocals, Dan Lukacinsky on guitar, Jason Brake on bass, and Stefan Rairigh on drums. This lineup lasted a year until Bill Jennings replaced Rairigh, but he was himself soon replaced by Derek Grant. They recorded the band's first demos The Essential Kevorkian and Green World in 1993 and 1994, both released through their own label Sluggo's Old Skool Records. <a href=\"https://www.last.fm/music/The+Suicide+Machines\">Read more on Last.fm</a>","content":"The Suicide Machines were a band formed in 1991 in Detroit, Michigan under the original name Jack Kevorkian and the Suicide Machines. The band's original lineup consisted of Jason Navarro on vocals, Dan Lukacinsky on guitar, Jason Brake on bass, and Stefan Rairigh on drums. This lineup lasted a year until Bill Jennings replaced Rairigh, but he was himself soon replaced by Derek Grant. They recorded the band's first demos The Essential Kevorkian and Green World in 1993 and 1994, both released through their own label Sluggo's Old Skool Records. They also released the \"Vans Song\" 7\" single on Youth Rendition Records. Brake left the group in 1994 and was briefly replaced by Dave Smith until Royce Nunley joined as the new permanent bass player. The lineup of Navarro, Lukacinsky, Nunley, and Grant would last for the next four years. This lineup reduced the band's name to The Suicide Machines and recorded the Skank for Brains split album with The Rudiments.\n\n1996-2001: Hollywood Records years\n\nIn 1995 the band signed to Hollywood Records, a subsidiary of The Walt Disney Company. 1996 saw the release of their first album, Destruction by Definition. Its blend of punk rock and ska brought the national attention in the midst of the mid-1990s punk rock mainstream revival. The single \"No Face\" became a minor hit on modern rock radio stations and the album was supported through extensive touring across the United States. They released a follow-up in 1998 entitled Battle Hymns, which continued their ska punk style while incorporating more aggressive elements of hardcore punk, with nearly all of its songs lasting under two minutes in length.\n\nFollowing the release of Battle Hymns Grant left the band. He went on to play with numerous groups including Thoughts of Ionesco, The Vandals, face to face, and Telegraph before finding a permanent position in the Alkaline Trio. He was replaced by Erin Pitman for some touring before new permanent drummer Ryan Vandeberghe joined. In 2000 this lineup released The Suicide Machines, a more pop rock oriented effort that moved away from the ska influences of their earlier releases. They received some radio and video play for the single \"Sometimes I Don't Mind\" and performed on the Warped Tour that Summer. In 2001 they released Steal This Record, which continued their exploration of pop punk style while mixing in elements of their earlier ska punk and hardcore albums.\n\n2002-2005: Side One Dummy years\n\nFollowing touring in support of Steal This Record bassist Nunley left The Suicide Machines to start his own band, Blueprint 76, and was replaced by Rich Tschirhart. The band also ended their contract with Hollywood Records, fulfilling their contractual obligations by releasing the compilation album The Least Worst of the Suicide Machines. They then moved to the independent label Side One Dummy Records. Their next album A Match and Some Gasoline, released in 2003, found the band abandoning the pop experimentations of their previous two albums and returning more to the ska punk and hardcore styles of their earlier years. They also began to explore sociopolitical themes in songs such as \"Did You Ever Get a Feeling of Dread?\" and \"Your Silence,\" which were critical of President George W. Bush's administration, its response to the September 11, 2001 terrorist attacks, and the wars in Afghanistan and Iraq. They toured internationally in support of the album and again performed on the Warped Tour.\n\nIn 2005 the band released the album War Profiteering is Killing Us All, which continued their political themes by openly attacking the Bush White House, the continuation of the Iraq War, and conservative Republicanism. Navarro also launched his own record label, Noise Riot Records, and released On the Eve of Destruction: 1991-1995, a compilation of the band's early EPs, singles, and demos.\n\n2006: Breakup and post-Suicide Machines activity\n\nIn 2006, while touring in support of War Profiteering is Killing Us All, the band abruptly broke up. Explanations given by the band members for this included Vandeberghe's desire to take a break from touring, which he did while friend Steve McCrumb filled for a performance at the Troubadour in Los Angeles on May 11. A tour of Mexico had been planned to follow this, and Navarro had suggested that the band perform its final shows that Christmas. However, interpersonal tensions came to a head after the Troubadour show when Lukacinsky refused to finish the tour. Lukacinsky himself further elaborated that the band had been planning to break up for some time.\n\nFollowing the band's breakup, Navarro and Vandeberghe continued working with Left in Ruin, a band they had started as a Suicide Machines side project and had worked on and off with for almost 6 years. Vandeberghe also joined the new band Hifi Handgrenades. Lukacinsky, meanwhile, started his own band Bayonetting the Wounded.  Navarro is currently fronting Hellmouth.  Tschirhart is in The A-Gang. <a href=\"https://www.last.fm/music/The+Suicide+Machines\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
