{"artist":{"name":"The Tragically Hip","mbid":"e86ab653-bec8-46f3-b4b6-a1a866919ef6","url":"https://www.last.fm/music/The+Tragically+Hip","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d68c2cccf2614efbb6065f838f23f273.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d68c2cccf2614efbb6065f838f23f273.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d68c2cccf2614efbb6065f838f23f273.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d68c2cccf2614efbb6065f838f23f273.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d68c2cccf2614efbb6065f838f23f273.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d68c2cccf2614efbb6065f838f23f273.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"186988","playcount":"6136810"},"similar":{"artist":[{"name":"Sam Roberts","url":"https://www.last.fm/music/Sam+Roberts","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d35979eecac8423e890778e2078fd615.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d35979eecac8423e890778e2078fd615.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d35979eecac8423e890778e2078fd615.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d35979eecac8423e890778e2078fd615.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d35979eecac8423e890778e2078fd615.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d35979eecac8423e890778e2078fd615.png","size":""}]},{"name":"Matthew Good Band","url":"https://www.last.fm/music/Matthew+Good+Band","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f223a2174d73480f8e6dafbad49ceb49.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f223a2174d73480f8e6dafbad49ceb49.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f223a2174d73480f8e6dafbad49ceb49.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f223a2174d73480f8e6dafbad49ceb49.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f223a2174d73480f8e6dafbad49ceb49.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f223a2174d73480f8e6dafbad49ceb49.png","size":""}]},{"name":"Blue Rodeo","url":"https://www.last.fm/music/Blue+Rodeo","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b8b1c1989b2648bdaa835d1eb1ddd535.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b8b1c1989b2648bdaa835d1eb1ddd535.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b8b1c1989b2648bdaa835d1eb1ddd535.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8b1c1989b2648bdaa835d1eb1ddd535.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8b1c1989b2648bdaa835d1eb1ddd535.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8b1c1989b2648bdaa835d1eb1ddd535.png","size":""}]},{"name":"54-40","url":"https://www.last.fm/music/54-40","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8bda578ee388431ba773e2c90a7dd82f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8bda578ee388431ba773e2c90a7dd82f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8bda578ee388431ba773e2c90a7dd82f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8bda578ee388431ba773e2c90a7dd82f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8bda578ee388431ba773e2c90a7dd82f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8bda578ee388431ba773e2c90a7dd82f.png","size":""}]},{"name":"Matthew Good","url":"https://www.last.fm/music/Matthew+Good","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2a207ee3fc7c407b96217942f7479354.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2a207ee3fc7c407b96217942f7479354.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2a207ee3fc7c407b96217942f7479354.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a207ee3fc7c407b96217942f7479354.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a207ee3fc7c407b96217942f7479354.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a207ee3fc7c407b96217942f7479354.png","size":""}]}]},"tags":{"tag":[{"name":"Canadian","url":"https://www.last.fm/tag/Canadian"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"alternative rock","url":"https://www.last.fm/tag/alternative+rock"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Tragically+Hip/+wiki"}},"published":"13 Feb 2006, 08:16","summary":"The Tragically Hip's infectious songs, catchy melodies, inspired lyrics, and solid musicianship have secured their place as the kings of rock in Canada. Formed in the early '80s in Kingston, Ontario, they are a five-piece group of friends: Gordon Downie (primary lyricist and lead vocalist (February 6, 1963-October 17,2017), Paul Langlois and Rob Baker (guitars), Gord Sinclair (bass) and Johnny Fay (drums). For thirty years, The Tragically Hip has <a href=\"https://www.last.fm/music/The+Tragically+Hip\">Read more on Last.fm</a>","content":"The Tragically Hip's infectious songs, catchy melodies, inspired lyrics, and solid musicianship have secured their place as the kings of rock in Canada. Formed in the early '80s in Kingston, Ontario, they are a five-piece group of friends: Gordon Downie (primary lyricist and lead vocalist (February 6, 1963-October 17,2017), Paul Langlois and Rob Baker (guitars), Gord Sinclair (bass) and Johnny Fay (drums). For thirty years, The Tragically Hip has been at the heart of the Canadian music scene and has been recognized for its Canadian storytelling and references, and for evoking a strong emotional connection between their music and their fans that remains unrivaled throughout the country.  The Hip has achieved the enviable status of a band that enjoys both mass popularity with over 8 million albums sold worldwide, as well as peer recognition through eleven (11) Juno Awards from more than a dozen recordings.\n\nThe group met while in high school at Kingston Collegiate Vocational Institute (KCVI) and all attended Queen's University in Kingston. They started as a cover band playing Rolling Stones and Doors covers, and were first represented by a local Kingston agent named Bernie Dobson.\n\nThey were first signed in 1987 after Bruce Dickinson, the then VP of A&R at MCA Records saw them perform live at the Horseshoe Tavern in Toronto, Ontario. Later that year they released their debut EP The Tragically Hip, though they were largely unrecognized until 1989's Up To Here. Up To Here established them as one of the best and most influential bands in Canada. In 1992, they created the Another Roadside Attraction festival, which tours Canada to promote smaller, unknown emerging bands. \n\nThe band is immensely popular in Canada. Although they have never achieved great success in the United States, they have never specifically sought it and have enjoyed their warm Canadian reception. When touring in Canada they typically play to sold-out arenas; when touring in the United States they play smaller venues and clubs. Performances abroad are usually attended by Canadian expatriates. In Europe, The Hip perhaps have their greatest following in the Netherlands. \n\nThe band permits recordings of their performances, so an active trading community thrives. The tone and content of much of their music is a paean to the Canadian experience and touches on such themes as small-town life, geography, and hockey. \n\nThe Tragically Hip received a star on the Canadian Walk of Fame in 2002, and they were inducted into the Canadian Music Hall of Fame at the 2005 Juno Awards. They have performed at the 2002 Winter Olympics in Salt Lake City, and played a three-song set at the worldwide broadcast Live 8 benefit concert on July 2nd, 2005 to help make poverty history for the poor African nations.\n\nOn April 7th, 2009, the band's twelfth album We Are The Same was being released in North America, and it immediately rose to Number 1 on the Canadian charts. The album features twelve diverse new recordings produced by Bob Rock who had produced 2007's World Container and is perhaps best known for his work with Metallica, Aerosmith, Bon Jovi, Bryan Adams, The Offspring, Michael Bublé and Simple Plan.  This album features songs that range from \"levity and light to melancholy and anger\" according to the band's website. Recorded primarily at The Bathouse Studio, band's recording studio located in a historical coach house west of their hometown, Kingston, Ontario, and its first single was \"Love Is A First\", which features the ironical addictive hook, 'love is a curse'.\n\nDespite some side solo projects in the past couple of years, the band has completed a new studio album at The Bathouse Studio and in Toronto with Gavin Brown, who is perhaps best known for his work producing Metric, Three Days Grace, Barenaked Ladies and Billy Talent.  The album is entitled Now For Plan A and it was released on October 2nd, 2012.  This album's first singles were \"At Transformation\" and \"Streets Ahead\" and they are available on iTunes and through the band's website.  \n\nMan Machine Poem  is the fourteenth studio album which is scheduled to be released June 17th, 2016. The album takes its name from a track on their Gold-selling 2012 release, Now For Plan A, and it was recorded at The Hip’s home studio The Bathouse, produced by Kevin Drew, founding member and producer of  Broken Social Scene, Andy Kim (singer, songwriter and Arts & Crafts label co-founder) and Dave Hamelin, songwriter and producer from The Stills and Eight and a Half. Album pre-orders are currently available on either CD or Vinyl through the band's \"Gift Shop\" on their official website: www.TheHip.com or digitally through iTunes. “In A World Possessed By The Human Mind” and “Tired As Fuck\" were its first singles, and both were made immediately available for digital download with the album's pre-order.\n\nEarly on May 24, 2016, The Tragically Hip announced via a post on their official website and through e-mail subscribers that its lead singer and primary lyricist, Gord Downie, is suffering from aggressive terminal brain cancer, and that the band will do one final national Canadian tour \"For Gord\". Concert dates for this final tour were available on-line through Ticketmaster, but sold out in minutes. There was a national outcry from devoted fans who claimed that scalpers had scooped up most of the tour's tickets using \"bots\". Petitions were filed to successfully encourage Canada's national television network, the CBC, to produce and air Live the final August 20, 2016 concert. Broadcast live from the band's hometown, at Kingston's Rogers K-Rock Centre, a national audience viewed The Tragically Hip's final tour show, The concert opened with \"50 Mission Cap\" and ended almost two hours later, after a third encore, with \"Ahead By A Century\".  All proceeds from the tour were donated to The Gord Downie Fund, at the Sunnybrook Foundation for Brain Cancer Research. Donations can be sent to: http://sunnybrook.ca/foundation.  \n\nFor the latest band details, please visit their official website: www.TheHip.com.\n <a href=\"https://www.last.fm/music/The+Tragically+Hip\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
