{"artist":{"name":"The Twinkle Brothers","mbid":"b36508f0-3ee0-40e7-beac-34a85d0143aa","url":"https://www.last.fm/music/+noredirect/The+Twinkle+Brothers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/161f9d817a2f4a9eb58fa27bc1d636de.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/161f9d817a2f4a9eb58fa27bc1d636de.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/161f9d817a2f4a9eb58fa27bc1d636de.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/161f9d817a2f4a9eb58fa27bc1d636de.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/161f9d817a2f4a9eb58fa27bc1d636de.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/161f9d817a2f4a9eb58fa27bc1d636de.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"0","playcount":"0"},"similar":{"artist":[]},"tags":{"tag":[{"name":"reggae","url":"https://www.last.fm/tag/reggae"},{"name":"roots reggae","url":"https://www.last.fm/tag/roots+reggae"},{"name":"dub","url":"https://www.last.fm/tag/dub"},{"name":"roots","url":"https://www.last.fm/tag/roots"},{"name":"jamaica","url":"https://www.last.fm/tag/jamaica"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/The+Twinkle+Brothers/+wiki"}},"published":"10 Jan 2008, 01:01","summary":"The Twinkle Brothers hail from the north coast of Jamaica in the ghettos of Falmouth, the Parish of Trelawny. The two brothers, Norman and Ralston Grant, were baptized in the church of Anglican Diocese. They started singing in the Sunday school choir and concerts at the age of six and eight respectively. At that time they started to make their own instruments since they could no afford to buy them. They made guitars and drums from various tin cans (garbage can, sardine, milk, etc.) and fishing line. <a href=\"https://www.last.fm/music/+noredirect/The+Twinkle+Brothers\">Read more on Last.fm</a>","content":"The Twinkle Brothers hail from the north coast of Jamaica in the ghettos of Falmouth, the Parish of Trelawny. The two brothers, Norman and Ralston Grant, were baptized in the church of Anglican Diocese. They started singing in the Sunday school choir and concerts at the age of six and eight respectively. At that time they started to make their own instruments since they could no afford to buy them. They made guitars and drums from various tin cans (garbage can, sardine, milk, etc.) and fishing line.\n\nAfter Jamaica received her independence from England in the early 60's, the Twinkle Brothers started to sing in real competitions. At that time the government of Jamaica started National Competitions called \"Pop and Mento\" festivals. In these competitions you would start at Parish level, then go the regional level. If successful there, you move on to the National finals. For years the Twinkle Brothers were Parish champions, then went onto the Regional finals where (according to the crowds and the Twinkle Brothers) they were cheated out of the winning crown for two consecutive years. However, the third time being the charm, they broke the barriers at the Regional finals in Montego Bay, and then went on to the Nationals in Kingston. This time they were victorious, winning first place in the \"group\" category! Norman won first place in the \"solo\" category. They reigned supreme for years in that competition coming away with several medals.\n\nIn the early sixties they joined a band in their hometown, Falmouth. The band was called The Cardinals. All the members were Falmouthians, some from middle-class society-teachers, bankers, and accountants. Norman and Ralston were the only \"ghetto boys.\" The Cardinals started playing in hotels and nightclubs throughout the island.\n\nBy the late sixties the Twinkle Brothers decided to do some recording and went to Kingston to try to get an audition with labels like Coxson, Prince Buster, Beverly's and Treasure Isle, to name a few. They were fortunate enough to get their first recording, a solo by Norman called \"Somebody Please Help Me\", recorded by Leslie Kong on the Beverly's label. A year later the got their first group single, \"Matthew and Mark\", recorded by Duke Ried on the Treasure Isle label.\n\nIn 1970, the entered the Jamaica Festival Song competition and placed third behind Hopeton Lewis and the Jamaicans - both groups on the Treasure Isle label. During that time, the Twinkle Brothers were on the Jack Pot label, produced by Bunny Lee. From there they moved to bigger and better things - recording for Dynamic Sounds, Federal Records, Sun Shot and Upsetter labels. In 1970 they formed their own Twinkle label. They currently have 60+ albums (and counting) and numerous singles to their credit (this could change before you read this!) a live Sunsplash album and video, one live album in Poland and three albums on the Virgin label. They have toured the United States many times and several times in Europe, Africa and Scandinavia. They've performed at festivals nationally and internationally; a few of them are the Essential Festival in Brighton, England, Bob Marley Days, Reggae on the River, Sunsplash, Reggae in the Park, the Hemp Festival, Roots Mountain Festival, Monterey Bay Reggae Fest, Helsinki Reggae Festival, Holland's Reggae Eruption, Festivals in Canada, Spain, Germany, Poland and many more. They are now preparing for another Family Reunion Tour this summer. Aptly titled, this tour will feature Ralston's wife, Della Grant, along with other family members and friends. <a href=\"https://www.last.fm/music/+noredirect/The+Twinkle+Brothers\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
