{"artist":{"name":"A Static Lullaby","mbid":"8d79e950-1333-4a32-9fc1-af53d421abc4","url":"https://www.last.fm/music/A+Static+Lullaby","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b25565b5e97040bd9ea3441a56b7314e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b25565b5e97040bd9ea3441a56b7314e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b25565b5e97040bd9ea3441a56b7314e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b25565b5e97040bd9ea3441a56b7314e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b25565b5e97040bd9ea3441a56b7314e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b25565b5e97040bd9ea3441a56b7314e.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"314562","playcount":"5491651"},"similar":{"artist":[{"name":"From Autumn To Ashes","url":"https://www.last.fm/music/From+Autumn+To+Ashes","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/90c8050cf52c454f9f90afc85311f55e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/90c8050cf52c454f9f90afc85311f55e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/90c8050cf52c454f9f90afc85311f55e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/90c8050cf52c454f9f90afc85311f55e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/90c8050cf52c454f9f90afc85311f55e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/90c8050cf52c454f9f90afc85311f55e.png","size":""}]},{"name":"A Thorn For Every Heart","url":"https://www.last.fm/music/A+Thorn+For+Every+Heart","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/df5969835d8f4f8798492d49d6a33d8c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/df5969835d8f4f8798492d49d6a33d8c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/df5969835d8f4f8798492d49d6a33d8c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df5969835d8f4f8798492d49d6a33d8c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df5969835d8f4f8798492d49d6a33d8c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df5969835d8f4f8798492d49d6a33d8c.png","size":""}]},{"name":"Scary Kids Scaring Kids","url":"https://www.last.fm/music/Scary+Kids+Scaring+Kids","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/654d385003884c478d1b592499783227.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/654d385003884c478d1b592499783227.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/654d385003884c478d1b592499783227.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/654d385003884c478d1b592499783227.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/654d385003884c478d1b592499783227.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/654d385003884c478d1b592499783227.png","size":""}]},{"name":"From First to Last","url":"https://www.last.fm/music/From+First+to+Last","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1b2469de4de241aaa9d1752d4c4aa78f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1b2469de4de241aaa9d1752d4c4aa78f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1b2469de4de241aaa9d1752d4c4aa78f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1b2469de4de241aaa9d1752d4c4aa78f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1b2469de4de241aaa9d1752d4c4aa78f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1b2469de4de241aaa9d1752d4c4aa78f.png","size":""}]},{"name":"Dead Poetic","url":"https://www.last.fm/music/Dead+Poetic","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/126fa250fc1b4b6fbd2575dd0a9f567b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/126fa250fc1b4b6fbd2575dd0a9f567b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/126fa250fc1b4b6fbd2575dd0a9f567b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/126fa250fc1b4b6fbd2575dd0a9f567b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/126fa250fc1b4b6fbd2575dd0a9f567b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/126fa250fc1b4b6fbd2575dd0a9f567b.png","size":""}]}]},"tags":{"tag":[{"name":"post-hardcore","url":"https://www.last.fm/tag/post-hardcore"},{"name":"screamo","url":"https://www.last.fm/tag/screamo"},{"name":"emocore","url":"https://www.last.fm/tag/emocore"},{"name":"emo","url":"https://www.last.fm/tag/emo"},{"name":"hardcore","url":"https://www.last.fm/tag/hardcore"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/A+Static+Lullaby/+wiki"}},"published":"25 Feb 2006, 22:06","summary":"It has been seven years since the world was first introduced to the innovative and emotional stylings of A Static Lullaby. They are one of the few bands who can boast that they were there when a genre was being born. Even more special is that they have battled the flood of copycats, survived the test of time, and are are still standing today. Despite periods of loss, internal struggles, and a sometimes unforgiving industry, vocalist Joe Brown and vocalist/guitarist Dan Arnold <a href=\"https://www.last.fm/music/A+Static+Lullaby\">Read more on Last.fm</a>","content":"It has been seven years since the world was first introduced to the innovative and emotional stylings of A Static Lullaby. They are one of the few bands who can boast that they were there when a genre was being born. Even more special is that they have battled the flood of copycats, survived the test of time, and are are still standing today. Despite periods of loss, internal struggles, and a sometimes unforgiving industry, vocalist Joe Brown and vocalist/guitarist Dan Arnold, who co-founded the band in 2001, refuse to let anything stand in the way of their original dream of writing and playing music. Finalizing their lineup with bassist Dane Poppin and drummer Tyler Mahurin, A Static Lullaby is ready to put the past behind them and charge ahead traveling on the heels of lessons learned, mistakes forgotten, and endless possibilities.\n\nThe road to today has been a long and tumultuous one for the Chino Hills, California rockers. Forming in 2001 while still in their teens, A Static Lullaby launched themselves into the local scene of Southern California with a fresh sound that was all at once heavy, catchy, and flat out well-written. ASL found themselves on stage and performing a short two weeks after becoming a band and immediately began to set the bar too high for their peers to reach. In the blink of an eye the band went from writing in their living rooms to being in the radar of the music industry spotlight. Thanks to an intense live show, a strong self-released EP entitled \"Withered\", and an eye-catching image, the music of A Static Lullaby did not go undetected for very long. In 2003 the band signed to the well-established Ferret Records and released their debut record \"...And Don't Forget To Breathe.\" The creativity of the writing was evident on every track, with each member pulling from their respective interests and musical backgrounds. A genre was born and a story was beginning to unfold. \n\nWith record sales climbing each week and the band hitting the road hard in support of their release, it was no surprise that the executive eyebrows of major labels began rising nationwide. In 2004, ASL signed to Columbia Records and were sent back into the studio with producer Lou Giordano (Taking Back Sunday, Goo Goo Dolls) to follow up the huge success of their critically acclaimed debut. The new relationship gave birth to 2005's \"Faso Latido\", which was a testament to experimentation in a hardcore environment and truly showcased the very core of the band's talent. However, the world of major record labels can be harsh and unfair. Falling short of high expectations, tension began to rise causing a chain of events that would shake free the glue holding together A Static Lullaby. \n\nArguably, there is no harder time in the life of a band than when members part ways. After drummer Brett Divono made the choice to leave and return to school, creative differences led to an unfriendly separation from bassist Pirrone and guitarist Nathan Lindeman. Five years after forming, Joe and Dan found themselves alone and confused. However, instead of allowing the hard times to turn to self-pity and regret, the pair shone the situation beneath a positive light: a rebirth was in store for A Static Lullaby.\n\nStarting over was a chance for Joe and Dan to find members who truly shared the same vision and desire as themselves. Solidifying their lineup with drummer Jarrod Alexander, guitarist John Death, and bassist Dane Poppin, ASL began to rebuild themselves. In four short months the band wrote and recorded a collection of new songs with a fresh look and a raw attitude. The music was a return to roots and and a fresh sound carefully molded together. In January of 2006, Fearless Records president Bob Becker found signing the band to be a no-brainer. \"Fearless has been a great support system enabling us to get back on our feet through some trying times,\" says Joe. \"Everyone is truly professional and have great patience with (me).\" The songs were compiled onto a self-titled third record and released later that year to critical acclaim, including a debut on The Billboard Top 200 at #172. The album was living, breathing proof that it was going to take a lot more than member changes and lost record deals to slow the engines of A Static Lullaby.\n\nDespite its glamour and almost dreamlike nature, even the world of music can not hide from the trials and endeavors of everyday life and love. A tough divorce coupled with time spent in rehab led to a rough period for Joe. Its time like these when music can seem insignificant, touring can seem pointless, and the industry as a whole can simply seem too hard. A lesser person may have just drowned in the pressure and let life get the best of him. We should all be very thankful that Joe Brown is not that lesser person. Instead of bowing out and giving up, he picked up the pieces and unleashed his emotion on the much anticipated fourth studio album from A Static Lullaby entitled Rattlesnake! \n\nThe music is heavy, the melodies are soothing, the screams are angry, and the lyrics are painfully honest. There is no hiding anything on this record. ASL returned to their friend and mentor, producer Steve Evetts (Senses Fail, Every Time I Die, Dillinger Escape Plan, Alesana), to help mold the emotional chaos and the result is a speeding locomotive stopping for nothing in its path. \"Steve has been a close friend for many years now, ever since the first record,\" says Joe. \"There was no question about returning to the studio with him. He understands the dynamic of our band...better than any other producer I've worked with.\" The band wrote as a four piece for the first time and they truly took their time spending two months in the studio. \"All in all this is the record I've always wanted to make since starting the band,\" says Joe. \"It showcases everything we worked to create as A Static Lullaby and should be received that way.\"\n\nThere is no hiding the anger and frustration displayed throughout all ten tracks on Rattlesnake! Joe paints a clear picture with lines like \"Your girl is safe with me, bound and bleeding the way they all should be\", \"Someone answer me, I got the steel in my mouth\", and \"Take a second to see, no one can be as sorry as me.\" \"Most of the lyrics were inspired by poems I wrote after my divorce and during my stay in rehab,\" recalls Joes. \"A lot of the visual side of the lyrics are logs from dreams I had during this time.\" Despite their depth and importance, there are times on the record when lyrics are not even necessary to portray the ferocity of the subject matter. The high energy attack of the drums and the perfectly orchestrated guitar arrangements speak for themselves. \"Tyler (Mahurin) has filled the shoes and out-done any previous works on this record,\" brags Joe. \"It is a blessing to have such talent being the backbone of the rhythm section of our band.\" Recorded at Omen Room Studios in Garden Grove, California, the record is scheduled to hit store shelves on September 9, 2008.\n\nA Static Lullaby is certainly no stranger to the road having already completed tours with acts as prestigious as AFI, The Used, Sum 41, Head Automatica, Senses Fail, and My Chemical Romance. They have performed on The Vans Warped Tour, were a main stage act at the 2005 Taste of Chaos, played the Take Action Tour in '07, and were direct support for a sold out UK tour with Funeral For A Friend. From the look of things 2008 will be no different for ASL. \"I embrace touring,\" says Joe. \"...always staying fresh and playing to new people is all I could ask for.\" All summer long the boys will be co-headlining the US with Dance Gavin Dance with support from Four Letter Lie, Secret and Whisper, and Lower Definition. They will also be appearing with Maylene and The Sons of Disaster this fall. With nearly 120,000 MySpace friends, 5,000,000 MySpace plays, and a collective 200,000 records sold, room to move will be hard to find once ASL hits the stage. \n\nThrough the ups and downs, the good times and the bad, A Static Lullaby has proven one thing: they are not going down without a fight. Rattlesnake! is a clear sign that the boys from Chino Hills have no plans of slowing down. \"The most important thing to me is that we are able to continue to make records that satisfy my lunacy and our fans,\" says Joe. \"I believe our band is the best at what we do and as long as I continue to believe that, we will make records and tour.\" This is a new and improved ASL. One that grabs ahold of you and refuses to let go. One of the originators of their genre, A Static Lullaby has returned to conquer the scene and take back what rightfully belongs to them. To close appropriately, the words of Joe Brown: \"I refuse to let this be the last song I sing.\"\n-Shawn Milke\n\nCheck Out A Static Lullaby's Websites.\nwww.myspace.com/astaticlullaby\nwww.facebook.com/astaticlullaby\nwww.buzznet.com/astaticlullaby\nwww.purevolume.com/astaticlullaby\nwww.ilike.com/artist/A+Static+Lullaby <a href=\"https://www.last.fm/music/A+Static+Lullaby\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
