{"artist":{"name":"The Waybacks","mbid":"a39fdbe7-1407-467b-9e6f-ec403de8bf65","url":"https://www.last.fm/music/The+Waybacks","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cec04371e8874606a86ee62415cf34f9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cec04371e8874606a86ee62415cf34f9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cec04371e8874606a86ee62415cf34f9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cec04371e8874606a86ee62415cf34f9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cec04371e8874606a86ee62415cf34f9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cec04371e8874606a86ee62415cf34f9.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"5924","playcount":"44017"},"similar":{"artist":[{"name":"New Grass Revival","url":"https://www.last.fm/music/New+Grass+Revival","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/84dec2a0951541eea1d31fc3f7067f19.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/84dec2a0951541eea1d31fc3f7067f19.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/84dec2a0951541eea1d31fc3f7067f19.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84dec2a0951541eea1d31fc3f7067f19.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84dec2a0951541eea1d31fc3f7067f19.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84dec2a0951541eea1d31fc3f7067f19.png","size":""}]},{"name":"Peter Rowan","url":"https://www.last.fm/music/Peter+Rowan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c934e0d4a87548d58c0c4e548d2fd0cd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c934e0d4a87548d58c0c4e548d2fd0cd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c934e0d4a87548d58c0c4e548d2fd0cd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c934e0d4a87548d58c0c4e548d2fd0cd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c934e0d4a87548d58c0c4e548d2fd0cd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c934e0d4a87548d58c0c4e548d2fd0cd.png","size":""}]},{"name":"Hot Rize","url":"https://www.last.fm/music/Hot+Rize","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/277e826573534e85928ad47bde9afd84.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/277e826573534e85928ad47bde9afd84.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/277e826573534e85928ad47bde9afd84.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/277e826573534e85928ad47bde9afd84.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/277e826573534e85928ad47bde9afd84.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/277e826573534e85928ad47bde9afd84.png","size":""}]},{"name":"The Mammals","url":"https://www.last.fm/music/The+Mammals","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/46fc99c8dc158414595d4485c7bdd764.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/46fc99c8dc158414595d4485c7bdd764.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/46fc99c8dc158414595d4485c7bdd764.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/46fc99c8dc158414595d4485c7bdd764.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/46fc99c8dc158414595d4485c7bdd764.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/46fc99c8dc158414595d4485c7bdd764.png","size":""}]},{"name":"Tony Furtado","url":"https://www.last.fm/music/Tony+Furtado","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/53b58b0bfe494d7a9be2d294b89ae28d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/53b58b0bfe494d7a9be2d294b89ae28d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/53b58b0bfe494d7a9be2d294b89ae28d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/53b58b0bfe494d7a9be2d294b89ae28d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/53b58b0bfe494d7a9be2d294b89ae28d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/53b58b0bfe494d7a9be2d294b89ae28d.png","size":""}]}]},"tags":{"tag":[{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"bluegrass","url":"https://www.last.fm/tag/bluegrass"},{"name":"newgrass","url":"https://www.last.fm/tag/newgrass"},{"name":"folk","url":"https://www.last.fm/tag/folk"},{"name":"Alt-country","url":"https://www.last.fm/tag/Alt-country"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/The+Waybacks/+wiki"}},"published":"03 Nov 2006, 02:40","summary":"They draw freely from the old school and the old world, but The Waybacks are no throwback. They've been erroneously pigeonholed as a bluegrass band and celebrated as purveyors of \"acoustic mayhem.\" They are as uninhibited and unpredictable as the eclectic San Francisco Bay area that claims them, and for nearly a decade, their experiments have always proven sharp-witted and musically dazzling. They're living proof that in music anyway, evolution and intelligent design are entirely compatible. <a href=\"https://www.last.fm/music/The+Waybacks\">Read more on Last.fm</a>","content":"They draw freely from the old school and the old world, but The Waybacks are no throwback. They've been erroneously pigeonholed as a bluegrass band and celebrated as purveyors of \"acoustic mayhem.\" They are as uninhibited and unpredictable as the eclectic San Francisco Bay area that claims them, and for nearly a decade, their experiments have always proven sharp-witted and musically dazzling. They're living proof that in music anyway, evolution and intelligent design are entirely compatible. \"The whole spirit of improvisation, that's always been the cornerstone of this band for me,\" says founding singer, songwriter and guitarist James Nash. \"Through all the stylistic changes and regardless of the instruments we're playing, to me the fun of this band has always been that in some ways I can do whatever I feel like doing at any moment.\"\nThey've been through changes for sure. Now a four-piece with a full arsenal of acoustic and electric instruments, The Waybacks are releasing Loaded, the boldest, rangiest and most exciting album of their career. Produced by Nashville bassist, composer and consummate sideman Byron House, it's a musical rebuke to anyone who would typecast true artistry.\n\nThe folk and roots underpinnings that have long been a Waybacks hallmark are still there, but after years of playing a huge range of venues and festivals, touring with Grateful Dead founder Bob Weir, and reconfiguring themselves around the hot guitar of James Nash and the fiddle virtuosity of Warren Hood, The Waybacks are enjoying a refreshed repertoire, one that's touched by Memphis soul, honky-tonk, Parisian swing, classical music, vintage blue pop and much more besides. Nash and Hood have stepped forward as songwriters, allowing The Waybacks to assemble their first project of entirely original music. They're finding a new collective voice, right before our ears.\n\nBesides Nash, the Waybacks include drummer Chuck Hamilton, bass player Joe Kyle Jr. and the newest member, fiddler and mandolinist Warren Hood. Those who have followed the band's progress over the past five years have had to bid good-bye to two long-time members, finger-stylist and singer Stevie Coyle and multi-instrumentalist Chojo Jacques. But in welcoming Hood (who sometimes refers to the revamped band as a power trio plus fiddle) and focusing around a more rhythmic, far-reaching sound. You might say The Waybacks have grown by shrinking.\n\n\"I just thought they were all very talented players,\" says Hood about his attraction to The Waybacks. \"I really couldn't put them into a genre, but I guess that's what I liked about it. I'd rather be in a band that plays a little of everything than a band that lives in one genre all night.\"\n\nThe Waybacks were launched in 1999, when Nash, a guitar phenomenon raised in Nashville, was making a living in San Francisco playing solid-body electric guitar. His involvement in an acoustic side project was not supposed to change his life, but it did. \"It was kind of a novelty to me,\" he says. \"It was a liberating, exciting thing where I kind of rediscovered that I love playing acoustic instruments.\" As they began touring, Nash was quickly recognized as a top-flight picker even in the rarified company that circulated at the world's best folk, roots and bluegrass festivals. The Waybacks' show was built around blazing instrumental skills and large doses of hilarity. They'd play traditional fiddle tunes with their own twist, original songs that fell into no category, and insanely difficult jazz tunes like Charlie Parker's \"Scrapple From The Apple.\"\n\nFans loved it, and so did the critics. The Chicago Tribune's David Royko praised their \"near-ideal balance of irreverence, chops, discipline, and originality.\" Bay Area writer Michael Miller admired their \"exotic settings\" and \"mind blowing picking.\" It led to major festival bookings and eventually a recording arrangement with Nashville's roots label Compass Records.\n\nThe Bob Weir shows were one of the most recent validations that The Waybacks had tapped into something profound. The Grateful Dead co-founder has remained incredibly prolific over the years, and in The Waybacks he saw something he recognized. He and the band collaborated on several memorable shows in 2006, including much buzzed-about sets at Merlefest in North Carolina and Hardly Strictly Bluegrass in San Francisco. They translated some of the Dead's electric repertoire into a newgrass format, while working up covers together from the likes of Johnny Cash and Led Zeppelin. So it should come as no surprise if you hear overtones of the Dead's freedom and eclecticism in songs like \"Good Enough\" and \"The River\" on Loaded.\n\nWhen they were getting ready to make the new album, Nash and company scheduled their longest- ever period of pre-production. It was a necessary step to finding out how to work as a four-piece and a productive investment in crafting an album that accomplishes a lot of things. \"We were so much better prepared for the studio and we had a lot more fun this time,\" says Joe Kyle. \"Once we got to Nashville with the meter running we were able to get down to business at once. The vibe was strong in the studio. We were at once purposeful and focused and we were having a ball.\"\n\nKyle also says that for the first time The Waybacks had more original material to record than they had space for. That's because of the songwriting energy of Nash and Hood. Warren's songs lean toward the vintage, and he shows chops beyond his 24 years in the complex chord changes and sophisticated melodies of tunes like \"Savannah.\" \"Nice To Be Alone\" sounds like something Sam Cooke might have recorded, and \"Tired of Being Right\" is a full-tilt roadhouse boogie. Hood also proves he's a gifted singer and every bit the son of Champ Hood, whose seminal Uncle Walt's Band is one good historical touchstone for The Waybacks.\n\nNash's songs tend to jam out harder and tell great stories. The characters in Loaded and \"City Boy\" are palpable and have motivation. The proud-because-she-has-to-be girl in \"Conjugal Visit\" is no lighter weight for being the subject of a funny song. \"Beyond the Northwest Passage\" is a no-holds- barred sea shanty with a rousing sing-along chorus that features the band's beer-fueled pals from the Greencards and the Infamous Stringdusters.\n\nDrummer Chuck Hamilton says \"each successive Waybacks recording project has been an improvement on the previous one- more fun, better musicianship, better production- and Loaded continues in that tradition. Somehow everything seems more authentic now. There's a combination of freedom and pressure that I really like.\"\n\nWhen you think about it, that's the essential tension behind all great music. One without the other just doesn't work. It's that balance that makes The Waybacks a real ensemble, one that transcends genres in the best possible way. As Hood says, \"I'd like to hear them try to call us a bluegrass band now!\" <a href=\"https://www.last.fm/music/The+Waybacks\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
