{"artist":{"name":"Theodis Ealey","mbid":"b049efcb-cd14-4aa4-aa2e-85b5f468f7fe","url":"https://www.last.fm/music/Theodis+Ealey","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8706ba9d635e4bb09ba40dc904aa7c16.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8706ba9d635e4bb09ba40dc904aa7c16.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8706ba9d635e4bb09ba40dc904aa7c16.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8706ba9d635e4bb09ba40dc904aa7c16.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8706ba9d635e4bb09ba40dc904aa7c16.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8706ba9d635e4bb09ba40dc904aa7c16.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"3648","playcount":"17984"},"similar":{"artist":[{"name":"Mel Waiters","url":"https://www.last.fm/music/Mel+Waiters","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dcc78150693f4ab1bf2d41aebf095059.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dcc78150693f4ab1bf2d41aebf095059.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dcc78150693f4ab1bf2d41aebf095059.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dcc78150693f4ab1bf2d41aebf095059.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dcc78150693f4ab1bf2d41aebf095059.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dcc78150693f4ab1bf2d41aebf095059.png","size":""}]},{"name":"Marvin Sease","url":"https://www.last.fm/music/Marvin+Sease","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/79f092c31f1e42d8934508722d9f30f6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/79f092c31f1e42d8934508722d9f30f6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/79f092c31f1e42d8934508722d9f30f6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/79f092c31f1e42d8934508722d9f30f6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/79f092c31f1e42d8934508722d9f30f6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/79f092c31f1e42d8934508722d9f30f6.png","size":""}]},{"name":"Carl Sims","url":"https://www.last.fm/music/Carl+Sims","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/05599fa966b942fab5f59de494e18810.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/05599fa966b942fab5f59de494e18810.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/05599fa966b942fab5f59de494e18810.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05599fa966b942fab5f59de494e18810.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05599fa966b942fab5f59de494e18810.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/05599fa966b942fab5f59de494e18810.png","size":""}]},{"name":"Floyd Taylor","url":"https://www.last.fm/music/Floyd+Taylor","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/23734ae7d437470b8f1fcef2cb7666c5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/23734ae7d437470b8f1fcef2cb7666c5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/23734ae7d437470b8f1fcef2cb7666c5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/23734ae7d437470b8f1fcef2cb7666c5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/23734ae7d437470b8f1fcef2cb7666c5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/23734ae7d437470b8f1fcef2cb7666c5.png","size":""}]},{"name":"Willie Clayton","url":"https://www.last.fm/music/Willie+Clayton","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bb75492bd05d44b79e3dcc1073373713.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bb75492bd05d44b79e3dcc1073373713.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bb75492bd05d44b79e3dcc1073373713.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb75492bd05d44b79e3dcc1073373713.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb75492bd05d44b79e3dcc1073373713.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bb75492bd05d44b79e3dcc1073373713.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"worth a listen","url":"https://www.last.fm/tag/worth+a+listen"},{"name":"funk","url":"https://www.last.fm/tag/funk"},{"name":"bluesrock","url":"https://www.last.fm/tag/bluesrock"},{"name":"guitar blues","url":"https://www.last.fm/tag/guitar+blues"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Theodis+Ealey/+wiki"}},"published":"07 Dec 2006, 23:30","summary":"Blues Guitarist, Vocalist, Songwriter Producer, and Entertainer... are just a few of the titles that describe the phenomenon of Theodis Ealey. This Mississippi native first picked up an instrument when his older brother Y Z Ealey first taught him how to play at the age of 4. Ten years later, Theodis on bass was playing at his first gig with brothers Y Z and Melvin Ealey in a group called Y Z Ealey and the Merrymakers. This brotherly trio made their debut in their hometown of Natchez, Mississippi at a local nightclub called Horseshoe Circle. <a href=\"https://www.last.fm/music/Theodis+Ealey\">Read more on Last.fm</a>","content":"Blues Guitarist, Vocalist, Songwriter Producer, and Entertainer... are just a few of the titles that describe the phenomenon of Theodis Ealey. This Mississippi native first picked up an instrument when his older brother Y Z Ealey first taught him how to play at the age of 4. Ten years later, Theodis on bass was playing at his first gig with brothers Y Z and Melvin Ealey in a group called Y Z Ealey and the Merrymakers. This brotherly trio made their debut in their hometown of Natchez, Mississippi at a local nightclub called Horseshoe Circle. One year later, Theodis traded his bass for a guitar and began performing with another Natchez group, Eugene Butler & the Rocking Royals. It was here that Theodis sharpened his guitar playing skills while hitting the local circuit.\n\nMusic has always been a part of his life. Growing up, Theodis says this lifelong love affair with music began when he lived on Highway 61 on the other side of the road from Miss Willie Mae's Juke Joint. \"I would just sit on the steps and listen to the sounds coming from there\" the heart and soul of the Blues. Since leaving Mississippi, Theodis always carried the \"Mississippi Juke Joint Spirit\" with him through his music.\n\nAs one of 11 children in his family, Theodis wanted to travel the world and the U.S. Air Force provided the opportunity. During his military tour of service, Theodis was stationed in Hawaii for 6 years and then moved to Oakland, California before making Atlanta, Georgia his permanent home. Still holding strong to his Mississippi roots, Theodis played guitar with such notable artists as Little Milton, Johnny Clyde Copeland, Richard \"Dimples\" Fields, the Blues Brothers, and the 'legendary' Charles Brown. This musical journey enabled Theodis to generate a personal style based upon his love of diverse music -- blues, country, soul, and rock.\n\nEstablished as an accomplished guitarist, Theodis took a chance and the music industry soon discovered the voice behind the guitar. Theodis \"the artist\" was born. Ichiban Records, a respected blues label in Atlanta, recognized Theodis' multiple talents and immediately signed him to a deal in 1991. Over the next six years, Theodis and Ichiban Records would enjoy 4 very successful albums. It was Theodis Ealey's charm and magnetism that attracted audiences worldwide. His electrifying stage performances also opened doors to Hollywood. Theodis appeared in the NBC Movie of the Week \"A Kiss To Die For,\" the Emmy-winning HBO special \"Miss Evers' Boys,\" the major motion picture \"The Fighting Temptations,\" and commercials for Rooms To Go and the Cartoon Network, forever \"The Bluesman Lover.\"\n\nTheodis Ealey generated industry recognition for his innovative style and authentic Mississippi flavor as the recipient of the Mo' Better Blues Male Artist of the Year Award in 1997 and Male Vocalist Top Star Award in the San Francisco Bay Area (1994). Theodis Ealey also crossed music genres and performed as a featured vocalist with Hip-Hop Group Ghetto Mafia \"On Da Grind\" CD, further expanding his fan base.\n\nThe \"Bluesman Lover\" created lemonade out of lemons when Ichiban Records eventually closed its doors. Seizing the moment, Theodis Ealey used this opportunity to create his new label home IFGAM Records. The name alone is symbolic of the Theodis Ealey spirit...I Feel Good About Myself (IFGAM). At his new label home, Theodis released his fifth project called \"It's A Real Good Thang,\" continuing with the Ealey tradition of music diversity filled with pure soul.\n\nHis current project \"Stand Up In It\" has been a runaway success as the #1 Single on Billboard's Hot R&B/Hip Hop Singles Sales Chart for five consecutive weeks, debuting as #5 on Billboard's Blues Album Chart and #69 on Billboards R&B/Hip-Hop Charts. Theodis thought this song and album was just for \"grown folks\" but the radio industry and listeners thought otherwise.\n\nEaley was one of 11 children raised in his family. He was stationed in Hawaii during his stint with the U.S. Air Force and spent some time in Oakland before settling down in the early '90s in Atlanta. It wasn't long before Ichiban Records took notice of his musical and vocal skills and signed him to a deal. The blues label was located in the city of Marietta and put out four of his albums over a span of six years before folding. Ealey went on to sign a contract with IFGAM, and the new label out of Atlanta issued his It's a Real Good Thing CD in 2002. While part of the Ichiban stable of artists, Ealey had the opportunity to tour Europe a few times. In 1997, he took home top prize as the Mo' Better Blues Male Artist of the Year in Atlanta. In San Francisco, he won the honor of Male Vocalist Top Star three years before. His credits include a star turn as Guitar Man in the theatrical production of Spunk, which is based on works by Zora Neale Thurston. He also appeared on television in the movies Miss Evers' Boys on HBO and A Kiss to Die For on NBC. In addition, he was featured on Ghetto Mafia's On da Grind CD. He toured the world with his band in 2002. <a href=\"https://www.last.fm/music/Theodis+Ealey\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
