{"artist":{"name":"Three 6 Mafia","mbid":"a8754ac4-a85e-4f48-a81f-eecd482570ef","url":"https://www.last.fm/music/Three+6+Mafia","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/46fe0adf431a46a4c63c31fee29761b4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/46fe0adf431a46a4c63c31fee29761b4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/46fe0adf431a46a4c63c31fee29761b4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/46fe0adf431a46a4c63c31fee29761b4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/46fe0adf431a46a4c63c31fee29761b4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/46fe0adf431a46a4c63c31fee29761b4.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"707098","playcount":"9994374"},"similar":{"artist":[{"name":"Koopsta Knicca","url":"https://www.last.fm/music/Koopsta+Knicca","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2d2e931bcb3e4f6d84275e44dce91e25.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2d2e931bcb3e4f6d84275e44dce91e25.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2d2e931bcb3e4f6d84275e44dce91e25.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2d2e931bcb3e4f6d84275e44dce91e25.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2d2e931bcb3e4f6d84275e44dce91e25.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2d2e931bcb3e4f6d84275e44dce91e25.png","size":""}]},{"name":"Tear da Club Up Thugs","url":"https://www.last.fm/music/Tear+da+Club+Up+Thugs","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/92a7aebee46f4a0aba2f6a6467a85866.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/92a7aebee46f4a0aba2f6a6467a85866.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/92a7aebee46f4a0aba2f6a6467a85866.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/92a7aebee46f4a0aba2f6a6467a85866.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/92a7aebee46f4a0aba2f6a6467a85866.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/92a7aebee46f4a0aba2f6a6467a85866.png","size":""}]},{"name":"Project Pat","url":"https://www.last.fm/music/Project+Pat","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/49596e65742c4fd0a72a1d5d2b58131a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/49596e65742c4fd0a72a1d5d2b58131a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/49596e65742c4fd0a72a1d5d2b58131a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/49596e65742c4fd0a72a1d5d2b58131a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/49596e65742c4fd0a72a1d5d2b58131a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/49596e65742c4fd0a72a1d5d2b58131a.png","size":""}]},{"name":"DJ Paul","url":"https://www.last.fm/music/DJ+Paul","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/782108ebb0b74cefa168ba67bcdcd79d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/782108ebb0b74cefa168ba67bcdcd79d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/782108ebb0b74cefa168ba67bcdcd79d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/782108ebb0b74cefa168ba67bcdcd79d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/782108ebb0b74cefa168ba67bcdcd79d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/782108ebb0b74cefa168ba67bcdcd79d.png","size":""}]},{"name":"Kingpin Skinny Pimp","url":"https://www.last.fm/music/Kingpin+Skinny+Pimp","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f07947ff318941d0a92b70b24432420d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f07947ff318941d0a92b70b24432420d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f07947ff318941d0a92b70b24432420d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f07947ff318941d0a92b70b24432420d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f07947ff318941d0a92b70b24432420d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f07947ff318941d0a92b70b24432420d.png","size":""}]}]},"tags":{"tag":[{"name":"rap","url":"https://www.last.fm/tag/rap"},{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"Dirty South","url":"https://www.last.fm/tag/Dirty+South"},{"name":"southern rap","url":"https://www.last.fm/tag/southern+rap"},{"name":"hip hop","url":"https://www.last.fm/tag/hip+hop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Three+6+Mafia/+wiki"}},"published":"20 Feb 2006, 16:27","summary":"Three 6 Mafia is an American hip hop group from Memphis, Tennessee. Originally called \"Backyard Posse,\" the group has included many members, including Gangsta Blac, Gangsta Boo, La' Chat, Koopsta Knicca, Lord Infamous, Playa Fly and Crunchy Black. The group now consists of only Juicy J and DJ Paul, who also serve as in-house producers. Project Pat is signed to their label along with Lil' Wyte. The dark and hardcore group is famous for their gruesome lyrics with topics ranging from drug use to inciting the crowd in a nightclub to riot. <a href=\"https://www.last.fm/music/Three+6+Mafia\">Read more on Last.fm</a>","content":"Three 6 Mafia is an American hip hop group from Memphis, Tennessee. Originally called \"Backyard Posse,\" the group has included many members, including Gangsta Blac, Gangsta Boo, La' Chat, Koopsta Knicca, Lord Infamous, Playa Fly and Crunchy Black. The group now consists of only Juicy J and DJ Paul, who also serve as in-house producers. Project Pat is signed to their label along with Lil' Wyte. The dark and hardcore group is famous for their gruesome lyrics with topics ranging from drug use to inciting the crowd in a nightclub to riot. They are famous for being pioneers of the crunk sound, as well as being the first rap artists from Memphis to go platinum.\n\nIn 1995, the Memphis underground rap group, then named \"Triple 6 Mafia\", released its first official album, Mystic Stylez. It had recorded this album by using the profits from its highly successful underground tape Smoked Out, Loced Out. The members then changed the group's name to \"Three 6 Mafia\" (or sometimes \"3-6 Mafia\") and now use the Triple-6 name on the compilations of reissued tracks from their underground tapes. They did this because radio stations supposedly refused to play the songs of a group whose name included a reference to the number 666. There are also rumors that the name was changed because of copyright reasons due to a falling out with others in the Memphis rap scene. The group has had a number of disputes with former allies, namely Playa Fly, Gangsta Blac, and Skinny Pimp. In fact, some say that the group was originally named \"Three Six Mafia\" (all words spelled out), then switched to \"Triple Six\" for similar reasons.\n\nOn the 1995 single \"Live By Yo Rep\", the group had accused Cleveland group Bone Thugs-N-Harmony of stealing its style (a mix of quasi-harmonic rapping and blatant references to the occult). The track \"All Original\" on Bone's Art of War album is thought to be a dis of Three Six (this issue has apparently been settled, however). The problems between the two groups were eventually settled in family court in June 1996.\n\nEventually, Three 6 Mafia moved towards the \"crunk\" style of rap - repetitive chanting aimed at hyping a crowd (e.g.— \"tear the club up, nigga, tear the club up!\"). This direction (exemplified by songs like \"Sippin' on Syrup\" with Houston rappers UGK) helped them reach number 6 on the Billboard album chart in 2000 with their CD 6661: When the Smoke Clears.\n\nThree 6 has expanded its operations considerably. Its stable of affiliated rappers is called \"Hypnotize Minds\" or the \"Hypnotize Camp Posse\" (HCP). Aside from many of the individual members releasing solo albums, they have also released material from \"Tear Da Club Up Thugs\" (a side project) and \"Three Six Mafia Presents: Hypnotize Camp Posse\" (a Memphis rap compilation). Unfortunately, Three 6 Mafia has also lost many members. Koopsta Knicca left due to a monetary dispute, while La Chat is currently pursuing a solo career. Gangsta Boo is rumored to have converted to Christianity and is interested in gospel music (which she denies, saying that it's a rumor started by her former label mates). Lord Infamous is likely in prison and very possibly under 24-hour lockdown, although Juicy J has said he's on \"vacation.\" T-Rock has parted ways with Three 6 Mafia, and has publicly dissed the entire clique and accused them of shady business dealings in interviews and on his track \"Mr. Big Man.\" Project Pat recently served time in prison for a parole violation, but was released in July 2005.\n\nIn 2003, Three 6 Mafia released the album Da Unbreakables, which features collaborations with Lil' Flip, Pimp C, (from UGK), Lil' Wyte, Frayser Boy, Hank Williams, Jr., and Project Pat. The album produced the hit \"Ridin' Spinnerz,\" which featured Lil' Flip.\n\nIn 2005, Three 6 Mafia released their highly anticipated new album “Most Known Unknown.” It was notable that Lord Infamous was missing from this album. The generally accepted reason was that he had been incarcerated; however, Three 6 Mafia claim he is on \"holiday.” He has since officially returned to Three 6 Mafia recently. The group is said to be associated with the crip gang. They diss the bloods in many of their lyrics.\n\nThree 6 Mafia has always been known for their controversial and sometimes misunderstood lyrics. For example, in the song \"Knock the Black Off Yo Ass\", they reference the DC Area Sniper Shootings in multiple lines in the song. \"I think they better call Bush, 'cause it's a national disaster, when I unleash my pistol-grip Bushmaster.\" \"You can't hide, you can't run. I'm a sniper, ridin' in a blue Chevy, a trunk full of guns, man you hoes ain't ready.\"\n\n“Stay Fly” was the first single off of The Most Unknown album. The next single released off of the album was \"Poppin’ My Collar,\" which premiered around mid January 2006.\n\nTheir song \"Late Nite Tip\" is favoured by car audio enthusiasts for its deep, rolling bassline and is a stalwart of testing ones sound system also it is known that they sampled many Willie Hutch songs on their album Most Known Unknown\n\nIn January of 2006, Three 6 Mafia made history as they became the first African-American hip-hop act to be nominated for an Academy Award in the category of Best Achievement In Music Written for Motion Pictures (Original Song). The group was nominated for the song It’s Hard Out Here For A Pimp off of the Hustle & Flow soundtrack. The first hip-hop act to actually be nominated for an Academy Award in this category was Eminem in 2002 for the song Lose Yourself off the 8 Mile soundtrack and he also won the award. Three 6 Mafia was credited by their real names in the nomination and not by their group name. Jordan Houston (Juicy J), Cedric Coleman (Crunchy Black), and Paul Beauregard (DJ Paul) were named in the nomination. Terrance Howard, who performed the song in the movie, refuses to perform it at the Academy Awards possibly because it reinforces stereotypes that all black males are pimps.\n\nOn March 5, 2006, Three 6 Mafia won the Academy Award they were nominated for, becoming the first African American Hip-Hop group to win an Oscar.\n\nDuring May Crunchy Black left Three 6 Mafia to go on his own. He is releasing 4 mixtapes and 4 dvds in the near future.\n\nOrigin: Memphis, Tennessee\nYear Formed: 1991 <a href=\"https://www.last.fm/music/Three+6+Mafia\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
