{"artist":{"name":"Bill Laswell","mbid":"8b7a121c-5b50-4912-ab4c-e49a631a2db0","url":"https://www.last.fm/music/Bill+Laswell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/18057a76df564d9bbb1afb2e7458c059.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/18057a76df564d9bbb1afb2e7458c059.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/18057a76df564d9bbb1afb2e7458c059.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/18057a76df564d9bbb1afb2e7458c059.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/18057a76df564d9bbb1afb2e7458c059.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/18057a76df564d9bbb1afb2e7458c059.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"81031","playcount":"999955"},"similar":{"artist":[{"name":"Jah Wobble","url":"https://www.last.fm/music/Jah+Wobble","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5705a31aa80c4272891f3413c50dc05b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5705a31aa80c4272891f3413c50dc05b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5705a31aa80c4272891f3413c50dc05b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5705a31aa80c4272891f3413c50dc05b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5705a31aa80c4272891f3413c50dc05b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5705a31aa80c4272891f3413c50dc05b.png","size":""}]},{"name":"Material","url":"https://www.last.fm/music/Material","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/75d455b6d3e042c1adeffcab3c8c1b9c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/75d455b6d3e042c1adeffcab3c8c1b9c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/75d455b6d3e042c1adeffcab3c8c1b9c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/75d455b6d3e042c1adeffcab3c8c1b9c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/75d455b6d3e042c1adeffcab3c8c1b9c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/75d455b6d3e042c1adeffcab3c8c1b9c.png","size":""}]},{"name":"African Head Charge","url":"https://www.last.fm/music/African+Head+Charge","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7f4fb17853dc4e92a1f6520d3381db4e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7f4fb17853dc4e92a1f6520d3381db4e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7f4fb17853dc4e92a1f6520d3381db4e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f4fb17853dc4e92a1f6520d3381db4e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f4fb17853dc4e92a1f6520d3381db4e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f4fb17853dc4e92a1f6520d3381db4e.png","size":""}]},{"name":"John Zorn","url":"https://www.last.fm/music/John+Zorn","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4352116ec5074fcbbaf45187d0dd0c7c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4352116ec5074fcbbaf45187d0dd0c7c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4352116ec5074fcbbaf45187d0dd0c7c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4352116ec5074fcbbaf45187d0dd0c7c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4352116ec5074fcbbaf45187d0dd0c7c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4352116ec5074fcbbaf45187d0dd0c7c.png","size":""}]},{"name":"Jon Hassell","url":"https://www.last.fm/music/Jon+Hassell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c8b5a5401ccd418fa2944063f627171f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c8b5a5401ccd418fa2944063f627171f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c8b5a5401ccd418fa2944063f627171f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c8b5a5401ccd418fa2944063f627171f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c8b5a5401ccd418fa2944063f627171f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c8b5a5401ccd418fa2944063f627171f.png","size":""}]}]},"tags":{"tag":[{"name":"ambient","url":"https://www.last.fm/tag/ambient"},{"name":"dub","url":"https://www.last.fm/tag/dub"},{"name":"experimental","url":"https://www.last.fm/tag/experimental"},{"name":"electronic","url":"https://www.last.fm/tag/electronic"},{"name":"jazz","url":"https://www.last.fm/tag/jazz"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Bill+Laswell/+wiki"}},"published":"12 May 2006, 18:03","summary":"With over 25 years of experience as a touring musician and composer and over 700 albums to his credit, producer and bassist Bill Laswell has collaborated with some of the most illustrious names in music across all genres and boundaries, including Buckethead, Herbie Hancock, Mick Jagger, Laurie Anderson, Pharoah Sanders, Yoko Ono, Iggy Pop, The Last Poets, Buddy Miles, George Clinton, Bootsy Collins, Afrika Bambaataa, Tony Williams, Public Image Ltd. <a href=\"https://www.last.fm/music/Bill+Laswell\">Read more on Last.fm</a>","content":"With over 25 years of experience as a touring musician and composer and over 700 albums to his credit, producer and bassist Bill Laswell has collaborated with some of the most illustrious names in music across all genres and boundaries, including Buckethead, Herbie Hancock, Mick Jagger, Laurie Anderson, Pharoah Sanders, Yoko Ono, Iggy Pop, The Last Poets, Buddy Miles, George Clinton, Bootsy Collins, Afrika Bambaataa, Tony Williams, Public Image Ltd., Peter Gabriel and countless others. He has also organized and produced recordings with master musicians from around the world, having logged extensive travel in Morocco and West Africa, India, Japan, Cuba, Australia, Brazil, and numerous other locations throughout Asia, Africa and South America. In the United States and abroad, his name has become synonymous with a commitment to creativity, integrity and daring -- whether in the recording studio or on stage -- that has earned him the respect (and often lifelong friendship) of all the artists with whom he has worked.\n\nBill Laswell was born in Salem, Illinois in 1955 and fell into music originally for social rather than aesthetic reasons; he has often been quoted as saying \"a band was like a gang.\" He started on guitar but soon switched to electric bass, and in his earliest groups played soul and funk music inspired by the likes of James Brown and Johnny \"Guitar\" Watson. In the early '70s he toured the \"chitlin circuit\" with cover bands that played Al Green, O'Jays and Meters material, while back home he was constantly making pilgrimages to Detroit for live performances of groups as diverse as The Stooges, The MC5 and Parliament-Funkadelic -- sometimes all on the same stage. Laswell was deeply into Black music but was also absorbing the tenets of protopunk and rock; the rhythmic assurance and aggressiveness that are the cornerstone of virtually all his work have their genesis in this early training. Early exposure to the music of Ornette Coleman, Albert Ayler, John Coltrane and Miles Davis also sparked in him a devoted interest in improvisation and the possibilities of real interaction with other musicians.\n\nLaswell eventually landed in New York in 1979 and almost immediately set out to change the climate of live and recorded music. He became an integral fixture in the growing downtown avant garde scene (dubbed \"no wave\" music by the press) with John Zorn, James Blood Ulmer, Fred Frith, Olu Dara, Billy Bang and many others, and launched a recording career that began with Brian Eno's On Land and continued with the Material collective he co-founded with keyboardist Michael Beinhorn and drummer Fred Maher, as well as other groups such as Massacre (with Fred Frith) and Daevid Allen's \"avant-fusion\" band Gong. By 1984, after only five years in New York, Laswell had reached the first of many pinnacles in his career by producing the first two of three revolutionary electronic albums for Herbie Hancock -- the hip-hop fusion classic Future Shock, which yielded the worldwide dancefloor and MTV hit \"Rockit,\" and the Grammy-winning follow-up Sound System. (Perfect Machine, the third of the triumvirate, would follow in 1988.)\n\nFuture Shock was a monumental foray into hip-hop, which in 1983 was for the most part a self-contained and even consciously guarded movement. The album featured turntable improvisations by Grandmixer D.ST, who was in on the ground floor of the founding of Afrika Bambaataa's Universal Zulu Nation in the Bronx, and who later that year would perform live with Laswell's group Material at the Montreux Jazz Festival. Shortly thereafter, Bambaataa was recruited to cover The MC5's \"Kick Out The Jams,\" and a fruitful collaborative period between Bam and Laswell was set in motion. The partnership sparked numerous Soulsonic Force-related projects, including the club hit \"World Destruction\" (with, of all people, John Lydon on vocals) and albums like Shango Funk Theology and The Light, the latter featuring guest appearances from George Clinton, Bootsy Collins and Bernie Worrell of Parliament-Funkadelic fame. Few fans of the music today are aware of the fact that Laswell was one of the main catalysts of a real funk and hip-hop fusion, and that he was executing it on stage before anyone had even conceived of adding a DJ to a live unit.\n\nLaswell quickly became the most sought-after producer of the moment, but after a string of high-profile albums that included Mick Jagger's She's The Boss, Public Image Ltd's Album and production or mixing work for Yoko Ono, Laurie Anderson, Peter Gabriel, Iggy Pop, Motorhead and many others, he began to move away from \"the business\" and the corporate constrictions that come with success in order to explore entirely new musical directions. His work with African musicians for the Celluloid label was one path in evidence here, as was his immersion in reggae rhythms on Sly & Robbie's post-Black Uhuru releases (which include Language Barrier in 1985 and the punk-funk classic Rhythm Killers in 1987) and Yellowman's breakthrough King Yellowman. For projects like these, Laswell was vilified by critics as a \"cultural bandit\" and a \"destroyer\" of African musical traditions; it was never even acknowledged that artists like Fela Kuti and Manu Dibango wanted to make the leap into Western technologies, and that Laswell was the only producer equipped to provide this access. Years later, computers and drum machines inevitably made their way into numerous African, Jamaican, Middle Eastern and Asian styles like dancehall, soukous, rai and bhangra -- thus answering the \"purist\" argument.\n\nWhile all this was happening, Laswell still found time to advance his pursuit of what had drawn him to New York in the first place -- the energy of group improvisation and the potential of creative \"collisions\" in live musicianship. Alongside the r&b, funk and world music-influenced Material projects Memory Serves and One Down, he displayed a more aggressive edge on bass in groups like Painkiller (with John Zorn) and the explosive freelance outfit Last Exit (with saxophonist Peter Brotzmann, drummer Ronald Shannon Jackson, and guitar great Sonny Sharrock). The aftermath of a Last Exit show in Europe was something akin to scorched earth, with jazz critics and avant garde fans alike shaking their heads in disbelief. The group released a series of acclaimed albums before calling it quits for reasons, according to Sharrock, that had to do with \"keeping a fresh approach to the music; we felt that after being together for so long we were in danger of repeating ourselves, which is never what the group was about.\"\n\nIn 1990, in a partnership with Island Records founder Chris Blackwell, Laswell created the Axiom label and opened his Greenpoint Studio in Brooklyn (now relocated to Orange Music Sound Studios in New Jersey). Both the imprint and the studio itself have been a magnet for some of the most innovative artists on the planet, including composer/arranger Henry Threadgill, jazz giants and Coltrane acolytes Pharoah Sanders and Elvin Jones, beat godfather William S. Burroughs, Miles Davis alumni Tony Williams, Wayne Shorter and Herbie Hancock, ex-Cream drummer Ginger Baker, and some of the more illustrious emissaries of funk and hip-hop such as George Clinton, Bootsy Collins, Buddy Miles, Bernie Worrell, the Jungle Brothers, the Bomb Squad (Hank and Keith Shocklee, the production team behind Public Enemy), and Umar Bin Hassan and Abiodun Oyewole of the original Last Poets.\n\nNumerous Axiom projects have been realized with musicians from around the world, including the Master Musicians of Jajouka (Morocco), the Mandinka and Fulani drummers of Gambia, the Gnawa musicians of Essaouira and Marrakesh (Morocco), the Olodum drumming ensemble (Brazil), and solo artists such as tabla master Zakir Hussain (India), vocalist and composer Liu Sola (China), violinists L. Shankar (India) and Simon Shaheen (Palestine), kora player Foday Musa Suso (Gambia), percussionist Aiyb Dieng (Senegal), and many more. While Laswell has always maintained a keen interest in working with musicians in their own environment -- particularly in Morocco and West Africa -- these are more than mere \"field recordings\". Using state-of-the-art multi-tracking techniques, Laswell is able to capture the live energy of a location and translate it into an even larger sonic experience from behind the mixing board.\n\nStarting in late 1994, Axiom began a series of label-defining releases that represented a new approach to certain \"genres\" in music. The first was the Axiom Ambient project Lost in the Translation, featuring Laswell's studio reconstructions of the Axiom catalog and contributions from UK ambient scholars The Orb, as well as Tokyo-born Tetsu Inoue and New York DJ Terre Thaemlitz. Axiom Funk's Funkcronomicon (from 1995) is a raucous exploration of postmodern funk, with George Clinton, Sly Stone, Bootsy Collins and various Parliament-Funkadelic alumni, including the late Eddie Hazel's last recorded works. Releases for 1996 included Altered Beats, a turntable-based hip-hop fugue featuring DXT, DJ Krush, New Kingdom, Prince Paul, Material, DJs Rob Swift, Q-Bert DJ DISK and more; and the Axiom Dub collection Mysteries of Creation, with revolutionary new tracks from Sly & Robbie, The Orb, Adrian Sherwood and Dub Syndicate, Mad Professor and many others.\n\nIn 1997 Laswell furthered his reputation for innovation (and alleged controversy) by exploring the tape vaults of two icons of modern music -- Miles Davis and Bob Marley. Emerging with original source material -- some of it previously unreleased -- he essentially uses the recording studio as an instrument of improvisation to construct radically different remixes of selections from Miles Davis' electric work (originally recorded from 1969 to 1974), and Bob Marley's studio work with the Wailers (from 1973 to 1979). The resulting albums, Panthalassa (Sony/Columbia) and Dreams Of Freedom (Axiom/Island), bring not only a fresh and futuristic perspective to the music of two very important artists, but also represent a new way of experiencing recorded sound in an ambient and almost sanctified environment. Similar remix projects are already planned for the music of Carlos Santana and Tony Williams Lifetime.\n\nAn equally huge undertaking -- and the last record to be released under Axiom's agreement with Island -- took place under the group name of Arcana. Arc of the Testimony, also released in 1997, is a futuristic ambient-jazz-rock fission with ex-Miles Davis drummer Tony Williams, Laswell on bass, and a stable of legendary musicians including Pharoah Sanders, Byard Lancaster and cornet prodigy Graham Haynes, with Nicky Skopelitis and mutant virtuoso Buckethead on guitars. It would turn out to be one of the last sessions Tony Williams completed before his passing in early 1997.\n\nAfter a brief hiatus due to a much-publicized record company merger that left the label's future temporarily uncertain, Axiom is now part of the Palm Pictures family and has released two new projects in 1999 and 2000. Material's Intonarumori -- a \"mutant hip-hop manifesto\" covering a wide spectrum of influences from the breakbeat underground -- continues the thread that started with the founding of Axiom a decade ago. Featuring performances from Kool Keith, Public Enemy's Flavor Flav, Wu Tang Clan's Killah Priest, Company Flow's Mr. Len and old school rap icon Rammellzee (again, to name only a few), the record has conceptual ties to several Laswell-directed projects of recent years, including Altered Beats (on Axiom), the Valis 1 and 2 compilations (on the Subharmonic and ION labels), and the now-legendary Crazy Wisdom Masters with the Jungle Brothers -- an endlessly compelling (and bootlegged) collision of urban beat poetics and live orchestration that was ultimately rejected by the JBs' former record label in favor of the \"safer,\" more sanitized J Beez Wit the Remedy. (\"That record will come back,\" Laswell says today. \"They called it Crazy Wisdom Masters for a reason.\") In 2000, Laswell collaborated with tabla legend Zakir Hussain and UK-based producer and Anokha founder Talvin Singh to create Tabla Beat Science - a fusion of Indian classical rhythms and harmonies with electronic beats that focuses on newly recorded tracks by Zakir Hussain, with Sultan Khan on sarangi and vocals and up-and-comer Karsh Kale on tabla and drum kit.\n\nThe range of Bill Laswell's music has demanded a new openness from musician and listener alike, and through his work points of congruence between genres have become clearer and we now have new hybrid forms to reckon with. Once described as a \"radical\" influence in music by the UK journal International Musician and Recording World, the often circumspect producer felt obliged to define the term for them: \"Radical means hitting people on a real level and trying to lift their awareness up a notch or two, to get them to think beyond the conventionally held beliefs that certain musics only work in certain ways. That's the driving force behind most of what I do, and if it means sacrificing notoriety and acceptance for freedom, creativity and integrity, I'll do it every time.\"\n\nFrom that ethos Bill Laswell founded a second label imprint in 2001 as a critical proving ground for radically new, and in fact revolutionary, sound. Innerhythmic is a label conceived as an alternative outlet for musicians from a variety of different backgrounds who are dedicated to exploring the recombinant possibilities of music. With a scope of influence that welcomes the traditional and \"trance\" rhythms of far-flung cultures as openly as the hip-hop, dub, jungle, jazz, funk and electronic cyber-styles emanating from the DJ underground and beyond, the label stands out as an active realization of the \"collage system\" - a system where entirely new forms can emerge almost at will from fusions of the familiar, an ecstatic journey into known and unknown worlds of sound.. Put simply, this is a past that arrives from the future to scramble the present; drum-and-bass, dub, mutant hip-hop, harmolodic fusion, new jazz, world and otherworld musics all connect to expand the potential of the experience.\n\nBill Laswell continues to be a powerful and prolific force in the world of underground music. His recent work includes such important releases as the latest Herbie Hancock album Future 2 Future, featuring guests \\ Wayne Shorter, Grandmaster DXT, Chaka Khan, and many others; the self-titled release by Ethiopian vocalist Gigi, and Grammy nominated Angelique Kidjo Black Ivory Soul (RCA Records). He is also credited with the mixing and mastering of the two latest John Zorn releases, \"Astronome\" and \"Moon Child\". On the Tzadik webpage, he is described as a \"musical terrorist\". <a href=\"https://www.last.fm/music/Bill+Laswell\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
