{"artist":{"name":"Billy Bragg","mbid":"7cec4a03-0a83-4308-856a-afb8aa5db0fc","url":"https://www.last.fm/music/Billy+Bragg","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4a390e5495bc4e1181c54f42526cdd65.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4a390e5495bc4e1181c54f42526cdd65.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4a390e5495bc4e1181c54f42526cdd65.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4a390e5495bc4e1181c54f42526cdd65.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4a390e5495bc4e1181c54f42526cdd65.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4a390e5495bc4e1181c54f42526cdd65.png","size":""}],"streamable":"0","ontour":"1","stats":{"listeners":"348703","playcount":"7298147"},"similar":{"artist":[{"name":"Billy Bragg & Wilco","url":"https://www.last.fm/music/Billy+Bragg+&+Wilco","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/965ee8dbd2b54746aeaaab98f2c8c777.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/965ee8dbd2b54746aeaaab98f2c8c777.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/965ee8dbd2b54746aeaaab98f2c8c777.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/965ee8dbd2b54746aeaaab98f2c8c777.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/965ee8dbd2b54746aeaaab98f2c8c777.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/965ee8dbd2b54746aeaaab98f2c8c777.png","size":""}]},{"name":"Kirsty MacColl","url":"https://www.last.fm/music/Kirsty+MacColl","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c7b637cc7bf34b5d8b53318485ebb21b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c7b637cc7bf34b5d8b53318485ebb21b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c7b637cc7bf34b5d8b53318485ebb21b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c7b637cc7bf34b5d8b53318485ebb21b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c7b637cc7bf34b5d8b53318485ebb21b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c7b637cc7bf34b5d8b53318485ebb21b.png","size":""}]},{"name":"The Housemartins","url":"https://www.last.fm/music/The+Housemartins","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/856e95209b724a60b0f4af004316259d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/856e95209b724a60b0f4af004316259d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/856e95209b724a60b0f4af004316259d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/856e95209b724a60b0f4af004316259d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/856e95209b724a60b0f4af004316259d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/856e95209b724a60b0f4af004316259d.png","size":""}]},{"name":"Richard Thompson","url":"https://www.last.fm/music/Richard+Thompson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/eabfb8ab4b164ad4a55c8054bab6bd19.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/eabfb8ab4b164ad4a55c8054bab6bd19.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/eabfb8ab4b164ad4a55c8054bab6bd19.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eabfb8ab4b164ad4a55c8054bab6bd19.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eabfb8ab4b164ad4a55c8054bab6bd19.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eabfb8ab4b164ad4a55c8054bab6bd19.png","size":""}]},{"name":"The Beautiful South","url":"https://www.last.fm/music/The+Beautiful+South","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5f2e5453403247318aae5a466a0b6e97.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5f2e5453403247318aae5a466a0b6e97.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5f2e5453403247318aae5a466a0b6e97.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f2e5453403247318aae5a466a0b6e97.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f2e5453403247318aae5a466a0b6e97.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f2e5453403247318aae5a466a0b6e97.png","size":""}]}]},"tags":{"tag":[{"name":"folk","url":"https://www.last.fm/tag/folk"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"political","url":"https://www.last.fm/tag/political"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"british","url":"https://www.last.fm/tag/british"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Billy+Bragg/+wiki"}},"published":"26 Feb 2006, 21:18","summary":"Billy Bragg (Stephen William Bragg, Barking, Essex, England, 20 December, 1957)  is an English singer, songwriter and left-wing activist. His music blends elements of folk music, punk rock and protest songs, and his lyrics mostly deal with political or romantic themes.\n\nIn 1977, Bragg formed the punk rock/pub rock band Riff Raff, and toured London's pubs and clubs. The band released a series of singles, which did not receive wide exposure. He also worked in Guy Norris Records in Barking. <a href=\"https://www.last.fm/music/Billy+Bragg\">Read more on Last.fm</a>","content":"Billy Bragg (Stephen William Bragg, Barking, Essex, England, 20 December, 1957)  is an English singer, songwriter and left-wing activist. His music blends elements of folk music, punk rock and protest songs, and his lyrics mostly deal with political or romantic themes.\n\nIn 1977, Bragg formed the punk rock/pub rock band Riff Raff, and toured London's pubs and clubs. The band released a series of singles, which did not receive wide exposure. He also worked in Guy Norris Records in Barking. Bragg became disillusioned with his music career, and in May 1981 joined the British Army as a recruit destined for the Queen's Royal Irish Hussars of the Royal Armoured Corps. After three months, he bought his way out of the army for £175 and returned home, having attended basic training but having never served in a regiment as a soldier.\n\nBragg began performing frequent concerts and busking around London, playing solo with an electric guitar. His roadie at the time was Andy Kershaw, who became a BBC DJ (Bragg and Kershaw later, in 1989, appeared in an episode of the BBC TV programme, Great Journeys, in which they travelled the Silver Road from Potosí, Bolivia, to the Pacific coast at Arica, Chile). Bragg performing at South by Southwest in 2008.\n\nBragg's demo tape initially got no response from the record industry, but by pretending to be a television repair man, he got into the office of Charisma Records' A&R man Peter Jenner. Jenner liked the tape, but the company was near bankruptcy and had no budget to sign new artists. Bragg got an offer to record more demos for a music publisher, so Jenner agreed to release them as a record. Life's a Riot with Spy Vs. Spy was released in July 1983 by Charisma's new imprint, Utility. Hearing DJ John Peel mention on-air that he was hungry, Bragg rushed to the BBC with a mushroom biryani, so Peel played a song from Life's a Riot with Spy Vs. Spy although at the wrong speed (since the 12\" LP was, unconventionally, cut to play at 45rpm). Peel insisted he would have played the song even without the biryani and later played it at the correct speed.\n\nWithin months, Charisma had been taken over by Virgin Records and Jenner, who had been laid off, became Bragg's manager. Stiff Records' press officer Andy Macdonald – who was setting up his own record label, Go! Discs – received a copy of Life's a Riot with Spy Vs. Spy. He made Virgin an offer and the album was re-released on Go! Discs in November 1983.[citation needed] In 1984, he released Brewing Up with Billy Bragg, a mixture of political songs (e.g., \"It Says Here\") and songs of unrequited love (e.g., \"The Saturday Boy\"). The following year he released Between the Wars, an EP of political songs that included a cover version of Leon Rosselson's \"The World Turned Upside Down\" – the EP made the top 20 of the UK Singles Chart and earned Bragg an appearance on Top of the Pops. Bragg later collaborated with Rosselson on the song, \"Ballad of the Spycatcher\". In 1985, his song \"A New England\", with an additional verse, became a Top 10 hit in the UK for Kirsty MacColl. After MacColl's early death, Bragg always sang the extra verse in her honour. In 1984–1985 he toured North America.\n\nIn 1986, Bragg released Talking with the Taxman about Poetry, which became his first Top 10 album. Its title is taken from a poem by Vladimir Mayakovsky and a translated version of the poem was printed on the record's inner sleeve. Back to Basics is a 1987 collection of his first three releases: Life's A Riot With Spy Vs. Spy, Brewing Up with Billy Bragg, and the Between The Wars EP. Bragg released his fourth album, Workers Playtime, in September 1988. With this album, Bragg added a backing band and accompaniment.\n\nIn May 1990, Bragg released the political mini-LP, The Internationale. The songs were, in part, a return to his solo guitar style, but some songs featured more complicated arrangements and included a brass band. The album paid tribute to one of Bragg's influences with the song, \"I Dreamed I Saw Phil Ochs Last Night\", which is an adapted version of Earl Robinson's song, \"I Dreamed I Saw Joe Hill Last Night\", itself an adaptation of a poem by Alfred Hayes.\n\nThe album Don't Try This at Home was released in September 1991, and included the song, \"Sexuality\", which reached the UK Singles Chart. Bragg had been persuaded by Go! Discs' Andy and Juliet Macdonald to sign a four-album deal with a million pound advance, and a promise to promote the album with singles and videos.[citation needed] This gamble was not rewarded with extra sales, and the situation put the company in financial difficulty. In exchange for ending the contract early and repaying a large amount of the advance, Bragg regained all rights to his back catalogue.[citation needed] Bragg continued to promote the album with his backing band, The Red Stars, which included his Riff Raff colleague and long-time roadie, Wiggy.\n\nBragg released the album William Bloke in 1996 after taking time off to help raise his son. Around that time, Nora Guthrie (daughter of American folk artist Woody Guthrie) asked Bragg to set some of her father's unrecorded lyrics to music. The result was a collaboration with the band Wilco and Natalie Merchant (with whom Bragg had worked previously). They released the album Mermaid Avenue in 1998, and Mermaid Avenue Vol. II in 2000. A rift with Wilco over mixing and sequencing the album led to Bragg recruiting his own band, The Blokes, to promote the album. The Blokes included keyboardist Ian McLagan, who had been a member of Bragg's boyhood heroes The Faces. The documentary film Man in the Sand depicts the roles of Nora Guthrie, Bragg, and Wilco in the creation of the Mermaid Avenue albums.\n\nIn 2004, Bragg joined Florida ska-punk band Less Than Jake to perform a version of 'The Brightest Bulb Has Burned Out' for the Rock Against Bush compilation.\n\nAt the 2005 Beautiful Days Festival in Devon, Bragg teamed up with the Levellers to perform a short set of songs by or associated with The Clash in celebration of Joe Strummer's birthday. Bragg performed guitar and lead vocals on \"Police and Thieves\", and performed guitar and backing vocals on \"English Civil War\", and \"Police on my Back\".\n\nIn 2007, Bragg moved closer to his English folk music roots by joining the WOMAD-inspired collective The Imagined Village, who recorded an album of updated versions of traditional English songs and dances and toured through that autumn. Bragg released his album Mr. Love & Justice in March 2008. This was the second Bragg album to be named after a book by Colin MacInnes. In 2008, during the NME Awards ceremony, Bragg sang a duet with British solo act Kate Nash. They mixed up their two greatest hits, Nash playing \"Foundations\", and Bragg redoing his \"A New England\". Bragg also collaborated with the poet and playwright, Patrick Jones, who supported Bragg's Tour.\n\nIn 2008, Bragg played a small role in Stuart Bamforth's film \"A13: Road Movie\". Bragg is featured alongside union reps, vicars, burger van chefs and Members of Parliament in a film that explored \"the overlooked, the hidden and the disregarded.\"\n\nHe was involved in the play Pressure Drop at the Wellcome Collection in London in April and May 2010. The production, written by Mick Gorden, and billed as \"part play, part gig, part installation\", featured new songs by Bragg. He performed during the play with his band, and acted as compere.\n\nBragg curated the Leftfield stage at Glastonbury Festival 2010.\n\nHe took part in the Bush Theatre's 2011 project Sixty Six where he has written a piece based upon a chapter of the King James Bible.\n\nBragg performed a set of the Guthrie songs that he had set to music for Mermaid Avenue during the Hay Literary Festival in June 2012. Mermaid Avenue Vol. III and Mermaid Avenue: The Complete Sessions were also released in early 2012.\n\nOn 18 March 2013, Bragg released his latest studio album, five years since Mr. Love & Justice, titled Tooth And Nail. It featured 11 original songs, including one written for the Bush Theatre, and a Woody Guthrie cover. Stylistically, it continues to explore genres of Americana (music) and Alternative country, both of which he has said he has been playing and writing regularly since Mermaid Avenue (1998). <a href=\"https://www.last.fm/music/Billy+Bragg\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
