{"artist":{"name":"Vanessa Daou","mbid":"17be2a06-5295-43ca-a363-c683b562df72","url":"https://www.last.fm/music/Vanessa+Daou","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1b52c4ceb5514060839ab9415936424f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1b52c4ceb5514060839ab9415936424f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1b52c4ceb5514060839ab9415936424f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1b52c4ceb5514060839ab9415936424f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1b52c4ceb5514060839ab9415936424f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1b52c4ceb5514060839ab9415936424f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"42240","playcount":"337470"},"similar":{"artist":[{"name":"Moodorama","url":"https://www.last.fm/music/Moodorama","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c8cde2d0394542f09fbdb85d7ddf3c3a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c8cde2d0394542f09fbdb85d7ddf3c3a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c8cde2d0394542f09fbdb85d7ddf3c3a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c8cde2d0394542f09fbdb85d7ddf3c3a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c8cde2d0394542f09fbdb85d7ddf3c3a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c8cde2d0394542f09fbdb85d7ddf3c3a.png","size":""}]},{"name":"Alphawezen","url":"https://www.last.fm/music/Alphawezen","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4b32f65b0636428dbfe4941791a67f67.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4b32f65b0636428dbfe4941791a67f67.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4b32f65b0636428dbfe4941791a67f67.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4b32f65b0636428dbfe4941791a67f67.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4b32f65b0636428dbfe4941791a67f67.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4b32f65b0636428dbfe4941791a67f67.png","size":""}]},{"name":"Ivy","url":"https://www.last.fm/music/Ivy","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/226df42d65f35f3a9e3b503e29de1848.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/226df42d65f35f3a9e3b503e29de1848.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/226df42d65f35f3a9e3b503e29de1848.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/226df42d65f35f3a9e3b503e29de1848.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/226df42d65f35f3a9e3b503e29de1848.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/226df42d65f35f3a9e3b503e29de1848.png","size":""}]},{"name":"Fragile State","url":"https://www.last.fm/music/Fragile+State","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9f0ff3cb5cc74a20a9fdcb58d2798be8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9f0ff3cb5cc74a20a9fdcb58d2798be8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9f0ff3cb5cc74a20a9fdcb58d2798be8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9f0ff3cb5cc74a20a9fdcb58d2798be8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9f0ff3cb5cc74a20a9fdcb58d2798be8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9f0ff3cb5cc74a20a9fdcb58d2798be8.png","size":""}]},{"name":"Esthero","url":"https://www.last.fm/music/Esthero","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0b9b7a15add549ee9f0e41a47b911ba2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0b9b7a15add549ee9f0e41a47b911ba2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0b9b7a15add549ee9f0e41a47b911ba2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0b9b7a15add549ee9f0e41a47b911ba2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0b9b7a15add549ee9f0e41a47b911ba2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0b9b7a15add549ee9f0e41a47b911ba2.png","size":""}]}]},"tags":{"tag":[{"name":"trip-hop","url":"https://www.last.fm/tag/trip-hop"},{"name":"chillout","url":"https://www.last.fm/tag/chillout"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"electronica","url":"https://www.last.fm/tag/electronica"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Vanessa+Daou/+wiki"}},"published":"07 May 2006, 19:56","summary":"Vanessa Daou is an American singer, songwriter, poet, visual artist and dancer. Most notably a musician, her work is known among electronica, nu jazz and trip hop circles for her trademark spoken word and aspirated singing style as well as its erotic and literary subtexts.\n\nDaou was born and spent her early childhood in St. Thomas, U.S. Virgin Islands, relocating in 1984 to attend boarding school in Massachusetts. As a young adult, she attended Vassar <a href=\"https://www.last.fm/music/Vanessa+Daou\">Read more on Last.fm</a>","content":"Vanessa Daou is an American singer, songwriter, poet, visual artist and dancer. Most notably a musician, her work is known among electronica, nu jazz and trip hop circles for her trademark spoken word and aspirated singing style as well as its erotic and literary subtexts.\n\nDaou was born and spent her early childhood in St. Thomas, U.S. Virgin Islands, relocating in 1984 to attend boarding school in Massachusetts. As a young adult, she attended Vassar College for two years and spent several years in New York City's Hell's Kitchen area before earning a scholarship to study dance at Columbia University. There, she would train with choreographer Eric Hawkins and explore visual art with Barry Moser and poetry with Kenneth Koch, whom she cites as having sparked her interest in spoken word. Daou ultimately graduated cum laude with a visual arts and art history degree from Barnard College/Columbia and frequently appeared in her senior year at Postcrypt Coffeehouse, the university's on-campus poetry lounge.\n\nWhile still a student, Daou began her career recording for NuGroove Records, one of New York's seminal underground electronica labels. Demos Daou had recorded with new husband/producer/musical collaborator Peter Daou caught the attention of two NuGroove DJs, and they invited her to provide guest vocals on a developing track. The experiment led to the label's top-selling single \"It Could Not Happen,\" which later was released on Network Records in the United Kingdom. The Daous also performed as \"Vandal\" at Los Angeles' Stranger Than Fiction rave at the Shrine Auditorium in 1990.\n\nDaou's underground success brought her to the attention of Columbia Records, which signed her to a seven-album record deal. Vanessa, along with a five-piece band including Peter Daou on keyboards, released Head Music as The Daou in 1992. An airy fusion of rock, jazz and funk, Head Music enjoyed moderate success and received praiseworthy reviews in the New York Times Sunday Arts & Leisure section and CREAM and Billboard magazines. The album's first single \"Surrender Yourself\" was remixed by Danny Tenaglia and reached #1 on Billboard's Dance Chart. Creative disagreements with Columbia would see Vanessa negotiate out of her contract and subsequently release Head Music's next two singles for the independent Tribal Records.\n\nIn 1994 Daou, now billed as a solo act, recorded Zipless, a sexually-charged collection of pieces inspired by the work of husband Peter's aunt, the poet/novelist Erica Jong. A slight stylistic evolution from Head Music, Zipless employed a somewhat more synthesized sound and introduced Daou's foray into recorded spoken word. The Daous released Zipless on their own label, Lotus Records. The album quickly established a cult following and attracted the attention of Bob Krasnow, the music A&R executive whose artist signings include Anita Baker, Björk, Natalie Merchant and Metallica. Krasnow signed Vanessa to his fledgling MCA Records subsidiary Krasnow Entertainment and re-released Zipless in 1995.\n\nZipless garnered favorable international press, with features and reviews in TIME, Billboard Spotlight Review, Bikini, VIBE, Wire, Mix Mag, URB, the Toronto Star and Le Monde magazines, among other publications. The first single, \"Near the Black Forest,\" was featured in heavy rotation on VH1 and, along with followup single \"Sunday Afternoons,\" enjoyed moderate radio rotation. Daou toured nationally with New York rapper Guru and his hip hop-jazz fusion project Jazzmatazz, playing at venues such as L.A.'s House of Blues and Bimbo's 365 Club in San Francisco.\n\nIn 1995 MCA underwent significant management changes, at which time the company faltered on the momentum that had been building for several months around Zipless. Vanessa recorded a sophomore solo album, Slow to Burn, and released it in the Fall of that year. With each song a vignette inspired by the biographies of such celebrated female artisans as Billie Holiday, Gertrude Stein and Frida Kahlo, Slow to Burn enjoyed moderate to heavy smooth jazz format radio play with its first single \"Two to Tango.\" It was featured in reviews in VIBE, URB, Billboard, Curve, and Cover magazines. Two to Tango was remixed by Danny Tenaglia and reached the top of Billboard's Dance Chart, remaining at #1 for three weeks. It was featured in the Matthew Perry film Fools Rush In. Two other songs from the album,\"If I Could (What I Would Do For You)\" and \"How Do You Feel?,\" were featured in the films An American Werewolf in Paris and Idle Hands, respectively.\n\nIn the winter of 1996 Seagram took over MCA and Doug Morris, a reputed adversary of Bob Krasnow, became president of the record label. Krasnow soon retired and folded his namesake label. Daou chose to leave as well, and negotiated out of her contract with MCA.\n\nOver the next couple years Daou again chose to release her records independently. With some support from Benny Medina/Handprint Entertainment, she released 1997's dancy, cosmic exploration-themed Plutonium Glow, on her own DaouMusic label. The project was one of the earliest albums by a former major-label artist to be marketed and sold on the internet. The online release was followed by a 1998 UK re-release by independent international distributor Oxygen Music Works. This latter version featured a reworked song sequencing and an alternate track, \"Alive,\" in place of \"Visions of You.\"\n\nArtwork from the Plutonium Glow era was showcased in an exhibit called \"Plutonium Show\" at Untitled (SPACE) Gallery in New Haven, Conn.[2] A piece from the show entitled \"Music Box\" subsequently went on for display at a National Arts Club student exhibition, securing the Jeffrey Seyfert Memorial Prize.\n\nIn 1999, Daou released Dear John Coltrane on the Oxygen imprint. Somewhat more heady and nostalgic in the vein of Slow to Burn than danceable like Plutonium Glow, the homage to the legendary jazz saxophonist met with warm reception by fans, but sparse marketing, press, club and radio support.\n\nDaou's next album Make You Love, inspired by the travails of a girlfriend living in Paris, was co-released in 2000 on Daou's own label imprint and EMI in France. Generally positive reviews for Make You Love were featured in Le Monde, Elle, Magic, and Billbard Spotlight Review, and many critics received the album as Daou's most pop-oriented. The album's song \"Show Me\" was used in a scene for U.S. television series Dawson's Creek; the single \"A Little Bit of Pain\" was used in Lifetime TV movie Sex, Lies and Obsession; and in the fall of 2000 Daou promoted the project as guest on a seven-week concert tour of France by pop vocalist Etienne Daho. The song \"Make Believe\" from Plutonium Glow was re-recorded as a duet with Daho for his Corps et armes album.\n\nOn the heels of Make You Love, Daou would take a seven-year hiatus from releasing new material. Her catalog was tapped for various music compilations and for the soundtrack to 2005 French film Lila Says, but Daou would devote this time largely to visual arts, writing and academic pursuits.\n\nIn 2007, Daou announced on her official website that some of her work during this time was being compiled for an upcoming multimedia project, introduced under the working title Then, at Midnight. The project, ostensibly a new music album with related graphical content, ultimately would undergo a name change to Joe Sent Me, a nod to the popular U.S. Prohibition-era password to enter red light district clubs.\n\nSeveral pivotal moments during Daou's hiatus would shape her new output -- the Sept. 11, 2001, terrorist attack on New York, where she remains a resident; an apparent professional split in 2004 from husband Peter; and inspiring travel experiences among them.\n\nDaou says of the project:\n\n    The Idea behind Joe Sent Me was inspired by a recent walk in New York City's Times Square, and my memory of a trip I made to Barcelona in 2006. What I remember most about the city was its uniquely dynamic and vibrant clash of the myriad sounds of the Spanish language, the co-mingling of its cultures and countries....I've created Joe Sent Me to reflect the way my mind reconstructs my memory of Barcelona.... the aim is to break down each poem into its component parts: word/page, sound/mouth, structure/form, rhythm/repetition, reader/interpreter, eye/viewer, meaning/intonation, imagination/interpretation.[3]\n\nOn May 19, 2008, audio clips, lyrics and interactive graphic content heralding Joe Sent Me premiered on the website for the Barcelona Poetry Symposium. The material thereafter became available on Daou's own site, and the album itself was released in November 2008 via Daou's online marketplace, daourecords.com.\n\n\n\n\n\n <a href=\"https://www.last.fm/music/Vanessa+Daou\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
