{"artist":{"name":"Vickie Winans","mbid":"378125ec-fd93-4920-87f0-0ab145c2db88","url":"https://www.last.fm/music/Vickie+Winans","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dea77e80a7ac49a68750c887e125e37a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dea77e80a7ac49a68750c887e125e37a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dea77e80a7ac49a68750c887e125e37a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dea77e80a7ac49a68750c887e125e37a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dea77e80a7ac49a68750c887e125e37a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dea77e80a7ac49a68750c887e125e37a.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"23023","playcount":"142659"},"similar":{"artist":[{"name":"Vanessa Bell Armstrong","url":"https://www.last.fm/music/Vanessa+Bell+Armstrong","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ff4d40e142d04364978c5697dd9d2d03.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ff4d40e142d04364978c5697dd9d2d03.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ff4d40e142d04364978c5697dd9d2d03.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ff4d40e142d04364978c5697dd9d2d03.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ff4d40e142d04364978c5697dd9d2d03.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ff4d40e142d04364978c5697dd9d2d03.png","size":""}]},{"name":"Kurt Carr","url":"https://www.last.fm/music/Kurt+Carr","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c7ad7cc887db48ed8cf6e9c9e3a588a6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c7ad7cc887db48ed8cf6e9c9e3a588a6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c7ad7cc887db48ed8cf6e9c9e3a588a6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c7ad7cc887db48ed8cf6e9c9e3a588a6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c7ad7cc887db48ed8cf6e9c9e3a588a6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c7ad7cc887db48ed8cf6e9c9e3a588a6.png","size":""}]},{"name":"Richard Smallwood","url":"https://www.last.fm/music/Richard+Smallwood","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/97cd1a2bfa094dccaa30e5399b9ba32c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/97cd1a2bfa094dccaa30e5399b9ba32c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/97cd1a2bfa094dccaa30e5399b9ba32c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/97cd1a2bfa094dccaa30e5399b9ba32c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/97cd1a2bfa094dccaa30e5399b9ba32c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/97cd1a2bfa094dccaa30e5399b9ba32c.png","size":""}]},{"name":"Norman Hutchins","url":"https://www.last.fm/music/Norman+Hutchins","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9b32c22973744e088ca43089e6c8b207.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9b32c22973744e088ca43089e6c8b207.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9b32c22973744e088ca43089e6c8b207.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9b32c22973744e088ca43089e6c8b207.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9b32c22973744e088ca43089e6c8b207.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9b32c22973744e088ca43089e6c8b207.png","size":""}]},{"name":"Darwin Hobbs","url":"https://www.last.fm/music/Darwin+Hobbs","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/be3c6870246449a8977a047cdf72cfe2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/be3c6870246449a8977a047cdf72cfe2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/be3c6870246449a8977a047cdf72cfe2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/be3c6870246449a8977a047cdf72cfe2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/be3c6870246449a8977a047cdf72cfe2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/be3c6870246449a8977a047cdf72cfe2.png","size":""}]}]},"tags":{"tag":[{"name":"gospel","url":"https://www.last.fm/tag/gospel"},{"name":"Vickie Winans","url":"https://www.last.fm/tag/Vickie+Winans"},{"name":"black gospel","url":"https://www.last.fm/tag/black+gospel"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"VICIKIE WINANS","url":"https://www.last.fm/tag/VICIKIE+WINANS"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Vickie+Winans/+wiki"}},"published":"05 Jun 2008, 06:34","summary":"An Amazing gospel singer and true believer of God:\n\nVickie Winans understands a woman’s struggles.  Fulfilling the roles of wife, mother, grandmother, daughter, sister, and friend, this Grammy-nominated and award winning artist knows the complexities associated with womanhood.  Her desire to share her joys, pains and the experiences of life is the impetus for her brand new CD, WOMAN TO WOMAN: SONGS OF LIFE.   After 20 years in the music industry and 10 CD’s later <a href=\"https://www.last.fm/music/Vickie+Winans\">Read more on Last.fm</a>","content":"An Amazing gospel singer and true believer of God:\n\nVickie Winans understands a woman’s struggles.  Fulfilling the roles of wife, mother, grandmother, daughter, sister, and friend, this Grammy-nominated and award winning artist knows the complexities associated with womanhood.  Her desire to share her joys, pains and the experiences of life is the impetus for her brand new CD, WOMAN TO WOMAN: SONGS OF LIFE.   After 20 years in the music industry and 10 CD’s later, Winans has once again broken the mold and introduced a plethora of brand new music filled with hope, inspiration and healing for  all God’s women and the men who love them.\n\nWOMAN TO WOMAN: SONGS OF LIFE, Winans’ first CD since the 2003 GRAMMY-nominated BRINGING IT ALL TOGETHER, which yielded even more hits such as, “Shake Yourself Loose,” and “We Need a Word from the Lord,” is a 10-year vision that Winans is thrilled to see come to fruition.  “This is a project I’ve desired to create for a long time, explains Winans!  I wanted to record music to help people get through life’s ups and downs.  There is a song that addresses almost every situation we face in life on either one of the 2 disc set,” she states.  \n\nSpeaking from experience, gospel’s hardest working woman has truly felt the thorns of life.  “I’ve been through almost everything that a woman can possibly go through.  I’ve been through divorce, sickness, poverty, losing a child, a near death experience, weight loss and gain,” explains Winans.  Humorously she adds, “I tell people that I’ve been evicted, convicted, possessed, repossessed, the whole nine yards!  But literally, I have been through it all.”\n  \nIt was her search for healing that led to the birth of WOMAN TO WOMAN:  SONGS OF LIFE.  The 33-song musical collage spans the gamut of emotions in a way that everyone can relate to.  But each song, like a piece of a puzzle, comes together with the restorative message of Christ.  The double CD is a keen mixture of powerful live cuts and slick studio tracks all displaying a variety of styles and musical inspirations.  The live portion of the project was recorded at Chicago’s House of Hope Church on May 12, 2006, to a packed crowd of about 10,000 people.\n\n“It was such an amazing night,” Winans says of that incredible event.  “An explosive and spiritual evening with an awesome band, orchestra, and singers, was topped off with the masterful hosting ability of Bishop T. D. Jakes.  It was one of the most explosive experiences I have ever had,” she beams.  \n\nWOMAN TO WOMAN: SONGS OF LIFE captures the essence of that grand night of worship and praise. Bishop T. D. Jakes, who is Winans, mentor, friend and confidante, opened with the rousing, “Declaration of Change.”  More memorable live cuts include the uplifting hand-clapper “Everyday Is a Good Day;” the spirited, African-tinged, “Alive Alive,” and the churchy sounds of the traditional, up-tempo cut, “Stretch Out.”   She also pulls out a gospel favorite, the Hawkins’ classic “I Love You Lord,” and gives it a gut-wrenching twist like only Vickie Winans can.\n\nOne of the CD’s most profound songs is, “The Rainbow.” A gut wrenching ballad that is close to Vickie’s heart!  “This song speaks about the promise that God gave to Noah,” she explains.  “The rainbow was the sign of a covenant God made between Himself and Noah.  God told Noah that the storm he had just come through would never happen again.  God didn’t say that there wouldn’t be any more storms, but that He wouldn’t destroy the earth again by water.”\n\nAnother gut wrenching ballad is “Stand Up and Carry On,” written by her son Mario Winans.  With its classic yet soulful vibe and backed by a wailing choir, the track is a pronouncement to everyone going through anything, to just hold on.   Listeners of this cut will walk away knowing without a doubt they can “carry on.”  She also focuses on the ups and downs of sisterly relationships on the heartfelt “You’re Still My Sister,” and the sincerity of her commitment to Christ pours out on the power ballad, “I Dedicate My Life.”  “It’s Alright,” a downright jam, will calm the spirit of the most anxious believer with its confident ring of assurance.\n\nWomen share many different relationships in their lifetimes and Winans touches on them all with this project.  Whether it’s a relationship between friends or sisters; husband and wife, or parent and child, she relates to each one of them - tackling the loss of a loved one on the melodic “Farewell,” and ministering to the brokenhearted on “God of Comfort.”  If her oldest son, Mario Winans’ tear-jerking rendition of, “Thirty Reasons Why I Love You Mommie,” don’t bring a tear to your eyes, her second son, Marvin Winans, Jr’s, “You’re More Than a Mom,” will definitely have you crying for sure!  “We Need Your Love” showcases the talents of Winans and her husband Joe McLemore.  The laid-back cut “Never Separate” stresses the importance of friendships.  It’s an appealing song with a smooth jazz feel and lyrics echoing the bond between best friends.\n\nBut her most important relationship, her relationship with Jesus Christ, continues to shine the brightest.  “Falling in Love,” a relaxed prelude, finds Vickie singing sweetly to her Lord.  “Madly in Love” is an infectious urban groove about a special spiritual love affair.  “When I think of the song, ‘Madly in Love’ I think of Jesus,” says Vickie.  “The first person that I think about in the morning is Jesus.  I think and then I thank.  I love Him and I fall in love with Him over and over again.  I just can’t help myself.”  \n\nFor the Best, Winans mobilized the best.  Besides producing three quarters of the double CD herself, she brought in the “big boys” for this dynamic project, including famed producers Rodney “Darkchild” Jerkins; Fred “Uncle Freddie” Jerkins, her platinum-selling son, Mario Winans; Warryn “Baby Dub” Campbell; Cedric & Victor Caldwell, Marvin Winans, Jr., and Steven Ford.\n\nVickie Winans’ Biography\n\nThe WOMAN TO WOMAN:  SONGS OF LIFE CD is the perfect capstone for a 20-year career that has seen Vickie Winans receive many accolades including 6 Grammy Award nominations; 8 Stellar Awards, and an NAACP Image Award.  In that span of time, she’s released 9 projects, with 2003’s “BRINGING IT ALL TOGETHER” debuting at #1 on Billboard’s Gospel Chart.\n\nIt’s doubtful that Vickie’s parents knew that their 7th child would be a Billboard-charting gospel icon.  But while singing her first solo in church at the age of 8, it’s certain that Aaron and Mattie Bowman saw something special in their daughter.  Growing up in church in Detroit, MI, she honed her skills and belted out songs stunning audiences time and time again.  Eventually, she connected with the Winans family who set her on the path to gospel superstardom.  Decades later, Vickie Winans is not only known as an award-winning gospel recording artist, but she’s revered as a consummate business woman that heads of Viviane, Inc. where she manages herself and books hundreds of shows per year.  She is also the President of her own record label, Destiny Joy Records.  An actress and a comedienne as well, she’s so thankful for all that God has done for her.\n\nWinans feels that her most rewarding accomplishments are the significant roles she plays in her family.  She is a loving sister to her 11 brothers and sisters, (the Bowman family) and in 2003, Winans married her love, Joe McLemore in a lavish wedding in Las Vegas.  Another one of her most satisfying jobs is her role as mother and grandmother.  She’s the mother of hit producers and singers, Mario Winans and Marvin Winans, Jr., and grandmother to Mario Mendell Winans, II, her 10-year old grandson; and her 6-year old granddaughter, Skyler Destiny Winans.\n\nVickie Winans knows she’s a blessed woman and she’s eager to share her life’s experiences with everyone she comes in contact with.  Her infectious personality and her thousand-watt smile will disarm the coldest stranger.  \n\n“Although I’ve had my share of heartaches, pain, and sickness over the years, I know that God has truly blessed me.  It’s because of Him that I have a fantastic family, great friends, and a rewarding career!” <a href=\"https://www.last.fm/music/Vickie+Winans\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
