{"artist":{"name":"Vince Taylor","mbid":"00793456-2e3f-49ab-9439-84efe81dc0e2","url":"https://www.last.fm/music/Vince+Taylor","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/43846254db0b49428a9b32763dc70f8c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/43846254db0b49428a9b32763dc70f8c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/43846254db0b49428a9b32763dc70f8c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43846254db0b49428a9b32763dc70f8c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43846254db0b49428a9b32763dc70f8c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43846254db0b49428a9b32763dc70f8c.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"11457","playcount":"56756"},"similar":{"artist":[{"name":"Gene Vincent","url":"https://www.last.fm/music/Gene+Vincent","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7f7c497d59774e5284720666f36a7a07.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7f7c497d59774e5284720666f36a7a07.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7f7c497d59774e5284720666f36a7a07.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f7c497d59774e5284720666f36a7a07.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f7c497d59774e5284720666f36a7a07.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f7c497d59774e5284720666f36a7a07.png","size":""}]},{"name":"Lee Rocker","url":"https://www.last.fm/music/Lee+Rocker","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/967c928bb17b4bf6877d7a827e98be9e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/967c928bb17b4bf6877d7a827e98be9e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/967c928bb17b4bf6877d7a827e98be9e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/967c928bb17b4bf6877d7a827e98be9e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/967c928bb17b4bf6877d7a827e98be9e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/967c928bb17b4bf6877d7a827e98be9e.png","size":""}]},{"name":"Link Wray","url":"https://www.last.fm/music/Link+Wray","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f530793f5dc04cdba04d47199beadaaa.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f530793f5dc04cdba04d47199beadaaa.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f530793f5dc04cdba04d47199beadaaa.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f530793f5dc04cdba04d47199beadaaa.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f530793f5dc04cdba04d47199beadaaa.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f530793f5dc04cdba04d47199beadaaa.png","size":""}]},{"name":"Charlie Feathers","url":"https://www.last.fm/music/Charlie+Feathers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c4cab265e590413387605609a1e5ed9a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c4cab265e590413387605609a1e5ed9a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c4cab265e590413387605609a1e5ed9a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4cab265e590413387605609a1e5ed9a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4cab265e590413387605609a1e5ed9a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c4cab265e590413387605609a1e5ed9a.png","size":""}]},{"name":"Horst With No Name","url":"https://www.last.fm/music/Horst+With+No+Name","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e97f4ba464e323389c5ec3916fb2011e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e97f4ba464e323389c5ec3916fb2011e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e97f4ba464e323389c5ec3916fb2011e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e97f4ba464e323389c5ec3916fb2011e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e97f4ba464e323389c5ec3916fb2011e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e97f4ba464e323389c5ec3916fb2011e.png","size":""}]}]},"tags":{"tag":[{"name":"rockabilly","url":"https://www.last.fm/tag/rockabilly"},{"name":"Rock and Roll","url":"https://www.last.fm/tag/Rock+and+Roll"},{"name":"british","url":"https://www.last.fm/tag/british"},{"name":"classic rock","url":"https://www.last.fm/tag/classic+rock"},{"name":"oldies","url":"https://www.last.fm/tag/oldies"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Vince+Taylor/+wiki"}},"published":"17 Apr 2008, 14:17","summary":"Vince Taylor (born Brian Maurice Holden on July 14, 1939 in Isleworth, Middlesex, England; died August 28, 1991) was a British rock and roll singer.\n\nAs the frontman for The Playboys, Taylor was successful primarily in the UK and Europe during the late 1950s and early 1960s, afterwards falling into obscurity amidst personal problems and drug abuse.\n\nEarly life\n\nTaylor's early life was in Isleworth, Middlesex. When he was seven years old, the Holdens emigrated to America and settled in New Jersey where his father took work in a coal mine. <a href=\"https://www.last.fm/music/Vince+Taylor\">Read more on Last.fm</a>","content":"Vince Taylor (born Brian Maurice Holden on July 14, 1939 in Isleworth, Middlesex, England; died August 28, 1991) was a British rock and roll singer.\n\nAs the frontman for The Playboys, Taylor was successful primarily in the UK and Europe during the late 1950s and early 1960s, afterwards falling into obscurity amidst personal problems and drug abuse.\n\nEarly life\n\nTaylor's early life was in Isleworth, Middlesex. When he was seven years old, the Holdens emigrated to America and settled in New Jersey where his father took work in a coal mine. Around 1955, his sister married Joe Barbera, of Hanna-Barbera productions, a successful animated cartoon company. As a result of the marriage, the family moved to California where Brian attended Hollywood High.\n\nAs a teenager, Taylor loved to fly, took flying lessons and obtained a pilot's license.\n\nHis music career\n\nAt age 18, impressed by the music of Gene Vincent and Elvis Presley, Taylor began to sing, mostly at amateur gigs. Joe Barbera, his brother-in-law, became his manager. When Barbera went to London on business he asked Taylor to join him to check out the music scene. At that time, rock was experiencing phenomenal international growth amongst teenagers, and American rockers were high in demand in the UK. Concerts starring Gene Vincent, Eddie Cochran, Chuck Berry and Bill Haley & His Comets (referred to collectively as the \"American Invasion\"), played to crowds of UK teenagers in sold out halls.\n\nIn London, Taylor went to a coffee bar on Old Compton Street in Soho, called “The 2 I’s” where rocker Tommy Steele was playing. There he met drummer Tony Meehan (later of The Shadows) and bass player Tex Makins (born Anthony Paul Makins, 3.7.1940, in Wembley, Middlesex). They formed a band called The Playboys. Whilst looking at a packet of Pall Mall cigarettes he noticed the phrase, “In hoc Vince’s”, thus giving rise to his new stage name of Vince Taylor.\n\nAfter some changes, the final line-up of The Playboys became:\n\n    * Bobbie Clarke (drums) (born Robert William Woodman, 13 June 1941, in Coventry, Warwickshire),\n    * Johnny Vance (bass) (born David John Cobb, in 1940, in Portsmouth, Hampshire),\n    * Alain Le Claire (piano) (born Alan Cocks, 26.8.1938, in Dulwich, South-east London) and\n    * Tony Harvey (guitar) (born Anthony Harvey, in 1940 died 23.3.1993), who alternated with Bob Steel.\n\nHis first singles for Parlophone, “I Like Love” and “Right Behind You Baby”, were released in 1958, followed several months later by “Pledgin' My Love” b/w “Brand New Cadillac”. Parlophone wasn’t satisfied with the immediate results and broke the contract. Vince moved to Palette Records and recorded “I’ll Be Your Hero” b/w “Jet Black Machine”, which was released on August 19, 1960.\n\nHowever, his unpredictable personality, although dynamic on stage, caused several arguments within the band, and The Playboys fired Vince Taylor and changed their name to \"The Bobbie Clarke Noise\". \"The \"Noise\" was contracted to play at the prestigious Olympia in Paris in July, 1961. The top of the bill was Wee Willie Harris.\n\nDespite his sacking Taylor remained friendly with the band and he asked if he could come to Paris too. Here he dressed up for the occasion in his black leather gear and added a chain around his neck with a Joan of Arc medallion which he had bought on arrival at Calais. He gave such an extraordinary performance at the sound check that even the band was amazed, and the organizers decided to put Vince at the top of the bill for both shows. As a result of his performance at those two shows, Eddie Barclay signed him to a six-year record deal on the Barclay label.\n\nDuring 1961 and 1962, Vince Taylor toured Europe including The French Riviera, Brussels, Belgium, Spain, and The Netherlands, with Bobbie Clarke's band, once again called Vince Taylor and his Playboys (in French this was translated as \"Vince Taylor et ses Play-Boys\").\n\nBetween gigs they recorded several EP records and an album of 20 songs, at Barclay Studios in Paris; these songs included:\n\n    * “Sweet Little Sixteen”,\n    * “C'mon Everybody”,\n    * “Twenty Flight Rock”,\n    * “Love Me”,\n    * “Long Tall Sally”,\n    * “So Glad You’re Mine”,\n    * “Baby Let’s Play House”,\n    * “Lovin Up A Storm” .\n\nBy the end of 1962, Vince Taylor and The Playboys were the top of the bill at the prestigious Olympia, in Paris.\n\nDespite an on-stage rapport with The Playboys, the off-stage relationship faltered: as a result, the band once more broke up. Taylor left for La Côte d'Azur with his new love, top model Helene April and Bobbie Clarke became the drummer for Johnny Hallyday and the Golden Stars backed up by Joey and the Showmen, resulting in three EPs released in 1963. Meanwhile, Taylor played engagements backed by the English band \"The Dragons\" (who backed Gene Vincent whenever he played the UK), but he still presented the band as The Playboys.\n\nIn February 1964, a new single “Memphis Tennessee” b/w “A Shot of Rhythm and Blues” was released on the Barclay label. The record sleeve showed a mysterious new Playboys, who were secretly:\n\n    * Joey Greco and Claude Djaoui on guitars,\n    * Ralph Di Pietro on bass, and\n    * Bobbie Clarke on drums.\n\nAll were under an exclusive contract for the Johnny Hallyday orchestra.\n\nJohnny Hallyday was drafted into the French Army, and so Bobbie Clarke again joined Vince Taylor and they started up \"The Bobbie Clarke Noise\" along with:\n\n    * Ralph Danks (guitar), [1]\n    * Alain Bugby of The Strangers (bass),\n    * Johnny Taylor, ex lead singer for the Strangers (rhythm guitar), and\n    * Prince Stanislas “Stash” Kosslowski (percussion).\n\nManaged by Jean Claude Camus, the band toured discreetly provincally to gain some experience. Their high point was reached one day in 1964 when Vince Taylor and the Bobbie Clarke Noise played as the opening act for The Rolling Stones on their first concert at the Olympia in Paris.\n\nWhen David Bowie created the character Ziggy Stardust he based him on the decline of Vince.[2] Sixty Things about David Bowie as he declared to Cameron Crowe on a Rolling Stone Magazine interview in February, 1976.\n\nDrug problems\n\nShortly thereafter, the band grew in size for an upcoming gig, by adding two new musicians, Ivan Jullien (trumpet) and Bob Garcia (saxophone). However, several days before the concert Vince and Stash went back to London for a gig where they met Bob Dylan, Nico and a few other people from the Acid Rock scene. A mixture of acid, amphetamines and alcohol proved fatal to his mind and in front of a full house, on the brink of becoming a huge international star, he had a break down - coming on stage and trying to evangelize the audience, he claimed to be the prophet Matthew, and he preached until the band agreed with everything he was saying. The audience pretended not to understand, thinking that it was part of the show. But after 15 minutes and a few poorly executed songs, he began to wreck the whole stage like The Who, but this was before the set was even played.\n\nDecline\n\nThe band disbanded and Taylor joined a religious movement. Danks left to play guitar with Three Dog Night, and later Tom Jones, Elvis Presley and Bob Dylan. Stash, a close friend of The Rolling Stones, would later produce The Dirty Strangers album featuring Keith Richards and Ronnie Wood. Bobbie Clark went on to replace drummer Don Conka for several studio sessions with the original line up of the band Love. He also played with Vince Flaherty and his band The Invincebles, Frank Zappa, Jimi Hendrix, and the first incarnation of Deep Purple before forming a group, Bodast, with Steve Howe and Dave Curtis. In 1968, Bodast recorded an LP for MGM Records, opened for The Who, and were the backing band for Chuck Berry at the Royal Albert Hall in London.\n\nMeanwhile, Clarke was involved in one last comeback for his friend Taylor, a small one-month tour across France, billed as \"Vince Taylor and Bobbie Clarke backed by Les Rockers\". After the first show, Vince stopped singing and moving; the band started a song and he sang the first verse of another. However, occasionally Taylor came out of his state, suddenly singing 5 or 6 songs correctly, and then without any apparent reason left the stage without a word. The finish of the tour was at Le Cadran at Colombes, a large bar with a room, seating 500 people. That year they booked The Animals, The Spencer Davis Group, and Jimi Hendrix & the Experience, before they played The Olympia as the opening act for Johnny Hallyday.\n\nJust before going on stage, Taylor is reported to have said, “I can't sing. There is a bad spell here. If I start to sing, everything will blow up. I feel it.” “Don’t be stupid,” said the band, “We've got to go on stage.” “I can't. I can't. It's all gonna explode… everything...”.\n\nThe crowd started to get impatient and shout, and the owner came into the dressing room and forced the band on stage. They played the instrumental version of Memphis Tennessee, and then began the intro of 'Trouble' from the film King Creole. As soon as Vince began to sing, the sound system and the amplifiers went down, and all the lights in the club blew out. There was no sound apart from Taylor who shouted uselessly into the microphone, “ I said so. I said so, and now look. I said so...\"\n\nIn autumn 1969, the magazines 'Bonjour les Amis' and 'Disco-Revue' started a support campaign for Taylor asking its readers to write in to Barclay's Record Company saying how much they would love to see the rock star make another record. Eddie Barclay, finally convinced, gave a new chance to Vince who recorded again and performed intermittently throughout the 1970’s and 1980’s, until his death in 1991.\n\nDuring his career, Taylor wrote and recorded many songs, among them his hit in Europe, \"Brand New Cadillac\" which has been covered by many other artists, such as The Clash. According to David Bowie, Taylor was the main inspiration for Bowie’s character Ziggy Stardust.\n\nDuring his last years, Vince Taylor lived in Switzerland where he took work as an airplane mechanic. He said it was the happiest time of his life.\n\nIn his 1999 song \"Goin' Down Geneva\", Irish singer Van Morrison mentions Vince Taylor, singing: \"Vince Taylor used to live here/No one's ever heard of him/Just who he was/Just where he fits in.\", lamenting, perhaps, the decline in Taylor's reputation in the public mind. <a href=\"https://www.last.fm/music/Vince+Taylor\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
