{"artist":{"name":"Walter Trout","mbid":"efddcf31-943b-49f0-aef1-cf5539d8048b","url":"https://www.last.fm/music/Walter+Trout","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e01bd5be3ab8405c9365c6dd0bbc2639.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e01bd5be3ab8405c9365c6dd0bbc2639.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e01bd5be3ab8405c9365c6dd0bbc2639.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e01bd5be3ab8405c9365c6dd0bbc2639.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e01bd5be3ab8405c9365c6dd0bbc2639.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e01bd5be3ab8405c9365c6dd0bbc2639.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"91338","playcount":"907192"},"similar":{"artist":[{"name":"Danny Bryant","url":"https://www.last.fm/music/Danny+Bryant","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7992707db67b43b0ac8c50b515d03139.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7992707db67b43b0ac8c50b515d03139.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7992707db67b43b0ac8c50b515d03139.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7992707db67b43b0ac8c50b515d03139.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7992707db67b43b0ac8c50b515d03139.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7992707db67b43b0ac8c50b515d03139.png","size":""}]},{"name":"Coco Montoya","url":"https://www.last.fm/music/Coco+Montoya","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e735317d4ea24601bb0288890597d237.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e735317d4ea24601bb0288890597d237.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e735317d4ea24601bb0288890597d237.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e735317d4ea24601bb0288890597d237.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e735317d4ea24601bb0288890597d237.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e735317d4ea24601bb0288890597d237.png","size":""}]},{"name":"Leslie West","url":"https://www.last.fm/music/Leslie+West","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1c0310fbc6bf48de952259c0d7b6158e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1c0310fbc6bf48de952259c0d7b6158e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1c0310fbc6bf48de952259c0d7b6158e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1c0310fbc6bf48de952259c0d7b6158e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1c0310fbc6bf48de952259c0d7b6158e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1c0310fbc6bf48de952259c0d7b6158e.png","size":""}]},{"name":"Kenny Wayne Shepherd Band","url":"https://www.last.fm/music/Kenny+Wayne+Shepherd+Band","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/491820714ea349e0ad028fa62445cc47.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/491820714ea349e0ad028fa62445cc47.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/491820714ea349e0ad028fa62445cc47.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/491820714ea349e0ad028fa62445cc47.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/491820714ea349e0ad028fa62445cc47.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/491820714ea349e0ad028fa62445cc47.png","size":""}]},{"name":"Joe Bonamassa","url":"https://www.last.fm/music/Joe+Bonamassa","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/90acdfc6d664453a92bbadf1eeba5933.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/90acdfc6d664453a92bbadf1eeba5933.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/90acdfc6d664453a92bbadf1eeba5933.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/90acdfc6d664453a92bbadf1eeba5933.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/90acdfc6d664453a92bbadf1eeba5933.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/90acdfc6d664453a92bbadf1eeba5933.png","size":""}]}]},"tags":{"tag":[{"name":"blues rock","url":"https://www.last.fm/tag/blues+rock"},{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"guitar","url":"https://www.last.fm/tag/guitar"},{"name":"Contemporary Blues","url":"https://www.last.fm/tag/Contemporary+Blues"},{"name":"hard rock","url":"https://www.last.fm/tag/hard+rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Walter+Trout/+wiki"}},"published":"31 Oct 2006, 18:20","summary":"Walter Trout (born March 6, 1951, Ocean City, New Jersey) is an American blues guitarist, singer and songwriter.\n\nTrout’s backstory is a page-turner you won’t want to put down. Five decades in the making; it is equal parts thriller, romance, suspense and horror. There are musical fireworks, critical acclaim and fists-aloft triumph, offset by wilderness years and brushes with the jaws of narcotic oblivion. There are feted early stints as gunslinger in bands from John Mayall’s Bluesbreakers to Canned Heat <a href=\"https://www.last.fm/music/Walter+Trout\">Read more on Last.fm</a>","content":"Walter Trout (born March 6, 1951, Ocean City, New Jersey) is an American blues guitarist, singer and songwriter.\n\nTrout’s backstory is a page-turner you won’t want to put down. Five decades in the making; it is equal parts thriller, romance, suspense and horror. There are musical fireworks, critical acclaim and fists-aloft triumph, offset by wilderness years and brushes with the jaws of narcotic oblivion. There are feted early stints as gunslinger in bands from John Mayall’s Bluesbreakers to Canned Heat, and the solo career that’s still blazing a quarter-century later.  The veteran bluesman has seen and done it all, with just one omission: he’s never made a covers album, until now.  “Luther Allison’s Blues is my first,” Trout notes. “I’ve thought about doing this album for years. It was just time.”\n\nOf all the peaks in Trout’s trajectory, his abiding memory of the late Chicago bluesman is perhaps the most literal. It’s 1986, and high above Lake Geneva, at the palatial Alpine chalet of late Montreux Jazz Festival Svengali Claude Nobs, lunch is being served. “So we’re up at the top of the Alps,” Trout recalls, “in this big room with John Mayall, Buddy Guy, Junior Wells, Robert Cray, Otis Rush, and as we’re eating, Dr. John is serenading us on acoustic piano. I was sat there with Luther Allison, and we had a great talk.\n\n“Luther was one of the all-time greats,” Trout continues, “and it was just an unbelievably potent thing to watch him perform. Just the energy and commitment that guy had, he was one of a kind. We played together once, at the Jazz Fest that year, and just as we walked offstage, somebody pointed a camera and we hugged and smiled. And that photo is on the cover of the CD.”When he died [in 1997], the idea of this album was planted in my brain.\n\nReleased June 10, 2013 on Provogue Records, this latest collection was bottled at Hollywood’s Entourage Studios alongside producer Eric Corne: the same combination that birthed 2012’s acclaimed solo release, Blues For The Modern Daze. The atmosphere, remembers Trout, was one of spit, grit and seat-of-the-pants energy: “Spontaneity is so important with this sort of music. Everybody was saying, ‘Well, aren’t you gonna get together and rehearse?’, but you don’t want to over-analyse or get too sterile. This album was all pretty much first or second takes. It’s gotta have warts on it. It’s gotta have a bit of grease in it.”\n\nNone of which should imply Luther Allison’s Blues was a throwaway project. “At times, it was, like, have I taken on too much here?” admits Trout. “Like, am I actually capable of doing justice to this? To me, Cherry Red Wine is one of the all-time greatest blues songs ever written, and Luther’s original version is so unbelievably passionate and emotional that even to sing it was a daunting task. If I had my way with this album, it would reignite interest in the man and his work, make people go back and check out the originals.”\n\nTrout knows all about the life-shaping power of a great record. Rewind to the mid-Sixties, and he was put on his path by an older brother with a habit of blasting the family home in New Jersey with seminal blues-rock platters from Paul Butterfield’s 1965 debut to John Mayall’s seismic Bluesbreakers with Eric Clapton. “He brought home John Mayall, and told me, ‘You gotta hear this guy!’” reflects the 62-year-old guitarist, who was soon inspired to buy his first Gibson Les Paul while on a day trip to Philadelphia. “I have fond memories of all those records. I still listen to them.”\n\nLocal bands never got the breaks, and in 1973, Trout made the death-or-glory move to LA, where he slept on couches and scrabbled for work. “I came out here and it was a overwhelming thing,” he says, “because I didn’t know anybody. I just started going around to clubs where there were bands playing and asked if I could sit in. My first gig, I was stand-up lead singer in a country band, singing Merle Haggard tunes. And with my third paycheque, I went and bought that Strat that’s still on the cover of all my CDs.”\n\nIn a city of Hicksville hopefuls, Trout’s ferocious talent on lead guitar and gift-of-the-gab soon marked him out. “I went to a party and that’s where I met Jesse Ed Davis, who was the first really famous guy I played with,” he remembers, of the sideman era that also saw him work alongside Big Mama Thornton, Lowell Fulson and Joe Tex. “I just weasled my way into his band, and I was with Jessie for two years.\n\nBy 1981, Trout had switched to West Coast boogie-blues titans Canned Heat for a period he diplomatically recalls as “turbulent”, but even this gig was topped three years later by a fantastical phone call from John Mayall, dangling the revered guitar slot in his iconic Bluesbreakers outfit. “As far as being a blues-guitar sideman, that gig is the pinnacle,” states Trout. “That’s Mount Everest. You could play with B.B. King or Buddy Guy, but you’re just gonna play chords all night. This guy features you. You get to play solos. He yells your name after every song, brings you to the front of the stage, and lets you sing. He creates a place for you in the world. Where do you go from there…?”\n\nTrout would answer that question in emphatic style on March 6, 1989. As guitarist, his tenure had brought thrilling flammability to the Breakers’ sound and produced stone-cold classics including One Life To Live, but as the newly sober guitarist played a lavish show at a Gothenburg symphony hall on his 38th birthday, he sensed the hand of destiny. “To walk away from the Bluesbreakers,” he admits, “a lot of people thought was completely crazy, because I could have stayed with John as long as I wanted. I mean, John to this day is like a dad to me. He was behind me when I was all screwed up, kept me in the band, believed in me, and gave me the opportunity to progress and grow up in a certain way. So that was a huge decision, and it was scary, but I had to do it, because I knew I had more, y’know?”\n\nQuarter of a century later, what seemed like career suicide has been vindicated by a thrilling catalogue of 22 solo albums, a still-growing army of fans and accolades including a nod as “the world’s greatest rock guitarist” in legendary DJ Bob Harris’s autobiography The Whispering Years, and a #6 placing on BBC Radio One’s countdown of the Top 20 Guitarists of All Time. Meanwhile, Trout’s most recent original album, Blues For The Modern Daze, was heralded by titles like Classic Rock Blues as perhaps his finest to date. “I feel like with Modern Daze,” he nods, “I found the style I’ve been searching for over 20 albums. It’s working, it comes out good, and I can play it well.”\n\nA lesser artist might rest on such laurels. As Walter Trout powers into his 25th year as a solo star, there’s no whiff of the ennui or creative autopilot that hobbles the later output of most veterans. On the contrary, there’s a sense of growing momentum, perhaps even of a little surprise. “It’s hard to believe I’m still alive, to be honest,” he smiles. “I should have been dead by 30, with the life I was leading. But I still have a career, and at 62, I’m still climbing the ladder, which keeps it exciting, instead of trying to rekindle past glories. I feel like I play with more fire than when I was 25. I’m still reaching, y’know…?”\n\n\n\nWalter Trout Battles Liver Disease - Update\nGreat News\nJuly 19, 2014\n\nGreat news: Yesterday, we managed to get the financial aspects handled and Walter was immediately transferred to the state-of-the-art Rehabilitation Center here in Omaha, NE. It is on a hospital campus, so in case he needs it, the hospital services are available to him. However, their focus is to work on strengthening and rehabilitating exclusively! So Walter will be working with occupational and physical therapists all day, and will be able to progress more efficiently.\n\nAs we were waiting for the financial aspects of the transfer to come together, Walter got up and took a walk with me. He boogied down the hospital hall faster than he has been able to walk previously. He has a new leg brace that is helping correct some temporary issues with his right foot. I could barely keep up as I clung, at times almost horizontally, to his gate belt while he sprinted past supply carts and rounding doctors!  Then he actually ate half of an ice cream sandwich! Both very encouraging events! Other than that he is continuing the tube feeding at the rehabilitation center. But the ability and willingness to actually put food in his mouth…. Awesome!                  \n\nThank you to all of you who continue to support us and surround us with your positive energy and love. We really feel it! And it makes a big difference.\n\nI have Skyped and been on the phone with our sons, and they are doing well at home. The neighbors hear them…. I have confirmation of that too, as they are in the garage practicing, jamming, and playing music to their heart’s content from early to late…. Thank you patient, awesome neighbors!!!   If all continues to go well, I may even be able to get home to them next week for a little while to partake in the festivities…. We’ll see.\n\nThe ebb and flow of life continues to pulsate through our lives. The rollercoaster ride continues. The intensity of the ups and downs is mind-altering! Literally! And I find that as I move through it all, pain and fear are not as scary as my fear of them. I think of the emotions as colors. Is there a bad color? No just different ones that all contribute to the rainbow of potentiality of experience. The trick for me is to keep moving through them and not get stuck. Writing here helps, as do your comments and love, and my morning walks. All of it helps me gain perspective to keep moving and seeing clearly.\n\nAs I was contemplating this analogy of emotions being like colors and the importance of moving through them and not get stuck, the universe provided me a beautiful synchronistic affirmation. On my morning walk, I altered my route slightly from my normal one. Suddenly, I saw people in work-out attire coming towards me, one more colorful than the other. When I got close enough, I saw that they were all going to attend the “The Color Run”. A 5K run here in Omaha that celebrates “healthiness, happiness, and individuality.”\n\nYesterday another affirmation: I had just finished writing about emotional lock-down in my journal, and I got up feeling I had moved through it, and I found a key to the front door that I had missed for a long time. It was hidden in my glasses case in the cloths I use to clean my lenses. Seeing clearly and wiping off my lenses of interpretation unlocks emotions to just be what they are: colors of the emotional rainbow.\n\nThe trek continues. We keep moving. And Walter is exactly where he needs to be now. What joy!\n\nMarie <a href=\"https://www.last.fm/music/Walter+Trout\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
