{"artist":{"name":"Way Out West","mbid":"ef22852b-b264-40a5-b6f7-dac5e5b0dbab","url":"https://www.last.fm/music/Way+Out+West","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/acd3349c924e48f481e2cbb0ea199421.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/acd3349c924e48f481e2cbb0ea199421.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/acd3349c924e48f481e2cbb0ea199421.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/acd3349c924e48f481e2cbb0ea199421.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/acd3349c924e48f481e2cbb0ea199421.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/acd3349c924e48f481e2cbb0ea199421.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"288053","playcount":"3150735"},"similar":{"artist":[{"name":"Jody Wisternoff","url":"https://www.last.fm/music/Jody+Wisternoff","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3937a911825f40afae3a7a9afdcc1c3b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3937a911825f40afae3a7a9afdcc1c3b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3937a911825f40afae3a7a9afdcc1c3b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3937a911825f40afae3a7a9afdcc1c3b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3937a911825f40afae3a7a9afdcc1c3b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3937a911825f40afae3a7a9afdcc1c3b.png","size":""}]},{"name":"16 Bit Lolitas","url":"https://www.last.fm/music/16+Bit+Lolitas","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bf464e02f29d4c8bace1db448960d210.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bf464e02f29d4c8bace1db448960d210.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bf464e02f29d4c8bace1db448960d210.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bf464e02f29d4c8bace1db448960d210.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bf464e02f29d4c8bace1db448960d210.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bf464e02f29d4c8bace1db448960d210.png","size":""}]},{"name":"Hybrid","url":"https://www.last.fm/music/Hybrid","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/56541b2870f9446c99fec5299e232338.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/56541b2870f9446c99fec5299e232338.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/56541b2870f9446c99fec5299e232338.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56541b2870f9446c99fec5299e232338.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56541b2870f9446c99fec5299e232338.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/56541b2870f9446c99fec5299e232338.png","size":""}]},{"name":"Jaytech","url":"https://www.last.fm/music/Jaytech","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3fbeb8732b9d41fdbc57b2ccf10cc0b1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3fbeb8732b9d41fdbc57b2ccf10cc0b1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3fbeb8732b9d41fdbc57b2ccf10cc0b1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3fbeb8732b9d41fdbc57b2ccf10cc0b1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3fbeb8732b9d41fdbc57b2ccf10cc0b1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3fbeb8732b9d41fdbc57b2ccf10cc0b1.png","size":""}]},{"name":"Sasha","url":"https://www.last.fm/music/Sasha","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c60da95dd88b88a60753e68dc1610d65.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c60da95dd88b88a60753e68dc1610d65.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c60da95dd88b88a60753e68dc1610d65.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c60da95dd88b88a60753e68dc1610d65.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c60da95dd88b88a60753e68dc1610d65.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c60da95dd88b88a60753e68dc1610d65.png","size":""}]}]},"tags":{"tag":[{"name":"electronic","url":"https://www.last.fm/tag/electronic"},{"name":"trance","url":"https://www.last.fm/tag/trance"},{"name":"Progressive House","url":"https://www.last.fm/tag/Progressive+House"},{"name":"breakbeat","url":"https://www.last.fm/tag/breakbeat"},{"name":"House","url":"https://www.last.fm/tag/House"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Way+Out+West/+wiki"}},"published":"10 Mar 2006, 02:33","summary":"There are 2 artists using the name \"Way Out West\". One is a hugely successful British House music and remix act and the other being an Australian World Jazz group. \n\nBritish: A world-renowned progressive house and remix act, was conceived in the bowels of Bristol, UK in early 1993. DJ and producer Jody Wisternoff had just been introduced to Nick Warren, and after a few hours in the studio together, they realized they had a common musical vision. Jody Wisternoff and Nick Warren have also maintained careers as successful DJs <a href=\"https://www.last.fm/music/Way+Out+West\">Read more on Last.fm</a>","content":"There are 2 artists using the name \"Way Out West\". One is a hugely successful British House music and remix act and the other being an Australian World Jazz group. \n\nBritish: A world-renowned progressive house and remix act, was conceived in the bowels of Bristol, UK in early 1993. DJ and producer Jody Wisternoff had just been introduced to Nick Warren, and after a few hours in the studio together, they realized they had a common musical vision. Jody Wisternoff and Nick Warren have also maintained careers as successful DJs, both individually and together as Way Out West.\n\nJody's first collaboration with Nick, under the name Sub-version 3, was on a track called \"Paradise is the Sound\" which he and a friend had been working on. The next two releases were under the name \"Echo\" and the most popular versions were titled \"Way Out West Mix.\" Originally intended as a remix project, the duo took a liking to the name and adopted it for the main act. \n\nJames Barton (A&R for Deconstruction in 1994) was suitably impressed with independent releases such as \"Shoot\" and \"Montana\" and signed them to Deconstruction - the only label Nick and Jody wished to join. \"Ajare,\" a tune that hinted at what was to come with pop hooks, bizarre samples, meticulate synth stabs, and epic hindu swirlings, reached #62 in the UK singles chart. The harder, trancier \"Domination\" followed before \"The Gift\" charted at #15 and established Way Out West as one of the foremost house acts in the UK. \"Blue,\" a melodic trip-hop groove, was released with a menacing club mix in 1997. \"Ajare\" was also re-released with an impressive new remix from the boys themselves and Brothers in Rhythm (a.k.a. Dave Seaman). \n\nWay Out West's first eponymous album, \"Way Out West\", was released in 1997 to huge critical acclaim. With this album, Way out West tiptoed effortlessly into the gap between the mainstream and raveland and produced one of the finest British house albums yet released. Tracks such as \"King of the Funk\" and \"Sequoia\" seemed to provide the perfect summer soundtrack. The single \"Blue\" was seen on TV with its bizarre video featuring cult actor Harry Dean Stanton. Nick and Jody set off on tour and played high-powered live shows all over Europe (including Glastonbury Festival, Amsterdam (MTV party) and MIDEM in France).\n\nAfter BMG graciously (sic) removed Way out West from their roster in December 2000 due to disappointing returns from the \"The Fall\" (samples the chill-out classic \"Autumn Leaves\" by Coldcut) single released earlier that year, Distinctive Records offered Way out West a three-album contract.\n\nTheir second album Intensify, released in 2001, a masterwork of swirling atmospherics, big trancy beats and a musical sensibility previously unprecedented within the genre, found a new home and was set for release in the UK on August 13th with the single of the same name (featuring the vocal talents of Ally Kennen) to be released the preceding week. The album appeared in the Dotmusic top 100 charts for that week, so it had obviously turned some heads. The album was released in North America by Nettwerk the following month. The next single, \"Mindcircus,\" featuring the vocals of Tricia Lee Kelshall, was released to a great fanfare in March of 2002 and managed to hit #39 in the UK singles charts and #1 in the UK dance charts. It's success continued by reaching #15 in the US dance charts. The loungecore \"Stealth,\" possibly the finest moment on Intensify and featuring the angelic vocals of Kirsty Hawkshaw, was set to be the final single from the album, released on September 2nd. \n\nThe duo released their third full length album in 2004, \"Don't Look Now, featuring the vocalist Omi on several tracks, and further defining their progressive sound to include more conventional song structures in addition to their drawn out compositions. The album also included a mix CD, displaying the duo's continued participation in the DJ scene.\n\nTheir song \"Don't Forget Me\" has been featured in Season 2 of Grey's Anatomy, and a loop of their song \"The Gift\" is used for the title theme on the MTV show True Life.\n\nIn the summer of 2006 Jody Wisternoff released a solo work, \"Cold Drink, Hot Girl\" which was followed up in November 2006 with \"Nostalgia\", both of which were critically acclaimed works.\n\nNick Warren's seventh (a record) Global Underground offering is due for release at the end of February 2007 and features two mixes inspired by the underground house clubs of Paris, France. Some of the music comes from Bristol label Hope Records, which Nick has recently joined in an A&R capacity. Nick has also been working on some projects of his own including a well received track with American DJ Jimmy Van M called \"One And Only\".\n\nThe duo's long-awaited fourth album, titled \"We Love Machine,\" was released on October 5, 2009. The song \"Only Love\" featuring Jonathan Mendelsohn on vocals (the album marks their first collaboration with a male vocalist) is the first single off the album, released August 31, 2009. The album was released on Hope Recordings / Armada, but the duo have set up a direct order with a deluxe version available at their own website: www.wayoutwest.mu. The duo is also planning a live tour..\n\nOfficial website www.wayoutwest.mu.\n\nAustralian:  Way Out West are an Australian jazz group, formed in 2001. They originated in the western suburbs of Melbourne and are noted for their unusual instrumentation which includes West African drumming, and many traditional Vietnamese string instruments such as a dan tranh, dan nguyet and dan bau.\nThe band has performed at major international festivals such as the Montreal Jazz Festival, Vancouver Jazz Festival, and Veneto Jazz Festival.\n\nMembers are: \n\nPeter Knight(trumpet),\nDung Nguyen (modified electric guitar, traditional Vietnamese instruments),\nPaul Williamson (saxophone),\nRay Pereira (percussion),\nHoward Cairns (acoustic bass),\nRajiv Jayaweera (drum kit).\n\nTheir second album, Old Grooves for New Streets (2007), received five star reviews in Australia, and a review by America's All About Jazz said, “Certainly a candidate for Best Release of the Year – I hope lots of ears hear this one!”.In 2009 the group won the Bell Award for Australian Jazz Ensemble of the year. The Sydney Herald observed, “That these exotic sounds blend so well with jazz is a mysterious Melbourne alchemy”.\n\nMyspace: http://www.myspace.com/wayoutwestmelbourne\n\n <a href=\"https://www.last.fm/music/Way+Out+West\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
