{"artist":{"name":"Zachary Richard","mbid":"2b1999ba-5256-4e9b-84be-4a23b9283e84","url":"https://www.last.fm/music/Zachary+Richard","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9659edb5e73142ec9e91e60141126541.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9659edb5e73142ec9e91e60141126541.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9659edb5e73142ec9e91e60141126541.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9659edb5e73142ec9e91e60141126541.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9659edb5e73142ec9e91e60141126541.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9659edb5e73142ec9e91e60141126541.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"12594","playcount":"83841"},"similar":{"artist":[{"name":"Bruce Daigrepont","url":"https://www.last.fm/music/Bruce+Daigrepont","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8798e5ae530b4a43ca71e5e41593e38f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8798e5ae530b4a43ca71e5e41593e38f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8798e5ae530b4a43ca71e5e41593e38f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8798e5ae530b4a43ca71e5e41593e38f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8798e5ae530b4a43ca71e5e41593e38f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8798e5ae530b4a43ca71e5e41593e38f.png","size":""}]},{"name":"Nathan & The Zydeco Cha Chas","url":"https://www.last.fm/music/Nathan+&+The+Zydeco+Cha+Chas","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3c9fffb8a59e4b40aed721ba239ff81e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3c9fffb8a59e4b40aed721ba239ff81e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3c9fffb8a59e4b40aed721ba239ff81e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3c9fffb8a59e4b40aed721ba239ff81e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3c9fffb8a59e4b40aed721ba239ff81e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3c9fffb8a59e4b40aed721ba239ff81e.png","size":""}]},{"name":"Steve Riley & The Mamou Playboys","url":"https://www.last.fm/music/Steve+Riley+&+The+Mamou+Playboys","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c73b97768f5041069cb495c79dbf470c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c73b97768f5041069cb495c79dbf470c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c73b97768f5041069cb495c79dbf470c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c73b97768f5041069cb495c79dbf470c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c73b97768f5041069cb495c79dbf470c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c73b97768f5041069cb495c79dbf470c.png","size":""}]},{"name":"Beau Jocque","url":"https://www.last.fm/music/Beau+Jocque","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a8ee4dafb1c340b8b943e330d290d85f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a8ee4dafb1c340b8b943e330d290d85f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a8ee4dafb1c340b8b943e330d290d85f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a8ee4dafb1c340b8b943e330d290d85f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a8ee4dafb1c340b8b943e330d290d85f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a8ee4dafb1c340b8b943e330d290d85f.png","size":""}]},{"name":"Balfa Toujours","url":"https://www.last.fm/music/Balfa+Toujours","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/88e0ac7493874a55b019f96f083155c3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/88e0ac7493874a55b019f96f083155c3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/88e0ac7493874a55b019f96f083155c3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/88e0ac7493874a55b019f96f083155c3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/88e0ac7493874a55b019f96f083155c3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/88e0ac7493874a55b019f96f083155c3.png","size":""}]}]},"tags":{"tag":[{"name":"cajun","url":"https://www.last.fm/tag/cajun"},{"name":"zydeco","url":"https://www.last.fm/tag/zydeco"},{"name":"louisiana","url":"https://www.last.fm/tag/louisiana"},{"name":"New Orleans","url":"https://www.last.fm/tag/New+Orleans"},{"name":"World Music","url":"https://www.last.fm/tag/World+Music"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Zachary+Richard/+wiki"}},"published":"29 Jan 2007, 04:11","summary":"Cultural activist,  environmentalist poet and singer-songwriter Zachary Richard’s roots are deeply planted in his native Louisiana.  Inspired by the various styles of the region, his song s go beyond the limitations of any particular genre.  Zachary’s style is uniquely his own. \n\nLe Fou is Zachary’s 20th album.  Going back to his roots, this album is steeped in the sounds and rhythms of Louisana.  The texture is acoustic folk.  The songs simple yet rich in emotion. <a href=\"https://www.last.fm/music/Zachary+Richard\">Read more on Last.fm</a>","content":"Cultural activist,  environmentalist poet and singer-songwriter Zachary Richard’s roots are deeply planted in his native Louisiana.  Inspired by the various styles of the region, his song s go beyond the limitations of any particular genre.  Zachary’s style is uniquely his own. \n\nLe Fou is Zachary’s 20th album.  Going back to his roots, this album is steeped in the sounds and rhythms of Louisana.  The texture is acoustic folk.  The songs simple yet rich in emotion.  The themes of resistance (Laisse le vent souffler - Let the storm wind blow), of separation (La chanson des migrateurs - The migrant’s song) and of identity (Orignal ou caribou - Moose or caribou) are still present in Zachary’s work, but this album has a unique Louisiana flavor as only Zachary Richard can prepare.  Clif’s Zydeco, Sweet Sweet, Crevasse Crevasse, Bee de la manche pay tribute to the culture  of Zachary’s bayou home.  The title song (Le Fou - The Crazy) was inspired by the Deepwater Horizon spill of 2010.  The first bird to be captured and cleaned in April of that year was a northern gannet, whose name in French is “Fou de Bassan” (Crazy from Bassan).  The folly of which the song speaks is the folly of mankind in destroying the natural environment.  It’s enough to make you crazy. \n\nZachary received his first recording contract at the age of 21.  He was the last artist to sign with Electra records before the creation of WEA.  That album, High Time, was lost in the maelstrom surrounding the merger and was not released until 2000 when the original masters were found in a vault in New York City and made available on Rhino Hand Made. \n\nIt was during his early days in New Yorek that Zachary made a discovery that would influence his art and effect the rest of his life.  With the advance money from the record company, he purchased a Cajun accordion.  From that moment on, he was swept up by the French language culture of Louisiana.   Delving into the Cajun tradition, Zachary formed the first new generation Cajun/Rock band.  It would be years, however, before Cajun music became popular outside of rural Louisiana.  In the meantime, Zachary career led him to Canada and France.\n\nFrom 1976 until 1981, Zachary lived in Montreal, recording seven French language albums including two gold albums, Mardi Gras and Migration.  Despite critical and commercial success in the French-speaking world, Zachary returned to Louisiana in the early 1980s and began another phase of his career, this time recording in English.  He recorded two albums for Rounder Records, Mardi Gras Mambo and the perennial favorite Zack’s Bon Ton, before signing with A&M, and recording two albums at the label, Women in the Room, and SnakeBite Love.  Non-stop touring and the strength of these recordings guaranteed Zachary an international following. \n\nIn 1994, after and extended absence from the French market, Zachary returned to Canada to play at the Acadian World Congress in New Brunswick.   Passionately inspired by his heritage once again, Zachary began a new collection of French songs.  The result was Cap Enragé.  This  double platinum (Canada) album established Zachary Richard as one of the foremost singer-songwriters in the French-speaking world.  Once again Zachary had broken the mold, weaving a musical tapestry rich in atmosphere, with masterfully crafted lyrics dealing with far ranging themes. \n\nDuring his years in Montreal, Zachary published three volumes of poetry, receiving the prestigious Prix Champlain for Faire Récolte in 1998.   Zachary’s third volume,  Feu was awarded the Prix Roland Gasparic in Roumania, the jury noting not only Zachary’s unique poetics, but also his militant commitment to the defense of the French language in North America.  With his daughter Sarah, Zachary had published three children’s book. \n\nIn 1996, Zachary founded Action Cadienne, a volunteer organization dedicated to the promotion of the French language and the Cadien/Cajun culture of Louisiana. His contributions to the arts and to French culture were recognized by the government of France in March, 1997.   Zachary Richard was decorated Officier de l’Ordre des Arts et Lettres de la République Française. That same year, Zachary was initiated into the Ordre des Francophones d’Amérique by the government of Québec.  Zachary has received three honorary doctorates, bestowed by the University of Moncton (New Brunswick), the University of Louisiana (Lafayette) and Ste Anne’s University in Nova Scotia. \n             \nZachary Richard has produced and narrated numerous television documentaries.  In collaboration with Louisiana Public Broadcasting, he produced, narrated and scored Against the Tide, the story of the Cajun people of Louisiana which was awarded Best Historical Documentary by the National Educational Television Association (NETA) in 2000.  A French version, Contre vents, contre marées received the Prix Historia from the L’institut d’Histoire de l’Amérique Française in 2003.  Other documentary projects included Coeurs Batailleurs, a 26 part series exploring the Acadian diaspora, Migrations, which dealt with avian migration in North America and was awarded the Liriot D’or (first prize) and the International Ornithological Film Festival (France) in 2008, and most recently Kouchibouguac, which investigated the social upheaval following the expropriation of 250 Acadian families in 1978 for the creation of a national park. \n\nThe celebrated Creole poet, Aimé Césaire, once said that to separate himself from one of his languages (French and Créole) would be like cutting off one of his hands.  It is much the same for Zachary.  Participating completely in two distinct cultures and creating in his two languages, French and English, Zachary’s artistic experience is unique.  He is the most American of French songwriters, and the most French of the American.\n\nOfficial Website: Zachary Richard\n <a href=\"https://www.last.fm/music/Zachary+Richard\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
