{"artist":{"name":"Zaïko Langa Langa","mbid":"cf8a81b7-1c57-41fc-a890-67dc28cb9ccf","url":"https://www.last.fm/music/+noredirect/Za%C3%AFko+Langa+Langa","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a2b7e37e68de44c2940c6b4849d3d254.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a2b7e37e68de44c2940c6b4849d3d254.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a2b7e37e68de44c2940c6b4849d3d254.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a2b7e37e68de44c2940c6b4849d3d254.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a2b7e37e68de44c2940c6b4849d3d254.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a2b7e37e68de44c2940c6b4849d3d254.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"4854","playcount":"28433"},"similar":{"artist":[{"name":"Empire Bakuba","url":"https://www.last.fm/music/Empire+Bakuba","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7a37ee92ba5f4242878fc08f1792e661.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7a37ee92ba5f4242878fc08f1792e661.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7a37ee92ba5f4242878fc08f1792e661.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7a37ee92ba5f4242878fc08f1792e661.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7a37ee92ba5f4242878fc08f1792e661.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7a37ee92ba5f4242878fc08f1792e661.png","size":""}]},{"name":"Nyboma","url":"https://www.last.fm/music/Nyboma","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ca7c36e7ac00412c9005dd929b6d7556.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ca7c36e7ac00412c9005dd929b6d7556.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ca7c36e7ac00412c9005dd929b6d7556.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ca7c36e7ac00412c9005dd929b6d7556.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ca7c36e7ac00412c9005dd929b6d7556.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ca7c36e7ac00412c9005dd929b6d7556.png","size":""}]},{"name":"Mbilia Bel","url":"https://www.last.fm/music/Mbilia+Bel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6cc353d51ff7477b8610c21b96782773.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6cc353d51ff7477b8610c21b96782773.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6cc353d51ff7477b8610c21b96782773.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cc353d51ff7477b8610c21b96782773.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cc353d51ff7477b8610c21b96782773.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cc353d51ff7477b8610c21b96782773.png","size":""}]},{"name":"Extra Musica","url":"https://www.last.fm/music/Extra+Musica","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/09082264fadc4ecc8cf3a9b898a3ebde.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/09082264fadc4ecc8cf3a9b898a3ebde.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/09082264fadc4ecc8cf3a9b898a3ebde.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/09082264fadc4ecc8cf3a9b898a3ebde.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/09082264fadc4ecc8cf3a9b898a3ebde.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/09082264fadc4ecc8cf3a9b898a3ebde.png","size":""}]},{"name":"Madilu System","url":"https://www.last.fm/music/Madilu+System","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/694c70a38fbe413786548632437d19a9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/694c70a38fbe413786548632437d19a9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/694c70a38fbe413786548632437d19a9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/694c70a38fbe413786548632437d19a9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/694c70a38fbe413786548632437d19a9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/694c70a38fbe413786548632437d19a9.png","size":""}]}]},"tags":{"tag":[{"name":"congo","url":"https://www.last.fm/tag/congo"},{"name":"soukous","url":"https://www.last.fm/tag/soukous"},{"name":"africa","url":"https://www.last.fm/tag/africa"},{"name":"Congolese","url":"https://www.last.fm/tag/Congolese"},{"name":"World Music","url":"https://www.last.fm/tag/World+Music"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/Za%C3%AFko+Langa+Langa/+wiki"}},"published":"06 Feb 2010, 06:45","summary":"Zaiko Langa Langa (also spelled Zaïko Langa Langa and in other variants) are a seminal soukous band from DR Congo. The word \"Zaiko\" is a portmanteau for the lingala phrase Zaire ya bankoko, meaning \"Zaire of our ancestors\", where \"Zaire\" must be read as a reference to the river by that name, now called Congo. The meaning of the phrase \"Langa Langa\" is controversial; according to the band's website, it means \"marvelous\" or \"almighty\".\n\nFounded in the early 1969 by D. <a href=\"https://www.last.fm/music/+noredirect/Za%C3%AFko+Langa+Langa\">Read more on Last.fm</a>","content":"Zaiko Langa Langa (also spelled Zaïko Langa Langa and in other variants) are a seminal soukous band from DR Congo. The word \"Zaiko\" is a portmanteau for the lingala phrase Zaire ya bankoko, meaning \"Zaire of our ancestors\", where \"Zaire\" must be read as a reference to the river by that name, now called Congo. The meaning of the phrase \"Langa Langa\" is controversial; according to the band's website, it means \"marvelous\" or \"almighty\".\n\nFounded in the early 1969 by D.V. Moanda, Marcelin Delo, Henry Mongombe, Olemi Eshar-Eshar dem'belina and Andre Bita, Zaiko Langa Langa survived into the 2000s (decade), and have been largely popular through the decades. Because of their \"rebel\" and \"hippie\" attitude, and their innovative approach to soukous, they became a symbol of the new generations of post-independence Zaire, and are sometimes compared to the Rolling Stones for their appeal on the Congolese youth.\n\nThe band has experienced several personnel changes, and a number of prominent soukous musicians have been in their lineup; examples are Bozi Boziana, Dindo Yogo, Evoloko Jocker, N'Yoka Longo and Bimi Ombale. Several soukous band formed as spin-offs of Zaiko Langa Langa; these include Isifi Lokole, Yoka Lokole, Viva La Musica, Langa Langa Stars, Zaiko Familia Dei, Basilique Loningisa, Choc Stars, Anti Choc, and Zaiko Nkolo Mboka. This large group of related bands is sometimes referred to as \"Clan Langa Langa\" (i.e., \"the Langa Langa family\").\n\nIn 2000, Zaiko Langa Langa were awarded by the Congolese Media Association as the best Congolese musical group of the 20th century.\n\nThe band was formed in 1969 with the provisional name \"Orchestra Zaiko\". The original lineup was composed of Papa Wemba, Mavuela Somo, Evoloko Lay Lay, Teddy Sukami, Oncle Bapius, Zamuangana le meilleur and Manuaku Waku (also known as Pépé Fely) and N'Yoka Longo. The band also had a pop section, which was playing before the soukous section, with Bimi Ombale, Mbuta Matima and Mashakado Mbuta. Moanda, Mongombe, Marcelin, Waku, Longo and Bita were all from a former band called Bel Guide National. They were mostly students coming from upper-class families of Kinshasa.\n\nThe sound of Zaiko Langa Langa was revolutionary with respect to the soukous tradition. They adopted a more up tempo beat, abandoned wind instruments and emphasized snare drums and lead electric guitars (and eventually also synthesizers). The percussion rhythms were adapted from traditional Congolese music and the sebene became more prominent. Their vocal lines made a large use of the call and response schemes. Their frenetic stage shows featured a frontline of four singers.\n\nBecause of these innovations, they are sometimes referred to as the founders of the \"third school\" of soukous. The \"first school\" is probably that of soukous bands of the 1950s, such as Grand Kalle et l'African Jazz and OK Jazz, while the \"second school\" could be that of Sam Mangwana's African Fiesta. While their \"rebel\" attitude, which resembled that of the hippie movement, earned them the sobriquet of \"Zaire's Rolling Stones\".\n\nZaiko quickly became one of the most popular groups of Zaire, and had a large fan base among Kinshasa's juvenile. In the 1970s, Zaiko's singers Evoloko \"Lay Lay\" Joker, Papa Wemba, Gina Efonge, Mavuela Somo, Nyoka Longo and Bimi Ombale popularized a dance known as cavacha, also spelled \"kavasha, that was a decade-lasting craze in most East Africa.\n\nIn 1974, Zaiko Langa Langa were amongst the Zairean bands to be invited to play in Zaire '74, a huge musical event celebrating the Rumble in the Jungle.\n\nIn the mid 1970s the band lost some of its most important members. Papa Wemba, Bozi Boziana, Mavuela Somo and Evoloko left in 1974 to create Isifi Lokole; the same year, Papa Wemba, Bozi Boziana and Mavuela abandoned Evoloko after a conflict of leadership in the groupe between Evoloko and Papa Wemba to form Yoka Lokole in 1976. In 1980, guitarist Manuaka Waku also founded his own group, Grand Zaiko Wa Wa. After a brief period of inactivity, the band returned in 1975, and in the following years maintained a prominent position in the soukous scenes, while competing with its own spin-offs such as Isifi Melodia, Yoka Lokole and later on in 1977 Viva La Musica of Papa Wemba after he left Yoka Lokole after another conflict of leadership between him and Mavuela Somo. The outcome of the personnel changes in the band was the establishment of N'Yoka Longo as the new leader, and new entries such as Lengi Lenga, Bakunde Ilo Pablo and Likinga. Zaiko Langa Langa's production of the latter 1970s are particularly sophisticated both in terms of melody and orchestration, and the choreography of the live performance was also richer than it was in the early years. In 1975 too saw the establishment of the longest serving front singers of Zaiko in Nyoka Longo, Bimi Ombale, Lengi Lenga and Likinga Redo who will become for fourteen years the face of Zaiko and impose Zaiko as the ultimate heavy weight of youth music in Zaire. The success of the band was so huge and unprecedented in Zairian music history that all the presonnel that have left the band were queuing to return. In 1977, Bozi Boziana rejoined the group, followed by Mashakado Mbuta and Evoloko in 1980.\n\nDespite new internal quarrels and personnel changes with the departure of Evoloko, Bozi and Djo Mali in 1981 to form Langa Langa Stars, Zaiko Langa Langa were successful throughout the 1980s. The band was touring Europe and Africa regularly and was the first Zairian band to visit Japan. At the end of the decade at the height of their glory and having establish themselves as legends in Zaire, the band experienced another major split, between the two leaders of the group Nyoka Longo and Bimi Ombale. The band was divided in two with every musician choosing his camp between the two leaders who were part of Zaiko since it creation. With Meridjo, Bapius, Matima, Zamuangana who were part of Zaiko from it creation staying with Nyoka Longo followed by Dindo Yogo and the band was called then Zaiko Langa Langa Nkolo Mboka, and was considered as the original Zaiko, to differentiate it from the band of Bimi Ombale which was called Zaiko Langa Langa Familia Dei and had Lengi Lenga, Ilo Pablo, JP Buse and the rest of the musicians that came in the 1980s. Later on, N'Yoka Longo's group reacquired the original name \"Zaiko Langa Langa\", which has maintained until today. N'Yoka Longo is still the leader of the group.\n\nIn 2002, Zaiko performed in the mythic arena Zenith of Paris, France. More than 6.000 fans attended. This was considered by many as the renaissance or rebirth of Zaiko. In fact, as earlier as 1988, Zaiko, being very popular at that time, made plan to perform in Zenith but the great split that occurred in the band stopped it for doing so.\n\nZaiko spent 6 and half years in Europe (2002–09). Its Headquarters ware based in Bruxelles, Belgium. But the band gave more concerts in France and other countries around Europe. During that time in Europe, Zaiko released three albums: Eureka (2002), Empreintes (2004), Recontres (2006). In the last album, Nyoka Longo invited many former Zaiko musicians like Malage, Beniko Popolipo; and a retired Congolese musician Tony Dee Bokito. He also recruited from Kinshasa, the son of late Dindo yogo, Lola Muana.\n\nDuring the time the Band was in Europe, Nyoka Longo, in 2006, charged Lola Muana who was then in Kinshasa to form a group that would promote Zaiko music in D.R.Congo. Lola recruited and formed a subsidiary group of Zaiko called Les Ganers de Zaiko. Bapius Muaka, a longtime guitarist bass player who left the group during a minor split of 1999, joined the Ganers too.\n\nThe group returned in D.R.Congo in January 2009 with only five musicians: Nyoka Longo, Doudou Adoula, Shou Lay Evoloko, Gege Mangaya and Lola Muana. Other members of the group defected and stayed in Europe where they formed a new band named Les Stars de Zaiko under the leadership of Adamo Ekula. Couple years later, they renamed their new band Zaikas Kolo Mboka.\n\nSince his recruitment in Zaiko, Lola Muana was regarded by many as the principal heir of Zaiko. But in 2009, he was forced to quit the group because of his proposal to have a valid work contract with the group. His request was denied by the President of Zaiko, N'Yoka Longo Mvula Jossart. The son of Evoloko, Shou Lay, who backed Lola's request left the group too. In November 2011, Lola Muana was reinstated in the group.\n\nZaiko Langa Langa were both influential in their own right and through their many spin-offs. Most of these maintained a strong link to the original formation, and this is often reflected by the names they adopted. The groups that somehow belong to the Zaiko Langa Langa \"franchise\" are collectively known as the \"Clan Langa Langa\". This includes:\n\nIsifi Lokole - Papa Wemba, Bozi Boziana, Evoloko Jocker, Mavuela Somo\nYoka Lokole - Papa Wemba, Bozi Boziana, Mavuela Somo\nGrand Zaïko Wa Wa (1975–?) - Manuaku Waku who was joined by successful singers like Shimita, Djo Poster among others\nViva La Musica (1977–?) - Papa Wemba, joined by Emeneya Mubiala, dindo yogo\nChoc Stars - Bozi Boziana, Tshimpaka Roxy joined by Ben Nyamabo, Karlito Lassa, Defao\nL'Orchestre Anti-Choc - Bozi Boziana, joined by Deyesse Mukangi, Jolie Detta, Dodoli, Walingonda, Fifi Mofude, etc.\nLanga Langa Stars (1981–1984) - Evoloko Jocker, Bozi Boziana, Tshimpaka Roxy and Djo Mali\nTPOK Jazz (1984–1983) - François Luambo Makiadi\nZaïko Langa Langa Nkolo Mboka - N'Yoka Longo, Meridjo, Dindo Yogo, Oncle Bapius, Zamuangana, Nono Atalaku and Matima. They were joined by Malage de Lugendo, Adamo, Baroza, Shiro Shiro,\nZaïko Langa Langa Familia Dei - Lengi Lenga, Ilo Pablo, Bimi Ombale, Beniko Popolipo, Petit Poisson, Djimi Yaba\nZaiko Universel (1999–2000)- Meridjo, Bapius Muaka\nLanga Langa Rénové - Evoloko Jocker\nBasilique Loningisa - Bimi Ombale\nNgwaka Aye- Dindo Yogo\nLes Quatros de Langa Langa, Papa Wemba, Evoloko, Bozi Boziana, Gina Efonge\nLes Stars de Zaiko, Now called Zaikas Kolo Mboka, Adamo Ekula, Petit Poisson, Tshanda, Papy Cocaine, etc.\nClan Petrole (1983–1940) - The Best Collections.\n\nDiscography\n\n    * 1970 : Pauline\n    * 1972 : L'amoureux decu\n    * 1973 : Mete la vérité, chouchouna\n    * 1974 : Liwa ya somo\n    * 1981 : Sarah Djenni\n    * 1983 : La Tout Neige\n    * 1985 : Zaiko Eyi Nkisi\n    * 1985 : Eh Ngoss! Eh Ngoss! Eh Ngoss!\n    * 1986 : Bongoville\n    * 1986 : Pusa Kuna... Serrez! Serrez!\n    * 1987 : Bongama Kamata Position\n    * 1987 : Subissez les conséquences\n    * 1988 : Nippon Banzai au Japon\n    * 1989 : Jetez l'Eponge\n    * 1990 : Zaiko Langa-Langa F. D.\n    * 1992 : L'Autentique Zaiko Langa Langa\n    * 1993 : Jamais sans nous\n    * 1993 : Zaire-Ghana (recorded in Accra in 1976, produced by Henri Bowane)\n    * 1995 : Avis de recherche\n    * 1995 : Zekete Zekete\n    * 1996 : Sans issue\n    * 1996 : Pacha labaran\n    * 1997 : Papa Omar\n    * 1997 : Onassis\n    * 1997 : Muvaro\n    * 1997 : Le beau temps\n    * 1997 : Bongo bouger\n    * 1997 : Bacline Lesson One\n    * 1997 : Poison\n    * 2000 : Etumba ya la vie\n    * 2001 : Legend\n    * 2002 : Anthologie\n    * 2003 : Sentiment Awa / Essesse\n    * 2003 : Eureka!\n    * 2004 : Empreinte\n    * Zaire Congo Dance\n    * Zaiko Langa Langa\n    * Saisie en Douane... 20 Ans Déjà\n    * Ici Ça Va... Fungola Motema\n    * Out of Africa\n <a href=\"https://www.last.fm/music/+noredirect/Za%C3%AFko+Langa+Langa\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
