{"artist":{"name":"Άννα Βισση","url":"https://www.last.fm/music/+noredirect/%CE%86%CE%BD%CE%BD%CE%B1+%CE%92%CE%B9%CF%83%CF%83%CE%B7","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/88a79b083739425cb399e4359ce9fec4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/88a79b083739425cb399e4359ce9fec4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/88a79b083739425cb399e4359ce9fec4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/88a79b083739425cb399e4359ce9fec4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/88a79b083739425cb399e4359ce9fec4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/88a79b083739425cb399e4359ce9fec4.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"49890","playcount":"645005"},"similar":{"artist":[{"name":"Despina Vandi","url":"https://www.last.fm/music/Despina+Vandi","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2423e2b1442d49838f83b8de3af6c07b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2423e2b1442d49838f83b8de3af6c07b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2423e2b1442d49838f83b8de3af6c07b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2423e2b1442d49838f83b8de3af6c07b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2423e2b1442d49838f83b8de3af6c07b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2423e2b1442d49838f83b8de3af6c07b.png","size":""}]},{"name":"Antique","url":"https://www.last.fm/music/Antique","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/89bac086a5f343a49115558ce3057609.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/89bac086a5f343a49115558ce3057609.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/89bac086a5f343a49115558ce3057609.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/89bac086a5f343a49115558ce3057609.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/89bac086a5f343a49115558ce3057609.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/89bac086a5f343a49115558ce3057609.png","size":""}]},{"name":"Helena Paparizou","url":"https://www.last.fm/music/Helena+Paparizou","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/44a5c53ba09c4725bcb19128f3169f4e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/44a5c53ba09c4725bcb19128f3169f4e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/44a5c53ba09c4725bcb19128f3169f4e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44a5c53ba09c4725bcb19128f3169f4e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44a5c53ba09c4725bcb19128f3169f4e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44a5c53ba09c4725bcb19128f3169f4e.png","size":""}]},{"name":"Evridiki","url":"https://www.last.fm/music/Evridiki","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a2a611c469a442c883cd20ff54052d45.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a2a611c469a442c883cd20ff54052d45.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a2a611c469a442c883cd20ff54052d45.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a2a611c469a442c883cd20ff54052d45.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a2a611c469a442c883cd20ff54052d45.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a2a611c469a442c883cd20ff54052d45.png","size":""}]},{"name":"Sakis Rouvas","url":"https://www.last.fm/music/Sakis+Rouvas","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ef1f1ad43657468bac2b4ae4f8dc50e9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ef1f1ad43657468bac2b4ae4f8dc50e9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ef1f1ad43657468bac2b4ae4f8dc50e9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ef1f1ad43657468bac2b4ae4f8dc50e9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ef1f1ad43657468bac2b4ae4f8dc50e9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ef1f1ad43657468bac2b4ae4f8dc50e9.png","size":""}]}]},"tags":{"tag":[{"name":"Greek","url":"https://www.last.fm/tag/Greek"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"Eurovision","url":"https://www.last.fm/tag/Eurovision"},{"name":"dance","url":"https://www.last.fm/tag/dance"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/%CE%86%CE%BD%CE%BD%CE%B1+%CE%92%CE%B9%CF%83%CF%83%CE%B7/+wiki"}},"published":"15 Feb 2006, 03:26","summary":"Anna Vissi (Greek: Άννα Βίσση; born December 20, 1957 in Larnaca) is a singer famous mainly in Greece and her home country Cyprus; with notable international success within the European Community, the United States and elsewhere. Since 1995, she has gone 28x platinum in Greece and in 2005, she also enjoyed success in the US, claiming the number one position on the Billboard Dance Charts with \"Call Me\".\n\nShe has been singing from a very early age, beginning formal musical studies at the age of six at a local conservatory. <a href=\"https://www.last.fm/music/+noredirect/%CE%86%CE%BD%CE%BD%CE%B1+%CE%92%CE%B9%CF%83%CF%83%CE%B7\">Read more on Last.fm</a>","content":"Anna Vissi (Greek: Άννα Βίσση; born December 20, 1957 in Larnaca) is a singer famous mainly in Greece and her home country Cyprus; with notable international success within the European Community, the United States and elsewhere. Since 1995, she has gone 28x platinum in Greece and in 2005, she also enjoyed success in the US, claiming the number one position on the Billboard Dance Charts with \"Call Me\".\n\nShe has been singing from a very early age, beginning formal musical studies at the age of six at a local conservatory. At the age of twelve she entered a talent competition and won first prize. Two years later, she was the main singer at Ayia Tilliria, which was also her first TV appearance. In 1973, her family moved to Athens, Greece where she was able to pursue her studies at the National Conservatory. She would eventually appear with a number of well-known Greek singers, such as George Dalaras, Haris Alexiou, and Vasilis Papakonstantinou, in the famous nightclubs of Plaka, in Athens. During this time she also studied law at the University of Athens. Her first important collaboration, alongside Georgios Dalaras, was with composer Stavros Koujioumtzis. Koujioumtris composed two songs for Vissi, S' Agapo and Sta Hronia tis Ipomonis. She also collaborated with many important Greek composers such as Mikis Theodorakis (1974/1975), Georgios Hadjinassios (1974), Doros Giorgiadis (1974), Nikos Karvelas (who later became her husband; 1975) and Mihalis Terzis (1976).\n\nIn 1977 she went on tour with Georgios Dalaras and Haris Alexiou, giving remarkable concerts with the most famous at Rainbow, London (June). In the same year, she won the prize for best singer and best song (As Kanoume Apopse mia Arhi) of the year at the Annual Song Festival of Thessaloniki (Palais des Sports). In 1978 she was proposed by ERT (Greek National Television) to represent Greece at the 23rd Eurovision Song Contest. There were two songs to select from — Poso S'Agapo and O Kyrios Nobel. Finally, due to controversies between the composers of the songs, her participation was disqualified and Tania Tsanaklidou went to the contest.\n\nIn 1980, Anna took part in the 25th Eurovision Song Contest representing Greece with the song \"Autostop\", finishing 13th with 30 points.Two years later, she represented her native Cyprus at the 27th Eurovision Song Contest with the song she composed herself \"Mono I Agapi\", which ended 5th with 85 points scoring Cyprus their highest position to date. The songs have not been released on any album or single until 2006, when both were released on CD single in time for Vissi's third Eurovision appearance. \"Mono I Agapi\" however, was released as a 7 -inch vinyl in 1982 with an English version titled \"I'm Gonna Be A Fool for You\" as a b-side.\n\nIn 1983 she married Nikos Karvelas, a composer, with whom she collaborated in 1975. After their marriage, she started a close collaboration with Karvelas. Since 1975, all her releases have become gold or platinum and have included songs by Karvelas.[2] In 1986, she participated at the Cypriot National Final for Eurovision Song Contest, with the song \"Thelo Na Gino Star\", taking second place. This song is still unreleased today. In 1986, Vissi released I Epomeni Kinisi, followed by Empnefsi! and Tora in 1988.[4] In 1988 she made her debut as a radio producer on ANT1 Radio. Her radio program had the title of one of her songs \"Ta Koritsia Einai Atakta\" and was aired every weekend. In the same year she participated with the song \"Kleo\" at the Greek National Final for Eurovision Song Contest, ending third.\nVissi in Daimones.\n\nIn 1989 she releases the studio album Fotia (Fire) being one of the first albums to feature western sounds. The lead single \"Pseftika\" became a big hit. She performed at \"Diogenis Palace\" in that same year, Athens' biggest night club at the time.\n\nIn the early 1990s, she continued performing around Greece with Nikos Karvelas, with appearances at Diogenis Palace and then at Rex. In November 1991, Vissi and Karvelas stared in the first Greek rock opera, Demones. It was based on a libretto by Stavros Sideras and staged at Athicon Theater in Athens for two years. Roger Williams was the director and Anna Vissi (Queen & Rozanne), Yannis Samsiaris (Daniel), Mpessy Malfa (Witch & Loa) and John Modinos (Inquisitor) were the leading actors. Demones was played on foreign TV stations and attracted the attention of Broadway agents.\n\nA year later in October 1993, Vissi landed the leading role of Aphrodite, in the one act opera Ode to the Gods by Stavros Sideras. It was held only once in Limassol, Cyprus, during the celebrations for the Commonwealth Day. The then-president of the Republic of Cyprus, Glafkos Kleridis, and Queen Elizabeth II, were amongst the audience. The following years Karvelas and Vissi released albums that became gold and platinum. They included Lambo in 1992, Emeis in 1992, Live! in 1993, Re! in 1994, and O! Kypros with traditional Cypriot songs in 1995.\nAnna Vissi holding up the 3X Platinum certification of Travma.\n\nIn 1994 she was the hostess on the ANT1 weekly TV show Me Agapi, Anna, while one year after she did a concert in Cyprus, supporting the defenses of the island. In 1996 Anna released the triple-platinum album Klima Tropiko. After giving more than 40 concerts all over Greece, she started winter appearances at club Gazi. On New Year's Eve, by invitation of the Mayor of the city of Athens, she performed in the Parliament Square in front of more than 20,000 people which was broadcast on TV all over Greece and Cyprus.\n\nIn February 1997, Vissi won three Greek Music Awards: Best Female Singer, Best Interpretation, and Biggest Airplay Song. In April 1997, Vissi released Travma which went gold in 12 days and triple platinum in six months selling over 150,000 units.\nVissi and Nikos Karvelas live at Asteria in 1998.\n\nA couple months later, a new CD single was released with the songs \"Crush\", \"Mavra Gyalia\", and \"Eleni\" as well as a re-release of her multi platinum album Travma with a bonus CD containing songs from previous albums, only in Australia.\n\nIn 1998, Vissi released her new studio album titled Antidoto, which sold more than 80,000 copies in just a week, breaking all previous records to that point. In 1998, Vissi gave a charity concert at the Presidential Palace in Cyprus, with the presidential orchestra of the Russian Confederacy (Telethon) and continued with two concerts in London, in February 1999 (Forum Music Theatre, Palladium Theatre). There was also a mini tour in the U.S., giving concerts in Los Angeles, Atlantic City, Chicago, Boston and New York (Madison Square Garden). The Los Angeles Times wrote: \"A performance so charismatic, so filled with sheer magnetic talent... expect big things from this potential new international star\", while the New York Times wrote: \"With raised arms and delicately stepping feet, she was no unapproachable, packaged pop diva, but an irrepressible entertainer\".\n\nIn New York City, Anna performed a mini concert for her fans at the Virgin Mega Store in Times Square. This performance was part of a series of events hosted by the Virgin Megastore, promoting some of the world's biggest stars, with Anna being the only Greek singer to receive this honor. The event was promoted throughout the tristate area by KTU (radio station) and was part of \"Anna Vissi day\" at the biggest Virgin Megastore in the US.\n\nFollowed by a short break from music, in April 2000 Anna Vissi performed at London's Royal Albert Hall, at the so-called 'millennium show', singing in front of people from Sony International, marketing managers from Europe, and fans from the UK.\n\nOn May 13, 2000, she performed as a special guest star in her native Cyprus, at the 49th annual Miss Universe Pageant which took place at the Eleftheria Stadium in Nicosia. She sang for the very first time her song \"On a Night Like This\", a song later made famous by Australian superstar Kylie Minogue and included on her album Light Years.\n\nSome months later, her first international single was released called Everything I Am, containing the original version and three remixes of the song (Almighty Mix, Eiffel 65 RMX, Groove Brothers Remix), and a song with both Greek and English lyrics called \"Moro Mou, No Tomorrow\". She also filmed her first video clip of that single, directed by Antti Jokinen (Solar films, Finland), that cost 80,000,000 drachmas (310,000 dollars).\n\nApart from the English single, she also released a new Greek single called \"Agapi Ypervoliki\", containing six new songs. Having sold more than 75,000 copies in 10 weeks, it became triple platinum and finally settled at four times platinum. To promote the single, she started appearances at Asteria Club with Karvelas and the boy band ONE, with Shaun Fernandez as the choreographer.\n\nIn September 2000, she gave a charity concert at the GSP Stadium in Nicosia, in front of 12,000 people, with ONE and a group of dancers from Sony International. She sang songs from the very beginning of her career to her current carrier (1973-2001).\n\nThe same year she released her international English language album called Everything I Am which although started as ambition effort to launch an international career, failed to chart in the US. It contained 12 songs by Russ Ballard, Mark Taylor, Graham Stack, Steve Torch, Paul Stanley, Tina Shafer, Julian Harris, Danielle Gerber and Nikos Karvelas. Producers of the album were Brian Rawling, Ric Wake and Peter Asher. In Greece, after a week, the album reached gold status (20,000 copies +) eventually reaching platinum, while Australia, South Africa, Spain, Italy, France, Germany, Turkey, Finland, Norway, and Asia started to promote it, with little success.\n\nIn November 2000, Kravgi was released. It was a double album with 24 new songs and included a duet with Katy Garbi. It reached double platinum status in just a couple of hours, a record, and eventually went 7x Platinum making it one of the most successful albums of all time in Greece. Some months later, she started appearances with Garbi and the boyband ONE at Fever Club, while she accepted the invitation of the Mayor of Athens to perform in the Parliament Square, at the celebrations of the New Year's Eve 2001.\n\nJust before Easter, a second single from her international album was released. It was called \"Still in Love with You\" with remixes (Radio Edit, Soda Club Radio Mix, Soda Club Mix, Soda Club TV Track) and production by Brian Rawling.\n\nOn the 6 June 2001 she was the main singer in a production in Bucharest (Unirii square, nearby river Dambovitei) along with the No Smoking band and the cinema director and producer Emir Kusturica. The concert (2001, Peace Odyssey) included a multimedia show, opening with a water screen. More than 150,000 people were present. Kusturica along with producer and director Angelos Hadjiandreou undertook the artistic direction of the event, marrying music with the most modern expression of art. Three months later (September 3, 2001) she gave a concert in Cyprus (GSP Stadium), singing in front of more than 18,000 viewers, for more than three hours. Just a day before, she was awarded for the seven times platinum Kravgi.\n\nShortly after, Vissi stared in the Musical Mala - I Mousiki Tou Anemou, written by Karvelas, based on a true love story that took place during World War II in Auschwitz, between Mala Zimetbaum and Edward Galiñski. The play, which was staged at Palace Theatre in Athens (19 January 2002), was written by her husband Nikos Karvelas, directed by Yannis Kakleas and accompanied by a symphony orchestra conducted by Yorgos Niarhos. The show received positive reviews mostly, while it was also shown on Mega Channel a year later. The soundtrack also reached gold status in Greece. The soundtrack of the album was also released and charted.\n\nIn late 2002, Vissi released the album X, which was produced by George De Angelis. Shortly after, the album was featured on CNN's Music Room, where they talked about how the album reached number 1 in Greece, and has already sold 75,000 copies and was still going strong. The album quickly reached number 1 on the IFPI charts, and was certified 2x platinum. In the winter of 2002-2003 she was at Fever Club in Athens, performing with Giannis Parios. In May 2003, Vissi performed with Nikos Karvelas and Irini Merkouri at Club Boom in Thessaloniki, Greece]\n\nOn July 15, 2003, Vissi gave a concert at A Plaz Voulas/Apollonies Aktes, with special guest star Nikos Karvelas. In September 2003, Vissi gave another concert in Cyprus, at the Tzirion Stadium in Limassol, with songs from her 30 years career. The same year, she was awarded with a prize for her whole contribution from the Cyprus Paralympic Organization, while a square in Larnaca was named after her. She also met and talked with the president of the Republic of Cyprus, in the Presidential Palace, in Nicosia.\n\nJust before 2004 on December 05, 2003, Vissi released the double album Paraksenes Eikones which went 2x platinum in six months. The album produced many hits, while the song \"Treno\" was the most played song of 2004 in Greece. To promote the album, she started appearing at Diogenis Studio for the winter season 2003-2004, with Konstandinos Christoforou, Nino and Hi-5.\n\n2004-2005: \"Call Me\" & Nylon\n\nOn the 31 March 2004, Anna Vissi performed in the Liberty Square in Nicosia, at a concert part of the celebrations for Cyprus's entry at the European Union, after an official invitation from the Republic of Cyprus.\n\nIn May 2004 she went on a small tour in England and U.S., with Lambis Livieratos (with whom she collaborated back in the early 90s), while in July, her album Paraksenes Eikones was re-released with a bonus CD single called Remixes 2004. On 29 August 2004 she performed at the closing ceremony of the XXVIII Olympiad, in Athens. She then gave a concert in Cyprus on 3 September, at the GSP Stadium in Nicosia, where she sang for the first time her new English song called \"Call Me\".\nVissi performing in a club in the USA part of her promotional tour for \"Call Me\".\n\nOn December 20, 2004, Vissi released a live album and DVD. After that concert she moved to the U.S., for the preparation and promotion of her single \"Call Me\". In US, the single was released by Moda Records. It features twelve remixes, and went to number 1 on the Billboard Hot Dance Music Club Play chart and number 2 on the Billboard Hot Dance Airplay chart. Anna then performed at the legendary Copacabana in New York for the KTU PartyGras. During the winter and through to the summer of 2005, Anna went around to clubs as part of her Mini-USA Tour to promote \"Call Me\". Some of the clubs included, Central, Mirage, DNA, The Sound Garden, and Studio 9.\n\nIn July 2005 Anna returned to Greece and released \"Call Me\" as a CD single by Sony BMG, along with a new English song titled Lie. The single reached number 1 on the IFPI singles charts and achieved gold certification. In that same month, Vissi visited the studios to start recording her new Greek album. In August 2005, Anna took to the stage of the Coca-Cola Sound-Wave which was held in Mykonos.[30] There she sang her new English song \"Lie\" and surprised fans and media by appearing on stage with half her head shaved. This performance was considered by many her come-back to the Greek music scene after being absent for more than a year.\n\nOn September 27, 2005, Vissi released a new Greek album titled Nylon. The album went Platinum within 24 hours and peaked at number 1 on the IFPI Greek Top 50 albums chart. Shortly after in October 2005, the album was released as a dual disc, the first ever to be released in Greece. The dual disk featured special footage from her and Nikos Karvelas in the studio. On the CD Anna has a duet with the lead singer of the hip-hop group Goin' Through called Erota i Polemo (Love or War). The album is different than other albums Vissi has released with a more rock feel to it as well as a mix of other genres including rock, dance, ballads and hip hop. On Novermber 24, 2005, Vissi started performances at Club Votanikos in Athens, Greece with Goin' Through, Dimitris Korgialas, Evridiki, and Despina Olympiou until March 2006.\n\n2006-2007: Eurovision Song Contest & Tour\n\nGreek national broadcaster ERT chose Anna Vissi to represent Greece in the Eurovision Song Contest 2006. There were 4 songs to pick from, which Anna Vissi sang during a song selection show on 14 March 2006 at Votanikos Club. The Greek viewers used televote and SMS messages along with a panel of judges to choose the song they wanted Vissi to sing in the Eurovision Song Contest 2006. Two of the competing songs, were composed by Nikos Karvelas, namely \"Everything\" and \"Who Cares about Love\", with Vissi herself writing the lyrics to \"Everything\". The third song, \"A Beautiful Night\" was written by composing group Pegasos, while the last song, \"Welcome To The Party\", was written by Greek composer Dimitris Kontopoulos. \"Everything\" was selected as the representative song of Greece, winning 47.79% of the votes. The day after the final, Vissi filmed the video clip.[42] Her old record company Minos EMI released a CD single of her two prior Eurovision entries \"Autostop\" and \"Mono I Agapi\" shortly after.\n\nAfter the video to the song was completed, Anna Vissi embarked on a promotional tour across Europe starting on April 12, 2006 with Russia. She also visited Malta, Cyprus, Albania, Serbia & Montenegro, Romania, Spain, Netherlands, Sweden, Bosnia & Herzegovina, Belgium, and ended her tour on May 10, 2006 in Israel.\n\nOn April 19, 2006 she released a single for her Eurovision entry \"Everything\". It featured the original version of \"Everything\" and a remix of it by DJ Valentino and Christodoulos Siganos. Anna then also re-released Nylon as Nylon: Euro-Edition, which includes all of the songs from her album Nylon, as well as the representative song \"Everything\" in original, remixed and karaoke version. \"Euro Edition\" also contains the three other Greek Eurovision Preselection songs: \"Beautiful Night\", \"Who Cares About Love\" and \"Welcome to the Party\", which has entered the playlist of American satellite radio station \"Sirius Beat\".\n\nDuring the contest, Anna performed in the 16th spot of the night and appeared alone on stage, wearing a Jean-Paul Gaultier outfit. Although she had been one of the favorites during the pre-contest period, she only managed to get 9th place with 128 points (hers was one of the two pre-qualified entries to finish in the Top 10 (the other was Romania). The other 8 songs were all qualified from the semi-final). Finland won the contest with the rock band Lordi and their song 'Hard rock hallelujah'. In interviews prior to the contest, she had stated that if there was anyone she would like to lose to, it would be the Finnish entry. Lordi had also expressed their liking of the Greek song in interviews too.\n\nFollowing the contest, \"Everything\" was released in Finland on May 24, 2006 by Sony BMG Finland. It has already been released in Sweden and it peaked at 24. It featured a different cover, than the original single. The Dual disk version of Nylon was also re-released with the Eurovision single. Anna gave a concert at London's Royal Albert Hall on May 27, 2006. She also had a concert on September 8, 2006 at G.S.P. Stadium in Nicosia, Cyprus, which kick-started her Mini-Greek Tour. The tour was called The Best of Anna Vissi 2006 and was covered by Alpha.\n\nIn the fall of 2006, she embarked on a Greek mini-tour performing around Greece in sold-out concerts as well as Cyprus with Goin' Through.\n\nIn the beginning of 2007, Vissi moved to Los Angeles, United States to start work on an English album. In February 2007, she accompanied long time friend Patricia Field to the Oscars in Los Angeles, California.\n\nVissi also started a world tour in January 2007. She traveled to Australia with Konstantinos Christoforou and had 3 concerts in Melbourne and Sydney and from April 10, 2007 through May 1, 2007, she toured North America. Along with Takis Zahartos, she performed in Chicago, New York, Atlantic City, Connecticut (Foxwoods), Los Angeles, Montreal, and Toronto. Vissi continued her tour in October 2007 with a mini-European tour. The concerts included Amsterdam and Brussels with her concert in Paris being canceled without an explanation. During the tour, she stated that she was only half way through her world tour.\n\nIn September 2007, Sony BMG Greece released a compilation titled The Essential Anna Vissi. The album contains 17 tracks, including some of Vissi's biggest hits. It also includes the previously leaked, but unofficially released English song \"Is it Safe?\".\n\nIn November 2007, she held a special charity concert in London for the Oinoussian Benevolent Fund. It was held at the Royal Opera House in Covent Garden with the London Philharmonic Orchestra and she raised £250,000, excluding the entrance tickets costing £200.\n\n2008: Apagorevmeno & New English album\n\nOn New Year's Day, Vissi kicked off the new year by holding a big concert in her birth town of Larnaca, Cyprus. Vissi spent a large portion of 2007 and 2008 recording her new English Album. In an interview with fans, Vissi talked about the album, describing it as “a rock album with unbelievably nice songs, that some of the biggest people in the USA music industry worked on. It is an album that could only be made in the US, that represents who I am, and I believe that this album will be a big plus in my career so far.” It was revealed that the album will be released in the first half of 2009.\n\nIn February 2008, Vissi signed to Maple Jam Music Group for the management of the release of her upcoming Greek and English albums. In April 2008, MAD TV hosted a competition for its \"Greek Week\" in which visitors to their website were able to vote for their 10 favorite Greek music videos, with the winners being showcased in a special \"Greek Top 30 Countdown\" on April 20. Vissi was the most nominated artist with 13 videos, and managed to secure the number one position with \"Treno\", while \"Agapi Ipervoliki\" came in at number four when the Top 30 were announced.\n\nOn 28 June 2008, Vissi posted the song \"Diri Dakta\" that had been recorded previously via her official myspace for her fans; the song would not appear on her new album.\n\nIn July 2008, MAD TV confirmed that Vissi has been booked to perform at the Athinon Arena starting in February 2009, as part of her comeback.[61]. On October 4, 2008, Vissi held a charity gala at the Grosvenor House Hotel in London.\n\nThe bonus track from the Greek album was released on October 29, 2008 along with its its music video. The song, titled \"To Parelthon Mou\" (My Past) will be the title track to a new Greek film Bank Bang to be released in December. The music video for the song was filmed on October 22, 2008 at The Mall Athens. With Cosmote sponsoring the album, three songs from the album were released on November 26, 2008 exclusively on the Cosmote online music store.\n\nVissi's Greek album Apagorevmeno was released on December 9, 2008. It was the first album since 1983 not to include any songs or input by Nikos Karvelas. The reason she gave for this in an interview with Down Town Magazine was that the two have gotten tired of each other, but clarified that this does not rule out a collaboration in the future. The album was certified Gold in the first week of release, and reached number one on its second week on the charts.\n\nCurrent Projects\n\n    * For 2009, Vissi is booked to sing at Athinon Arena in Athens, Greece. Peter Young (Takis Kouvatseas) will be the director, while Mia Michaels will be the choreographer.\n    * Anna is currently working on a new English album in LA with a 2009 release date. Some of the songwriters include Dave Stewart, Glen Ballard, Pat Leonard and Brian Hewes. It is schedualed to be released in the first half of 2009. <a href=\"https://www.last.fm/music/+noredirect/%CE%86%CE%BD%CE%BD%CE%B1+%CE%92%CE%B9%CF%83%CF%83%CE%B7\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
