{"artist":{"name":"何韻詩","mbid":"91344a97-e0aa-4085-a374-9a36290e098e","url":"https://www.last.fm/music/%E4%BD%95%E9%9F%BB%E8%A9%A9","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/197b63141b8d10ddfc8c2e2362808a36.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/197b63141b8d10ddfc8c2e2362808a36.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/197b63141b8d10ddfc8c2e2362808a36.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/197b63141b8d10ddfc8c2e2362808a36.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/197b63141b8d10ddfc8c2e2362808a36.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/197b63141b8d10ddfc8c2e2362808a36.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"13255","playcount":"754875"},"similar":{"artist":[{"name":"麥浚龍","url":"https://www.last.fm/music/%E9%BA%A5%E6%B5%9A%E9%BE%8D","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5533c8ac4abb4558baaa8b8790324f64.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5533c8ac4abb4558baaa8b8790324f64.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5533c8ac4abb4558baaa8b8790324f64.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5533c8ac4abb4558baaa8b8790324f64.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5533c8ac4abb4558baaa8b8790324f64.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5533c8ac4abb4558baaa8b8790324f64.png","size":""}]},{"name":"鄭融","url":"https://www.last.fm/music/%E9%84%AD%E8%9E%8D","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3a699b09b0efab7ed6f2661e31912c61.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3a699b09b0efab7ed6f2661e31912c61.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3a699b09b0efab7ed6f2661e31912c61.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a699b09b0efab7ed6f2661e31912c61.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a699b09b0efab7ed6f2661e31912c61.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3a699b09b0efab7ed6f2661e31912c61.png","size":""}]},{"name":"梁漢文","url":"https://www.last.fm/music/%E6%A2%81%E6%BC%A2%E6%96%87","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/831c7ca6c0c14baab405ae0e635cd45a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/831c7ca6c0c14baab405ae0e635cd45a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/831c7ca6c0c14baab405ae0e635cd45a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/831c7ca6c0c14baab405ae0e635cd45a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/831c7ca6c0c14baab405ae0e635cd45a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/831c7ca6c0c14baab405ae0e635cd45a.png","size":""}]},{"name":"At17","url":"https://www.last.fm/music/At17","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b29e7f8391834d3f8a03e2fc76f6bc07.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b29e7f8391834d3f8a03e2fc76f6bc07.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b29e7f8391834d3f8a03e2fc76f6bc07.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b29e7f8391834d3f8a03e2fc76f6bc07.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b29e7f8391834d3f8a03e2fc76f6bc07.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b29e7f8391834d3f8a03e2fc76f6bc07.png","size":""}]},{"name":"許志安","url":"https://www.last.fm/music/%E8%A8%B1%E5%BF%97%E5%AE%89","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3360c6501ff847f581ce12fecf3fdef0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3360c6501ff847f581ce12fecf3fdef0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3360c6501ff847f581ce12fecf3fdef0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3360c6501ff847f581ce12fecf3fdef0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3360c6501ff847f581ce12fecf3fdef0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3360c6501ff847f581ce12fecf3fdef0.png","size":""}]}]},"tags":{"tag":[{"name":"cantonese","url":"https://www.last.fm/tag/cantonese"},{"name":"Hong Kong","url":"https://www.last.fm/tag/Hong+Kong"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"chinese","url":"https://www.last.fm/tag/chinese"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/%E4%BD%95%E9%9F%BB%E8%A9%A9/+wiki"}},"published":"04 Mar 2007, 03:46","summary":"Denise Ho Wan-See (Traditional Chinese: 何韻詩; Simplified Chinese: 何韵诗; pinyin: Hé Yùnshī), also known as HOCC, CC and Goo, born May 10, 1977, with family roots in Shunde, Guangdong, is a Hong Kong Cantopop singer.\n\nBiography:\n\n1996-2001\nDenise Ho was born in Hong Kong and received her education in Canada and Diocesan Girls' Junior School, Hong Kong. She emigrated with her family to Montreal, Quebec at the age of 11. Her music career was launched in 1996, after she won the 15th New Talent Singing Awards. <a href=\"https://www.last.fm/music/%E4%BD%95%E9%9F%BB%E8%A9%A9\">Read more on Last.fm</a>","content":"Denise Ho Wan-See (Traditional Chinese: 何韻詩; Simplified Chinese: 何韵诗; pinyin: Hé Yùnshī), also known as HOCC, CC and Goo, born May 10, 1977, with family roots in Shunde, Guangdong, is a Hong Kong Cantopop singer.\n\nBiography:\n\n1996-2001\nDenise Ho was born in Hong Kong and received her education in Canada and Diocesan Girls' Junior School, Hong Kong. She emigrated with her family to Montreal, Quebec at the age of 11. Her music career was launched in 1996, after she won the 15th New Talent Singing Awards. Her victory not only earned her a recording contract with Capital Artists Limited (華星唱片) but also a chance to become the only female apprentice of her childhood idol, Anita Mui. Her debut EP, first., came 5 years after her victory. During her 5 year wait, she went on tour with Anita Mui as a background singer and hosted various TV shows produced by TVB.\n\n2002\nAfter Capital Artists closed, Denise Ho joined EMI in 2002. Although she was only with the company for a brief 2 years period, but it is during this time that her music talents flourished. She teamed up with Ying C Foo (英師傅) for her first EMI label release, hocc² (EP). The song \"Angel Blues\" (天使藍), composed by Ho herself, not only reached top spots on music charts, but according to Ho, it is also her \"growing up\" song. Another single in the EP, \"Rosemary\" (露絲瑪莉), written by Wyman Wong, created considerable controversies at the time, as it touched on the topic of lesbianism. This song also marked the beginning of Ho's series of songs containing gay themes. Following the success of \"Rosemary\" (露絲瑪莉), Ho continued the story of the two lovers in \"Goodbye... Rosemary\" (再見…露絲瑪莉) in her first full length album, free{love}.\n\n2002 proved to be a successful year for Ho. The two singles \"Angel Blues\" (天使藍) and \"Goodbye... Rosemary\" (再見…露絲瑪莉) have won multiple music awards in Hong Kong, including CASH Golden Sail Music Awards (CASH金帆音樂獎) – “Best Vocal Performance By A Female Artist” for the song “Angel Blues”. In the same year, Ho won the recognizable \"Female Singer Bronze Award\" in the Commercial Radio Hong Kong Annual Awards (叱吒樂壇流行榜頒獎典禮).\n\n2003-2004\nIn 2003 Denise Ho did a spectacular \"Music is Live\" concert with Andy Hui, who is also an apprentice of Anita Mui. Their performance won praise from the critics, and Ho proved to the audience her magnificent abilities to perform live as a musician. Later that year, Ho released her second full-length album Dress Me Up!. She was the credited as the producer of the album, indicating that Ho has finally gained full control over her music. In September 2003, Ho’s long time mentor, Anita Mui announced she was diagnosed with cervical cancer. Shortly after the announcement, Anita lost her battle against cervical cancer and died on December 30, 2003.\n\nBetween 2003 and 2004, Ho took on the role of hosting TVB's weekly live music show, Jade Solid Gold. In 2004, she appeared in Sammi Cheng's 2004 \"Sammi vs. Sammi\" concert as a cross-dressing cigarette-smoking admirer of Sammi. Ho's critically acclaimed performance in the short musical segment not only brought attention to the role she played, but also further established herself as a tremendous live performer.\n\n2004-2005\nIn September, 2004, Denise Ho signed a contract with East Asia Music (東亞娛樂), the sister company of Amusic. The album Glamorous (艷光四射), which pays tribute to the superstars of the 80's, was released in January 2005. It also marked the start of a close collaboration between Denise and the Green Mountain Orchestra band (青山大樂隊). She was named the Orbis Student Ambassador 2005, and visited Hainan in July. In September 2005, Ho performed in the musical Butterfly Lovers (梁祝下世傳奇)as the leading actress, producer and musical director. Her album of the same name gave her three Number 1 singles - \"Becoming a Butterfly\" (化蝶), \"Lawrence and Lewis\" (勞斯．萊斯) and \"Coffee in a Soda Bottle\" (汽水樽裡的咖啡), which are all based on the story of the Butterfly Lovers, with possible homosexual themes. These singles helped her Receive the \"Female Singer Silver Award\" at Commercial Radio Hong Kong Annual Awards 2005 (叱吒樂壇流行榜頒獎典禮).\n\n2006-2007\nDenise Ho held her first Hong Kong Coliseum concert \"Live in Unity 2006\" on 26-28 October, 2006. The concert was a great success and was positively received by the public. Ho decided to stage a second concert, \"Live in Unity 2007\", on 19-20 January, 2007 following the original concert's success. Her single, We Stand As One, named after the slogan for the \"Live in Unity\" concerts, was released on January 11, 2007. Recordings of the concert were later released in February 2007. Ho then went on a worldwide tour, performing in Toronto, Canada and Atlantic City, U.S..\n\nThe significant public attention and positive reception to her music helped her garner the \"Female Singer Gold Award\" at the Commercial Radio Hong Kong Annual Awards 2006 (叱吒樂壇流行榜頒獎典禮). Ho also sang the Chinese version of Ayumi Hamasaki's song \"Secret\", known as \"Wounded City Secret\" (傷城秘密), for the 2006 movie Confession of Pain. She continued as the Orbis Student Ambassdor 2006 and visited Vietnam, and later started her own charitable fund.\n\n2008-present\n\nIn 2008, a new album 《Ten Days in the Madhouse》released. She produced this album from the view point of society's outcasts and to raise awareness of mental health issues. She encourages people to understand and know more about people with mental illness and those are ex-mental ill and care about their needs and situation. Denise Ho encourage the communication between them and the public, ultimately, to achieve social harmony. Denise Ho delivers her most ambitious project yet with \"Ten Days in the Madhouse\" and released with a documentary by Hong Kong director Yan Yan Mak (Butterfly) and an exhibition for charity, Denise shows that a multimedia project by a musician can be about something more important than clothing tie-ins.\n\nIn 2009, she followed up her plan from late last year, and organized a free concert (a huge rarity in Hong Kong) called \"Happiness is Free\" in the outdoor courtyard in Diocesan Boys' School. She managed to book the place because her father was a teacher there. In June, she began the shooting of a new TV sitcom of TVB (titled \"O.L. Supreme\") with Liza Wang. In July, she released her new song \"The Old Testament\" (舊約) and announced that her concert with the theme \"SUPERGOO\" would be held during 9–12 October this year. Following the concert, Denise took on a role in the new stage comedy \"Man and Woman, War and Peace\"(男人與女人之戰爭與和平) directed by Edward Lam. The stage comedy was presented on 13–16 November at Kwai Tsing Theatre of Hong Kong.\n\nIn 2010, she started the filming for the new movie (奪命金) directed by Johnnie To. She also extends her presence in Taiwan by launching an intensive roadshow program with miniconcerts and interviews in key regions of Taiwan such as Taipei, Kaoshiung etc. In September her first Taiwanese album (無名．詩) was officially released in Taiwan and Hong Kong. After having spent most of her effort in Taiwan and China, her 'Homecoming' concert will be held in Hong Kong during 23–25 December 2010.\n\nIn 2011, Denise was nominated the first time at The 22nd Annual Golden Melody Popular Music Award for the Best Female Artist in Mandarin. Although she couldn’t bring the award home at the end, she sees the nomination of this award as a great encouragement after having spent her effort and time in Taiwan in the past year. Denise initiated another round of live concerts in Taipei again in June this year.\n\nIn 2012, Denise Ho announced her sexual orientation on stage at the \"Dare to Love\" event at the Hong Kong Pride Parade 2012. She called herself \"tongzhi,\" a Chinese term for homosexuals. Ho is the first mainstream female singer in Hong Kong to come out of the closet. Since then, she has been involved in the Big Love Alliance, and striving equal rights for LGBT. Later that year, she was nominated for the first time at The 49th Annual Golden Horse Awards for the Best Actress for her performance in the movie \"Life Without Principle\" (奪命金) directed by Johnnie To. In the end, Ho lost the award to Taiwan's Gwei Lun Mei. Ho said she was actually very surprised and a little embarrassed when she received news that she had been nominated for this award since her role was not really considered a main character in the movie. Thus, she took the nomination as an encouragement to work harder on her next film.\n\nIn 2013, Denise Ho continued with the tour of her play Awakening in Singapore and as well in many Chinese cities. The play was well-received by the public, and achieved full house attendance in various venues. She also released her second Mandarin album, Coexistence, whose main theme is about embracing the differences in people and providing support for each other. The album achieved good sales in Hong Kong, Mainland China, and as well Taiwan, selling more than 30,000 copies in total. Denise is also holding her third major concert \"Memento Live\" at the Hong Kong Coliseum from 19–21 October. The concert theme will be memories, and the name \"Memento\" fits in perfectly because the English definition for it is \"something that serves to remind.\" In the past, people had a set image of Denise, which was very tomboy-like. So this time, she wants to break all these stereotypes (especially after she came out of the closet) and show the audience a more versatile/multifaceted side of Denise Ho, show them her breakthroughs, and most importantly to show them how she has grown since her last Hong Kong Coliseum concert. As well, to go along with the concert's theme of memories, Denise will be releasing a cover album of her mentor Anita Mui's songs, called Recollections, for it has been ten years since she has passed away. This in itself is a breakthrough for Denise because she, in the past, had intentionally avoided singing her mentor's songs for she thought that Anita Mui's songs were for Anita only and nobody else should sing it. But now, she feels that it is time to let go of certain stubbornness and pay tribute to her beloved mentor.\n\nAccording to her Weibo page, she is an occasional vegetarian because when she tried to convert to vegetarianism in 2010, she became ill due to work schedule and shock to the system, so she only become a vegetarian for about two months a year.\n\nDiscography:\n    * 2001 - first. (EP)\n    * 2002 - hocc² (EP)\n    * 2002 - free {love}\n    * 2003 - Roundup (Compilation)\n    * 2003 - Music is Live 03 Andy Hui X Denise Ho (許志安 X 何韻詩 2人交叉組合拉闊03) (Live Album)\n    * 2003 - Dress Me Up!\n    * 2004 - The Best of HOCC (Compilation)\n    * 2005 - Glamorous (艷光四射)\n    * 2005 - Butterfly Lovers (梁祝下世傳奇)\n    * 2006 - Our Time Has Come (我們的時代經已降臨)\n    * 2006 - HOCC - The Greatest Hits (最愛 何韻詩) (Compilation)\n    * 2007 - We Stand As One (Single)\n    * 2007 - HOCC Live In Unity 2006 (HOCC Live In Unity 2006 演唱會) (Live Album)\n    * 2007 - What Really Matters (CD+DVD)\n    * 2008 - Goomusic Collection 2004-2008 (2CD+DVD)\n    * 2008 - TEN DAYS IN THE MADHOUSE (CD+DVD)\n    * 2009 - HEROES (CD+DVD)\n    * 2009 - HOCC Supergoo Live 2009 (HOCC Supergoo Live 2009 演唱會) (Live Album)\n    * 2010 - Poem and Nonsense 詩與胡說 (Single)\n    * 2010 - Unnamed.Poem 無名．詩 (Debut Mandarin Album)\n    * 2011 - Green (Single)\n    * 2011 - Awakening\n    * 2012 – Awakening (Mandarin Version)\n    * 2012 – All is Fair 無臉人 (Single with Bonus Track of English Version)\n    * 2013 – Coexistence 共存 (Mandarin Album)\n    * 2013 – Recollections (Cover Album)\n    * 2014 – Memento Live 2013 Concert (Live Album)\n\nSongs:\n(The following are songs which have not appeared on any of Denise Ho's albums)\n    * 2003 - Fiery Fire (火紅火熱) (Miriam Yeung/Edmond Leung/Ronald Cheng/Denise Ho)\n        From Ronald Cheng's album - 唔該， 救救我 “火紅火熱”版 (Please Help!!! - 2 AVCD Version)\n    * 2005 - I Am The Present (我是現在)\n        From the Seoul Raiders Original Soundtrack\n    * 2009 - Shameless Love (愛無愧)\n        Title Song from The Beauty of the Game\n\nVCD's:\n    * 2003 - Music is Live 03 Andy Hui X Denise Ho (許志安 X 何韻詩 2人交叉組合拉闊03)\n    * 2005 - Good Morning! Manhattan (早安啊! 曼克頓)\n    * 2005 - Butterfly Lovers - The Musical (梁祝下世傳奇 舞台劇)\n    * 2007 - HOCC Live In Unity 2006 - We Stand As One 演唱會 Live Karaoke\n\nDVD's:\n    * 2003 - Music is Live 03 Andy Hui X Denise Ho (許志安 X 何韻詩 2人交叉組合拉闊03)\n    * 2005 - Butterfly Lovers - The Musical (梁祝下世傳奇 舞台劇)\n    * 2007 - HOCC Live In Unity 2006 - We Stand As One 演唱會 Live Karaoke\n    * 2007 - Small Matters\n    * 2009 - \"Happiness is Free\" Live (快樂是免費的 音樂會)\n    * 2009 - HOCC Supergoo Live 2009 Karaoke\n    * 2010 - HOCC Homecoming Live 2010\n    * 2012 – Awakening Documentary\n    * 2014 – Memento Live 2013 Concert\n\nFilmography:\n    * 1998 - Rumble Ages (烈火青春)\n    * 2000 - The Slayer of Demons (妖怪傳) - Voice only: Sakuya (聲演: 神木櫻夜)\n    * 2003 - 1:99\n    * 2003 - Naked Ambition (豪情)\n    * 2003 - Anna In Kungfuland (安娜與武林)\n    * 2003 - Hidden Track (尋找周杰倫)\n    * 2007 - The Simpsons Movie (阿森一族大電影) - Voice only: Bart Simpson\n    * 2008 - Kung Fu Panda (功夫熊貓) - Hong Kong Voice only: Tigress\n    * 2009 - Look for a Star (游龍戲鳳)\n    * 2010 - 72 Tenants of Prosperity\n    * 2010 - Shares\n    * 2010 - Merry-Go-Round\n    * 2011 - Kung Fu Panda 2 (功夫熊貓2) - Hong Kong Voice only: Tigress\n    * 2011 - Life Without Principle\n    * 2012 - I Love Hong Kong 2012\n    * 2013 - Young and Dangerous: Reloaded (古惑仔：江湖新秩序)\n\nTV series\n    * 1999 - Anti-Crime Squad (反黑先鋒) as 單解心\n    * 2005 - Henry Lau \"To Russia with Love\" Fashion Show\n    * 2010 - O.L. Supreme (女王辦公室) as Music Miu 繆惜之\n\nStage:\n    * 2001 - This Summer This Moment (十九樓1/2的夏天)\n    * 2003 - A Lover's Discourse (戀人論語 - 您愛我妳不愛我)\n    * 2003 - Camp David (大衛營)\n    * 2004 - Good Morning! Manhattan (早安啊! 曼克頓)\n    * 2005 - Butterfly Lovers - The Musical (梁祝下世傳奇 舞台劇)\n    * 2006 - HOCC Live in Unity 2006 (何韻詩二零零六演唱會)\n    * 2007 - HOCC Live in Unity 2007 (何韻詩二零零七演唱會)\n    * 2007 - Metro Media HOCC & special guests (新城何韻詩好友音樂會)\n    * 2007 - HOCC showcase 07 MUSIC MATTERS\n    * 2007 - 又一個叱吒十年回歸音樂會\n    * 2007 - Neway Shall We 音樂會\n    * 2008 - 分享情‧活出愛 音樂會\n    * 2008 - 08 Moov live - 何韻詩\n    * 2008 - 東亞華星演唱會\n    * 2009 - 《快樂是免費的》HOCC免費音樂會\n    * 2009 - 新城Blue Girl唱好Easter音樂會\n    * 2009 - SUPERGOO Live 2009 (何韻詩SUPERGOO二零零九演唱會)\n    * 2009 - MAN AND WOMAN, WAR AND PEACE - The Musical (男人與女人之戰爭與和平 舞台劇)\n    * 2010 - Riverside (Taipei 2010/7/21) 《公館河岸留言》（台北）\n    * 2010 - Music is Live Anthony Wong x Denise Ho x Jan Lamb (黃耀明x何韻詩x林海峰 903拉闊音樂會）\n    * 2011 to 2013 – Jia Baoyu/Awakening (賈寶玉)\n    * 2013 – HOCC Coexistence Concerts 2013 (何韻詩共存演唱會2013)\n    * 2013 – MEMENTO Live 2013\n\nStage (as a guest)\n    * 2000 - Music is Live Eason & Friends (Eason & Friends拉闊音樂會)\n    * 2001 - Elva Hsiao Concert (蕭亞軒夏日的精彩演唱會)\n    * 2002 - Metro Media Eason & Girlfriends Mini Concert (新城唱好Eason & Girlfriends音樂會)\n    * 2004 - 903 Edison's Live (903陳冠希香港地夠膽死音樂會)\n    * 2004 - Sammi vs Sammi 2004 Concert (Sammi VS Sammi 2004 演唱會)\n    * 2005 - Wilfred Lau 903 Hit 4 On Fire 0813 Concert (劉浩龍 加州紅903熱火樂團音樂會)\n    * 2005 - Reflection of Joey's Live 2005 (容祖兒演唱會2005)\n    * 2007 - Show Mi Sammi Concert 2007 景福Show Mi 鄭秀文2007演唱會)\n    * 2007 - Lokamochi Mamiba (森美小儀歌劇團)\n    * 2008 - The 27th Hong Kong Film Awards Presentation Ceremony (第二十七屆香港電影金像獎頒獎典禮)\n    * 2009 - Sammi Love Mi World Tour Hong Kong (Love Mi 鄭秀文世界巡回演唱會 香港站)\n    * 2012 – Concert YY (黃偉文作品展)\n    * 2013 – Jam Hsiao Wish Love Live (蕭敬騰演唱會 20130831)\n\nCommercials:\n    * Ericsson R310sc (with Andy Lau)\n    * Neutrogena (2002)\n    * Budweiser (2004)\n    * Pepsi\n    * Sony Walkman A Series (2006)\n    * Motorola Ming A1200: 花見, 光明會(2006)\n    * Mcdonald Dip Dip McNuggets (2009)\n    * Levi's Curve ID (2010)\n    * Ultimate Ears (2010)\n    * Levi's Roadwear (2010)\n    * Millie's Autumn/Winter Collection view (2012)\n    * Diesel's The Power of D view (2013) <a href=\"https://www.last.fm/music/%E4%BD%95%E9%9F%BB%E8%A9%A9\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
