{"artist":{"name":"張學友","mbid":"a2cab261-63cc-4ccf-8023-6b6e8588bb62","url":"https://www.last.fm/music/%E5%BC%B5%E5%AD%B8%E5%8F%8B","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a300efc1f4e941699f1e1394c6e22d4c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a300efc1f4e941699f1e1394c6e22d4c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a300efc1f4e941699f1e1394c6e22d4c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a300efc1f4e941699f1e1394c6e22d4c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a300efc1f4e941699f1e1394c6e22d4c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a300efc1f4e941699f1e1394c6e22d4c.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"49228","playcount":"1467361"},"similar":{"artist":[{"name":"張國榮","url":"https://www.last.fm/music/%E5%BC%B5%E5%9C%8B%E6%A6%AE","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5ecab85362ae4443b8409530f0b0b930.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5ecab85362ae4443b8409530f0b0b930.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5ecab85362ae4443b8409530f0b0b930.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5ecab85362ae4443b8409530f0b0b930.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5ecab85362ae4443b8409530f0b0b930.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5ecab85362ae4443b8409530f0b0b930.png","size":""}]},{"name":"劉德華","url":"https://www.last.fm/music/%E5%8A%89%E5%BE%B7%E8%8F%AF","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/995fc74d76094dc89e4c2bda937a798d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/995fc74d76094dc89e4c2bda937a798d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/995fc74d76094dc89e4c2bda937a798d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/995fc74d76094dc89e4c2bda937a798d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/995fc74d76094dc89e4c2bda937a798d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/995fc74d76094dc89e4c2bda937a798d.png","size":""}]},{"name":"陳奕迅","url":"https://www.last.fm/music/%E9%99%B3%E5%A5%95%E8%BF%85","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e5c56387cd0b12fe8bf9e8b68aa9c2de.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e5c56387cd0b12fe8bf9e8b68aa9c2de.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e5c56387cd0b12fe8bf9e8b68aa9c2de.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5c56387cd0b12fe8bf9e8b68aa9c2de.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5c56387cd0b12fe8bf9e8b68aa9c2de.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e5c56387cd0b12fe8bf9e8b68aa9c2de.png","size":""}]},{"name":"譚詠麟","url":"https://www.last.fm/music/%E8%AD%9A%E8%A9%A0%E9%BA%9F","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2ed3301c366d4c91b2d93f4c3b79a0c8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2ed3301c366d4c91b2d93f4c3b79a0c8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2ed3301c366d4c91b2d93f4c3b79a0c8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2ed3301c366d4c91b2d93f4c3b79a0c8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2ed3301c366d4c91b2d93f4c3b79a0c8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2ed3301c366d4c91b2d93f4c3b79a0c8.png","size":""}]},{"name":"陳慧嫻","url":"https://www.last.fm/music/%E9%99%B3%E6%85%A7%E5%AB%BB","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/11b5869406781513f0eedf0b3cd59262.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/11b5869406781513f0eedf0b3cd59262.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/11b5869406781513f0eedf0b3cd59262.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11b5869406781513f0eedf0b3cd59262.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11b5869406781513f0eedf0b3cd59262.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11b5869406781513f0eedf0b3cd59262.png","size":""}]}]},"tags":{"tag":[{"name":"chinese","url":"https://www.last.fm/tag/chinese"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"cantonese","url":"https://www.last.fm/tag/cantonese"},{"name":"C-pop","url":"https://www.last.fm/tag/C-pop"},{"name":"Hong Kong","url":"https://www.last.fm/tag/Hong+Kong"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/%E5%BC%B5%E5%AD%B8%E5%8F%8B/+wiki"}},"published":"03 Jul 2006, 15:09","summary":"Jacky Cheung Hok Yau (Traditional Chinese: 張學友; Simplified Chinese: 张学友; pinyin: Zhāng Xúeyǒu; born July 10, 1961 in Hong Kong with family roots in Tianjin) is a Hong Kong singer and film star from the mid-1980s to the present. Dubbed the god of songs (歌神) by the Cantopop industry, Cheung is regarded by many as one of the finest male singers to have come out of Hong Kong, known for his rich baritone voice, wide range and exceptional interpretative powers. <a href=\"https://www.last.fm/music/%E5%BC%B5%E5%AD%B8%E5%8F%8B\">Read more on Last.fm</a>","content":"Jacky Cheung Hok Yau (Traditional Chinese: 張學友; Simplified Chinese: 张学友; pinyin: Zhāng Xúeyǒu; born July 10, 1961 in Hong Kong with family roots in Tianjin) is a Hong Kong singer and film star from the mid-1980s to the present. Dubbed the god of songs (歌神) by the Cantopop industry, Cheung is regarded by many as one of the finest male singers to have come out of Hong Kong, known for his rich baritone voice, wide range and exceptional interpretative powers. Since the early 1990s, he is arguably the world's most popular and respected Chinese pop singer.\n\nHe was the national singing champion in Hong Kong 1984 with the song Fatherland, ousting more than ten thousand other contestants. He was signed by the then Polygram Records, now Universal Music Group. Although encouraged by a bright start, he was not yet able to achieve immediate supremacy in Cantopop, then dominated by 譚詠麟, 梅艷芳, Leslie Cheung and 陳百強. Cheung suffered a nosedive in his career in 1988 after a best-selling first two albums. That year he did not have a single song awarded in the annual TVB JSG. His subsequent sales record dipped and one of his albums in the late 1980s managed just around ten thousand in sales. The reason for the fall in his CD sales was partially attributed to his alcohol problem - he could get drunk 5 times a week. After disrupting his friend's birthday party while being drunk, Cheung vowed in public that he would not consume alcohol again till he was 40. He kept that promise.\n\nHis recording career subsequently returned to its track. Then, in 1991, with the song 每天愛你多一些 (Loving You More Everyday), his career took a massive upturn. The album, 真情流露True Love Expression in 1992, as well as the succeeding release, 愛火花Love Sparks in 1992, became the two most successful albums in Hong Kong history, achieving audited sales of over 400,000 copies in Hong Kong alone and turned Cheung into a superstar, paving the way for himself and his contemporaries, Andy Lau, Leon Lai and Aaron Kwok, to take Cantopop to even greater heights. Subsequent albums continue to be a hit like 我與你True Love Expression 1993, 餓狼傳說 Wolf Tale 1994 etc. Since then his career has grown from strength to strength, and Cheung has managed to garner thousands of fans overseas as well as numerous music awards both in Hong Kong and elsewhere, including the best-selling Chinese singer in the Worlds Music Awards. Cheung has also been elected one of the world's Ten Outstanding Young Persons.\n\nAmong his most famous songs are Amour, 只想一生跟你走 (Only Thinking of Going Through Life With You) and the everlasting 吻别 (Goodbye Kiss) which confirms his status as one, and many consider the pre-eminent member, of the Four Heavenly Kings of Cantopop. Goodbye Kiss, a Mandarin number, was also one of the best-selling albums of all time, achieving more sales in Hong Kong, Taiwan and Southeast Asia such as not attained before, with an astounding 5 million copies sold in 1993 alone, a record that has remained yet unbroken. Goodbye Kiss was also instrumental in helping Cheung to break into the mando-pop market, and it also prompted other Hong Kong singers who wanted to gain a wider market to follow suit, even though, to this very day, very few indeed have been able to approach Cheung's level of success.\n\nHis work on the ground-breaking cantonese musical, Snow, Wolf, Lake musical (1997), was also enthusiastically received by both audiences and critics. Cheung not only played the male lead, but was also the artistic director for this production. The female lead was played by Sandy Lam and they achieved 43 full-house performances at the gigantic Hong Kong Coliseum. In November 2004, Jacky and his concert manager, Florence Chan Suk-Fan, worked on a revised Mandarin version of Snow, Wolf, Lake so as to bring it to a wider audience. The estimated budget for this revised production was HK$100 million and the show premiered on 24 December 2004 in Beijing. The production subsequently toured China and other Asian destinations to huge acclaim.\n\nCheung won, for the umpteenth time, the Best Selling Cantonese Album Award in the Hong Kong IFPI Awards of 2005 with his live album, Jacky Live Performance. In the fast-changing scene of canto-pop, Cheung is able to maintain his popularity and sales power for more than 20 years after his debut, which is unparalleled in the history of Hong Kong pop music.\n\nCheung acted in many films, although singing has always been his priority. His versatility and acting skills have enabled him to play a lot of diverse parts. He received the Best Supporting Actor Golden Horse Award for his work in Swordsman (1990). He also received the Best Actor Award at the New Dehli Film Festival for his portrayal of the protagonist in July Rhapsody. His song Perhaps Love, which serves as the theme song for the multi-award-winning film Perhaps Love, also won the Best Song Award at the 2005 Hong Kong Film Awards.\n\nHe is married to May Lo with two daughters.\n\nCheung was named spokesperson for Hong Kong Disneyland in 2004. As the theme park's spokesperson, Cheung took part in a number of large-scale marketing events organized by The Walt Disney Company and Walt Disney Parks and Resorts, beginning by hosting a TV program, Magical World of Disneyland. [1] He also recorded a song for Hong Kong Disneyland, a multi-lingual song entitled One. The music video for One was filmed at Hong Kong Disneyland. <a href=\"https://www.last.fm/music/%E5%BC%B5%E5%AD%B8%E5%8F%8B\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
