{"artist":{"name":"黎明","mbid":"603976ae-5e99-4126-8406-23bf7134433c","url":"https://www.last.fm/music/%E9%BB%8E%E6%98%8E","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/220eaccd229543a6b59475a72b6d064f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/220eaccd229543a6b59475a72b6d064f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/220eaccd229543a6b59475a72b6d064f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/220eaccd229543a6b59475a72b6d064f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/220eaccd229543a6b59475a72b6d064f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/220eaccd229543a6b59475a72b6d064f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"22104","playcount":"276324"},"similar":{"artist":[{"name":"劉德華","url":"https://www.last.fm/music/%E5%8A%89%E5%BE%B7%E8%8F%AF","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/995fc74d76094dc89e4c2bda937a798d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/995fc74d76094dc89e4c2bda937a798d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/995fc74d76094dc89e4c2bda937a798d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/995fc74d76094dc89e4c2bda937a798d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/995fc74d76094dc89e4c2bda937a798d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/995fc74d76094dc89e4c2bda937a798d.png","size":""}]},{"name":"李克勤","url":"https://www.last.fm/music/%E6%9D%8E%E5%85%8B%E5%8B%A4","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dfad2f1c672049f299939fd072aea857.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dfad2f1c672049f299939fd072aea857.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dfad2f1c672049f299939fd072aea857.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dfad2f1c672049f299939fd072aea857.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dfad2f1c672049f299939fd072aea857.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dfad2f1c672049f299939fd072aea857.png","size":""}]},{"name":"鄭秀文","url":"https://www.last.fm/music/%E9%84%AD%E7%A7%80%E6%96%87","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/61995cbb389c9cbc9b3fe772b11e63c7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/61995cbb389c9cbc9b3fe772b11e63c7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/61995cbb389c9cbc9b3fe772b11e63c7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/61995cbb389c9cbc9b3fe772b11e63c7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/61995cbb389c9cbc9b3fe772b11e63c7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/61995cbb389c9cbc9b3fe772b11e63c7.png","size":""}]},{"name":"陳慧琳","url":"https://www.last.fm/music/%E9%99%B3%E6%85%A7%E7%90%B3","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cf6d7eacbb260ace50c164f0c9c39ec3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cf6d7eacbb260ace50c164f0c9c39ec3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cf6d7eacbb260ace50c164f0c9c39ec3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf6d7eacbb260ace50c164f0c9c39ec3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf6d7eacbb260ace50c164f0c9c39ec3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf6d7eacbb260ace50c164f0c9c39ec3.png","size":""}]},{"name":"陳慧嫻","url":"https://www.last.fm/music/%E9%99%B3%E6%85%A7%E5%AB%BB","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/11b5869406781513f0eedf0b3cd59262.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/11b5869406781513f0eedf0b3cd59262.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/11b5869406781513f0eedf0b3cd59262.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11b5869406781513f0eedf0b3cd59262.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11b5869406781513f0eedf0b3cd59262.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11b5869406781513f0eedf0b3cd59262.png","size":""}]}]},"tags":{"tag":[{"name":"chinese","url":"https://www.last.fm/tag/chinese"},{"name":"C-pop","url":"https://www.last.fm/tag/C-pop"},{"name":"Chinese Pop","url":"https://www.last.fm/tag/Chinese+Pop"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"cantonese","url":"https://www.last.fm/tag/cantonese"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/%E9%BB%8E%E6%98%8E/+wiki"}},"published":"23 Dec 2006, 06:37","summary":"Leon Lai, MH (黎明; pinyin: Lí Míng; Cantonese: lai4 ming4; born December 11, 1966) is a Chinese actor and a Cantopop singer.\n\nBiography\n\nBorn in Beijing, China as Lai Chit (黎捷), Leon was the only child in his family. His parents divorced when he was four. During his youth, he attended King's Way Princeton College (England). Before he became a singer in Hong Kong, he worked as a salesperson for a cellular phone company. After becoming the second runner up in the 5th New Talent Singing Awards <a href=\"https://www.last.fm/music/%E9%BB%8E%E6%98%8E\">Read more on Last.fm</a>","content":"Leon Lai, MH (黎明; pinyin: Lí Míng; Cantonese: lai4 ming4; born December 11, 1966) is a Chinese actor and a Cantopop singer.\n\nBiography\n\nBorn in Beijing, China as Lai Chit (黎捷), Leon was the only child in his family. His parents divorced when he was four. During his youth, he attended King's Way Princeton College (England). Before he became a singer in Hong Kong, he worked as a salesperson for a cellular phone company. After becoming the second runner up in the 5th New Talent Singing Awards, held by the TVB in 1986, he went to be taught singing by Dai Si Zong(戴思聪) and in the same year, he also obtained a recording contract with Capital Artist[1]. However he didn't get to release any album for four years [2]. As a result, his teacher arranged to have him signed a recording contract with Polygram (now known as Universal Music) and then got the contract with Capital Artist to be annulled after some negotiation [3]. In Polygram, he released his first album \"Leon\" and subsequent album \"Meet In The Rain\" which propelled Leon into instant stardom[4]. After several years at Polygram, Lai then signed a new contract with Sony Music on March 23, 1998.\n\nLeon has been associated with many female celebrities since he began his career. One of his most famous rumoured ex-girlfriends is Shu Qi. Apart from Shu Qi, he has been rumoured to have relationship with Dai Yun Hui, Wang Zu Xian, Seto Asaka, Michelle Reis, Kim Hee Sun, Lee Na Young, Wang Xiu Lin[5]. Currently, he is dating a model Gaile Lok[6].\n\n[edit] Career\n\n[edit] Singer\n\nTogether with Jacky Cheung, Andy Lau and Aaron Kwok, Lai was among the four most popular male singers during the 1990s, when the media referred to them as the \"Four Heavenly Kings\" (Chinese: 四大天王).\n\nIn the early stages of his career, he mainly sang cantopop, but due to the influence of producer Mark Lui, he expanded his repertoire to include popular electronic songs with compelling music videos. In 2002, he was selected to sing \"Charged up\", the 2002 World Cup theme song for the Greater China Region.\n\nThe lowpoint of his singing career came at the 1991 Hua Tong Flood Charity Concert. After his performance on stage, he was requested by a significant donor who wanted him to perform again. While performing the song Sorry I Love You, he went completely out of tune at the high note but he managed to complete the performance on stage. This event made him a target of critics and a butt of all jokes at the time and later earned him the tag 'out of tune' Heavenly Kings. However inspite of it, his fans still supported him[7].\nPerhaps - Leon's Album\nPerhaps - Leon's Album\n\nIn 1998, Leon's Korean song \"After loving you\" managed to reach the Top 10 in a Korean pop chart. He is the first Hong Kong singer to achieve this.[1]\n\nHe won numerous singing awards before announcing in 1999 that he would no longer accept any awards in Hong Kong. He won the \"Most Popular Male Singer\" award in 1993 and 1995 for TVB Jade Solid Gold. He has also won the \"Song of the Year\" award four times. In the 1996 year of awards, Leon Lai won a personal record 16 awards in the Hong Kong music scene. A tie with fellow singers Sky King and Jacky Cheung. This gives both artists one more award. The 4 stage Joint Award of Best Musicians. Awarded to the musician with the most awards won in the year ending award shows. Lai's music career gradually declined from the late 1990s. While he is still releasing new albums from time to time, his record sales are now less than impressive and his position has been overtaken by the newer generation of cantopop singers.\n\nIn 2004, Leon Lai formed a new record production company, \"A Music\", East Asia Record Production Company Limited, with Peter Lam. The first album produced by the company, \"Dawn\" was released in September of that year.\n\n[edit] Actor\n\nIn the period before he participated in the New Talent Singing Awards, he enrolled in the ATV actor training class, however he didn't complete the training with no apparent reason. Then, he applied for admission to the Hong Kong Performing Arts Academy but his application was rejected.\nThe Breaking Point\nThe Breaking Point\n\nAfter the New Talent Singing Awards, he got to act in a few TV serials. On one occasion, he went for filming of a romantic serials in Taiwan. There was a stark contrast in height between leon and the popular lead actress who is only 1.60 cm in height. The actress then demanded that leon squatted while filming so as to make up for the height differences. So leon has to act through all the scenes with the actress while squatting but he has to endure it as he was not popular at the time. However not long afterwards his new TV serials, \"The Breaking Point\" which turned out to be a resounding success and propel him to widespread fame in Hong Kong and Taiwan.[8]\n\nIn 1996, Lai was nominated for the Best Actor award at the 16th Hong Kong Film Awards for the film Comrades, Almost a love story. However, he did not win.\n\nThe next year in 1997, he managed to win the award for Best Original Song for the film Eighteen Springs both at the Golden Horse Film Festival and Hong Kong Film Awards.\n\nHe was again nominated for the Best Actor and Best Original Film Song award for the film City of Glass in 1999 at the Hong Kong Film Awards but he only managed to win the award for Best Original Film Song which he shared with Lin Xi and Dick Lee[9].\nThree - Leon award winning film\nThree - Leon award winning film\n\nIn 2002, Lai took the spotlight at the Golden Horse Awards, the Chinese-language version of the Oscars in Taiwan. He won Best Actor for Three: Going Home. In 2004, Lai wrote the story Leaving Me, Loving You together with Wilson Yip and also became the creative/production controller of the movie. However, the movie was a flop.\n\nIn 2005, Leon acted as one of the seven warriors, Yang Yun Chong, in the Tsui Hark directed Wuxia film, Seven Swords.[10]. In the same year in the film Moonlight In Tokyo, Leon unexpectedly acted as a chinese retard who pretend to be a Korean gigolo in Japan and thus shedding his idol image.[11]\n\nIn 2006, Leon wrote and directed a musical film titled A Melody Looking which was shot in New York. It features Leon and the rest of the Amusic family of singers. This film marks his debut as a director. [12]\n\n[edit] Societal contributions\n\nApart from being an actor, he took part in the production of advertisement for \"Dress Casual Day\" of the Community Chest. In the recent years, Lai has participated in many charity events. He has been a member of The Community Chest Campaign Committee and in December 1995, his contribution to children is further recognized by being appointed as UNICEF Special Representative to Youth at UNICEF Headquarters in New York. He also occasionally helps other non-profit organisations to raise funds.\n\nLai has been elected as one of The Ten Outstanding Young Persons (TOYP) in 1997, giving him a formal recognition of his professional endeavours and commitment to the community. He was also awarded the Medal of Honour (M.H.) on 12 October 2003 by Tung Chee-Hwa, the Chief Executive of Hong Kong SAR. <a href=\"https://www.last.fm/music/%E9%BB%8E%E6%98%8E\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
