{"artist":{"name":"Blind Lemon Jefferson","mbid":"9481010a-db23-469d-87df-b04118850efb","url":"https://www.last.fm/music/Blind+Lemon+Jefferson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b00072bbce9e413abf210276905c28d4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b00072bbce9e413abf210276905c28d4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b00072bbce9e413abf210276905c28d4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b00072bbce9e413abf210276905c28d4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b00072bbce9e413abf210276905c28d4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b00072bbce9e413abf210276905c28d4.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"135327","playcount":"854845"},"similar":{"artist":[{"name":"Blind Willie McTell","url":"https://www.last.fm/music/Blind+Willie+McTell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2a57dd2de0344a648af8d53642786646.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2a57dd2de0344a648af8d53642786646.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2a57dd2de0344a648af8d53642786646.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a57dd2de0344a648af8d53642786646.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a57dd2de0344a648af8d53642786646.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a57dd2de0344a648af8d53642786646.png","size":""}]},{"name":"Charley Patton","url":"https://www.last.fm/music/Charley+Patton","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/21f37c12bdd54cb7958d620b87aae8b2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/21f37c12bdd54cb7958d620b87aae8b2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/21f37c12bdd54cb7958d620b87aae8b2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21f37c12bdd54cb7958d620b87aae8b2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21f37c12bdd54cb7958d620b87aae8b2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21f37c12bdd54cb7958d620b87aae8b2.png","size":""}]},{"name":"Blind Blake","url":"https://www.last.fm/music/Blind+Blake","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/667ccb5a52afc9963e8da1ee7615accf.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/667ccb5a52afc9963e8da1ee7615accf.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/667ccb5a52afc9963e8da1ee7615accf.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/667ccb5a52afc9963e8da1ee7615accf.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/667ccb5a52afc9963e8da1ee7615accf.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/667ccb5a52afc9963e8da1ee7615accf.png","size":""}]},{"name":"Blind Willie Johnson","url":"https://www.last.fm/music/Blind+Willie+Johnson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7f57ca086906457e9d06c6e0719f4bc3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7f57ca086906457e9d06c6e0719f4bc3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7f57ca086906457e9d06c6e0719f4bc3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f57ca086906457e9d06c6e0719f4bc3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f57ca086906457e9d06c6e0719f4bc3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f57ca086906457e9d06c6e0719f4bc3.png","size":""}]},{"name":"Bukka White","url":"https://www.last.fm/music/Bukka+White","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d5ea7971699b43c890d32126eee3ae27.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d5ea7971699b43c890d32126eee3ae27.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d5ea7971699b43c890d32126eee3ae27.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d5ea7971699b43c890d32126eee3ae27.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d5ea7971699b43c890d32126eee3ae27.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d5ea7971699b43c890d32126eee3ae27.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"delta blues","url":"https://www.last.fm/tag/delta+blues"},{"name":"country blues","url":"https://www.last.fm/tag/country+blues"},{"name":"Classic Blues","url":"https://www.last.fm/tag/Classic+Blues"},{"name":"folk","url":"https://www.last.fm/tag/folk"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Blind+Lemon+Jefferson/+wiki"}},"published":"04 May 2006, 21:36","summary":"Blind Lemon Jefferson (Lemon Henry Jefferson, Coutchman, Texas, October 26, 1894? – December 1929) was an influential blues singer and guitarist from Texas. He was one of the most popular blues singers of the 1920s.\n\n\nHis musical style was individualistic, and Jefferson's singing and self-accompaniment were distinctive as a result of his high-pitched voice and originality on the guitar. He has been titled \"Father of the Texas Blues.\"\nHe was not influential on some younger blues singers of his generation <a href=\"https://www.last.fm/music/Blind+Lemon+Jefferson\">Read more on Last.fm</a>","content":"Blind Lemon Jefferson (Lemon Henry Jefferson, Coutchman, Texas, October 26, 1894? – December 1929) was an influential blues singer and guitarist from Texas. He was one of the most popular blues singers of the 1920s.\n\n\nHis musical style was individualistic, and Jefferson's singing and self-accompaniment were distinctive as a result of his high-pitched voice and originality on the guitar. He has been titled \"Father of the Texas Blues.\"\nHe was not influential on some younger blues singers of his generation, as they did not seek to imitate him as they did other commercially successful artists. However, later blues and rock and roll musicians attempted to imitate both his songs and his musical style.\n\nJefferson was born blind near Coutchman, Texas in Freestone County, near present-day Wortham, Texas. Jefferson began playing the guitar in his early teens, and soon after he began performing at picnics and parties. He also became a street musician, playing in East Texas towns in front of barbershops and on corners. According to his cousin, Alec Jefferson, quoted in the notes for Blind Lemon Jefferson, Classic Sides:\"They was rough. Men was hustling women and selling bootleg and Lemon was singing for them all night... he'd start singing about eight and go on until four in the morning... mostly it would be just him sitting there and playing and singing all night.\" \n\nBy the early 1910s, Jefferson began traveling frequently to Dallas, where he met and played with fellow blues musician Leadbelly. In Dallas, Jefferson was one of the earliest and most prominent figures in the blues movement developing in Dallas' Deep Ellum area. Jefferson likely moved to Deep Ellum in a more permanent fashion by 1917, where he met Aaron Thibeaux Walker, also known as T-Bone Walker. Jefferson taught Walker the basics of blues guitar, in exchange for Walker's occasional services as a guide. Also, by the early 1920s, Jefferson was earning enough money for his musical performances to support a wife, and possibly a child. However, firm evidence for both his marriage and any offspring is unavailable.\n\n\nThe beginning of the recording career\nUnlike many artists who were \"discovered\" and recorded in their normal venues, in December 1925 or January 1926, he was taken to Chicago, Illinois, to record his first tracks. Uncharacteristically, Jefferson's first two recordings from this session were gospel songs (\"I Want to be like Jesus in my Heart\" and \"All I Want is that Pure Religion\"), released under the name Deacon L. J. Bates. This led to a second recording session in March 1926. His first releases under his own name, \"Booster Blues\" and \"Dry Southern Blues,\" were hits; this led to the release of the other two songs from that session, \"Got the Blues\" and \"Long Lonesome Blues,\" which became a runaway success, with sales in six figures. He recorded about 100 tracks between 1926 and 1929; 43 records were issued, all but one for Paramount Records. Unfortunately, Paramount Records' studio techniques and quality were infamously bad, and the resulting recordings sound no better than if they had been recorded in a hotel room. In fact, in May 1926, Paramount had Jefferson re-record his hits \"Got the Blues\" and \"Long Lonesome Blues\" in the superior facilities at Marsh Laboratories, and subsequent releases used that version. Both versions appear on compilation albums and may be compared.\n\n\nSuccess with Paramount Records\nIt was largely due to the popularity of artists such as Blind Lemon Jefferson and contemporaries such as Blind Blake and Ma Rainey that Paramount became the leading recording company for the blues in the 1920s. Jefferson's earnings reputedly enabled him to buy a car and employ chauffeurs (although there is debate over the reliability of this as well); he was given a Ford car \"worth over $700\" by Mayo Williams, Paramount's connection with the black community. This was a frequently seen compensation for recording rights in that market. Jefferson is known to have done an unusual amount of traveling for the time in the American South, which is reflected in the difficulty of pigeonholing his music into one regional category. He sticks to no musical conventions, varying his riffs and rhythm and singing complex and expressive lyrics in a manner exceptional at the time for a \"simple country blues singer.\" According to North Carolina musician Walter Davis, Jefferson played on the streets in Johnson City, Tennessee during the early 1920s at which time Davis and fellow entertainer Clarence Greene learned the art of blues guitar.\n\nJefferson was reputedly unhappy with his royalties (although Williams said that Jefferson had a bank account containing as much as $1500). In 1927, when Williams moved to OKeh Records, he took Jefferson with him, and OKeh quickly recorded and released Jefferson's \"Matchbox Blues\" backed with \"Black Snake Moan,\" which was to be his only OKeh recording, probably because of contractual obligations with Paramount. Jefferson's two songs released on Okeh have considerably better sound quality than on his Paramount records at the time. When he had returned to Paramount a few months later, \"Matchbox Blues\" had already become such a hit that Paramount re-recorded and released two new versions, under producer Arthur Laibly.\n\nIn 1927, Jefferson recorded another of his now classic songs, the haunting \"See That My Grave Is Kept Clean\" (once again using the pseudonym Deacon L. J. Bates) along with two other uncharacteristically spiritual songs, \"He Arose from the Dead\" and \"Where Shall I Be.\" Of the three, \"See That My Grave Is Kept Clean\" became such a big hit that it was re-recorded and re-released in 1928.\n\n\nStories\nAs his fame grew, so did the tales regarding his life, often personally involving the teller. T-Bone Walker states that as a boy, he was employed by Jefferson to lead him around the streets of Dallas; he would have been of the appropriate age at the time. A Paramount employee told biographer Orrin Keepnews that Jefferson was a womanizing sloppy drunk; on the other hand, Jefferson's neighbor in Chicago, Romeo Nelson, reports him as being \"warm and cordial,\" and singer Rube Lacy states that Jefferson always refused to play on a Sunday, \"even if you give me two hundred.\" He is claimed to have earned money wrestling before his musical success, which is further claimed as proof that he was not blind at the time (something of a non sequitur). Victoria Spivey elliptically credits Jefferson as someone who \"could sure feel his way around.\"\n\n\nDeath and grave\nJefferson died in Chicago in December 1929. The cause of death is unknown, and though rumors swirled that a jealous lover poisoned his coffee, a more likely scenario is that he died due to a heart attack after being disoriented during a snowstorm (another scenario is that he froze to death). The book \"Tolbert's Texas\" claims that he was killed while being robbed of a large royalty cash payment by a guide taking him to Union Station to catch a train home to Texas. Paramount Records paid for the return of his body to Texas by train, accompanied by pianist Will Ezell. Jefferson was buried at Wortham Negro Cemetery (now Wortham Black Cemetery). Far from his grave being kept clean, it was unmarked until 1967, when a Texas Historical Marker was erected in the general area of his plot, the precise location being unknown. By 1996, the cemetery and marker were in poor condition, but a new granite headstone was erected in 1997. In 2007 the cemetery's name was changed to Blind Lemon Memorial Cemetery and keeping his wishes his gravesite is being kept clean by a cemetery committee in Wortham Texas.\n\n\nMusical influence\nJefferson had an intricate and fast style of guitar playing and a particularly high-pitched voice. He was a founder of the Texas blues sound and an important influence on other blues singers and guitarists, including Lead Belly and Lightnin' Hopkins. The white North Carolina performer Arthel \"Doc\" Watson credited listening to Jefferson's recordings as his first exposure to the blues, which would powerfully influence his own style.\n\nHe was the author of many tunes covered by later musicians, including the classic \"See That My Grave Is Kept Clean.\" Another of his tunes, \"Matchbox Blues,\" was recorded more than 30 years later by the Beatles, albeit in a rockabilly version credited to Carl Perkins, who himself did not credit Jefferson on his 1955 recording. Given this influence, it is unfortunate that many of the details of his life remain shrouded in mystery, perhaps forever; even the only known picture of him, shown here, is heavily retouched, with a fake tie painted in by hand. However, at the time, \"race music\" and its white cousin, \"hillbilly music,\" were not considered to be worthy of consideration as art, rather as a low-cost product to be sold and soon forgotten.\n\nBlind Lemon Jefferson is the featured musician on a State of Texas license plate. \nB. B. King has always maintained that Jefferson was a huge influence on his singing and guitar playing. \n\nThe Rock and Roll Hall of Fame listed one song by Blind Lemon Jefferson of the 500 songs that shaped rock and roll: 1927 Matchbox Blues \n\nJefferson was among the inaugural class of blues musicians inducted into the Blues Hall of Fame.\n\nCovers of Blind Lemon Jefferson\nThe White Stripes's \"De Ballot of De Boll Weevil\" is a cover version of \"Boll Weevil Blues.\" \nBob Dylan's \"See That My Grave Is Kept Clean\" on Bob Dylan. \nThe Beatles's and Carl Perkins' \"Match Box\" was a cover version of \"Matchbox Blues.\" \nB. B. King's \"See That My Grave Is Kept Clean\" on One Kind Favor \n\nReferences to Blind Lemon Jefferson\nKing Solomon Hill recorded the song \"My Buddy Blind Papa Lemon\" as a tribute to Jefferson in 1932. \nVan Morrison refers to Jefferson in the song \"Cleaning Windows\" on the 1982 album Beautiful Vision. \nFrancis Cabrel refers to Jefferson in the song \"Cent Ans de Plus\" on the 1999 album Hors-Saison. \nGeoff Muldaur refers to Jefferson with the song \"Got To Find Blind Lemon\" on the album The Secret Handshake \nNick Cave and the Bad Seeds recorded the song \"Blind Lemon Jefferson\" on the album The Firstborn Is Dead. \nThe 2007 film Black Snake Moan refers to the title of Jefferson's song \"Black Snake Moan\" \nIn the 2003 movie Masked and Anonymous, Bobby Cupid (Luke Wilson) gives his friend Jack Fate (Bob Dylan) Blind Lemon's original guitar, on which he claims Matchbox Blues was first recorded. \nPatrick Sky parodied Jefferson as \"Blind Funk Earwax\" playing \"Child Molesting Blues\" on his 1973 album Songs That Made America Famous \nCheech and Chong parodied Jefferson as \"Blind Melon Chitlin'\" on their self-titled 1971 album Cheech and Chong (album), their 1985 album Get Out of My Room, and in a stage routine that can be seen in their 1983 movie Still Smokin'. \nA bar called Blind Lemon appears in the Philip K. Dick novel The Game-Players of Titan. \nAn episode of Sanford and Son titled \"The Blind Mellow Jelly Collection\" refers to Jefferson's name. \nMichael Martin Murphy refers to Jefferson in the song \"Rolling Hills' on his 1973 album Cosmic Cowboy Souvenir. \nLead Belly refers to Jefferson in his song \"My Friend Blind Lemon.\" \nOn VeggieTales, Larry tries to sing the blues with the help of Blind Lemon Lincoln. \nBlind Melon may be a reference to his name and/or style. \n <a href=\"https://www.last.fm/music/Blind+Lemon+Jefferson\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
