{"artist":{"name":"Blind Willie McTell","mbid":"81e02e29-e46a-49cb-bf13-d204cbe86daa","url":"https://www.last.fm/music/Blind+Willie+McTell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2a57dd2de0344a648af8d53642786646.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2a57dd2de0344a648af8d53642786646.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2a57dd2de0344a648af8d53642786646.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a57dd2de0344a648af8d53642786646.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a57dd2de0344a648af8d53642786646.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a57dd2de0344a648af8d53642786646.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"188843","playcount":"1411348"},"similar":{"artist":[{"name":"Blind Blake","url":"https://www.last.fm/music/Blind+Blake","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/667ccb5a52afc9963e8da1ee7615accf.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/667ccb5a52afc9963e8da1ee7615accf.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/667ccb5a52afc9963e8da1ee7615accf.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/667ccb5a52afc9963e8da1ee7615accf.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/667ccb5a52afc9963e8da1ee7615accf.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/667ccb5a52afc9963e8da1ee7615accf.png","size":""}]},{"name":"Blind Lemon Jefferson","url":"https://www.last.fm/music/Blind+Lemon+Jefferson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b00072bbce9e413abf210276905c28d4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b00072bbce9e413abf210276905c28d4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b00072bbce9e413abf210276905c28d4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b00072bbce9e413abf210276905c28d4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b00072bbce9e413abf210276905c28d4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b00072bbce9e413abf210276905c28d4.png","size":""}]},{"name":"Sleepy John Estes","url":"https://www.last.fm/music/Sleepy+John+Estes","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9bbaf0753827488fbfbfae0d8bddf604.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9bbaf0753827488fbfbfae0d8bddf604.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9bbaf0753827488fbfbfae0d8bddf604.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9bbaf0753827488fbfbfae0d8bddf604.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9bbaf0753827488fbfbfae0d8bddf604.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9bbaf0753827488fbfbfae0d8bddf604.png","size":""}]},{"name":"Charley Patton","url":"https://www.last.fm/music/Charley+Patton","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/21f37c12bdd54cb7958d620b87aae8b2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/21f37c12bdd54cb7958d620b87aae8b2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/21f37c12bdd54cb7958d620b87aae8b2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21f37c12bdd54cb7958d620b87aae8b2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21f37c12bdd54cb7958d620b87aae8b2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21f37c12bdd54cb7958d620b87aae8b2.png","size":""}]},{"name":"Blind Boy Fuller","url":"https://www.last.fm/music/Blind+Boy+Fuller","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5427cbed508f4a48ad90094c4ee62750.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5427cbed508f4a48ad90094c4ee62750.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5427cbed508f4a48ad90094c4ee62750.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5427cbed508f4a48ad90094c4ee62750.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5427cbed508f4a48ad90094c4ee62750.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5427cbed508f4a48ad90094c4ee62750.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"delta blues","url":"https://www.last.fm/tag/delta+blues"},{"name":"Classic Blues","url":"https://www.last.fm/tag/Classic+Blues"},{"name":"country blues","url":"https://www.last.fm/tag/country+blues"},{"name":"folk","url":"https://www.last.fm/tag/folk"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Blind+Willie+McTell/+wiki"}},"published":"01 Apr 2006, 08:58","summary":"Blind Willie McTell (born William Samuel McTier; May 5, 1898 – August 19, 1959) was a Piedmont and ragtime blues singer and guitarist. He played with a fluid, syncopated fingerstyle guitar technique, common among many exponents of Piedmont blues, although, unlike his contemporaries, he came to use twelve-string guitars exclusively. McTell was also an adept slide guitarist, unusual among ragtime bluesmen. His vocal style, a smooth and often laid-back tenor <a href=\"https://www.last.fm/music/Blind+Willie+McTell\">Read more on Last.fm</a>","content":"Blind Willie McTell (born William Samuel McTier; May 5, 1898 – August 19, 1959) was a Piedmont and ragtime blues singer and guitarist. He played with a fluid, syncopated fingerstyle guitar technique, common among many exponents of Piedmont blues, although, unlike his contemporaries, he came to use twelve-string guitars exclusively. McTell was also an adept slide guitarist, unusual among ragtime bluesmen. His vocal style, a smooth and often laid-back tenor, differed greatly from many of the harsher voice types employed by Delta bluesmen, such as Charley Patton. McTell embodied a variety of musical styles, including blues, ragtime, religious music and hokum.\n\nBorn in the town of Thomson, Georgia, McTell learned how to play guitar in his early teens. He soon became a street performer around several Georgia cities including Atlanta and Augusta, and first recorded in 1927 for Victor Records. Although he never produced a major hit record, McTell's recording career was prolific, recording for different labels under different names throughout the 1920s and 30s. In 1940, he was recorded by folklorist John A. Lomax and Ruby Terrill Lomax for the Library of Congress's folk song archive. He would remain active throughout the 1940s and 50s, playing on the streets of Atlanta, often with his longtime associate, Curley Weaver. Twice more he recorded professionally. McTell's last recordings originated during an impromptu session recorded by an Atlanta record store owner in 1956. McTell would die three years later after suffering for years from diabetes and alcoholism. Despite his mainly failed releases, McTell was one of the few archaic blues musicians that would actively play and record during the 1940s and 50s. However, McTell never lived to be \"rediscovered\" during the imminent American folk music revival, as many other bluesmen would.\n\nMcTell's influence extended over a wide variety of artists, including The Allman Brothers Band, who famously covered McTell's \"Statesboro Blues\", and Bob Dylan, who paid tribute to McTell in his 1983 song \"Blind Willie McTell\"; the refrain of which is, \"And I know no one can sing the blues, like Blind Willie McTell\". Other artists influenced by McTell include Taj Mahal, Alvin Youngblood Hart, Ralph McTell, Chris Smither and The White Stripes.\n\nBorn William Samuel McTier in Thomson, Georgia, blind in one eye, McTell had lost his remaining vision by late childhood. He attended schools for the blind in the states of Georgia, New York and Michigan and showed proficiency in music from an early age, first playing harmonica and accordion, learning to read and write music in Braille, and turning to the six-string guitar in his early teens. His family background was rich in music, both of his parents and an uncle played guitar; he is also a relation of bluesman and gospel pioneer Thomas A. Dorsey. His father left the family when McTell was still young, and, when his mother died in the 1920s, he left his hometown and became a wandering musician, or \"songster\". He began his recording career in 1927 for Victor Records in Atlanta.\n\nMcTell married Ruth Kate Williams, now better known as Kate McTell, in 1934. She accompanied him on stage and on several recordings before becoming a nurse in 1939. Most of their marriage from 1942 until his death was spent apart, with her living in Fort Gordon near Augusta and him working around Atlanta.\n\nIn the years before World War II, McTell traveled and performed widely, recording for a number of labels under many different names, including Blind Willie McTell (Victor and Decca), Blind Sammie (Columbia), Georgia Bill (Okeh), Hot Shot Willie (Victor), Blind Willie (Vocalion and Bluebird), Barrelhouse Sammie (Atlantic), and Pig & Whistle Red (Regal). The \"Pig 'n Whistle\" appellation was a reference to a chain of Atlanta barbecue restaurants, one of which was located on the south side of East Ponce de Leon between Boulevard and Moreland Avenue, which later became a Krispy Kreme. McTell would frequently played for tips in the parking lot of this location. He was also known to play behind the nearby building that later became Ray Lee's Blue Lantern Lounge. Like his fellow songster Lead Belly, who began his career as a street artist, McTell favored the somewhat unwieldy and unusual twelve-string guitar, whose greater volume made it suitable for outdoor playing.\n\nIn 1940 John A. Lomax and his wife, Ruby Terrill Lomax, Classics professor at the University of Texas at Austin, interviewed and recorded McTell for the Library of Congress's Folk Song Archive in a two-hour session held in their hotel room in Atlanta, Georgia. These recordings document McTell's distinctive musical style, which bridges the gap between the raw country blues of the early part of the 20th century and the more conventionally melodious, Ragtime-influenced East-Coast Piedmont blues sound. Mr. and Mrs. Lomax also elicited from the singer a number of traditional songs (such as \"The Boll Weevil\" and \"John Henry\") as well as spirituals (such as \"Amazing Grace\"), which were not part of his usual commercial repertoire. In the interview, John A. Lomax is heard asking if McTell knows any \"complaining\" songs (an earlier term for protest songs), to which the singer replies somewhat uncomfortably and evasively that he does not. The Library of Congress paid McTell $10, the equivalent of $154.56 in 2011, for this two-hour session. The material from this 1940 session was issued in 1960 in LP and later in CD form, under the somewhat misleading title of \"The Complete Library of Congress Recordings\", notwithstanding the fact that it was in fact truncated, in that it omitted some of John A. Lomax's interactions with the singer and cut out entirely the contributions of Ruby Terrill Lomax.\n\nPostwar, McTell recorded for Atlantic Records and Regal Records in 1949, but these recordings met with less commercial success than his previous works. He continued to perform around Atlanta, but his career was cut short by ill health, predominantly diabetes and alcoholism. In 1956, an Atlanta record store manager, Edward Rhodes, discovered McTell playing in the street for quarters and enticed him with a bottle of corn liquor into his store, where he captured a few final performances on a tape recorder. These were released posthumously on Prestige/Bluesville Records as Last Session. Beginning in 1957, McTell occupied himself as a preacher at Atlanta's Mt. Zion Baptist Church.\n\nMcTell died in Milledgeville, Georgia, of a stroke in 1959. He was buried at Jones Grove Church, near Thomson, Georgia, his birthplace. A fan paid to have a gravestone erected on his resting place. The name given on his gravestone is Eddie McTier. He was inducted into the Blues Foundation's Hall of Fame in 1981, and into the Georgia Music Hall of Fame in 1990.\n\nOne of McTell's most famous songs, \"Statesboro Blues,\" was frequently covered by The Allman Brothers Band and is considered one of their earliest signature songs. A short list of some of the artists who also perform it includes Taj Mahal, David Bromberg, The Devil Makes Three and Ralph McTell, who changed his name on account of liking the song. Ry Cooder covered McTell's \"Married Man's a Fool\" on his 1973 album, Paradise and Lunch.\n Jack White of The White Stripes considers McTell an influence, as their 2000 album De Stijl was dedicated to him and featured a cover of his song \"Southern Can Is Mine\". The White Stripes also covered McTell's \"Lord, Send Me an Angel\", releasing it as a single in 2000.\nIn 2013 Jack White's Third Man Records teamed up with Document Records to reissue The Complete Recorded Works in Chronological Order of Charley Patton, Blind Willie McTell and The Mississippi Sheiks.\n\nBob Dylan has paid tribute to McTell on at least four occasions: Firstly, in his 1965 song \"Highway 61 Revisited\", the second verse begins with \"Georgia Sam he had a bloody nose\", referring to one of Blind Willie McTell's many recording names; later in his song \"Blind Willie McTell\", recorded in 1983 but released in 1991 on The Bootleg Series Volumes 1-3; then with covers of McTell's \"Broke Down Engine\" and \"Delia\" on his 1993 album, World Gone Wrong; also, in his song \"Po' Boy\", on 2001's \"Love & Theft\", which contains the lyric, \"had to go to Florida dodging them Georgia laws\", which comes from McTell's \"Kill It Kid\".\nAlso, Bath-based band \"Kill It Kid\" is named after that song.\n\nA blues bar in Atlanta is named after McTell and regularly features blues musicians and bands. The Blind Willie McTell Blues Festival is held annually in Thomson, Georgia. <a href=\"https://www.last.fm/music/Blind+Willie+McTell\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
