{"artist":{"name":"Bob Margolin","mbid":"90e17526-597c-4d91-b47f-40a85be1860a","url":"https://www.last.fm/music/Bob+Margolin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/22ba51ae1bdf4cd59c90541fb33a2a92.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/22ba51ae1bdf4cd59c90541fb33a2a92.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/22ba51ae1bdf4cd59c90541fb33a2a92.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/22ba51ae1bdf4cd59c90541fb33a2a92.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/22ba51ae1bdf4cd59c90541fb33a2a92.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/22ba51ae1bdf4cd59c90541fb33a2a92.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"15219","playcount":"89482"},"similar":{"artist":[{"name":"Jimmy Thackery And The Drivers","url":"https://www.last.fm/music/Jimmy+Thackery+And+The+Drivers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ea96cc71395146d7974507faeb716460.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ea96cc71395146d7974507faeb716460.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ea96cc71395146d7974507faeb716460.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ea96cc71395146d7974507faeb716460.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ea96cc71395146d7974507faeb716460.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ea96cc71395146d7974507faeb716460.png","size":""}]},{"name":"Bill Perry","url":"https://www.last.fm/music/Bill+Perry","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ff0c9adf93d345fda6523626b02fdda3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ff0c9adf93d345fda6523626b02fdda3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ff0c9adf93d345fda6523626b02fdda3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ff0c9adf93d345fda6523626b02fdda3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ff0c9adf93d345fda6523626b02fdda3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ff0c9adf93d345fda6523626b02fdda3.png","size":""}]},{"name":"Joanna Connor","url":"https://www.last.fm/music/Joanna+Connor","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d7f2dbad081441a9a5a9b81b1b316f9f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d7f2dbad081441a9a5a9b81b1b316f9f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d7f2dbad081441a9a5a9b81b1b316f9f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d7f2dbad081441a9a5a9b81b1b316f9f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d7f2dbad081441a9a5a9b81b1b316f9f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d7f2dbad081441a9a5a9b81b1b316f9f.png","size":""}]},{"name":"Corey Stevens","url":"https://www.last.fm/music/Corey+Stevens","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/921f0092573b49f8801474a88357b2cc.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/921f0092573b49f8801474a88357b2cc.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/921f0092573b49f8801474a88357b2cc.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/921f0092573b49f8801474a88357b2cc.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/921f0092573b49f8801474a88357b2cc.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/921f0092573b49f8801474a88357b2cc.png","size":""}]},{"name":"Craig Erickson","url":"https://www.last.fm/music/Craig+Erickson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6c4eb9709bfa46b4aff740b22a3ce7fc.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6c4eb9709bfa46b4aff740b22a3ce7fc.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6c4eb9709bfa46b4aff740b22a3ce7fc.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c4eb9709bfa46b4aff740b22a3ce7fc.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c4eb9709bfa46b4aff740b22a3ce7fc.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c4eb9709bfa46b4aff740b22a3ce7fc.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"blues rock","url":"https://www.last.fm/tag/blues+rock"},{"name":"Chicago Blues","url":"https://www.last.fm/tag/Chicago+Blues"},{"name":"guitar","url":"https://www.last.fm/tag/guitar"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Bob+Margolin/+wiki"}},"published":"13 Feb 2007, 10:37","summary":"\"Steady Rollin'\" Bob Margolin (born May 9, 1949 Brookline, Massachusetts) is an American blues guitarist and vocalist.\n\nMargolin played with Muddy Waters for several years, and is now touring with some of the musicians from the old Muddy Waters Band. He's also a senior writer for Blues Revue Magazine.\n\nBob Margolin's website is http://www.bobmargolin.com/. He maintains a MySpace page with current touring information at www.myspace.com/bobmargolin <a href=\"https://www.last.fm/music/Bob+Margolin\">Read more on Last.fm</a>","content":"\"Steady Rollin'\" Bob Margolin (born May 9, 1949 Brookline, Massachusetts) is an American blues guitarist and vocalist.\n\nMargolin played with Muddy Waters for several years, and is now touring with some of the musicians from the old Muddy Waters Band. He's also a senior writer for Blues Revue Magazine.\n\nBob Margolin's website is http://www.bobmargolin.com/. He maintains a MySpace page with current touring information at www.myspace.com/bobmargolin\n\nI was born in Boston in 1949 and was brought up in nearby Brookline, Massachusetts. Inspired by Chuck Berry, I started to play guitar in 1964 and began playing in Rock bands right away.\n\nI soon followed the path of Chuck Berry’s inspiration back to the Blues. I was especially taken by the music of Muddy Waters and listened to as much of it as I could find. I worked in Blues or Blues-Rock bands in the Boston area, including with Luther “Georgia Boy” “Snake” Johnson, and The Boston Blues Band.\n\nIn August, 1973, I went to see Muddy at Paul’s Mall in Boston. He had seen me in opening bands and had been very encouraging to me because I was trying to play his style of “Old School” (Muddy’s term) Chicago Blues. He had just lost long-time guitarist Sammy Lawhorn and he hired me to play in his band. While most musicians in modern times learn from listening to recordings, Muddy put me on his right side on the bandstand so I could watch him play guitar. I sure appreciated that opportunity while it was happening, and tried to use it to learn to give Muddy what he wanted on the bandstand, and for myself.\n\nMuddy’s band toured the world and jammed with many great Blues and Rock musicians, but the biggest thrill was playing Muddy’s blues with him. He brought me with him to special shows and recordings too, when sometimes he didn’t use his whole band, to give him a familiar sound when he worked with other musicians: In 1975, we recorded Grammy® Award-winning Muddy Waters Woodstock Album, his last with Chess Records, featuring Paul Butterfield, and Levon Helm and Garth Hudson from The Band.\n\nThroughout the last half of the ‘70s, when I had time off from Muddy’s band, I would add on to Washington D.C.’s The Nighthawks and The Charlottesville Blues All-Stars, playing Blues and Rock ‘n’ Roll and making life-long friends.\n\nIn ‘76, Muddy brought me with him to San Francisco to perform at The Band’s The Last Waltz concert. Martin Scorcese filmed the concert for the movie of the same name. As it happened, only one camera was operating during our performance, zooming in or out, and since I was standing right next to Muddy, I was in every shot while he sang a powerful “Mannish Boy.” Now, when the movie is shown on TV, everyone I speak to tells me, “I saw you on TV!” for a few days. Then they tell me I looked scared, happy, mad, excited, or bored, or however they would have felt in my place. I also played on the four albums that Muddy recorded for Blue Sky Records, which were produced by Johnny Winter, and with Johnny on his Nothin’ But The Blues album. Three of those albums won Grammy® Awards.\n\nIn 1980, Muddy’s band left him over business problems, though we all remained personal friends with him until his death in 1983. It is sometimes presumed that I worked with Pinetop Perkins, Jerry Portnoy, Calvin “Fuzz” Jones, and Willie “Big Eyes” Smith in The Legendary Blues Band, which they formed, but actually Luther “Guitar Jr.” Johnson and I each started our own bands at that time. I was living in Washington, DC then and in 1985 moved to Blacksburg, Virginia, a beautiful college town in the mountains. All through the ‘80s I ran up and down the highways, mostly in Virginia and North Carolina (to where I moved in ‘89) and played Blues in bars for soulful folks having fun. I was able to make a living without the pressures of the music business, and didn’t even feel any need to make an album -- I was playing most nights, and with total musical freedom and no commercial considerations. Sometimes I’d make a live recording of my band off the mixing board, and make up cassette copies for my friends.\n\nIn ’82 and ‘83, I did some gigs with my neighbor in Springfield, Virginia, Rocakbilly musician Tex Rubinowitz, who taught me the language of that music. We did a show backing original Rockabilly legend Charlie Feathers, and worked with fine players like Danny Gatton and Evan Johns.\n\nOccasionally, I would do a “high-profile” gig, based on my Muddy Waters connection. In ‘84, at the New Orleans Jazz and Heritage Festival, we did a tribute to Muddy where Pinetop and I added on to The Fabulous Thunderbirds, with Etta James singing, and Taj Mahal and James Cotton opening. With my band, I opened shows for Stevie Vaughan, George Thorogood, Johnny Winter, and The T-Birds.\n\nThese years of playing many styles of Blues, as well as some Rock ‘n’ Roll, Rockabilly, Funk, and favorite oldies were important to my musical development, just as my Chicago Blues experience was. And beyond the music, being at home onstage, improvising on the moment, and treating the audience like friends in all kinds of performing situations helps me break down the barriers that are often found between musician and audience. We all have a better time than if I was playing a show AT them. Though I can’t mark my progress in the ‘80s by recordings, folks who were at my shows then come out now and let me know how much they enjoyed my band in places like Desperado’s in D.C., The Nightshade Cafe in Greensboro, North Carolina, or The South Main Cafe in Blacksburg, Virginia. Those clubs, and many more like them, are gone now. I worked with some wonderful musicians over hundreds of gigs in the ‘80s – Jeff Lodsun, Clark Matthews, Steve “Slash” Hunt, Rev. Billy Wirtz, Doug Jay, Terry Benton, Jeff Sarli, Tom Principato, Steve Wolf, Steve Jacobs, Rick Serfas, Big Joe Maher, John Mooney, Ben Sandmel, Dave Besley, Matt Abts, David Nelson, Mike Avery, Billy Mather, Nappy Brown, Fats Jackson, Sweet Betty and many more.\n\nBy the end of the ‘80s, it didn’t take a psychic to see that the Blues Scene was going to change a lot in the ‘90s. People were not going out to clubs as much for their entertainment but there were many new Blues bands emerging, all wanting to work. I realized that in order to continue making a living playing Blues, I would have to record and get back out on the world-wide Blues Scene and tour more widely.\n\nIn 1989 I recorded my first solo album The Old School for Powerhouse Records, which is owned by Tom Principato, a Washington D.C. guitar wizard who started the label to release his own albums and those of his friends. The Old School features Mark Wenner, harp player for The Nighthawks, Big Joe Maher on drums, and Jeff Sarli on bass.\n\nI began 1990 doing a 10-week cross-country tour playing guitar with James Cotton, who was taking a break from his high-energy Blues-boogie to feature more traditional Chicago Blues. A big highlight of that tour for me was getting to work with and learn from the late Luther Tucker, a great Blues guitar player who had worked with Little Walter, Sonny Boy Williamson, Robert Lockwood Jr., and of course, Cotton.\n\nMy second album for Powerhouse, Chicago Blues, released in ‘91, features songs from three different recording sessions. One had Chicago Blues legend Jimmy Rogers on guitar and harp master Kim Wilson, with Willie “Big Eyes” Smith on drums. I did a few songs with Willie on drums, along with Pinetop Perkins and Calvin “Fuzz” Jones, all from Muddy’s band, and Kaz Kazanoff on sax and harp and co-producing. I also did some with my band at the time, Mookie Brill on bass and harp, and Clark Matthews on drums.\n\nAlso in the early ‘90s, I began a second career as a music magazine writer. Local friends from the Piedmont Blues Preservation Society in North Carolina asked me to write a story for their newsletter about Chicago harp legend Carey Bell, a friend of mine who was coming to town for a concert. Soon, I began to write stories and Blues album reviews for a local entertainment weekly, ESP. After doing that in ’91 and ’92, I was interviewed for the new Blues Revue Quarterly magazine. It occured to me that my local Blues writing might be even more at home in this growing Blues magazine, and I contacted founder/publisher/editor Bob Vorel and submitted some of my stories. Since then, I have been a regular contributor, writing articles from my personal experience, profiles of musicians I know, and some Blues Fiction stories.\n\nIn August, ‘92 I began working on my third solo album in my hometown of Boston with help from friend and guitar star Ronnie Earl, and his band. Kaz was co-producing again, and I did some additional songs with my own band back in North Carolina. I also did a couple of songs with just my acoustic guitar and the vocals of legendary R&B singer Nappy Brown, whom I worked with occasionally. Another special guest was Chicago Blues legend John Brim, with whom I’d cut a Handy Award-nominated album for Tone-Cool Records, Tough Times, in ‘92.\n\nI sent a rough tape to Bruce Iglauer, president of Alligator Records, the premier independent Blues record label. Bruce was not ready to pick up my album, but he made some very constructive suggestions about performance and mix. I appreciated the benefit of Bruce’s perspective and experience and reworked the songs and re-submitted them. Finally, in July ‘93, Bruce committed to finishing the album with me and releasing it on Alligator. The album is called Down In The Alley.\n\nThis was certainly the biggest “break” I’d had in music since Muddy took me into his band 20 years before, for Alligator is without peer for promoting their artists. At the same time, I signed with Piedmont Talent, a fine Blues booking agency based in Charlotte, North Carolina. Down In The Alley and Piedmont’s strong booking took me all over the world and helped me re-connect with the Blues audience that hadn’t seen much of me in years. At the end of ‘93, I did a gig at B.B. King’s club in Memphis with Billy Boy Arnold, a Chicago Blues harp legend who also had a new release on Alligator. Our success together led to a lot of bookings over the next few years with Billy Boy and my band, and we backed him on his next Alligator album, Eldorado Cadillac.\n\n1994 found me touring hard and playing at many of the major Blues festivals during the Summer season. In August and September, The Muddy Waters Tribute Band, the musicians who were in Muddy’s band when I was, went on a national tour with B.B. King, Dr. John, and Little Feat. In December of that year, we cut an album featuring ourselves and special guests from the Rock and Blues worlds, You Gonna Miss Me, a Tribute to Muddy Waters on Telarc Records. That recording was nominated for a Grammy® Award in ‘96.\n\nAlso at the end of ‘94, I recorded my second album for Alligator, My Blues and My Guitar which featured special guest Chicago Blues harp legend Snooky Pryor, Kaz Kazanoff playing harp, horn, arranging for a horn section, and co-producing again, percussionist Jim Brock, and my band at the time, Chuck Cotton on drums and Steve “Slash” Hunt on bass. My Blues and My Guitar was released in ‘95 and I was nominated for a W.C. Handy Award in the guitar category in ‘96.\n\n‘95 and ‘96 found me touring constantly, doing clubs, concerts, festivals, and overseas tours with my band, sometimes with Billy Boy Arnold or the Muddy Waters Tribute Band. At the end of ‘96 I toured again with James Cotton, this time in a trio with David Maxwell, an old friend from Boston who is one of the world’s greatest Blues piano players, and is featured on all of my Alligator albums.\n\nMy third album for Alligator, Up & In, was released in March, ‘97. I tried to play some deep Blues, but the song that got the most attention, and airplay on Blues radio, was “Blues for Bartenders.” This song is a string of “this guy walks into a bar...” jokes set to a Blues shuffle.\n\nWhile I was making Up & In, I went out to dinner with Alligator Records president Bruce Iglauer and Piedmont Talent presidents Steve Hecht, and we were trying to think of a special way to promote the album. Bruce suggested that since Pinetop Perkins was a special guest on the album, that we book lot of shows with Pinetop added onto the band. Great idea. It has been my honor to work often with Pinetop since then.\n\nI introduce Pinetop Perkins at our shows together this way, and it should work for you now if you don’t know about him: “Ladies and Gentlemen, it’s Star Time. Please welcome a young man who worked with the original King Biscuit Boys in Helena, Arkansas. He played with great slide guitar players Robert Nighthawk and Earl Hooker, and spent twelve years in Muddy Waters’ band. On his own, he is a living legend of the blues piano and has won 10 W.C. Handy Awards, and was nominated for a Grammy this year...” – and since I originally wrote this for my website, Pinetop’s had more W.C. Handy Awards, Grammy® nominations, and a Grammy® Lifetime Achievement Award too.\n\nPinetop was born in 1913, two years before Muddy Waters. When we played in Muddy’s band together, I stood onstage between Pine and Mud, and those times are the deepest Blues music I will ever experience. Though many of my shows are still done with just me and my band, the many times in the last few years that Pine has been our featured guest are a pure pleasure for me. We try to back him up gracefully and to inspire him to play his best, deep Blue and good fun. Pinetop is getting the recognition he deserves now -- when I introduce him as above, fans rush the stage like he was Elvis.\n\nAlso in ’97, I scripted and was featured in an instuctional video, Muddy Waters’ Guitar Style, for Starlicks Video produced by Dave Rubin and distributed by Hal Leonard Corp. Originally on VHS tape, this video is now widely available on DVD. It gives up what I know about Muddy’s guitar playing for the Blues guitar player. It continues to sell strongly, according to the checks in my mailbox.\n\nEight times between ’95-’05, I played at the Handy Award shows in Memphis, usually leading an all-star band and performing with such fine musicians as Scotty Moore, Joe Louis Walker, Shemekia Copeland, Marcia Ball, Tracy Nelson, Reba Russell, Kim Wilson, Snooky Pryor, Charlie Musselwhite, Chris Layton, Pinetop, Rod Piazza, Dr. John, Ronnie Earl, Duke Robillard, Willie Kent, Willie “Big Eyes” Smith, Calvin “Fuzz” Jones, and bass players Mookie Brill and Tad Walters, who were in my band at the time.\n\nIn ’97, I appeared on a Kennedy Center Tribute to Muddy Waters, which featured Buddy Guy, Koko Taylor, John Hiatt, G.E. Smith, Peter Wolf, Nick Gravenites, Keb’ Mo’, Big Bill Morganfield, Robert Lockwood, Jr., Charlie Musselwhite, Barry Goldberg, and Johnnie Johnson. A DVD, A Tribute to Muddy Waters, King of the Blues, of that show was released the next year.\n\nIn ’98, I was approached by Blind Pig Records to produce a debut album for Muddy’ son, Big Bill Morganfield. Rising Son won a W.C. Handy Award for Bill, “Best New Artist” in 2000. I was having artistic differences with Alligator Records and left them on friendly terms to make Hold Me To It for Blind Pig Records, released in June ’99. I made the album I wanted to with Blind Pig, and Big Bill Morganfield and I were co-billed on a number of shows in ’99 and 2000 which featured my band backing us.\n\nDuring that time, Bill and I also played some shows which featured Pinetop Perkins. This revue was called “The Rolling Fork Revue,” a joke that musician/comedian Rev. Billy Wirtz made to our booking agents, referring to Muddy Waters’ birthplace and our traditional Blues. I still think it’s strange that the name stuck – I’ve still never even been to Rolling Fork, Mississippi, and I don’t pretend to be an old African-American Bluesman, and most people who hear the name don’t understand the obscure reference to Blues history. The “Rolling Fork Revue” name is retired now, but the idea of old-fashioned revues featuring well-known players is a good one and lives on...\n\nAs The Blues World grows tighter in the New Millenium, I’ve been putting together revues with my legendary Chicago Blues friends. In the Fall of 2002, I produced a recording of The Bob Margolin All-Star Blues Jam which features Pinetop, Carey Bell, Hubert Sumlin, Jimmy D. Lane, and my bass/harp/singer Mookie Brill. This album was released on May 27, 2003 on Telarc Records. In 2004, it brought me two W.C. Handy Award nominations: one for “Blues Band of the Year” and the other for “Traditional Blues Album.” It was recorded at Blue Heaven Studio in Salina, Kansas, known for it’s majestic acoustics and the audiophile dedication of owner/promoter Chad Kassem. It shows off the consummate engineering skills of Mark Williams, who has worked on all of my albums since ’93, and has taught me patiently about the process of recording music.\n\nAt the end of 2003, booking agent Hugh Southard left Piedmont Talent to start his own booking agency, Blue Mountain Artists. Believing in Hugh and how he operates in business and friendship, I jumped over to Blue Mountain and have enjoyed the progress that they’ve made booking me on my own, with The Bob Margolin All-Star Blues Jam, and starting in 2005 with Legends of Chicago Blues. This gang features a customizable line-up of with Willie “Big Eyes” Smith on drums and harp, a choice of harp players James Cotton, Carey Bell, or Jerry Portnoy, guitar genius Hubert Sumlin, piano players Pinetop or David Maxwell, and a choice of Calvin “Fuzz” Jones, Bob Stroger, or Mookie Brill.\n\nI am also producing and consulting on re-issues of Muddy Waters’ recordings for the Blue Sky Label for Sony/Legacy. I played guitar on these recordings and it’s an honor to make them sound as good as we can, present unreleased recordings for the first time, and write liner notes that reveal the story of the recordings from the inside. The first was released in September, 2003 -- the Muddy “Mississippi” Waters Live Legacy Edition. It was remixed, remastered, and featured a new CD of a performance of Muddy and in his band in a small club. In 2004, it won the W.C. Handy Award Best Historical Recording. In May, 2004, the other three albums I did with Muddy for Blue Sky Records were reissued: Hard Again, I’m Ready, and King Bee. Each album features out-takes from the original sessions. The albums were remastered but not remixed, and I wrote new liner notes for each of them. King Bee and I’m Ready were nominated for Handy Awards for Best Historical Recording in 2005. I was particularly surprised and thrilled to win the Handy Award for Guitar in 2005. I will take it as an inspiration to honor all Blues guitar players.\n\nIn early 2004, Blues Revue magazine was sold by founder/publisher Bob Vorel to Visionation, which publishes the online Blues magazine Blueswax (Blueswax.com). The print and the online magazine exist independently and now I write articles for both regularly.\n\nIn 2005, I was honored to receive a W.C. Handy Award for Best Instrumentalist, Guitar. I took it as an inspiration to honor all Blues guitar players. I continued to tour worldwide, both with my North Carolina band and in revues which featured Chicago Blues Legends like Hubert Sumlin, James Cotton, Carey Bell, Pinetop Perkins, and Willie “Big Eyes” Smith. 2006 brought more of the same, including tours in Finland, Poland, and the Czech Republic.\n\nIn January of 2007, I released In North Carolina, a CD that I crafted at home, alone. It is a solo album in that nobody else played a note on it, but there are songs where I overdubbed more than one guitar part, and I played electric bass and snare drum on some. I wanted to play the music that was in my heart, beyond the music I make onstage and in recording studios, and take my time recording it,. To release the album, I formed my own record label Steady Rollin’ Records, with partners Chip Eagle (publisher of Blues Revue and BluesWax) and Richard “Rosy” Rosenblatt (former President of Tone Cool Records, a great harp player, and an old Boston Blues Scene friend).\n\nWe soon realized that we could provide the same label services for other Blues musicians with independent labels. We formed the VizzTone Label Group. As of the beginning of 2010, we have 23 releases. VizzTone makes sense in today’s world where the twentieth-century business model of marketing recordings is long gone. It’s a win-win-win situation for VizzTone, the artists, and music lovers.\n\nIn January of 2007, as my own new CD was being released, I was in California producing and playing on Candye Kane’s Guitar’d & Feathered CD for Ruf Records. In February I produced Breakin’ It Up, Breakin’ It Down for Sony/Legacy. This live album is from concert tapes of a 1977 tour featuring Muddy Waters, Johnny Winter, and James Cotton after the release of the legendary Hard Again album. I played in the original concerts, chose the songs for the CD, worked on the sound of the recordings with master engineer Mark Williams, and wrote the liner notes for it. The album won a Blues Music Award in 2008 as Best Historical Recording.\n\nIn 2008, I continued non-stop touring, but also co-produced and played on Gaye Adegbalola’s Gaye Without Shame and Big Bill Morganfield’s Born Lover. Both were released through the VizzTone Label Group. I also won another Blues Music Award for Guitar. In 2009, I produced and played on Mac Arnold’s Country Man and it was released on VizzTone. In October, 2009, I toured in Argentina and Chile with Willie “Big Eyes” Smith and Bob Stroger.\n\nFor 2010, I’m hoping to finish and release a new CD, Steady Rollin’ Live with performances of my North Carolina band, Matt Hill and Chuck Cotton, plus some from the Chicago Blues legends I still work with, Hubert Sumlin, Bob Stroger, and Willie “Big Eyes” Smith.\n\nAll the music I’ve listened to and played, all the experience onstage, and all of the fine musicians I’ve worked with have left their mark on me, and are obvious when I play now. On the bandstand, I play what feels right at the moment, whether it’s featuring my original songs, telling stories, joking and talking with he audience, or just playing for the dancers. I like to be “professional” in terms of responsibility and competence, but past that, I am a musician playing for my friends.\n\nThank you for checking me out and getting to know me, but you can get much closer to who I am by listening to my music. I hope this background makes that more interesting for you.\n <a href=\"https://www.last.fm/music/Bob+Margolin\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
