{"artist":{"name":"Bobbie Gentry","mbid":"a5106366-6368-4a02-a580-73a3c02abb2f","url":"https://www.last.fm/music/Bobbie+Gentry","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2a19e8c6ccbc444c8fe59b1ec5ac2df9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2a19e8c6ccbc444c8fe59b1ec5ac2df9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2a19e8c6ccbc444c8fe59b1ec5ac2df9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a19e8c6ccbc444c8fe59b1ec5ac2df9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a19e8c6ccbc444c8fe59b1ec5ac2df9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a19e8c6ccbc444c8fe59b1ec5ac2df9.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"143694","playcount":"777036"},"similar":{"artist":[{"name":"Tammy Wynette","url":"https://www.last.fm/music/Tammy+Wynette","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":""}]},{"name":"Glen Campbell","url":"https://www.last.fm/music/Glen+Campbell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/62db890bb24a41daaad82e05d873fa28.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/62db890bb24a41daaad82e05d873fa28.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/62db890bb24a41daaad82e05d873fa28.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/62db890bb24a41daaad82e05d873fa28.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/62db890bb24a41daaad82e05d873fa28.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/62db890bb24a41daaad82e05d873fa28.png","size":""}]},{"name":"Lee Hazlewood","url":"https://www.last.fm/music/Lee+Hazlewood","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fe02e7275ccb4235a84a44497be71673.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fe02e7275ccb4235a84a44497be71673.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fe02e7275ccb4235a84a44497be71673.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe02e7275ccb4235a84a44497be71673.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe02e7275ccb4235a84a44497be71673.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fe02e7275ccb4235a84a44497be71673.png","size":""}]},{"name":"Charlie Rich","url":"https://www.last.fm/music/Charlie+Rich","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/049fee4e0916415eaf683c2ddfd3f2fd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/049fee4e0916415eaf683c2ddfd3f2fd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/049fee4e0916415eaf683c2ddfd3f2fd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/049fee4e0916415eaf683c2ddfd3f2fd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/049fee4e0916415eaf683c2ddfd3f2fd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/049fee4e0916415eaf683c2ddfd3f2fd.png","size":""}]},{"name":"Jackie DeShannon","url":"https://www.last.fm/music/Jackie+DeShannon","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/10693ddde6dc4120b35a91ecea16353e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/10693ddde6dc4120b35a91ecea16353e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/10693ddde6dc4120b35a91ecea16353e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/10693ddde6dc4120b35a91ecea16353e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/10693ddde6dc4120b35a91ecea16353e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/10693ddde6dc4120b35a91ecea16353e.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"60s","url":"https://www.last.fm/tag/60s"},{"name":"soul","url":"https://www.last.fm/tag/soul"},{"name":"70s","url":"https://www.last.fm/tag/70s"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Bobbie+Gentry/+wiki"}},"published":"15 Apr 2006, 16:28","summary":"Bobbie Gentry (born July 27, 1944) is an American singer-songwriter. She was born Roberta Lee Streeter to Portuguese parents in Chickasaw County, Mississippi. She shot to international fame in the summer of 1967 with the quirky and intriguing Ode to Billie Joe, written by Gentry and sung in her warm, captivating style. \"Ode\" was listed as the most popular single of the year in many U.S. record surveys and was admired by Frank Sinatra and other singers. <a href=\"https://www.last.fm/music/Bobbie+Gentry\">Read more on Last.fm</a>","content":"Bobbie Gentry (born July 27, 1944) is an American singer-songwriter. She was born Roberta Lee Streeter to Portuguese parents in Chickasaw County, Mississippi. She shot to international fame in the summer of 1967 with the quirky and intriguing Ode to Billie Joe, written by Gentry and sung in her warm, captivating style. \"Ode\" was listed as the most popular single of the year in many U.S. record surveys and was admired by Frank Sinatra and other singers.\n\nEarly years\n\nGentry spent her childhood living with her father in Greenwood, Mississippi, where she attended elementary school and began teaching herself to play the guitar, the bass guitar, and the banjo. In her early teens, she moved to Palm Springs, California, to live with her mother, Ruby Bullington Streeter, graduating from Palm Springs High School in 1962. It was during this time that the teenage Roberta settled on the stage name \"Bobbie Gentry,\" and began performing at local country clubs, encouraged by no less a Palm Springs celebrity than Bob Hope.\n\nAfter a short career as a Las Vegas showgirl, Gentry moved to Los Angeles, attended UCLA (where she was a philosophy major) and worked clerical jobs while occasionally performing in local nightclubs. She later transferred to the Los Angeles Conservatory of Music to hone her composition and performing skills.\n\nRise to fame\n\nIn 1967, Gentry recorded a demo and submitted it to Capitol Records executive Kelly Gordon, who quickly signed her to a recording contract and produced her first album. A 45 rpm \"single\" of two of her songs—\"Mississippi Delta\" and \"Ode to Billie Joe\"—was the first issue from this first effort, and even though \"Mississippi Delta\" was chosen for the \"A\" side, radio stations were quickly enamored with the quirky tale of Billie Joe McAllister and the mystery of his fate, as hauntingly performed and recorded on the \"B\" side. Bobbie Gentry had a monster hit on her hands, and Capitol Records had its newest superstar. Gentry went on to win three Grammy Awards that year, including \"Best Vocal Performance by a Female\", and \"Best New Artist.\"\n\nGentry's follow-up albums, The Delta Sweete and Local Gentry, both produced by Gordon, were issued in 1968. Though critically acclaimed, neither album garnered the kinds of sales figures that were realized with Gentry's debut effort. The year 1968 also saw the release of an album of duets that paired Gentry with fellow Capitol alumnus Glen Campbell. Gentry and Campbell's harmonies resulted in a gold record and three hit singles, including a cover of the Everly Brothers hit \"All I Have to Do Is Dream\", which rose to No. 6 on the country charts in the winter of 1969.\n\nGentry toured briefly with Campbell and performed on a number of U.S. television programs and specials in the late 1960s. Her other notable singles include Doug Kershaw's composition \"Louisiana Man\" as well as a mellow version of a Burt Bacharach-Hal David song, \"I'll Never Fall in Love Again\". The latter went to No. 1 in Great Britain in 1970, a year after Dionne Warwick had a hit with it in the United States. 1970 also saw the release of another U.S. hit with the self-penned \"Fancy,\" which rose to No. 26 on the Country chart and 31 on the Pop chart. (This enduring tale would later be covered with major success by Reba McEntire in 1991.)\n\nGentry would go on to record three more albums, while having earlier albums reissued under different titles. These last three albums, Touch 'Em with Love, Fancy, and the ambitious and highly regarded Patchwork, which consisted of all original material, were greeted enthusiastically by critics but, with the exception of the aforementioned title track to Fancy, failed to resonate with the public (though Gentry did generate a significant fan base in the United Kingdom).\n\nUndaunted by declining record sales, Gentry sought other outlets for her creativity. She continued to write and perform, touring Europe and headlining a Las Vegas review in which she produced, choreographed, and wrote and arranged the music. In 1974, Gentry hosted a short-lived summer replacement variety show, The Bobbie Gentry Happiness Hour on CBS. The show, which served as her own version of Campbell's hit series The Glen Campbell Goodtime Hour, also on CBS, was not picked up for a full season. That same year, Gentry wrote and performed \"Another Place, Another Time\" for writer-director (and Beverly Hillbillies actor) Max Baer, Jr.'s film, Macon County Line. Baer would go on to direct a feature film take on Ode To Billy Joe, starring Robbie Benson, in which the mystery of Billie Joe's suicide is revealed as a part of the conflict between his love for Bobbie Lee Hartley and his emerging homosexuality.\n\nBy the middle 1970s, Gentry's sellability had waned significantly, and Capitol did not renew her contract. After some behind-the-scenes work in television production failed to hold her interests, Gentry decided to retire from show business. Her last public appearance as a performer was on Christmas night 1978, as a guest on The Tonight Show with Johnny Carson. She has deliberately remained out of the limelight ever since.\n\nPersonal life\n\nShe was married twice. The first, to casino magnate William F. Harrah in 1969, when she was 25 and he was 58, lasted only three months, a victim of her fame. The second, to novelty singer-songwriter Jim Stafford, ended in 1979, after only eleven months of marriage and the birth of a son, Tyler. The details of Gentry's personal life after her retirement are little known, but it is generally believed that she has settled into a happy life, and enjoys being a private citizen, unhindered by the scrutiny that fame brings. As of January 2003, she was living in Los Angeles County, California. <a href=\"https://www.last.fm/music/Bobbie+Gentry\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
