{"artist":{"name":"Bobby Bland","mbid":"66ebc271-6a26-4fe7-848b-f217da119d92","url":"https://www.last.fm/music/+noredirect/Bobby+Bland","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/42854545e80d412fb5417abebf3d0db8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/42854545e80d412fb5417abebf3d0db8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/42854545e80d412fb5417abebf3d0db8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/42854545e80d412fb5417abebf3d0db8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/42854545e80d412fb5417abebf3d0db8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/42854545e80d412fb5417abebf3d0db8.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"0","playcount":"0"},"similar":{"artist":[]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"soul","url":"https://www.last.fm/tag/soul"},{"name":"rhythm and blues","url":"https://www.last.fm/tag/rhythm+and+blues"},{"name":"70s","url":"https://www.last.fm/tag/70s"},{"name":"soul-blues","url":"https://www.last.fm/tag/soul-blues"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/Bobby+Bland/+wiki"}},"published":"17 Sep 2007, 13:42","summary":"Bobby Bland (known also as Bobby \"Blue\" Bland) was born 27 January 1930, in the small town of Rosemark, Tennessee, USA. Later moving to Memphis with his mother, Bland started singing with local gospel groups there, including amongst others the Miniatures. Eager to expand his interests, he began frequenting the city's infamous Beale Street where he became associated with an ad hoc circle of aspiring musicians named, not unnaturally, the Beale Streeters.[5] <a href=\"https://www.last.fm/music/+noredirect/Bobby+Bland\">Read more on Last.fm</a>","content":"Bobby Bland (known also as Bobby \"Blue\" Bland) was born 27 January 1930, in the small town of Rosemark, Tennessee, USA. Later moving to Memphis with his mother, Bland started singing with local gospel groups there, including amongst others the Miniatures. Eager to expand his interests, he began frequenting the city's infamous Beale Street where he became associated with an ad hoc circle of aspiring musicians named, not unnaturally, the Beale Streeters.[5]\n\nBobby's recordings from the early 1950's show him striving for individuality, but any progress was halted by a spell in the US Army. When the singer returned to Memphis in 1954 he found several of his former associates, including Johnny Ace, enjoying considerable success, while Bland's recording label, Duke, had been sold to Houston entrepreneur Don Robey. In 1956 Bland began touring with Little Junior Parker. Initially he doubled as valet and driver, a role he reportedly fulfilled for B.B. King and Roscoe Gordon.[6] Simultaneously, Bobby began asserting his characteristic vocal style. Melodic big-band blues singles, including \"Farther Up The Road\" (1957) and \"Little Boy Blue\" (1958) reached the US R&B Top 10, but Bobby's craft was most clearly heard on a series of superb early 1960's releases including \"Cry Cry Cry,\" \"I Pity The Fool\" and the sparkling \"Turn On Your Lovelight,\" which was destined to become a much-covered standard. Despite credits to the contrary, many such classic works were written by Joe Scott, the artist's bandleader and arranger.[7]\n\nBland continued to enjoy a consistent run of R&B chart entries throughout the mid-'60s but his recorded work was nonetheless eclipsed by a younger generation of performers. Bland's highest charting song on the pop chart, \"Ain't Nothing You Can Do\" only peaked at #20 during the same week The Beatles held down the Top 5 spots. Financial pressures forced the singer to cut his touring band and in 1968 the group broke up altogether. His relationship with Scott, who died in 1979, was irrevocably severed. Nonetheless, depressed and increasingly dependent on alcohol, Bland weathered this unhappy period. He stopped drinking in 1971; his record company, Duke, was sold to the larger ABC Records group, resulting in several contemporary blues/soul albums including California and Dreamer.\n\nDuring his tenure at ABC in the 1970s, he frequently appeared in package shows with labelmate B. B. King.  Often one would join the other onstage during a set, resulting in extraordinary concert performances with the two artists performing together.  Two live albums were released on ABC in the early 1970s which provided a sample of these concerts:  \"Together for the First Time\" and \"Together Again\".\n\nSubsequent attempts at pushing the artist towards the disco market were unsuccessful but a 1983 release, \"Here We Go Again\", provided a commercial life-line. Two years later Bland was signed by Malaco Records, specialists in traditional Southern black music, who provided an empathetic environment. One of the finest singers in post-war blues, Bobby Bland has sadly failed to reach the popular acclaim his influence and craft perhaps deserves. <a href=\"https://www.last.fm/music/+noredirect/Bobby+Bland\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
