{"artist":{"name":"Bobby Vee","mbid":"97ebb1b4-1d9c-4303-bb60-074c993e2d53","url":"https://www.last.fm/music/Bobby+Vee","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3325df228bfc47339c983b41ea172d36.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3325df228bfc47339c983b41ea172d36.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3325df228bfc47339c983b41ea172d36.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3325df228bfc47339c983b41ea172d36.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3325df228bfc47339c983b41ea172d36.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3325df228bfc47339c983b41ea172d36.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"206578","playcount":"1142787"},"similar":{"artist":[{"name":"Neil Sedaka","url":"https://www.last.fm/music/Neil+Sedaka","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ae4c863a8696433c9deedc63ea794c51.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ae4c863a8696433c9deedc63ea794c51.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ae4c863a8696433c9deedc63ea794c51.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ae4c863a8696433c9deedc63ea794c51.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ae4c863a8696433c9deedc63ea794c51.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ae4c863a8696433c9deedc63ea794c51.png","size":""}]},{"name":"Johnny Tillotson","url":"https://www.last.fm/music/Johnny+Tillotson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/982932dc8abf4aca99c516d164c82560.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/982932dc8abf4aca99c516d164c82560.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/982932dc8abf4aca99c516d164c82560.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/982932dc8abf4aca99c516d164c82560.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/982932dc8abf4aca99c516d164c82560.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/982932dc8abf4aca99c516d164c82560.png","size":""}]},{"name":"Gene Pitney","url":"https://www.last.fm/music/Gene+Pitney","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/84af4b6fe9fa49f3bfeb1fac4bb4c1fe.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/84af4b6fe9fa49f3bfeb1fac4bb4c1fe.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/84af4b6fe9fa49f3bfeb1fac4bb4c1fe.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84af4b6fe9fa49f3bfeb1fac4bb4c1fe.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84af4b6fe9fa49f3bfeb1fac4bb4c1fe.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/84af4b6fe9fa49f3bfeb1fac4bb4c1fe.png","size":""}]},{"name":"Billy Fury","url":"https://www.last.fm/music/Billy+Fury","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/99ecca5e496f29a8ee218acfbc21793b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/99ecca5e496f29a8ee218acfbc21793b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/99ecca5e496f29a8ee218acfbc21793b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/99ecca5e496f29a8ee218acfbc21793b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/99ecca5e496f29a8ee218acfbc21793b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/99ecca5e496f29a8ee218acfbc21793b.png","size":""}]},{"name":"Bobby Rydell","url":"https://www.last.fm/music/Bobby+Rydell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/637ecf6f1b974b08afdea5542213e7c9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/637ecf6f1b974b08afdea5542213e7c9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/637ecf6f1b974b08afdea5542213e7c9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/637ecf6f1b974b08afdea5542213e7c9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/637ecf6f1b974b08afdea5542213e7c9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/637ecf6f1b974b08afdea5542213e7c9.png","size":""}]}]},"tags":{"tag":[{"name":"oldies","url":"https://www.last.fm/tag/oldies"},{"name":"60s","url":"https://www.last.fm/tag/60s"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"male vocalists","url":"https://www.last.fm/tag/male+vocalists"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Bobby+Vee/+wiki"}},"published":"15 May 2006, 01:10","summary":"Bobby Vee (born Robert Thomas Velline, April 30, 1943 – October 24, 2016) was an American pop singer who was a teen idol in the early 1960s. \nAccording to Billboard magazine, he had 38 American Hot 100 chart hits, 10 of which hit the Top 20.\n\nVee was born in Fargo, North Dakota, to Sydney Ronald Velline and Saima Cecilia Tapanila. His first single, \"Suzie Baby,\" was written by Vee with a nod to Buddy Holly's \"Peggy Sue\" and recorded for the Minneapolis-based <a href=\"https://www.last.fm/music/Bobby+Vee\">Read more on Last.fm</a>","content":"Bobby Vee (born Robert Thomas Velline, April 30, 1943 – October 24, 2016) was an American pop singer who was a teen idol in the early 1960s. \nAccording to Billboard magazine, he had 38 American Hot 100 chart hits, 10 of which hit the Top 20.\n\nVee was born in Fargo, North Dakota, to Sydney Ronald Velline and Saima Cecilia Tapanila. His first single, \"Suzie Baby,\" was written by Vee with a nod to Buddy Holly's \"Peggy Sue\" and recorded for the Minneapolis-based Soma Records in 1959; it drew enough attention and chart action to be purchased by Liberty Records, who signed him later that year. His followup single, a cover of Adam Faith's UK number-one \"What Do You Want?\", charted in the lower reaches of the Billboard pop chart in early 1960. His fourth release, a revival of the Clovers' doo-wop ballad \"Devil or Angel\", brought him into the big time with U.S. buyers. His next single, \"Rubber Ball\", made him an international star.\n\nVee's 1961 summer release \"Take Good Care of My Baby\" went to number one on the Billboard U.S. listings and number three in the UK Singles Chart. Known primarily as a performer of Brill Building pop material, he went on to record a string of international hits in the 1960s, including \"Devil or Angel\" (U.S. number six), \"Rubber Ball\" (1961, U.S. number six, Australia number one), \"More Than I Can Say\" (1961, U.K. number four), \"Run to Him\" (1961, U.S. number two), \"The Night Has a Thousand Eyes\" (1963, U.S. number three), and \"Come Back When You Grow Up\" (U.S. number three). When Vee recorded \"Come Back When You Grow Up\" in 1967, he was joined by a band called the Strangers. He also recorded, in 1961, a version of the song \"Lollipop\", originally by Ronald & Ruby, which also became a success.\n\nVee was also a pioneer in the music video genre, appearing in several musical films, as well as in the Scopitone series of early film-and-music jukebox recordings.\n\nHe received the North Dakota Roughrider Award in 1999.\n\nHe is mentioned in the film No Direction Home regarding his brief musical association with Bob Dylan and Dylan's suggestion that he was \"Bobby Vee\" after Vee's regional hit.\n\nThe Very Best of Bobby Vee, released by EMI/UK on May 12, 2008, charted in the UK top five. On January 17, 2011, EMI/UK released Rarities, a double-CD package with 61 tracks, many of which were previously unreleased. Others included were alternate takes and first-time stereo releases as well as tracks from the album Bobby Vee Live on Tour minus the \"canned\" audience.\n\nOn March 28, 2011, he became the 235th inductee into the Rockabilly Hall of Fame. In 2014 he was inducted into the Scandinavian-American Hall of Fame.\n\nVee's career began amid tragedy. On February 3, 1959, \"The Day the Music Died\", three of the four headline acts in the lineup of the traveling Winter Dance Party—Buddy Holly, Ritchie Valens, and the Big Bopper—were killed, along with the 21-year-old pilot, Roger Peterson, in the crash of a V-tailed 1947 Beechcraft Bonanza airplane (Dion, the second headliner, opted not to travel on the plane). It crashed near Clear Lake, Iowa, en route to the next show on the tour itinerary in Moorhead, Minnesota. Velline, then aged 15, and a hastily assembled band of Fargo schoolboys calling themselves the Shadows volunteered for and were given the unenviable job of filling in for Holly and his band at the Moorhead engagement. Their performance there was a success, setting in motion a chain of events that led to Vee's career as a popular singer.\n\nIn 1963, Vee released a tribute album on Liberty Records called I Remember Buddy Holly. In the liner notes, Vee recalled Holly's influence on him and the events surrounding Holly's death:\n\nLike so many other people, I became a Buddy Holly fan the very first time I heard him sing. I've been a fan ever since and I guess I always will be. I remember a few years ago when Buddy was scheduled to appear at a dance in my home town of Fargo, North Dakota. It was going to be a big event for the whole town, but even more so for me. I was anxiously looking forward to seeing Buddy in action.\n\nThe day he was to arrive disaster struck, taking Buddy's life, along with the lives of two other fine singers, Ritchie Valens and the Big Bopper. The shocking news spread through Fargo very quickly. The local radio station broadcast a plea for local talent to entertain at the scheduled dance. About a week before this, I had just organized a vocal and instrumental group of five guys. Our style was modelled after Buddy's approach and we had been rehearsing with Buddy's hits in mind. When we heard the radio plea for talent, we went in and volunteered. We hadn't even named the group up to that time, so we gave ourselves a name on the spot, calling ourselves The Shadows. We appeared at the dance and were grateful to be enthusiastically accepted. Soon afterwards, I made my first record. It was called \"Suzie Baby\" and I was pretty lucky with it; it was a fair-sized hit.\n\nFor some time now, I have wanted to make an album in tribute to Buddy, but I wasn't sure it was the proper thing to do. However, during the past year, I have received many requests to do such an album. These requests came not only from my fans and from DJs, but also from Buddy's loyal following---still a large group of devoted fans. It.... gave me the confidence to do the album. From \"Suzie Baby\" to this present album, I have made many records, but I have never forgotten Buddy Holly and his influence on my singing style and my career.\n\nVee went on to become a bona fide star and regularly performed at the Winter Dance Party memorial concerts in Clear Lake. His sons are all musicians and have performed with him there.\n\nEarly in Vee's career, a musician named Elston Gunnn [sic] briefly toured with the band. \"Gunnn\", whose birth name was Robert Allen Zimmerman, later went on to fame as Bob Dylan.\n\nDylan's autobiography, Chronicles, Volume One, mentions Vee and provides complimentary details about their friendship, both professional and personal.\n\nIn a concert at Midway Stadium in St. Paul, Minnesota, on July 10, 2013, Dylan said he had been on the stage with many stars, but that none of them were as meaningful as Vee. He said Vee was in the audience and then played Vee's hit \"Suzie Baby\" with emotion. Dylan said (in an audio recording of the concert),\n\nThank you everyone, thank you friends. I left here a while back, and since that time, I've played all over the world, with all kinds of people. And everybody from Mick Jagger to Madonna. And everybody in there in between. I've been on the stage with most of those people. But the most meaningful person I've ever been on the stage with, was a man who is here tonight, who used to sing a song called \"Suzie Baby\". I want to say that Bobby Vee is actually here tonight. Maybe you can show your appreciation with just a round of applause. So, we're gonna try to do this song, like I've done it with him before once or twice.\n\nVee and Karen Bergen were engaged July 1, 1963, and married December 28, 1963. They had four children: Jeffery Robert Velline (b. Jan 3, 1965), Thomas Paul Velline (b. October 25, 1966), Robert Bryon Velline (b. August 4, 1967), and Jennifer Joanne Velline (b. May 31, 1972). Karen died of kidney failure on August 3, 2015.\n\nOn April 29, 2012, Vee announced on his website that a year prior he had been diagnosed with an early stage of Alzheimer's disease and consequently would withdraw from the music business.\n\nOn October 24, 2016, Vee died in Rogers, Minnesota, from complications of early onset Alzheimer's disease.\n\n <a href=\"https://www.last.fm/music/Bobby+Vee\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
