{"artist":{"name":"Brenda Lee","mbid":"6ca4886a-8f77-4133-b404-46fb3908e24a","url":"https://www.last.fm/music/Brenda+Lee","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5ab3c7ca48c94de8a3cdbc69eea434ab.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5ab3c7ca48c94de8a3cdbc69eea434ab.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5ab3c7ca48c94de8a3cdbc69eea434ab.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5ab3c7ca48c94de8a3cdbc69eea434ab.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5ab3c7ca48c94de8a3cdbc69eea434ab.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5ab3c7ca48c94de8a3cdbc69eea434ab.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"576187","playcount":"3179765"},"similar":{"artist":[{"name":"Connie Francis","url":"https://www.last.fm/music/Connie+Francis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/77fdf774625a4384890c6770090e3f27.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/77fdf774625a4384890c6770090e3f27.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/77fdf774625a4384890c6770090e3f27.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/77fdf774625a4384890c6770090e3f27.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/77fdf774625a4384890c6770090e3f27.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/77fdf774625a4384890c6770090e3f27.png","size":""}]},{"name":"Chubby Checker","url":"https://www.last.fm/music/Chubby+Checker","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2199b0822d2e41a9a08c3fd8533027f1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2199b0822d2e41a9a08c3fd8533027f1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2199b0822d2e41a9a08c3fd8533027f1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2199b0822d2e41a9a08c3fd8533027f1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2199b0822d2e41a9a08c3fd8533027f1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2199b0822d2e41a9a08c3fd8533027f1.png","size":""}]},{"name":"Pat Boone","url":"https://www.last.fm/music/Pat+Boone","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/03b1579cdd224d97879a9b9befb7c92c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/03b1579cdd224d97879a9b9befb7c92c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/03b1579cdd224d97879a9b9befb7c92c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/03b1579cdd224d97879a9b9befb7c92c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/03b1579cdd224d97879a9b9befb7c92c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/03b1579cdd224d97879a9b9befb7c92c.png","size":""}]},{"name":"Perry Como","url":"https://www.last.fm/music/Perry+Como","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6afdd40941cf4989a282451636ef9743.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6afdd40941cf4989a282451636ef9743.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6afdd40941cf4989a282451636ef9743.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6afdd40941cf4989a282451636ef9743.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6afdd40941cf4989a282451636ef9743.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6afdd40941cf4989a282451636ef9743.png","size":""}]},{"name":"Ricky Nelson","url":"https://www.last.fm/music/Ricky+Nelson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d09a5f067ddc4d8ba4d2db60a728d28c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d09a5f067ddc4d8ba4d2db60a728d28c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d09a5f067ddc4d8ba4d2db60a728d28c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d09a5f067ddc4d8ba4d2db60a728d28c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d09a5f067ddc4d8ba4d2db60a728d28c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d09a5f067ddc4d8ba4d2db60a728d28c.png","size":""}]}]},"tags":{"tag":[{"name":"oldies","url":"https://www.last.fm/tag/oldies"},{"name":"60s","url":"https://www.last.fm/tag/60s"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"rockabilly","url":"https://www.last.fm/tag/rockabilly"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Brenda+Lee/+wiki"}},"published":"04 Apr 2006, 15:50","summary":"Brenda Lee, née Brenda Mae Tarpley (born December 11, 1944 in Atlanta, Georgia), is an American country-pop singer, who was popular during the 1950s and 1960s. In the 1960s she had more charted hits than any other woman, and only three male singers/groups (Elvis Presley, Ray Charles and The Beatles) outpaced her. She was one of the earliest pop stars to have a major contemporary international following.\n\nShe was given the nickname Little Miss Dynamite <a href=\"https://www.last.fm/music/Brenda+Lee\">Read more on Last.fm</a>","content":"Brenda Lee, née Brenda Mae Tarpley (born December 11, 1944 in Atlanta, Georgia), is an American country-pop singer, who was popular during the 1950s and 1960s. In the 1960s she had more charted hits than any other woman, and only three male singers/groups (Elvis Presley, Ray Charles and The Beatles) outpaced her. She was one of the earliest pop stars to have a major contemporary international following.\n\nShe was given the nickname Little Miss Dynamite after recording Dynamite in 1957; the explosive strength of the sound pouring out of her small frame amazed audiences and promoters. Her general popularity faded as her voice suffered damage and matured in the late 1960s, but she successfully continued her recording career by returning to her roots as a country singer. She was able to chart in Billboard's country-western top-ten twice in 1980.\n\nShe enjoys one distinction unique among successful American singers; her opening act on a UK tour in the early 1960s was a little-known beat group from Liverpool, England: The Beatles.[1][2]\n[edit] Early Years\nLee's father, Ruben Tarpley, was born roughly halfway between Atlanta and Augusta, Georgia. He was the son of a hardscrabble farmer in Georgia's red-clay belt, which was devastated by soil depletion and the boll weevil. Although he stood only 170 cm (5 feet 7 inches), he was an excellent left-handed pitcher, and spent 11 years in the Army playing baseball. Her mother, Annie Grayce Yarbrough, had a similar background of an honest, uneducated working class family in Greene County, Georgia, although she had the distinction of a Cherokee great-grandparent.\n\nBrenda was born Brenda Mae Tarpley in the charity ward of Grady Hospital in Atlanta, Georgia, on December 11, 1944. She weighed 2126 g (4 pounds 11 ounces) at birth. She attended grade schools wherever her father found work, primarily in the corridor between Atlanta and Augusta. Her family was poor, living hand-to-mouth; she shared a bed with her two siblings in a series of three-room houses without running water. Life centered around her parents' finding work, their extended family, and the Baptist Church (where she sang solos every Sunday).[3]\n\nShe was a musical prodigy. Although her family did not have indoor plumbing until after her father's death, they had a battery-powered table radio that fascinated Brenda as a baby. By the time she was two, she would hear songs on the radio once and be able to whistle the complete tune.[4] Both her mother and sister remember taking her repeatedly to a local candy store before she turned three; one of them would stand her on the counter and she would earn free candy or small coins for singing.\n\nHer voice, pretty face, and complete absence of stage fright won her wider attention from the time she was five years old. At age 6, she won a local singing contest sponsored by the elementary schools. The reward was a live appearance on an Atlanta radio show, \"Starmakers Revue\".\n\nHer father died in 1953. By the time she turned ten, she had become the primary breadwinner of her family by singing at events and on local radio and television shows.\n\nHer break into big-time show business came when she turned down paid employment -- $30 to sing on a local television station in Atlanta -- in order to hear Red Foley and the Ozark Jubilee in Augusta. An Augusta DJ convinced Foley to hear her sing before the show. Foley was as transfixed as everyone else who heard the huge voice coming from the tiny girl and immediately agreed to let her to perform the Hank Williams standard Jambalaya on stage that night, unrehearsed. Foley later recounted the moments following her introduction:\n\nI still get cold chills thinking about the first time I heard that voice. One foot started patting rhythm as though she was stomping out a prairie fire but not another muscle in that little body even as much as twitched. And when she did that trick of breaking her voice, it jarred me out of my trance enough to realize I'd forgotten to get off the stage. There I stood, after 26 years of supposedly learning how to conduct myself in front of an audience, with my mouth open two miles wide and a glassy stare in my eyes.\n\nThe audience erupted in applause and refused to let her leave the stage until she had sung three more songs. She was eleven years old and well under five feet tall. (As an adult, she was variously reported to stand between 140 and 145 cm tall: 4' 7\" and 4' 9\".)\n\nLess than two months later -- on July 30, 1956 -- Decca Records offered her a recording contract. She began her recording career at age 11 with rockabilly songs like \"BIGELOW 6-200\" (a telephone number with the numerals pronounced six two oh oh) and \"Little Jonah.\" The song \"Dynamite\", coming out of a 145-cm frame (4 foot 9 inch), led to her lifelong nickname, \"Little Miss Dynamite.\"\n\nAlong with Connie Francis, she was one of the first female idols, achieving huge popularity with a long string of hits. At Christmas 1958, she released \"Rockin' Around the Christmas Tree,\" which sold only 5,000 copies during its initial release. However, it would eventually sell over five million copies. Disc jockeys also dubbed her \"Little Miss Razz Matazz\" after her husky, pounding voice belted out her first U.S. Top 10 hit, \"Sweet Nothin's,\" in late 1959.\n\n\n[edit] The Height of Her Career\nBrenda Lee first attracted attention performing in country music venues, and her first single, 1957's \"One Step at a Time\", was a country hit. However, her label and management felt it best to market her exclusively as a pop artist, the result being that none of her best-known recordings from the 1960s were released to country radio, and despite her obvious country sound, she would not have another country hit until 1969.\n\nBrenda Lee came to her biggest success on the Pop charts in the late 1950s through the mid 1960s with rockabilly and rock and roll styled songs. Her biggest hits during this time include a rockabilly version of the country classic \"Jambalaya (On the Bayou),\" \"Sweet Nothin's\" (written by the country musician Ronnie Self), \"I Want to Be Wanted,\" \"All Alone Am I,\" and \"Fool #1\".\n\nThe overall biggest selling track of Lee's career is, oddly enough, a Christmas song. In 1958, when she was 13, Owen Bradley asked her to record a new song written by Johnny Marks, who had had success writing Christmas tunes for country singers, most notably \"Rudolph the Red-Nosed Reindeer\" (Gene Autry) and \"A Holly, Jolly Christmas\" (Burl Ives). Lee recorded the song, \"Rockin' Around the Christmas Tree\" in July with a prominent twanging guitar part by Hank Garland. Decca released it as a single that November, but it sold only 5,000 copies, and did not do much better when it was released again in 1959.\n\nIn 1960, she recorded her signature song, \"I'm Sorry\", which hit number one on the Billboard pop chart and was her first gold single. Even though it was not released as a country song, it was the first big hit to use what was to become the new \"Nashville Sound\" -- a string orchestra and legato harmonized background vocals. (Ray Charles used the same sound that year on the huge pop hit, Georgia on My Mind.) \"Rockin' Around the Christmas Tree\" got noticed in its third release a few months later, and sales snowballed; the song remains a perennial radio favorite each December and is probably the record with which she is most identified by contemporary audiences.\n\nLee was popular in the UK very early in her career. She toured the UK in 1959, before she had achieved much pop recognition in the US. Her 1961 rockabilly release \"Let's Jump the Broomstick\" did not chart in the US, but went to #12 in the UK. She then had two top 10 hits in the UK that were not released as singles in her native country: \"Speak To Me Pretty\" peaked at number three in early 1962, followed by \"Here Comes That Feeling.\"\n\nHer last top-10 single on the pop charts was 1963's \"Losing You,\" while she continued to have other chart songs such as her 1966 song \"Coming On Strong\" and \"Is It True?\" in 1964. The latter was her only hit single recorded in London, England, and was produced by Mickie Most, who at the time was producing hits for The Animals and Herman's Hermits.\n\nDuring the early 1970s, Lee re-established herself as a country music artist, and earned a string of Top 10 hits on the country charts. Th first of these was 1973's \"Nobody Wins,\" which reached the Top 5 that spring and also became her last Top 100 pop hit, peaking at number 70. The follow-up, the Mark James composition \"Sunday Sunrise,\" reached number six on Billboard magazine's Hot Country Singles chart that October. Other major hits included \"Wrong Ideas\" and \"Big Four Poster Bed\" (1974); and \"Rock On Baby\" and \"He's My Rock\" (both 1975). After a few years of lesser hits, Lee began another run at the Top 10 with 1979's \"Tell Me What It's Like.\" Two follow-ups also reached the Top 10 in 1980: \"The Cowboy and the Dandy\" and \"Broken Trust\" (the latter featuring vocal backing by The Oak Ridge Boys). A 1982 album, The Winning Hand, featuring reissues of a number of Lee's 1960s Monument hits, as well as that of Dolly Parton, Kris Kristofferson and Willie Nelson, was a surprise hit, reaching the top-ten on the U.S. country albums chart. Her last well-known hit was 1985's \"Hallelujah, I Love Her So,\" a duet with George Jones. Today, she continues to perform and tour as a country singer.\n\n\n[edit] Life Today\nOver the ensuing years, Lee has continued to record and perform all around the world, previously cutting records in four different languages. She is a member of the Rock and Roll Hall of Fame, the Country Music Hall of Fame, the Rockabilly Hall of Fame, and the Hit Parade Hall of Fame.\n\nIn 1992, Lee recorded a duet (\"You’ll Never Know\") with Willy DeVille, on his album Loup Garou.\n\nChuck Berry wrote a song about Brenda Lee on the album St. Louis to Liverpool. She was also immortalized in the hit Golden Earring song \"Radar Love\": \"Radio's playing some forgotten song / Brenda Lee's 'Coming on Strong'.\" She was also remembered as a heroine to Burton Cummings on his self-titled 70's album in the song \"Dream of a Child,\" including the closing line, \"I love Brenda Lee / Brenda Lee loves me / yeah...\"\n\nAlthough her songs have often centered on lost loves, and although she did lose her father at a young age, her marriage to Ronnie Shacklett in 1963 was a success. He was able to deal with the notoriously rapacious music industry, which had exploited her badly, and is credited with ensuring her long-term financial success. They have two daughters, Jolie and Julie (who was named for Patsy Cline's daughter) and three grandchildren, Taylor, Jordan and Charley.\n\nCelebrating over 50 years as a recording artist, Brenda Lee was given the Jo Meador-Walker Lifetime Achievement award by Source Nashville in September 2006. She is the second recipient of the award, Jo Meador-Walker being the first.\n\n\n[edit] Brenda Lee Discography\n\n[edit] Singles\n\n[edit] Top Twenty Hits\nThe following Brenda Lee singles made the Top 20 on the Billboard Hot 100, Country or AC chart in the U.S., U.K., or Canada.\n\nOne Step At a Time (1957) US Pop #43, US C&W #15 \nSweet Nothin's (1960) US Pop #4 / UK #4 \nI'm Sorry (1960) US Pop #1 / UK #12 \nThat's All You Gotta Do (1960) US Pop #6 \nI Want to Be Wanted (1960) US Pop #1 / UK #31 \n*Rockin' Around the Christmas Tree (1960) US Pop #14 / (1962) UK #6. \nEmotions (1961) US Pop #7 / UK #45 \nYou Can Depend On Me (1961) US Pop #6 \nDum Dum (1961) US Pop #4 / UK #22 \nFool #1 (1961) US Pop #3 / UK #38 \nLet's Jump the Broomstick (1961) UK #12 \nBreak It to Me Gently (1962) US Pop #2 / UK #46 \nEverybody Loves Me But You (1962) US Pop #6, US AC #2 \nAll Alone Am I (1962) US Pop #3, US AC #1 / UK #7 \nHeart In Hand (1962) US Pop #15, US AC #4 \nIt Started All Over Again (1962) US Pop #29 / UK #15 \nHere Comes That Feelin' (1962) US Pop #89 / UK #5 \nSpeak to Me Pretty (1962) UK #3 \nYour Used to Be (1963) US Pop #28, US AC #12 \nI Wonder (1963) US Pop #25, US AC #9 \nLosing You (1963) US Pop #6, US AC #2 / UK #10 \nMy Whole World Is Falling Down (1963) US Pop #24, US AC #8 \nThe Grass Is Greener (1963) US Pop #17, US AC #7 \nAlone With You (1964) US Pop #48, US AC #8 \nAs Usual (1964) US Pop #12, US AC #5 / UK #5 \nIs It True? (1964) US Pop #17 / UK #17 / Can #8 \nThink (1964) US Pop #25, US AC #4 / UK #26 \nWhen You Loved Me (1964) US Pop #47, US AC #8 \nRusty Bells (1965) US Pop #33, US AC #8 \nThanks A Lot (1965) Can #14 \nToo Many Rivers (1965) US Pop #13, US AC #2 / UK #22 \nTruly, Truly True (1965) US Pop #54, US AC #9 \nComing On Strong (1966) US Pop #11 / Can #9 \nJohnny One Time (1969) US Pop #41, US C&W #50, US AC #3 / Can #38 \nNobody Wins (1973) US Pop #70, US C&W #5 \nSunday Sunrise (1973) US C&W #6 \nWrong Ideas (1974) US C & W #6 \nBig Four Poster Bed (1974) US C&W #4 \nRock On Baby (1975) US C&W #6 \nHe's My Rock (1975) US C&W #8 \nTell Me What It's Like (1979) US C&W #8 \nThe Cowgirl And The Dandy (1980) US C&W #10 \nBroken Trust (w/Oak Ridge Boys, 1980) US C&W #9 \nHallelujah, I Love You So (w/George Jones, 1985) US C&W #15 \nNotes:\n\n*\"Rockin' Around the Christmas Tree\" spent a total of 25 weeks on Billboard's Christmas singles chart, charting every year from 1963 to 1969 and again in 1973, 1983, and 1984. In 1997, it charted #16 on the Adult Contemporary chart. Its highest position of #3 on the Christmas chart was reached during the 1965 Christmas season. \nOther Brenda Lee singles which made the Billboard Christmas chart include: \"Jingle Bell Rock\" (#10 in 1964 and #8 in 1967), \"This Time of the Year\" (#12 in 1964), and \"Christmas Will Be Just Another Lonely Day\" (#24 in 1964). \n\n[edit] International Hits\nThese singles did well in non-US markets, although they did not chart well (or were not even released) in the US.\n\nLet's Jump the Broomstick (1961) UK #12 \nSpeak to Me Pretty (1962) UK #3 \nIch will immer auf dich warten (1964) Germany #13, Holland #33 \nJingle Bell Rock (1964) Germany #1 \nIs It True/What'd I Say (1964) UK #17 (A-track released separately in US) \nOne Rainy Night in Tokyo (in Japanese)(1965) #1 Japan \nIf You Love Me (1965) #1 Japan \nI'm Sorry (1978) #1 France \n\n[edit] Selected albums\nYear Album US Pop Albums \n1959 Grandma, What Great Songs You Sang! - \n1960 Brenda Lee 5 \n1960 This Is... Brenda 4 \n1961 Emotions 24 \n1961 All the Way (#20 UK) 17 \n1962 Sincerely 29 \n1962 Brenda, That's All (#13 UK) 20 \n1963 All Alone, Am I (#8 UK) 25 \n1963 Let Me Sing 39 \n1964 By Request 90 \n1964 Merry Christmas From Brenda Lee 7 \n1965 Top Teen Hits - \n1965 The Versatile Brenda Lee - \n1965 Too Many Rivers 36 \n1966 Bye Bye Blues (#21 UK) 94 \n1966 10 Golden Years 70 \n1966 Coming On Strong 94 \n1967 For the First Time, Brenda and Pete (with Pete Fountain) 187 \n1968 Good Life - \n1969 Reflections In Blue - \n1969 The Show For Christmas Seals (with Tennessee Ernie Ford) - \n1969 Johnny One Time 98 \n1970 Memphis Portrait - \n1973 A Whole Lotta Love - \n1973 The Brenda Lee Story: Her Greatest Hits - \n1974 Brenda (Warner Bros.) - \n1974 New Sunrise - \n1975 Brenda Lee Now - \n1975 Sincerely, Brenda Lee - \n1976 L.A. Sessions - \n1980 Even Better - \n1980 Take Me Back - \n1980 Little Miss Dynamite (#15 UK; Britain-only compilation) - \n1981 Only When I Laugh - \n1982 Greatest Country Hits - \n1983 Kris, Willie, Dolly & Brenda...the Winning Hand (with Kris Kristofferson, Dolly Parton and Willie Nelson) - \n1983 25th Anniversary (#65 UK) - \n1984 The Very Best of Brenda Lee (#16 UK) - \n1985 Feels So Right - \n1991 Brenda Lee (Warner Bros.) - \n1991 A Brenda Lee Christmas - \n1992 Greatest Hits Live - \n1994 The Very Best of Brenda Lee (#20 UK) - \n1995 Coming On Strong - \n2007 Gospel Duets with Treasured Friends (with Vince Gill, Huey Lewis, Dolly Parton, Kix Brooks, Ronnie Dunn,\nMartina McBride, George Jones, Alison Krauss, Pam Tillis, Emmylou Harris and Charlie Daniels) - \n\n\n[edit] See also\nBest selling music artists — World's top-selling music artists chart. \nAlways on My Mind \n\n[edit] External links\nBrenda Lee Official Website \n\n[edit] References\n^ Argyrakis, Andy (2007-07-05). \"Reluctant Legend\". Christianity Today. Retrieved on 2008-04-02. “I also have a poster of The Beatles signed by each one of them because they used to open for me in England before they were a success.” \n^ Wooding, Dan. \"'Little Miss Dynamite' returns to her Gospel roots with a little help from some of her best friends\". Good News Daily. Retrieved on 2008-04-02. “While in England, I had met this group of young men and they toured with me throughout Germany and parts of England. They were then called The Silver Beatles and they later became known as The Beatles.” \n^ Lee remembers the church as not being truly \"Primitive Baptist\", but the congregation did engage in foot-washing and performed baptisms in a river. \n^ Oral remembrance of Grayce Rainwater, recounted in Little Miss Dynamite. \nRetrieved from \"http://en.wikipedia.org/wiki/Brenda_Lee\"\nCategories: 1944 births | Living people | American country singers | American female singers | American rock singers | Rock and Roll Hall of Fame inductees | American pop singers | People from Georgia (U.S. state)\n\n\n <a href=\"https://www.last.fm/music/Brenda+Lee\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
