{"artist":{"name":"Brian Keane","mbid":"9b94ea46-77c0-4f28-a63e-c91646c4eae2","url":"https://www.last.fm/music/Brian+Keane","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e3d70078f65c495c867c6abdcdb9a4c5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e3d70078f65c495c867c6abdcdb9a4c5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e3d70078f65c495c867c6abdcdb9a4c5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e3d70078f65c495c867c6abdcdb9a4c5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e3d70078f65c495c867c6abdcdb9a4c5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e3d70078f65c495c867c6abdcdb9a4c5.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"7857","playcount":"54405"},"similar":{"artist":[{"name":"Faures","url":"https://www.last.fm/music/Faures","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0653e13b0c8f424dc286026d54c7a961.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0653e13b0c8f424dc286026d54c7a961.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0653e13b0c8f424dc286026d54c7a961.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0653e13b0c8f424dc286026d54c7a961.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0653e13b0c8f424dc286026d54c7a961.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0653e13b0c8f424dc286026d54c7a961.png","size":""}]},{"name":"Matt Stell","url":"https://www.last.fm/music/Matt+Stell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/aab96fdff57c4f198c2f36b4298a1f01.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/aab96fdff57c4f198c2f36b4298a1f01.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/aab96fdff57c4f198c2f36b4298a1f01.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aab96fdff57c4f198c2f36b4298a1f01.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aab96fdff57c4f198c2f36b4298a1f01.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aab96fdff57c4f198c2f36b4298a1f01.png","size":""}]},{"name":"Chaitanya Hari Deuter","url":"https://www.last.fm/music/Chaitanya+Hari+Deuter","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/729f6038143d4383a4ef8fb10679283c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/729f6038143d4383a4ef8fb10679283c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/729f6038143d4383a4ef8fb10679283c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/729f6038143d4383a4ef8fb10679283c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/729f6038143d4383a4ef8fb10679283c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/729f6038143d4383a4ef8fb10679283c.png","size":""}]},{"name":"Mando Saenz","url":"https://www.last.fm/music/Mando+Saenz","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/17d48a0bbf694104b81597457acff99a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/17d48a0bbf694104b81597457acff99a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/17d48a0bbf694104b81597457acff99a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/17d48a0bbf694104b81597457acff99a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/17d48a0bbf694104b81597457acff99a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/17d48a0bbf694104b81597457acff99a.png","size":""}]},{"name":"Tibetan singing bowls","url":"https://www.last.fm/music/Tibetan+singing+bowls","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6d62e9b29b5bae9f3f3fff70c3a958bd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6d62e9b29b5bae9f3f3fff70c3a958bd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6d62e9b29b5bae9f3f3fff70c3a958bd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6d62e9b29b5bae9f3f3fff70c3a958bd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6d62e9b29b5bae9f3f3fff70c3a958bd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6d62e9b29b5bae9f3f3fff70c3a958bd.png","size":""}]}]},"tags":{"tag":[{"name":"alt country","url":"https://www.last.fm/tag/alt+country"},{"name":"indie","url":"https://www.last.fm/tag/indie"},{"name":"world","url":"https://www.last.fm/tag/world"},{"name":"alt-texas-red dirt country","url":"https://www.last.fm/tag/alt-texas-red+dirt+country"},{"name":"composer","url":"https://www.last.fm/tag/composer"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Brian+Keane/+wiki"}},"published":"09 Dec 2008, 19:12","summary":"Multi-award winning composer, producer, and musician, Brian Keane has always taken the road less traveled; From his early days as a guitarist's guitarist in duo with Larry Coryell, to his pioneering records as a Grammy-winning producer and innovator in world music, or to becoming the foremost composer in the world of documentaries, he has always carved out a unique niche for himself. Keane's career has consistently been centered around a timeless sense of quality <a href=\"https://www.last.fm/music/Brian+Keane\">Read more on Last.fm</a>","content":"Multi-award winning composer, producer, and musician, Brian Keane has always taken the road less traveled; From his early days as a guitarist's guitarist in duo with Larry Coryell, to his pioneering records as a Grammy-winning producer and innovator in world music, or to becoming the foremost composer in the world of documentaries, he has always carved out a unique niche for himself. Keane's career has consistently been centered around a timeless sense of quality, rather than the convention and hype that so pervades the entertainment industry today.\n\nA career path such as this should read like the epitaph for a suffering artist, but the remarkable thing is that Keane has been one of the most successful and in-demand composer/producers in the entertainment business, having scored over 350 films that have won an impressive collection of awards and producing over 100 CDs with 29 Billboard Top Tens, five of which went to #1. In 2002 Brian Keane became the first composer in the history of the Emmys to sweep all the Emmy nominations for Outstanding Music Composition in a single year. In all, Brian has received 23 Emmy nominations, winning 10, along with many other awards. One would think that with such a prolific career, Brian would be a Hollywood insider, but he has accomplished all of this while rarely straying from his home in the woods of Connecticut.\n\nBrian Keane made his name as a musician's musician, capable of writing cutting edge symphonic music for orchestra or trading bebop lines with the biggest names in jazz, while never losing sight of a vision of music as, first and foremost, a medium for expressing emotion and spirituality  in fact Keane's reputation as a composer is built on his soaring melodies and moving scores. His best known work as a producer is in the ethnic and New Age worlds, where he has produced landmark spiritual and ethnic records with musicians from all over the world.\n\nBrian was born in Philadelphia in 1953 to a musical family (his mother Winifred is an avant garde composer and singer, his father George is an Irish tenor, his grandfather Al was a Vaudeville entertainer, his brother Geof plays cello, sings, and owns Merit Music in New Canaan CT, and his sister Sheila has also sung professionally). Although he spent some early years in the Berkshires, he grew up primarily in Westport Connecticut, where he studied privately with Julliard professor, jazz pianist, and \"Rhythmic and Tonal Principles\" author John Mehegan. He graduated Staples High School in Westport in 1971 and went on to attend Cornell University and Ithaca College, where he graduated with honors in 3 years. While there, he studied privately with Czech composer Karel Husa. Upon graduation, Keane moved back to the New York area and found work as a session guitarist, working with (among others) the late disco star Vicky Sue Robinson, a jazz trio with Eddie Gomez and Jeremy Steig, and a stint as musical director for Eartha Kitt. It was his work with Gomez and Steig that caught the attention of Larry Coryell. Coryell hired Brian, and the two toured in a duo for several years, additionally performing in a trios with flamenco great Paco De Lucia, and Polish violinist Michael Urbaniak. Keane and Coryell recorded 3 records together. During the mid 80s, Brian continued to tour with other jazz greats such as Bobby McFerrin, the Brubecks, and Spyro Gyra.\n\nIn 1981, while he was still mid-stride in his career as a jazz guitarist, Brian scored his first film, \"Against Wind And Tide: A Cuban Odyssey\" (a documentary about the Mariel boat-lift), for film makers Jim Burroughs and Suzanne Baugman. The film went on to be nominated for an Academy Award. Starting out slowly, Keane's career as a film composer gained steam by word of mouth throughout the early 80's as he continued touring and recording as a jazz guitarist. In 1986 Suzanne Baugman asked him to score a film about the Ottoman Empire called \"Suleyman The Magnificent\". Not being familiar with any Turkish musicians, Brian asked famed producer Arif Mardin, with whom he had worked earlier as a session guitarist, to recommend some musicians for the score. While initially stumped, Arif called back a few days later, and said that his cook frequented a belly-dancing club in the \"Hell's Kitchen\" section of New York City called \"Fazil's\". It was at \"Fazil's\" that Brian discovered the talented multi-instrumentalist Faruk Tekbilek. Employing Faruk's masterful musicianship over his own orchestration, Brian created a soundtrack that was one of the first to use Western and Middle Eastern instrumentation together. The highly successful film was subsequently seen by German record company president Eckart Rahn, who decided he had to have the soundtrack for his Celestial Harmonies label. The soundtrack from \"Suleyman The Magnificent\" became the first of a series of critically acclaimed recordings made by Keane and Tekbilek, culminating in the now-classic 1992 release \"Beyond The Sky\". Brian also recorded two more solo records as a jazz artist: 1987's \"Snowfalls\" and 1992's \"Common Planet\" (for Blue Note). Although he had the number one Jazz record on the radio in 1992, Brian chose not to continue his solo career, as the labels at that time were trying to push him into a \"smooth jazz\" format, which he refused to be limited to. He shocked Blue Note by walking away from his recording deal after his highly successful debut release. Finding the world of a recording artist too limiting artistically, he has yet to make a CD as a featured artist since.\n\nIn the early 90's, Brian Keane was continuing to steadily develop his career as a producer. Keane's steady stream of successes were noticed by other musicians and labels, and Brian, again by word of mouth inside the industry, began to receive offers for more and more record projects.\n\nMeanwhile, in 1989, Brian scored a film for Simon and Goodman Films about Jane Goodall's crusade for chimpanzees. The HBO film \"Chimps: So Like Us\", won an Emmy Award, and was nominated for an Academy Award as well. Working one floor up from Simon and Goodman was Ric Burns, who had co-written and produced the landmark documentary \"The Civil War\" with his brother, Ken. Ric hired Brian to score his classic film \"Coney Island\". Brian has continued to score all of Ric's films to date, including \"The Donner Party\", considered one of the most influential documentaries of all time and named as the best film of the year by the National Board of Review, as well as the epic Emmy and Peabody winning documentaries \"The Way West\" and, most recently, \"New York\" (which is the biggest selling video in PBS history). In 2002, Brian became the first composer in history to sweep all of the Emmy nominations for \"Outstanding Musical Score\" in a single year. Click here to read the article in \"Pro Sound News Online Daily\".\n\nThrough the 1990s, Keane's reputation steadily grew, still by word of mouth, in the film and record communities. The critical success of the \"Way West\" soundtrack, along with the enormously successful \"Celtic Twilight\" and \"Song of the Irish Whistle\" series that Brian had produced for the Hearts of Space label and which had sold in the millions of copies, had gotten him noticed by Windham Hill records when Native American musician Spotted Eagle asked Brian to produce his 1996 debut for the label, \"Closer to Far Away\". Brian was then given the opportunity to produce the 1996 \"Carols of Christmas\" which went to the top of the Billboard New Age charts selling over 400,000 units. He has gone on to produce many records for Windham Hill and BMG (who subsequently bought Windham Hill) ever since, including the very successful \"Winter's Solstice\" series, the \"Summer Solstice\" series, and the \"Thanksgiving\" collection. In the film world, while all this was going on, Keane scored two mini-series for the late, great documentary film maker Henry Hampton (\"Eyes On The Prize\" and \"The Great Depression\"), as well as some classic documentaries for director Tom Lennon, \"The Battle Over Citizen Kane'\" ( Emmy and Peabody winner and Academy Award Nominee ), and the celebrated Disney/PBS documentary series \"Long Journey Home: The Irish In America\" (for which he collaborated with Cheiftain's leader Paddy Moloney and won a Grammy in 1998). He also scored successful TV series for HBO and ABC, and scored several feature films. In the record world, Keane continued expanding his client base producing many top-selling records, and by now has been the producer behind literally millions of record sales.\n\nToday, Brian still enjoys a full and diverse schedule, while living with his wife and three children in Connecticut on a 12 acre estate which adjoins a sizeable nature preserve, approximately 1 hour by car from Manhattan. He has a state of the art studio complex, a full time staff, and continues to be a major force in music, and a major employer for New York area and world musicians. <a href=\"https://www.last.fm/music/Brian+Keane\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
