{"artist":{"name":"Britt Nicole","mbid":"9519eba5-d329-417e-b69a-9ebb2faffca4","url":"https://www.last.fm/music/Britt+Nicole","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cee5b85f71a61b6051738071bc0e3e5f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cee5b85f71a61b6051738071bc0e3e5f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cee5b85f71a61b6051738071bc0e3e5f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cee5b85f71a61b6051738071bc0e3e5f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cee5b85f71a61b6051738071bc0e3e5f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cee5b85f71a61b6051738071bc0e3e5f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"81613","playcount":"1455663"},"similar":{"artist":[{"name":"Francesca Battistelli","url":"https://www.last.fm/music/Francesca+Battistelli","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/45d5615f1d3b47a6badf11b2dd9f75cd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/45d5615f1d3b47a6badf11b2dd9f75cd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/45d5615f1d3b47a6badf11b2dd9f75cd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/45d5615f1d3b47a6badf11b2dd9f75cd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/45d5615f1d3b47a6badf11b2dd9f75cd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/45d5615f1d3b47a6badf11b2dd9f75cd.png","size":""}]},{"name":"Mandisa","url":"https://www.last.fm/music/Mandisa","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/42a4ff69b6b080b9c3fd9322fd7a9ec9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/42a4ff69b6b080b9c3fd9322fd7a9ec9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/42a4ff69b6b080b9c3fd9322fd7a9ec9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/42a4ff69b6b080b9c3fd9322fd7a9ec9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/42a4ff69b6b080b9c3fd9322fd7a9ec9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/42a4ff69b6b080b9c3fd9322fd7a9ec9.png","size":""}]},{"name":"Group 1 Crew","url":"https://www.last.fm/music/Group+1+Crew","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d390d7d074d34254b731372502c23888.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d390d7d074d34254b731372502c23888.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d390d7d074d34254b731372502c23888.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d390d7d074d34254b731372502c23888.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d390d7d074d34254b731372502c23888.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d390d7d074d34254b731372502c23888.png","size":""}]},{"name":"Jamie Grace","url":"https://www.last.fm/music/Jamie+Grace","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ccaa7fadb4bb5c6d3178da43e52cc862.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ccaa7fadb4bb5c6d3178da43e52cc862.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ccaa7fadb4bb5c6d3178da43e52cc862.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ccaa7fadb4bb5c6d3178da43e52cc862.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ccaa7fadb4bb5c6d3178da43e52cc862.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ccaa7fadb4bb5c6d3178da43e52cc862.png","size":""}]},{"name":"TobyMac","url":"https://www.last.fm/music/TobyMac","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/02b427d0ddd34843a0b89c4b7143195e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/02b427d0ddd34843a0b89c4b7143195e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/02b427d0ddd34843a0b89c4b7143195e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/02b427d0ddd34843a0b89c4b7143195e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/02b427d0ddd34843a0b89c4b7143195e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/02b427d0ddd34843a0b89c4b7143195e.png","size":""}]}]},"tags":{"tag":[{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"christian","url":"https://www.last.fm/tag/christian"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"christian pop","url":"https://www.last.fm/tag/christian+pop"},{"name":"gospel","url":"https://www.last.fm/tag/gospel"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Britt+Nicole/+wiki"}},"published":"23 May 2007, 00:30","summary":"Brittany Nicole Waddell, better known by her stage name as Britt Nicole is a Christian pop artist.\nWaddell began singing at the age of three in her home church, Truth Temple of (Kannapolis, North Carolina). She, along with her brother and cousin, eventually became involved with the church's daily program on Charlotte TV station WAXN.\n\nWaddell turned down a scholarship from Belmont University in Nashville Tennessee to pursue a full-time music career <a href=\"https://www.last.fm/music/Britt+Nicole\">Read more on Last.fm</a>","content":"Brittany Nicole Waddell, better known by her stage name as Britt Nicole is a Christian pop artist.\nWaddell began singing at the age of three in her home church, Truth Temple of (Kannapolis, North Carolina). She, along with her brother and cousin, eventually became involved with the church's daily program on Charlotte TV station WAXN.\n\nWaddell turned down a scholarship from Belmont University in Nashville Tennessee to pursue a full-time music career, she felt that God called her to not go to college but to concentrate on music instead In 2004 she signed a management deal with Vertical Entertainment and then signed a development - dealing with Word Records Sparrow Records signed her in 2006 and her first album Say It was released May 22, 2007 Britt Nicole was committed to the Winter Jam Tour with Sanctus Real, Hawk Nelson Jeremy Camp and Steven Curtis Chapman Newsong [1] \n\nA native of Salisbury, NC, Britt has always had a heart for reaching people and has long used music as the vehicle to change lives.  She began singing in church at age three and by the time she was in high school, was appearing on her church’s daily television program and logged a performance at New York’s famed Carnegie Hall with her school’s advanced chorus.\n\nThose early pursuits paved the way for her to sign with Sparrow Records in 2006.  She burst on the charts a year later with her label debut, “Say It,” a finely crafted pop collection that introduced us to her engaging voice and thought-provoking lyrics.  It earned her a slot on the Winter Jam tour that year with Steven Curtis Chapman, Jeremy Camp, NewSong and Hawk Nelson where she developed a reputation as a compelling live performer.\n\nIt was a whirlwind existence that found her looking to meet the needs of those around her—whether it was a girl in a youth group who needed someone to pray with or a parent seeking advice on their troubled teen.  Her servant’s heart and earnest desire to fill others up soon left Britt herself feeling empty.  It all caught up with her at an Alabama youth conference called The Ramp.  “I went with my youth group as a youth leader to support and pray for them, but near the end of the event, I was kind of worn out and I began saying ‘Okay God, I just really need You to come and do something in my life,’” Britt recalls.  She got her answer as she was driving back to Nashville.\n\n“I just felt different. I felt like the old me was gone and God had started to show me who I really was and what I was called to do,” Britt says.  “As I was driving home from the conference, everywhere I would stop, whether at a gas station or a restaurant, God was challenging me to step out and tell people about Him and His love for them.  There are so many hurting and broken people around us each day and God was showing me the importance of reaching out to them just as He would.  In the past, I have often let the fear of people and their opinions stop me from being who I am.  At the core though, I know who I am and who God has called me to be.  In letting go of my past, I was able to move forward, and instead of focusing on all my mistakes and failures, I started focusing on those around me.  That’s ultimately why I’m here, to worship God and to reach those who need to know Him.”\n\nAfter that experience, she wrote songs for the new album that included “The Lost Get Found,” “Walk on the Water,” and “Safe.”  Britt continues to explain that, “They all have a similar message of having the courage to step out in faith and walk in what God has called you to do even when it’s scary.  I don’t want to be selfish anymore.  I don’t want to be safe anymore.  When God tells me to step out and talk to somebody or believe for what seems impossible, I want to do it.”\n\nThe new album combines compelling lyrics with catchy pop songs that linger in your head such as the funky “How We Roll” and the infectious groove of “Headphones.”  “When I write songs, I often write to specific people,” she reveals.  “The first verse of ‘Headphones’ was written to a girl that I know.  She’s in middle school dealing with the pressure of fitting in.  I wanted to remind her that she does not have to look or be like anyone else because God loves her and made her just the way she is.  Sometimes it is hard to stand out and sometimes you feel alone when you do, but I know she is being a light to so many and that’s what matters.”\n\n“Feel the Light” is another song that was written for a specific friend of hers who had faced several difficult things as a child.  “She was hiding all of her pain and had never told anyone what she was going through,” shares Britt.  “Sometimes it’s easier to hide our fears, our struggles, and things that have happened to us in our past rather than talk about them.  A lot of kids I meet feel they have no one to talk to who will understand, but God promises us that when we bring everything into His light, He will heal us and we will be free.”  One of her favorite lines in the song is “you’re a queen, but you’ve never known it.”  She explains that, “The important thing to remember is that your past does not define who you are.  We all go through hard things, but it is our choice to decide how we deal with them.  The song simply says, ‘Let go and feel the light.’”\n\nOne of the most personal songs on the new record is “Have Your Way”.  “I was thinking about my brother when I wrote the song, but when I sang it in the studio, it somehow hit even closer to home,” says Britt.  “I was also reminded of Job in the Bible when I wrote the lyrics.  He went through so many things and everything was taken from him, but at the end of it all, he still fell to his knees and worshiped God and never turned his back on Him.  He just said, ‘God have Your way, whatever You want.’  I want to be like that.”  Through Britt’s achingly vulnerable vocals, you can sense the more personal nature of the song as she sings, “you never said the road would be easy, but you said you would never leave.”  “The night I sang it in the studio, I sang it laying down,” says Britt.  “I’ve never sung a vocal like that.  I always sing standing up in a vocal booth, which makes it feel more like a performance.  When I’m praying or just spending time with God, I’m usually on the floor so it just naturally felt more like I was singing to God.”\n\nIn listening to Britt Nicole’s music, it’s obvious she possesses wisdom beyond her years and a spiritual maturity not often seen in one so young.  Yet she’s very much the playful girl next door and those equally intriguing sides of her personality merge seamlessly on “The Lost Get Found.”\n\n “My fans want a pop record,” she says wistfully.  “I’m a pop artist and they love fun music.  When they come to my concerts, they want to have fun and I love that.  That’s in my personality to have fun, but the heart of who I am is to worship and to see people’s lives changed and to reach those who are hurting.  It’s what I believe God has called me to do.”\n\nSalisbury, North Carolina, United States2007 <a href=\"https://www.last.fm/music/Britt+Nicole\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
