{"artist":{"name":"Burning Spear","mbid":"16dad944-c492-43dd-88ed-e0b7ac520c40","url":"https://www.last.fm/music/Burning+Spear","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/09196001a49445e186a821ae07c10210.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/09196001a49445e186a821ae07c10210.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/09196001a49445e186a821ae07c10210.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/09196001a49445e186a821ae07c10210.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/09196001a49445e186a821ae07c10210.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/09196001a49445e186a821ae07c10210.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"423517","playcount":"4377937"},"similar":{"artist":[{"name":"Black Uhuru","url":"https://www.last.fm/music/Black+Uhuru","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/252cb5ce74a14a5dca21b37d563f94a7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/252cb5ce74a14a5dca21b37d563f94a7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/252cb5ce74a14a5dca21b37d563f94a7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/252cb5ce74a14a5dca21b37d563f94a7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/252cb5ce74a14a5dca21b37d563f94a7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/252cb5ce74a14a5dca21b37d563f94a7.png","size":""}]},{"name":"Bunny Wailer","url":"https://www.last.fm/music/Bunny+Wailer","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a33149c748dd49b8801164f3175ba2d8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a33149c748dd49b8801164f3175ba2d8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a33149c748dd49b8801164f3175ba2d8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a33149c748dd49b8801164f3175ba2d8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a33149c748dd49b8801164f3175ba2d8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a33149c748dd49b8801164f3175ba2d8.png","size":""}]},{"name":"Israel Vibration","url":"https://www.last.fm/music/Israel+Vibration","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/db79d83eae8548c99f11130d317e2cae.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/db79d83eae8548c99f11130d317e2cae.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/db79d83eae8548c99f11130d317e2cae.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db79d83eae8548c99f11130d317e2cae.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db79d83eae8548c99f11130d317e2cae.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db79d83eae8548c99f11130d317e2cae.png","size":""}]},{"name":"Culture","url":"https://www.last.fm/music/Culture","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d9b83d8ce3df4c32ad1b6bb14ca2ef85.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d9b83d8ce3df4c32ad1b6bb14ca2ef85.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d9b83d8ce3df4c32ad1b6bb14ca2ef85.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d9b83d8ce3df4c32ad1b6bb14ca2ef85.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d9b83d8ce3df4c32ad1b6bb14ca2ef85.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d9b83d8ce3df4c32ad1b6bb14ca2ef85.png","size":""}]},{"name":"Peter Tosh","url":"https://www.last.fm/music/Peter+Tosh","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c7cee04149d547c6a6936f08ec43497a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c7cee04149d547c6a6936f08ec43497a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c7cee04149d547c6a6936f08ec43497a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c7cee04149d547c6a6936f08ec43497a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c7cee04149d547c6a6936f08ec43497a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c7cee04149d547c6a6936f08ec43497a.png","size":""}]}]},"tags":{"tag":[{"name":"reggae","url":"https://www.last.fm/tag/reggae"},{"name":"roots reggae","url":"https://www.last.fm/tag/roots+reggae"},{"name":"dub","url":"https://www.last.fm/tag/dub"},{"name":"roots","url":"https://www.last.fm/tag/roots"},{"name":"jamaican","url":"https://www.last.fm/tag/jamaican"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Burning+Spear/+wiki"}},"published":"19 Apr 2006, 20:22","summary":"Winston Rodney (born March 1, 1945), also known as Burning Spear, is a Jamaican roots reggae singer and musician. Like many famous Jamaican reggae artists, Burning Spear is known for his Rastafari movement messages.\nRodney was born in Saint Ann's Bay, St. Ann, Jamaica, as were Bob Marley and Marcus Garvey; who both had a great influence on Rodney's life. Garvey in his philosophy, which Burning Spear greatly took to, and Marley in directly helping Burning Spear get started in the music industry. <a href=\"https://www.last.fm/music/Burning+Spear\">Read more on Last.fm</a>","content":"Winston Rodney (born March 1, 1945), also known as Burning Spear, is a Jamaican roots reggae singer and musician. Like many famous Jamaican reggae artists, Burning Spear is known for his Rastafari movement messages.\nRodney was born in Saint Ann's Bay, St. Ann, Jamaica, as were Bob Marley and Marcus Garvey; who both had a great influence on Rodney's life. Garvey in his philosophy, which Burning Spear greatly took to, and Marley in directly helping Burning Spear get started in the music industry. Burning Spear was originally Rodney's group, named after Jomo Kenyatta, the first Prime Minister and President of an independent Kenya. As fame took hold the name of the group gradually became synonymous with Rodney.\nBurning Spear is one of the strongest proponents of Marcus Garvey's self-determination and self-reliance for all African descendants, thus leading to several album releases in commemoration of the African activist.\nIn 2002, Burning Spear and his wife, Sonia Rodney who has produced a number of his albums, founded Burning Spear Records.\nBurning Spear advocates messages of honesty, peace, and love, which tie in with his religious and political messages of Rasta and black unity.\n\n\nAbout Burning Spear\t\n\n\nBurning Music \n\n\"I don't know how other people see music,\" reggae legend Burning Spear reflects. \"Some people might see it based upon money, some people might see music based upon opportunity and access. But I see music as life. I see music as inspiration.\" \n\nFor more than 35 years, Burning Spear's music-thus, his life-has inspired people on numerous continents. Since the beginning, his songs have implored listeners to fight oppression in all its forms, to work at improving their own condition and to consider the social impact of their actions. \n\nOUR MUSIC builds upon the Jamaican native's legacy of musical activism. With its inimitable dancing groove, the album percolates and bubbles rhythmically in its call for unity between races, between nations, between individuals and even between business associates. \n\nOUR MUSIC is the second album released on his Burning Spear label, following 2003's Grammy-nominated FREEMAN. In the midst of its expected messages about love, oppression and African history is the title track, a public confirmation that his brand of positivity is tempered with a strong sense of self. \"Our Music\" is Burning Spear's reclamation of his own artistry-a justification for establishing his record company and a challenge to all artists to commandeer their own future. \n\n\"A lot of artists just have no time to really look within the business section of the music business,\" Burning Spear reasons. \"There's no one to really sit them down and give them some of that business understanding before they get into what they get into. So then people walk all over these artists and do things where it's not appropriate and it's not right. It's not in the artist's love.\" \n\nWith his art and his business now firmly in his own control, Burning Spear's OUR MUSIC stands among the most joyful albums of his career. Bolstered by its throbbing basslines, bright horn parts and slinky female background singers, the songs embrace persistence (\"Try Again\"), self-analysis (\"Friends\"), love (\"Fix Me\") and community (\"Together\") through deceptively simple lyrics that point to deeper issues. It is, in effect, smart music you can dance to. \n\n\"It's like art,\" he says. \"You're gonna paint this thing, and people are gonna look at this art and say that it looks like a tree, looks like a car, some people it looks like a flower. People are gonna say different things according to what they see. It's very different, what it looks like to them.\" \n\nNo matter who looks at Burning Spear's career, they have to be impressed. Of his more than 25 albums, nine have earned Grammy nominations, with one of them - 1999's CALLING RASTAFRI - receiving the Academy's Best Reggae Album honor. And he remains one of the few reggae pioneers still working and influencing the people today. \n\nBorn Winston Rodney in St. Ann, Jamaica, he was an early fan of Bob Marley. As the legend goes, Rodney bumped into Marley while walking through a field, and the two began talking about music. Marley encouraged him to visit Jamaica's Studio One, where Rodney and a fellow musician recorded \"Door Peep.\" By the time of its release, Rodney had branded the duo Burning Spear, taking the nickname of Jomo Kenyatta, who was jailed by a colonial British government in Africa but rose to become the first president of Kenya. \n\n\"I believe in people who are gonna stand up for what they believe in,\" Burning Spear notes, \"not only for themselves, but for themselves and their people, and that was what Jomo was doing.\" \n\nEven more central to Burning Spears' mission - and it truly is a mission - was the doctrine of Marcus Garvey, a 20th century figure who pushed for a stronger black race through self-reliance. The Jamaican-born Garvey supported freedom and economic strength for all people, but made the African-originated population his focus and published his views in a New York-based newspaper, Negro World. Garvey was jailed in the 1920s and eventually exiled to Jamaica, though he never lashed out at the system that brought him down. His message survived, influencing the likes of Kenyatta, Martin Luther King Jr., Marley and Burning Spear, which titled some of its seminal albums MARCUS GARVEY and MARCUS' CHILDREN. \n\n\"Those men wasn't preachin' any violence,\" Burning Spear says. \"They were preachin' about Oneness and the struggles of black people about where they can live and having their voices heard. I don't see anything wrong with his plan and his direction. I think he opened a lot of eyes and opened a lot of mouths so those people could really talk and their voices could be heard. I think the time is right now to clear his name up and set his record free.\" \n\nBurning Spear's mission remains rather unchanged today, though the act and the music have undergone some alterations. The duo grew into a trio, but has long since morphed into Burning Spear, a solo artist. And while his music has always been a vehicle for social change, his songs are now increasingly melodic, developed with catchy hooks that use short phrases and point more subtly to internal truths for those willing to go through self-exploration. \n\nThe music survives in a much different musical era. The reggae genre, once a distinct idiom unto itself, has been co-opted by artists throughout the years and melded with other pop forms. Artists such as Eric Clapton, Paul Simon, The Rolling Stones, The Police, Stevie Wonder and UB40 combined it with pop and rock during the '70s and '80s, while Shaggy and Sean Paul have blended it with hip-hop textures in more recent years. Even country man Willie Nelson put together a hybrid album involving Toots Hibbert, of The Maytals. \n\nThose efforts have called attention to the genre, and specifically to those who helped bring reggae to the world in the '70s, including Burning Spear, Peter Tosh, Hibbert and Marley. In his time, Marley gave Burning Spear his personal seal of approval, and the Spear continues to maintain a devotion to reggae's roots while continuing his service to Jah. \n\n\"I think people have to remember the originals,\" Burning Spear suggests. \"So to be honest, I don't really feel no way about it when people put reggae in a different form. Regardless who's gonna do what with the music, I don't think they interfere with Burning Spear.\" \n\nOUR MUSIC relies heavily on the roots of the reggae movement. \n\n\"What I tried to do with this album, musically and lyrically, is to go back to the '70s, when we were singin' about the history and the culture and the lifestyle of these people,\" Burning Spear observes. \"A lot of Burning Spear songs of that earlier times, people would see as political. To me, it's just a natural thing. As an artist, I just expressed that.\" \n\nBurning Spear continues his mission of expressing his heart, of entertaining and educating the masses. He cleverly accomplishes that by winning over his listeners' bodies before he impacts their minds. He witnesses that process each time he takes the stage. \n\n\"You see the head start to nod, you start to see one movement from one of these legs down here and another one, 'til the whole body just gets involved in the whole thing,\" he laughs. \"You have to think about that when you're creatin' the music-you're not just creatin' the music for people to sit back and listen, 'Oh, that's all good and that's bad.' You need people to shake a leg.\" \n\nAs they listen at home and shake legs to OUR MUSIC, listeners will also be swept up with the headiness of Burning Spear's message. The political statements are still there, most obviously in the continued references to Marcus Garvey (\"One Marcus\" and \"Little Garvey\"). \n\nBut OUR MUSIC also contains deeper ideas that penetrate quietly, subtly into the mind before they reach clarity. The bouncy \"Friends\" asks rather simplistically, \"Are you my friend, my neighbor or my enemy?/Who are you? Who are you?\" On further reflection, it's obvious that the question is a complex one about societal roles and provocative self-evaluation. \"Together\" recalls the image of African slaves, shackled together at the ankles, while suggesting that contemporary blacks can still link together figuratively at the elbow in the continued quest for equality. And \"Fix Me\" embraces the power and essence of love, which Burning Spear sees as the ultimate goal of humanity. \n\n\"Love,\" he says, \"is a harmony thing, it's a communication. Love is a link.\" \n\nBurning Spear's link is a pure one in 2006. Unfettered by someone else's record company, still linked to the roots of reggae and to the ideals of its forefathers, OUR MUSIC points to a better world for those who are oppressed, and for those who simply believe a better world is possible. \n\n\"Music,\" Burning Spear maintains, \"is a very important thing. We have to remember that no force is stronger than the music.\" <a href=\"https://www.last.fm/music/Burning+Spear\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
