{"artist":{"name":"Capleton","mbid":"93dda03d-c1d3-42c2-80b0-fa71bc20262b","url":"https://www.last.fm/music/Capleton","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ad6b1b12c7f14ec789b8b803cde2d5f4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ad6b1b12c7f14ec789b8b803cde2d5f4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ad6b1b12c7f14ec789b8b803cde2d5f4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad6b1b12c7f14ec789b8b803cde2d5f4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad6b1b12c7f14ec789b8b803cde2d5f4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad6b1b12c7f14ec789b8b803cde2d5f4.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"296576","playcount":"2575996"},"similar":{"artist":[{"name":"Sizzla","url":"https://www.last.fm/music/Sizzla","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9c86124fef764d7aa0ca257a775bf257.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9c86124fef764d7aa0ca257a775bf257.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9c86124fef764d7aa0ca257a775bf257.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c86124fef764d7aa0ca257a775bf257.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c86124fef764d7aa0ca257a775bf257.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c86124fef764d7aa0ca257a775bf257.png","size":""}]},{"name":"Anthony B","url":"https://www.last.fm/music/Anthony+B","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d8ea846b893f45ab8d04f58d0ebe435f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d8ea846b893f45ab8d04f58d0ebe435f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d8ea846b893f45ab8d04f58d0ebe435f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d8ea846b893f45ab8d04f58d0ebe435f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d8ea846b893f45ab8d04f58d0ebe435f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d8ea846b893f45ab8d04f58d0ebe435f.png","size":""}]},{"name":"Jah Mason","url":"https://www.last.fm/music/Jah+Mason","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/da787aaabef74a78801adbd52d6a2905.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/da787aaabef74a78801adbd52d6a2905.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/da787aaabef74a78801adbd52d6a2905.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/da787aaabef74a78801adbd52d6a2905.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/da787aaabef74a78801adbd52d6a2905.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/da787aaabef74a78801adbd52d6a2905.png","size":""}]},{"name":"Buju Banton","url":"https://www.last.fm/music/Buju+Banton","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ef973a8c9bdc4643bd3c401c81a9c6e9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ef973a8c9bdc4643bd3c401c81a9c6e9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ef973a8c9bdc4643bd3c401c81a9c6e9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ef973a8c9bdc4643bd3c401c81a9c6e9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ef973a8c9bdc4643bd3c401c81a9c6e9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ef973a8c9bdc4643bd3c401c81a9c6e9.png","size":""}]},{"name":"Richie Spice","url":"https://www.last.fm/music/Richie+Spice","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c9916daace394ff0b6796421a562519e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c9916daace394ff0b6796421a562519e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c9916daace394ff0b6796421a562519e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9916daace394ff0b6796421a562519e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9916daace394ff0b6796421a562519e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c9916daace394ff0b6796421a562519e.png","size":""}]}]},"tags":{"tag":[{"name":"reggae","url":"https://www.last.fm/tag/reggae"},{"name":"dancehall","url":"https://www.last.fm/tag/dancehall"},{"name":"ragga","url":"https://www.last.fm/tag/ragga"},{"name":"jamaica","url":"https://www.last.fm/tag/jamaica"},{"name":"roots","url":"https://www.last.fm/tag/roots"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Capleton/+wiki"}},"published":"19 Jul 2006, 10:34","summary":"King Shango, King David, The Fireman and The Prophet.\n\nA wise man once said that a prophet is not without honour save in his own country and so it has been with Capleton. While the veteran DJ's words and works long ago earned him the title of \"The Prophet\", the respect and honor that should rightfully be his have been a long time coming. \"Anytime you try to uplift righteousness and upliftment of the people them, then you ah go get a fight\", says the hottest entertainer in the worldwide reggae fraternity. <a href=\"https://www.last.fm/music/Capleton\">Read more on Last.fm</a>","content":"King Shango, King David, The Fireman and The Prophet.\n\nA wise man once said that a prophet is not without honour save in his own country and so it has been with Capleton. While the veteran DJ's words and works long ago earned him the title of \"The Prophet\", the respect and honor that should rightfully be his have been a long time coming. \"Anytime you try to uplift righteousness and upliftment of the people them, then you ah go get a fight\", says the hottest entertainer in the worldwide reggae fraternity. \"Bob Marley come do it and them fight him. And when Bob Marley dead, that's when they start to endorse him. I already aware of this, I am not unaware. So I know the more them fight I is the more I get stronger\" In the fast-moving world of dancehall reggae, fame and success are hard to obtain and easy to lose. Fans can be fickle, and trends change in the blink of an eye, leaving most entertainers with painfully short career spans. Only a rare few can remain relevant from year to year, holding their audience's attention and leaving them crying for more. His lyrics are deep, precise, and thoughtful. His stage shows are nothing less than dynamic, explosive performances. But his remarkable staying power and longevity may be Capleton's greatest gift.\n\nBorn Clifton George Bailey III on April 13, 1967, in the rural parish of St. Mary, Capleton earned his future stage name from friends who were so impressed with his sharp reasoning skills that they named him after the most famous lawyer in town. From a tender young age, he was a lover of the traveling sound systems, sneaking out at night to catch the vibes until dawn. But it wasn't until he turned 18 and moved to Kingston that he was able to realize his destiny.\n\nIt was Stewart Brown, owner of a Toronto-based sound called African Star, who gave the untested artist his first break, flying him to Canada for a stage show alongside giants like Ninjaman and Flourgon. The audience poured out their appreciation, and he never looked back. When Capleton first burst on the scene in the late 1980s, the dancehall was a very different place than it is today. Slackness and gun talk were the order of the day. This bright promising newcomer announced his arrival with a string of hit songs from \"Bumbo Red\" to \"Number One on the Look Good Chart\" and \"Lotion Man.\" Everything he touched hit the sound-good charts, and the youthful artist with the nimble vocabulary and hardcore voice quickly established himself as one of dancehall's most reliable hitmakers. But even he could not have predicted that eleven years later, at the start of the new millennium, he would be dancehall's ruling voice.\n\n\"I think the people dem see say me really deserve that because of the amount of years me put in,\" Capleton says, \"and we never really bow and we still hold the faith. We stand up for whatever we a say. Yeah and we really work for it. And them say by your works, a so you get your pay. The people them see the amount of fight me face and the whole heap of accusation. And me still never give up\"\n\nWhen he dropped the tune \"Alms House\" in 1992, Capleton established himself as more than an entertainer but as a guiding light of righteousness through music. \"United we stand and divided we fall,\" he sang for the benefit of his fans and dancehall comrades. \"Nuff of them nah go know themself till them back against the wall.\" A few years later he came back with yet another antidote to the clashing and rivlary that had taken hold of the dancehall business. \"Music is a mission,\" he reminded his fellow artists, \"not a competition. Some man use the music to cause confusion.\" The path of this dancehall Prophet was clearly established in 1994 with a string of songs that declared his newfound faith in Rastafari. \"INI sight up the light and see say really, yunno, Rasta is real,\" he recalls. \"founder of the world, because Rasta did come set the trend. Y'unnerstand. Rasta is life.\"\n\nThe first words of his mega-hit \"Dis The Trinity\" made it plain that the DJ had experienced some kind of revelation. \"I was once lost but now I'm found,\" he stated, \"Selassie I live every time.\" Capleton became a strong advocate of the teaching of the Jamaican National Hero, Marcus Mosiah Garvey, founder of the Universal Negro Improvement Association and advocate of universal black repatriation. \"Babylon rewarded us with hatred for our love,\" he declares. \"They taught us to rape, steal and kill. For instance, they stole our literature and taught it back to us in a different manner so as to infiltrate our minds with foolishness and other misconceptions. Now we as black men do not see ourselves as prince and prophets, but as punks and guys. Our women do not see themselves as queens, princesses or empresses anymore, but as harlots and concubines.\" The only solution, as Bob Marley advocated, is to emancipate oneself from mental slavery.\n\n\"Over the years INI as a nation and a people, them no really teach INI nuttin' bout INI black self. You know I mean? Them teach INI them give we European philosophy. So INI and some other youths a try emerge now, we ask certain question and we ask fi certain things. Caw we know say an institute, or in a college, or in a certain organization we need we Ethiopian curriculum, we need the black man thing. We need to know about weself. Becaw the prophet Marcus Garvey did show we say, A nation without no knowledge of them own history is like a tree without a root. And if you don't know where you're coming from, you're not gonna know where you're going.\"\n\nEven as he uplifts the black race, Capleton always makes a point of clarifying that he does not seek to alienate any race. \"We are not being racial nor prejudiced star,\" he says. \"Becaw we know Jah is for everyone. But where history and prophesy in concerned, that is our witness and we have to be ourself, and we cannot hide from the truth. Caw we woulda be a traitor and a sellout to ourself. And you cannot sell out yourself.\"\n\nSoon thereafter came the song \"Tour\" a blazing state of the dancehall report written in the weeks following the slaying of Panhead and Dirtsman, two of Capleton's fellow artists. That song not only became an anthem of the roots revival within the dancehall, but a hip hop flavored remix of that song hit the Billboard charts, opening up a huge new audience to Capleton's messages of righteousness.\n\nThere followed a relationship with Def Jam records, who released two Capleton albums, Prophecy and I-Testament, which featured memorable collaborations with rap stars like Method Man and Q-Tip. Both records were warmly accepted by the international audience, but as the millennium drew to a close, Capleton sensed that it was time to return to his core audience. He had work to do. \"I have to be myself, right? And I only can be me,\" he reasons. \"So whichever way fi make me be me, I work with dat. Y'understand.\"\n\nCapleton is now at the height of his powers. 1999 and 2000 have brought a ceaseless string of sound system favorite and dancehall chart toppers like the anti-violence anthem \"Jah Jah City\" and \"Good In Her Clothes,\" a message of respect for the sisters who carry themselves like Empresses rather than. But even as he completes his mission of upliftment, Capleton has had many critics. One of his biggest hits, in fact, is addressed the naysayers in the press and the ivory towers of power. \"Critics won't leave I alone,\" chats the Prophet. \"They say they can't take the fire weh me put pon Rome\"\n\nMany of Capleton's songs \"and most of his critics\" make mention of this blazing fire. Capleton hopes to clear up the confusion once and for all. \"Is not really a physical fire. Is really a spiritual fire, and a wordical fire, and a musical fire. You see the fire is all about a livity. But is people get it on the wrong term. People get confused.So when a man say \"more fire\" him think that mean say you fi go light the cane field or go light the church.\" Fire, Capleton explains, is a way of reminding one's brother that they are going astray. \"That way a man know say him doing something wrong. That even give him the urge to know say Yo check up on yourself. What you're doing is not right, or else him would not say \"Fire fi dat,\" or \"Burn dat\" or \"More fire.\"  \"If we go check it back now,\" he continues, \"fire is for the purification of earth, anyhow you check it. This earth itself have to even emerge from the literal fire also, which is the volcanic activity, we a talk bout lava. The hottest element to rise us in the morning is the sun. The water cleanse, but it's still the support from the fire that burn the water, burn out of the bacteria so the water coulda heal we fi cleanse. The herb heal, but it's still the fire fi burn the herb so the herb coulda heal we also.\"\n\n{Bio is courtesy of Rob Kenner} www.vprecords.com <a href=\"https://www.last.fm/music/Capleton\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
