{"artist":{"name":"Cachao","mbid":"d6060786-dac7-4101-80f1-8a10c81d0a7a","url":"https://www.last.fm/music/Cachao","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/afc4994800db4f5ea23b42d333de9b5b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/afc4994800db4f5ea23b42d333de9b5b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/afc4994800db4f5ea23b42d333de9b5b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/afc4994800db4f5ea23b42d333de9b5b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/afc4994800db4f5ea23b42d333de9b5b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/afc4994800db4f5ea23b42d333de9b5b.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"83739","playcount":"369553"},"similar":{"artist":[{"name":"Ray Barretto","url":"https://www.last.fm/music/Ray+Barretto","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/44ea1ec7f61f43b59e01f84c03e8be61.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/44ea1ec7f61f43b59e01f84c03e8be61.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/44ea1ec7f61f43b59e01f84c03e8be61.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44ea1ec7f61f43b59e01f84c03e8be61.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44ea1ec7f61f43b59e01f84c03e8be61.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/44ea1ec7f61f43b59e01f84c03e8be61.png","size":""}]},{"name":"Tito Puente","url":"https://www.last.fm/music/Tito+Puente","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ec1fe05eb9ff42bf922a5a583e1fc734.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ec1fe05eb9ff42bf922a5a583e1fc734.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ec1fe05eb9ff42bf922a5a583e1fc734.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec1fe05eb9ff42bf922a5a583e1fc734.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec1fe05eb9ff42bf922a5a583e1fc734.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ec1fe05eb9ff42bf922a5a583e1fc734.png","size":""}]},{"name":"Eddie Palmieri","url":"https://www.last.fm/music/Eddie+Palmieri","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e21da2d0246e4b3e8a83c700add41fe5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e21da2d0246e4b3e8a83c700add41fe5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e21da2d0246e4b3e8a83c700add41fe5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e21da2d0246e4b3e8a83c700add41fe5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e21da2d0246e4b3e8a83c700add41fe5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e21da2d0246e4b3e8a83c700add41fe5.png","size":""}]},{"name":"Mongo Santamaria","url":"https://www.last.fm/music/Mongo+Santamaria","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3b364324e84746a7bb3131b2cc02f3e7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3b364324e84746a7bb3131b2cc02f3e7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3b364324e84746a7bb3131b2cc02f3e7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3b364324e84746a7bb3131b2cc02f3e7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3b364324e84746a7bb3131b2cc02f3e7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3b364324e84746a7bb3131b2cc02f3e7.png","size":""}]},{"name":"Rubén González","url":"https://www.last.fm/music/Rub%C3%A9n+Gonz%C3%A1lez","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9687b88280334e778f8cadfaa0e8ca33.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9687b88280334e778f8cadfaa0e8ca33.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9687b88280334e778f8cadfaa0e8ca33.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9687b88280334e778f8cadfaa0e8ca33.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9687b88280334e778f8cadfaa0e8ca33.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9687b88280334e778f8cadfaa0e8ca33.png","size":""}]}]},"tags":{"tag":[{"name":"latin","url":"https://www.last.fm/tag/latin"},{"name":"cuban","url":"https://www.last.fm/tag/cuban"},{"name":"latin jazz","url":"https://www.last.fm/tag/latin+jazz"},{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"salsa","url":"https://www.last.fm/tag/salsa"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Cachao/+wiki"}},"published":"03 Dec 2006, 17:55","summary":"Israel \"Cachao\" López (September 14, 1918 – March 22, 2008) was a Cuban double bassist and composer who helped popularize mambo in the United States in the early 1950s.\nHe has a star on the Hollywood Walk of Fame, won several Grammy Awards, and has been described as \"the inventor of the mambo\". He is considered a master of descarga (Latin jam sessions).\n\nCachao was born in 1918 in Havana, into a family of musicians, many of them bassists—around forty or more in his extended family. <a href=\"https://www.last.fm/music/Cachao\">Read more on Last.fm</a>","content":"Israel \"Cachao\" López (September 14, 1918 – March 22, 2008) was a Cuban double bassist and composer who helped popularize mambo in the United States in the early 1950s.\nHe has a star on the Hollywood Walk of Fame, won several Grammy Awards, and has been described as \"the inventor of the mambo\". He is considered a master of descarga (Latin jam sessions).\n\nCachao was born in 1918 in Havana, into a family of musicians, many of them bassists—around forty or more in his extended family.\nAs an 8-year-old bongo player, he joined a children's septet that included a future famous singer and bandleader, Roberto Faz. A year later, already on double bass, he provided music for silent movies in his neighborhood theater, in the company of a pianist who would become a true superstar, the great cabaret performer Ignacio Villa, known as Bola de Nieve.\nHis parents made sure he was classically trained, first at home and then at a conservatory. In his early teens he was already playing contrabass with the Orquesta Filarmónica de La Habana, under the baton of guest conductors including Herbert von Karajan, Igor Stravinsky and Heitor Villa-Lobos. He played with the orchestra from 1930 to 1960.\nHe played the acoustic bass with his late, older brother, the multi-instrumentalist/composer Orestes López, who was known as \"Macho\". The brothers composed literally thousands of songs together and were a major influence on Cuban music from the 1930s to the 1950s. They introduced the nuevo ritmo (\"new rhythm\") in the late 1930s, which transformed the danzón by introducing African rhythms into Cuban music, which led to mambo. They co-wrote the danzón \"Mambo\" which was called the \"Mother of all Mambos\" by Cuban writer G. Cabrera Infante.\nA possibly more important move took place in 1957, when Cachao gathered a group of musicians in the early hours of the morning, energized from playing gigs at Havana's popular nightclubs, to jam in front of the mikes of a recording studio. The resulting descargas, known to music aficionados worldwide as Cuban jam sessions, revolutionized Afro-Cuban popular music. Under Cachao's direction, these masters improvised freely in the manner of jazz, but their vocabulary was Cuba's popular music. This was the model that would make live performances of Afro-Cuban based genres, from salsa to Latin jazz, so incredibly hot.\nThese descargas were released in 1957 by the Panart label under the title \"Descargas: Cuban Jam Sessions In Miniature.\" They have been named by many critics as one the most essential contributions to the Latin-jazz genre, including being cited by the book \"1,000 Recordings To Hear Before You Die.\"\nIn the early 1960s, according to the documentary film La Época, Cachao was one of two of the most in-demand bassists in New York City (the other being Alfonso \"El Panameño\" Joseph, who was the bassist of legendary Cuban tres player Arsenio Rodríguez for eight years until Arsenio's death in December 1970). Joseph and López substituted for each other over a span of five years, performing at New York City clubs and venues such as the Palladium Ballroom, The Roseland, The Birdland, Havana San Juan, and Havana Madrid. Mentioned in the film, La Época, while Cachao was performing with Machito's orchestra in New York, Joseph was recording and performing with Cuban conga player Cándido Camero. When Joseph left Cándido's band to work with Charlie Rodríguez and Johnny Pacheco, it was Cachao who took his place in Cándido's band. Cachao was recently scheduled to be interviewed by Executive Producer Josue Joseph of the film in New Haven, CT where Cachao and Palladium-era dancer Cuban Pete were scheduled to perform at Yale University. The film is about the evolution of Latin music and dance during the Palladium-era to present day, and Cachao was scheduled to discuss his contribution of the mambo rhythm, which he derived from Arsenio Rodríguez, documented in the film.\nFor a while, he had two distinct musical personae. In the New York salsa scene he was revered as a music god, with homage concerts dedicated to him, and records of his music produced by Cuban-music collector René López. In Miami, he was an ordinary working musician who would play quinceañeras and weddings, or back dance bands in the notorious Latin nightclubs of the Miami Vice era.\nIn the '90s, actor Andy García produced the recordings known as Master Sessions and big concerts honoring his legacy. Since then, Cachao became again a household word among Cubans and his reputation continued to grow.\n\nHis nephew, Orlando \"Cachaíto\" López became one of the mainstays of the famed Buena Vista Social Club group.\n\nIn July 2006, three young artists from Miami owners of Leiter Gallery, Sinuhe Vega, Jesús Rojas Torres and Ben Abounassif showcased the work by Miami Herald photographer Carl P. Juste with an exhibition entitled \"Cachao & Friends\" as a living tribute to the Cuban master.\nCachao played and/or recorded with many top instrumentalists and vocalists, artists such as Antonio Arcaño, Niño Rivera, Pedro \"Peruchín\" Jústiz, Guillermo Barreto, Alejandro \"El Negro\" Vivar, Tata Güines, Arsenio Rodríguez, Eugenio \"Totico\" Arango, Carlos \"Patato\" Valdés, Juan \"Curba\" Dreke, Virgilio Martí, Lino Frías of the famed Sonora Matancera, Mario \"Papaíto\" Muñoz (also of La Sonora Matancera), Gonzalo Fernández, Julito Collazo, Marcelino Guerra, Alfredo \"Chocolate\" Armenteros, Félix \"Pupy\" Legarreta, Bebo Valdés, Celia Cruz, Rolando Laserie, Tito Puente, Tito Rodríguez, Charlie Palmieri, Eddie Palmieri, Barry Rogers, Manny Oquendo, Andy González, Paquito D'Rivera, Nelson González, Willie Colón, and Willy Chirino, and his music has been featured in movies such as The Birdcage and on the Grand Theft Auto: Vice City soundtrack. Andy García produced two documentaries about this music, Cachao ... Como Su Ritmo No Hay Dos (\"With A Rhythm Like No Other\") (1993) and Cachao: Uno Más, which premiered in April 2008 at the San Francisco International Film Festival. The inspiration for Cachao: Uno Más, made by San Francisco State University's DOC Film Institute, came largely from a concert Cachao played at Bimbo's 365 Club in San Francisco, and the film's premiere was followed by a tribute concert with the John Santos Band at Yoshi's Jazz Club SF.\nLópez died on the morning of March 22, 2008 in Coral Gables, Florida, at the age of 89. He died from complications resulting from kidney failure.\nHis recording of \"La Guajira\" was used in the film \"The Birdcage\" (1996).\n\nLópez has won several Grammy Awards for both his own work and his contributions on albums by Latin music stars, including Gloria Estefan. In 1994, he won a Grammy for Master Sessions Volume 1. In 2003, he won a Latin Grammy for Best Traditional Tropical Latin Album together with Bebo Valdés and Carlos \"Patato\" Valdés for El Arte del Sabor.\nOn June 11, 2006, López was honored by Union City, New Jersey with a star on the Walk of Fame at Union City's Celia Cruz Park.\nLópez won a further Grammy in 2005, again for his own work, ¡Ahora Sí!.\nIn 2012, a posthumously released album, The Last Mambo, won the Grammy Award in the Best Tropical Latin album category.\n <a href=\"https://www.last.fm/music/Cachao\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
