{"artist":{"name":"Catherine Howe","mbid":"7e92079b-6d93-4c8d-87bd-364c3a5d2bc3","url":"https://www.last.fm/music/Catherine+Howe","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b5add28d66d64a989314a96c4db6043e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b5add28d66d64a989314a96c4db6043e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b5add28d66d64a989314a96c4db6043e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b5add28d66d64a989314a96c4db6043e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b5add28d66d64a989314a96c4db6043e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b5add28d66d64a989314a96c4db6043e.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"3538","playcount":"47413"},"similar":{"artist":[{"name":"Ruthann Friedman","url":"https://www.last.fm/music/Ruthann+Friedman","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/63ba78a5e9074d18a99da123c95468b1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/63ba78a5e9074d18a99da123c95468b1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/63ba78a5e9074d18a99da123c95468b1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/63ba78a5e9074d18a99da123c95468b1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/63ba78a5e9074d18a99da123c95468b1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/63ba78a5e9074d18a99da123c95468b1.png","size":""}]},{"name":"Shelagh McDonald","url":"https://www.last.fm/music/Shelagh+McDonald","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1a9e347610ba4dd9ac6f69a005808afa.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1a9e347610ba4dd9ac6f69a005808afa.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1a9e347610ba4dd9ac6f69a005808afa.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1a9e347610ba4dd9ac6f69a005808afa.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1a9e347610ba4dd9ac6f69a005808afa.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1a9e347610ba4dd9ac6f69a005808afa.png","size":""}]},{"name":"Wizz Jones","url":"https://www.last.fm/music/Wizz+Jones","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3f8ffd482cad41679de1dce9a22bc018.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3f8ffd482cad41679de1dce9a22bc018.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3f8ffd482cad41679de1dce9a22bc018.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f8ffd482cad41679de1dce9a22bc018.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f8ffd482cad41679de1dce9a22bc018.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3f8ffd482cad41679de1dce9a22bc018.png","size":""}]},{"name":"Emmanuelle Parrenin","url":"https://www.last.fm/music/Emmanuelle+Parrenin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e022b9d381a945568a19720aacf1165b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e022b9d381a945568a19720aacf1165b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e022b9d381a945568a19720aacf1165b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e022b9d381a945568a19720aacf1165b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e022b9d381a945568a19720aacf1165b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e022b9d381a945568a19720aacf1165b.png","size":""}]},{"name":"Andy Roberts","url":"https://www.last.fm/music/Andy+Roberts","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8fa87e8deaac4e768bef55756fcdc639.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8fa87e8deaac4e768bef55756fcdc639.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8fa87e8deaac4e768bef55756fcdc639.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8fa87e8deaac4e768bef55756fcdc639.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8fa87e8deaac4e768bef55756fcdc639.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8fa87e8deaac4e768bef55756fcdc639.png","size":""}]}]},"tags":{"tag":[{"name":"folk","url":"https://www.last.fm/tag/folk"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"chillout","url":"https://www.last.fm/tag/chillout"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Catherine+Howe/+wiki"}},"published":"31 Jan 2007, 20:57","summary":"Catherine Howe is a female English singer-songwriter. She began a successful acting career in the late 1960s, though has since gained a cult following on the folk music scene ('one of the great unrecognised voices...' - Record Collector 2007) as one of the highest-regarded performers of her generation ('Catherine Howe was a Kate Bush before her time...' - Observer Music 2007) Catherine is an Ivor Novello award winning songwriter who has earned top-class reviews in all major music periodicals both in the UK and the US <a href=\"https://www.last.fm/music/Catherine+Howe\">Read more on Last.fm</a>","content":"Catherine Howe is a female English singer-songwriter. She began a successful acting career in the late 1960s, though has since gained a cult following on the folk music scene ('one of the great unrecognised voices...' - Record Collector 2007) as one of the highest-regarded performers of her generation ('Catherine Howe was a Kate Bush before her time...' - Observer Music 2007) Catherine is an Ivor Novello award winning songwriter who has earned top-class reviews in all major music periodicals both in the UK and the US, including Folk Album of the Year from The Sunday Times. Following a gap of more than two decades, during which she raised her daughter and gained a first-class honours degree, Catherine Howe has returned to song-writing and recording, also giving occasional performances.\n\nHowe trained as an actress at the Corona Drama School in London. She commenced a successful acting career in the late 1960s, performing in contemporary television dramas such as Z Cars, The Wednesday Play, Doctor Who and Dixon of Dock Green. Howe went on to appear in Barney Platts-Mill's film Private Road. In 1970, Howe met Andrew Cameron Miller, an executive at Reflection, a subsidiary of CBS Records, and as a result recorded her debut album What A Beautiful Place at Trident Studios in London, in February 1971. Miller paired Howe with Bobby Scott, an American pianist and record producer who had previously co-written the the Hollies' He Ain't Heavy, He's My Brother. However, Reflection ceased to trade when the album was on the point of release, and as a result it remained largely unheard until it was reissued in 2007 on the Numero label. The re-release met with universal critical acclaim; extraordinarily, for a debut album, gaining a five-star review from Observer Music ('could be Dusty Springfield covering Joni Mitchell...'). This is even more remarkable considering the master tapes were by then lost; with the re-recording made from an original source copy. The vinyl print remains the holy grail of record collectors, selling for over £1200-. Howe featured on soundtrack recordings in the UK and Europe throughout the 1970s, and provided the lead vocal for Ennio Morricone's theme song Un genie, deux associes, une cloche OST - 1976. Catherine worked with the Italian jazz musician Piero Piccioni, recording two songs for his 1972 film God Under the Skin and singing in an Italian TV broadcast with Piccioni two years later. Howe's second LP Harry was released in the UK in 1975 on RCA, for which the title track received an Ivor Novello award (only the second female recording artist to achieve this). Such is its continued popularity that Harry remains available as a mobile phone ring-tone. Also in 1975, Howe appeared on film as the singer during the title credits of the notorious British sex farce, Jim Atkinson's Can You Keep It Up For A Week? The original song, crafted by the Ted Dicks/Hazel Adair team, seemed incongruous against the slap-stick comedy. RCA released a follow-up album, Silent Mother Nature in 1976, winning Folk Album of the Year from the Sunday Times.[citation needed] A single was released called Until The Morning Comes written by Scottish singer/guitarist Dave Kelly and Ray McRiner, and was performed on LWT's Supersonic. The following year, the title tracks of both RCA LPs were re-released (together with the aforementioned single) on the EP The Truth of the Matter and was one of the top 75 selling EPs of 1977.[citation needed] Throughout that year Howe produced and sang the songs for BBC's That's Life. Howe 's fourth album came two years later, with Dragonfly Days, released on Ariola Records. Ariola also released singles by Howe prior to and following the album, some of which are not included on the LP, and promoted as far afield as South America; enough single records to fill another album. One was with producer Mike Batt, Howe's self-penned \"Sit Down And Think Again\", another was a cover of Carole King's Goin' Back produced by Pip Williams. Dragonfly Days extended Howe 's style across a variety of genre - but to date remains the only record not reissued on CD. In 1979, the BBC filmed Rhythm on 2: Catherine Howe and Judie Tzuke, a live concert at Ipswich's Corn Exchange. The following year, again for the BBC, Howe featured on both the Jeremy Taylor and Sacha Distel shows.\n\nNone of Howe's albums sold in large amounts at the time, and after Dragonfly Days, she decided to retire from the music business. Howe explains this chapter in her own words on the tradmusic.com website: \"Despite promotion and tours with Andy Fairweather-Low, Chris de Burgh, David Soul and later with Randy Edleman, the albums and singles didn't sell enough. I thought it was because of me, but it was as much (I've since learned) because they weren't in the shops to buy. To remedy this it was suggested that maybe I should write 'country and western', maybe I should change my hair, maybe wear black leather. So the music business, which I loved, and I parted company. Like a bad marriage, some damage was sustained before separation took place...\" There was some activity in the 1980s with a re-issue of the Harry single in 1984 (on public demand with the birth of Prince Harry).[citation needed] A year later, Howe contributed two songs to the Sounds of Yorkshire LP: a re-recording of Lucy Snow (Lucy Snowe) from the Silent Mother Nature album; and a new piece in a traditional vein, Yorkshire Hills. In 1989 Howe had a daughter, Jenny, and later earned a first-class degree in History and Religion from the Open University. She is currently working on a book on the life of the 19th century secularist George Holyoake as well as continuing with her song-writing. In 2002 Howe returned to recording, resulting in a new CD, her fifth: Princelet Street. This coincided with the launch of an official website and preceded the reissue of her 1970s albums What a Beautiful Place (with the Numero label), Harry (with BGO) and Silent Mother Nature (with BGO). Of Princelet Street, Howe wrote: \"My great-grandmother Susannah Constantine was born on Princelet Street in 1851, her mother worked as a silk winder, her father as a fancy comb maker. Lots of my family lived in or near the City of London in the early 1800s, and even before I knew this I used to go city walking there as a girl because it felt like coming home. Princelet Street the album is inspired by the street and a sense of family, past and present, and as I enjoyed writing and recording its songs I hope you'll enjoy hearing them...\" <a href=\"https://www.last.fm/music/Catherine+Howe\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
