{"artist":{"name":"Charley Patton","mbid":"c71b4f57-29da-4bf2-bccb-9dc81cd2d905","url":"https://www.last.fm/music/Charley+Patton","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/21f37c12bdd54cb7958d620b87aae8b2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/21f37c12bdd54cb7958d620b87aae8b2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/21f37c12bdd54cb7958d620b87aae8b2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21f37c12bdd54cb7958d620b87aae8b2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21f37c12bdd54cb7958d620b87aae8b2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/21f37c12bdd54cb7958d620b87aae8b2.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"121137","playcount":"1006961"},"similar":{"artist":[{"name":"Bukka White","url":"https://www.last.fm/music/Bukka+White","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d5ea7971699b43c890d32126eee3ae27.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d5ea7971699b43c890d32126eee3ae27.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d5ea7971699b43c890d32126eee3ae27.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d5ea7971699b43c890d32126eee3ae27.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d5ea7971699b43c890d32126eee3ae27.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d5ea7971699b43c890d32126eee3ae27.png","size":""}]},{"name":"Blind Willie Johnson","url":"https://www.last.fm/music/Blind+Willie+Johnson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7f57ca086906457e9d06c6e0719f4bc3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7f57ca086906457e9d06c6e0719f4bc3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7f57ca086906457e9d06c6e0719f4bc3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f57ca086906457e9d06c6e0719f4bc3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f57ca086906457e9d06c6e0719f4bc3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7f57ca086906457e9d06c6e0719f4bc3.png","size":""}]},{"name":"Blind Lemon Jefferson","url":"https://www.last.fm/music/Blind+Lemon+Jefferson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b00072bbce9e413abf210276905c28d4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b00072bbce9e413abf210276905c28d4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b00072bbce9e413abf210276905c28d4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b00072bbce9e413abf210276905c28d4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b00072bbce9e413abf210276905c28d4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b00072bbce9e413abf210276905c28d4.png","size":""}]},{"name":"Son House","url":"https://www.last.fm/music/Son+House","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/015d0c809c6e47759ebd30b2ae32ab3a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/015d0c809c6e47759ebd30b2ae32ab3a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/015d0c809c6e47759ebd30b2ae32ab3a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/015d0c809c6e47759ebd30b2ae32ab3a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/015d0c809c6e47759ebd30b2ae32ab3a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/015d0c809c6e47759ebd30b2ae32ab3a.png","size":""}]},{"name":"Blind Willie McTell","url":"https://www.last.fm/music/Blind+Willie+McTell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2a57dd2de0344a648af8d53642786646.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2a57dd2de0344a648af8d53642786646.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2a57dd2de0344a648af8d53642786646.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a57dd2de0344a648af8d53642786646.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a57dd2de0344a648af8d53642786646.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2a57dd2de0344a648af8d53642786646.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"delta blues","url":"https://www.last.fm/tag/delta+blues"},{"name":"Classic Blues","url":"https://www.last.fm/tag/Classic+Blues"},{"name":"country blues","url":"https://www.last.fm/tag/country+blues"},{"name":"folk","url":"https://www.last.fm/tag/folk"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Charley+Patton/+wiki"}},"published":"21 Aug 2006, 14:02","summary":"Charley Patton (between April 1887 and 1891 – April 28, 1934), also known as Charlie Patton, was an American Delta blues musician. He is considered by many to be the \"Father of the Delta Blues\", and is credited with creating an enduring body of American music and personally inspiring just about every Delta blues man (Palmer, 1995). Musicologist Robert Palmer considers him among the most important musicians that America produced in the twentieth century. <a href=\"https://www.last.fm/music/Charley+Patton\">Read more on Last.fm</a>","content":"Charley Patton (between April 1887 and 1891 – April 28, 1934), also known as Charlie Patton, was an American Delta blues musician. He is considered by many to be the \"Father of the Delta Blues\", and is credited with creating an enduring body of American music and personally inspiring just about every Delta blues man (Palmer, 1995). Musicologist Robert Palmer considers him among the most important musicians that America produced in the twentieth century. Many sources, including musical releases and his gravestone, spell his name “Charley” even though the musician himself spelled his name \"Charlie\".\n\nPatton was born in Hinds County, Mississippi, near the town of Edwards, and lived most of his life in Sunflower County in the Mississippi Delta. Some sources say he was born May 1, 1891, but there is some debate about this, and the years 1887 and 1894 have also been suggested.\nPatton's parentage and race have been the subject of debate. Although born to Bill and Annie Patton, locally he was regarded as having been fathered by former slave Henderson Chatmon, many of whose other children also became popular Delta musicians both as solo acts and as members of groups such as the Mississippi Sheiks. Biographer John Fahey describes Patton as having \"light skin and Caucasian features.\" Though Patton was considered African-American, because of his light complexion there have been rumors that he was Mexican, or possibly a full-blood Cherokee, a theory endorsed by Howlin' Wolf. In actuality, Patton was a mix of white, black, and Cherokee (one of his grandmothers was a full-blooded Cherokee). Patton himself sang in \"Down the Dirt Road Blues\" of having gone to \"the Nation\" and \"the Territo'\"—meaning the Cherokee Nation portion of the Indian Territory (which became part of the state of Oklahoma in 1907), where a number of Black Indians tried unsuccessfully to claim a place on the tribal rolls and thereby obtain land.\nIn 1900, his family moved 100 miles (160 km) north to the legendary 10,000-acre (40 km2) Dockery Plantation sawmill and cotton farm near Ruleville, Mississippi. It was here that both John Lee Hooker and Howlin' Wolf fell under the Patton spell as well as Willie Brown, Tommy Johnson, and Fiddlin' Joe Martin. It was also here that Robert Johnson played and was given his first guitar. At Dockery, Charley fell under the tutelage of Henry Sloan, who had a new, unusual style of playing music which today would be considered very early blues. Charley followed Henry Sloan around, and, by the time he was about 19, had become an accomplished performer and songwriter in his own right, having already composed \"Pony Blues,\" a seminal song of the era.\nRobert Palmer describes Patton as a \"jack-of all-trades bluesman\" who played \"deep blues, white hillbilly songs, nineteenth-century ballads, and other varieties of black and white country dance music with equal facility\". He was extremely popular across the Southern United States and also performed annually in Chicago, Illinois and, in 1934, New York City. In contrast to the itinerant wandering of most blues musicians of his time, Patton played scheduled engagements at plantations and taverns. Long before Jimi Hendrix impressed audiences with flashy guitar playing, Patton gained notoriety for his showmanship, often playing with the guitar down on his knees, behind his head, or behind his back. Although Patton was a small man at about 5 foot 5,[8] his gravelly voice was rumored to have been loud enough to carry 500 yards without amplification. Patton's gritty bellowing was a major influence on the singing style of his young friend Chester Burnett, who went on to gain fame in Chicago as Howlin' Wolf.\nPatton settled in Holly Ridge, Mississippi with his common-law wife and recording partner Bertha Lee in 1933. He died on the Heathman-Dedham plantation near Indianola on April 28, 1934 and is buried in Holly Ridge (both towns are located in Sunflower County). Patton's death certificate states that he died of a mitral valve disorder. Bertha Lee is not mentioned on the certificate, the only informant listed being one Willie Calvin. His death was not reported in the newspapers. A memorial headstone was erected on Patton's grave (the location of which was identified by the cemetery caretaker C. Howard who claimed to have been present at the burial) paid for by musician John Fogerty through the Mt. Zion Memorial Fund in July, 1990. The spelling of Patton's name was dictated by Jim O'Neal, who also composed the Patton epitaph.\n\nScreamin' and Hollerin' the Blues: The Worlds of Charley Patton (2001) is a boxed set collecting Patton's recorded works. It also featured recordings by many of his friends and associates. The set won three Grammy Awards in 2003 for Best Historical Album, Best Boxed or Special Limited Edition Package, and Best Album Notes. Another collection of Patton recordings, released under Catfish Records, is titled The Definitive Charley Patton.\nCharley Patton's song \"Pony Blues\" (1929) was included by the National Recording Preservation Board in the Library of Congress' National Recording Registry in 2006. The board selects songs in an annual basis that are \"culturally, historically, or aesthetically significant.\"\nIn 2013 Jack White's Third Man Records teamed up with Document Records to reissue The Complete Recorded Works in Chronological Order of Charley Patton, Blind Willie McTell and The Mississippi Sheiks.\nThe Mississippi Blues Trail placed its first historic marker on Charley Patton's grave in Holly Ridge, Mississippi, in recognition of his legendary status as a bluesman and his importance in the development of the blues in Mississippi. It placed another historic marker at the site where the Peavine Railroad intersects with Highway 446 in Boyle, Mississippi, designating it as a second site related to Patton on the Mississippi Blues Trail. The marker commemorates the original lyrics of Patton's \"Peavine Blues\" that describe the railway branch of Yazoo and Mississippi Valley Railroad, which ran south from Dockery Plantation to Boyle. The marker emphasizes that a common theme of blues songs was riding on the railroad which was seen as a metaphor for travel and escape.\n\nTributes\n\n\"Blind Owl\" Alan Wilson & Canned Heat covered Patton songs \"Pony Blues\", \"Shake It and Break It\" and \"Yellow Bee\".\nBob Dylan dedicated his song \"High Water (For Charley Patton)\", on his 2001 album \"Love and Theft\", to Patton.\nThe Reverend Peyton's Big Damn Band internationally touring American country blues recording/touring artists, fronted by Kentucky Colonel, The Reverend Peyton, produced a tribute recording to Charley Patton: Peyton on Patton, which was released July 19, 2011. The album entered the Billboard Blues Album chart at #7.\nFrench singer-songwriter Francis Cabrel refers to Charley Patton in the song \"Cent Ans de Plus\" on his 1999 album Hors-Saison.\nIndie rock band Gomez recorded a song on their 2006 release How We Operate, entitled \"Charley Patton Songs\".\nThere is a picture of Charley Patton in the recording studio used for The White Stripes' album Icky Thump. It can be seen in the background of the short demo video on their website\nJule Brown recorded an updated arrangement of Patton's \"Green River Blues\", on their 2006 release Smoke and Mirrors.\nRobert Crumb narrated Patton's life in a comic book.\nThe 1980s NYC Punk/Blues band Hi Sheriffs of Blue (which included visual artists Mark Dagley, George Condo and Elliott Sharp) was named after the Patton song \"High Sheriff Blues\".\n\nDiscography\n\nGennett Records, Richmond, Indiana, 1929\n\"Pony Blues\"\n\"Mississippi Boweavil Blues\"\n\"Screamin' And Hollerin' The Blues\"\n\"Down The Dirt Road Blues\"\n\"Banty Rooster Blues\"\n\"Pea Vine Blues\"\n\"It Won't Be Long\"\n\"Tom Rushen Blues\"\n\"A Spoonful Blues\"\n\"Shake It And Break It (But Don't Let It Fall Mama)\"\n\"Prayer Of Death Part 1 & 2\"\n\"Lord I'm Discouraged\"\n\"I'm Goin' Home\"\n\nParamount Records, Grafton, Wisconsin, 1929\n\"Going To Move To Alabama\"\n\"Elder Greene Blues\"\n\"Circle Round The Moon\"\n\"Devil Sent The Rain Blues\"\n\"Mean Black Cat Blues\"\n\"Frankie And Albert\"\n\"Some These Days I'll Be Gone\"\n\"Green River Blues\"\n\"Hammer Blues\"\n\"Magnolia Blues\"\n\"When Your Way Gets Dark\"\n\"Heart Like Railroad Steel\"\n\"Some Happy Day\"\n\"You're Gonna Need Somebody When You Die\"\n\"Jim Lee Blues Part 1\"\n\"Jim Lee Blues Part 2\"\n\"High Water Everywhere Part 1\"\n\"High Water Everywhere Part 2\"\n\"Jesus Is A Dying-Bed Maker\"\n\"I Shall Not Be Moved\"\n\"Rattlesnake Blues\"\n\"Running Wild Blues\"\n\"Joe Kirby\"\n\"Mean Black Moan\"\n\"Farrell Blues\"\n\"Come Back Corrina\"\n\"Tell Me Man Blues\"\n\"Be True Be True Blues\"\n\nParamount Records, Grafton, Wisconsin, 1930\n\"Dry Well Blues\"\n\"Some Summer Day\"\n\"Moon Going Down\"\n\"Bird Nest Bound\"\n\nVocalion Records, New York City, New York, 1934\n\"Jersey Bull Blues\"\n\"High Sheriff Blues\"\n\"Stone Pony Blues\"\n\"34 Blues\"\n\"Love My Stuff\"\n\"Revenue Man Blues\"\n\"Oh Death\"\n\"Troubled 'Bout My Mother\"\n\"Poor Me\"\n\"Hang It On The Wall\"\n\"Yellow Bee\"\n\"Mind Reader Blues\" <a href=\"https://www.last.fm/music/Charley+Patton\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
