{"artist":{"name":"Charley Pride","mbid":"1c1de177-984d-4208-9177-ca94f8776a39","url":"https://www.last.fm/music/Charley+Pride","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f766a108a3034a2886cbc993fbb6df77.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f766a108a3034a2886cbc993fbb6df77.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f766a108a3034a2886cbc993fbb6df77.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f766a108a3034a2886cbc993fbb6df77.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f766a108a3034a2886cbc993fbb6df77.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f766a108a3034a2886cbc993fbb6df77.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"121914","playcount":"839746"},"similar":{"artist":[{"name":"Conway Twitty","url":"https://www.last.fm/music/Conway+Twitty","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2605666eebf14ed4ad35a891e213c46e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2605666eebf14ed4ad35a891e213c46e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2605666eebf14ed4ad35a891e213c46e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2605666eebf14ed4ad35a891e213c46e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2605666eebf14ed4ad35a891e213c46e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2605666eebf14ed4ad35a891e213c46e.png","size":""}]},{"name":"Billie Jo Spears","url":"https://www.last.fm/music/Billie+Jo+Spears","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/db2e468fccde4b188e21365754f39249.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/db2e468fccde4b188e21365754f39249.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/db2e468fccde4b188e21365754f39249.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db2e468fccde4b188e21365754f39249.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db2e468fccde4b188e21365754f39249.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db2e468fccde4b188e21365754f39249.png","size":""}]},{"name":"Barbara Mandrell","url":"https://www.last.fm/music/Barbara+Mandrell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/37f5084537fa441db2f77bad6f41eb8b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/37f5084537fa441db2f77bad6f41eb8b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/37f5084537fa441db2f77bad6f41eb8b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37f5084537fa441db2f77bad6f41eb8b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37f5084537fa441db2f77bad6f41eb8b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37f5084537fa441db2f77bad6f41eb8b.png","size":""}]},{"name":"Jim Reeves","url":"https://www.last.fm/music/Jim+Reeves","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/707e9a9c14a846ec80bfc38c51441811.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/707e9a9c14a846ec80bfc38c51441811.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/707e9a9c14a846ec80bfc38c51441811.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/707e9a9c14a846ec80bfc38c51441811.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/707e9a9c14a846ec80bfc38c51441811.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/707e9a9c14a846ec80bfc38c51441811.png","size":""}]},{"name":"Bobby Bare","url":"https://www.last.fm/music/Bobby+Bare","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a89394935317423388bbd28a58fd9d6e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a89394935317423388bbd28a58fd9d6e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a89394935317423388bbd28a58fd9d6e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a89394935317423388bbd28a58fd9d6e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a89394935317423388bbd28a58fd9d6e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a89394935317423388bbd28a58fd9d6e.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"classic country","url":"https://www.last.fm/tag/classic+country"},{"name":"charley pride","url":"https://www.last.fm/tag/charley+pride"},{"name":"oldies","url":"https://www.last.fm/tag/oldies"},{"name":"male vocalists","url":"https://www.last.fm/tag/male+vocalists"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Charley+Pride/+wiki"}},"published":"26 Dec 2006, 08:20","summary":"Becoming a trailblazing Country Music superstar was an improbable destiny for Charley Pride (born March 18, 1938), especially considering his humble beginnings as a sharecropper’s son on a cotton farm in Sledge, Mississippi.  His unique journey to the top of the music charts includes a tumultuous detour through the world of Negro league, minor league and semi-pro baseball as well as many long years of labor alongside the vulcanic fires of a smelter. <a href=\"https://www.last.fm/music/Charley+Pride\">Read more on Last.fm</a>","content":"Becoming a trailblazing Country Music superstar was an improbable destiny for Charley Pride (born March 18, 1938), especially considering his humble beginnings as a sharecropper’s son on a cotton farm in Sledge, Mississippi.  His unique journey to the top of the music charts includes a tumultuous detour through the world of Negro league, minor league and semi-pro baseball as well as many long years of labor alongside the vulcanic fires of a smelter.  But in the end, with boldness, perseverance and undeniable musical talent, he managed to parlay a series of fortuitous encounters with Nashville insiders into an amazing legacy of hit singles and tens of millions in record sales.  \n\nGrowing up, Charley was exposed primarily to Blues, Gospel and Country music.  His father inadvertently fostered Charley’s love of Country music by tuning the family’s Philco radio to Nashville’s WSM-AM in order to catch Grand Ole Opry broadcasts.  At 14 years of age, Charley purchased his first guitar—a Silvertone from a Sears Roebuck catalog—and taught himself how to play it by listening to the songs that he heard on that radio.  \n\nBy the age of 16, Charley began emerging as a talented baseball player.  He first played organized games in the Iowa State League and then professional games in the Negro American League as a pitcher and outfielder for the Memphis Red Sox.  In 1953, he signed a contract with the Boise Yankees, the Class C farm team of the New York Yankees.  But during that season an injury hampered his pitching.  He was first sent to the Yankees' Class D team in Fond du Lac, Wisconsin and then released.  Over the next several years, Charley rejoined the Memphis Red Sox, moved to the Louisville Clippers and then was traded, along with another player, to the Birmingham Black Barons for a used bus.  He also played for the El Paso Kings and a team in Nogales, Mexico.  Upon rejoining the Memphis Red Sox in 1956 he won 14 games as a pitcher and earned himself a position on the Negro American League All-Star Team.  As an all-star player that year, Charley pitched against a group of major league all-stars that included Willie Mays, Hank Aaron, Al Smith, Gene Baker and Ernie Banks.\n\nBetween ballparks, Charley often passed the time and entertained teammates by singing and playing his guitar on the team bus.  And during these travels he happily joined performers onstage whenever he was given the opportunity.  \n\nIn late 1956 Charley was drafted by Uncle Sam and ordered to report to Fort Chaffee, Arkansas for basic training.  During Christmas leave from basic training, he married his wife Rozene, who he had met earlier in the year while playing baseball in Memphis.  After basic training, he was stationed at Fort Carson, near Colorado Springs, Colorado, where he was assigned to quartermaster duty and the fort’s baseball team.  Upon receiving his discharge from the US Army in early 1958, Charley rejoined the Memphis Red Sox and returned to doggedly pursuing his dream of becoming a major league baseball pitcher.  \n\nIn 1960, Charley moved to Montana to play for the Missoula Timberjacks in the Pioneer League, but ended up working at a smelter operated by the Anaconda Mining Company and playing for its semi-pro baseball team, the East Helena Smelterites.  In 1961, he was invited to try out for the Los Angeles Angels during spring training but found himself heading back home to Helena, Montana after just two weeks.\n\nDuring the first half of the 1960’s, Charley continued to work at the smelter and play baseball for its semi-pro team.  But he also began making a name for himself as a music performer by singing the national anthem at baseball games and performing at honky-tonks and nightclubs in the Helena, Anaconda and Great Falls areas.  Sometimes he performed as a solo artist and other times as a member of a combo or group.\n\nIn 1962, with the help of Tiny Stokes, a local disc jockey, Charley was introduced to Country singers Red Sovine and Red Foley and invited to perform “Heartaches By The Numbers” and “Lovesick Blues” during one of their shows.  This brief initial encounter with Red Sovine would turn out to be crucial in laying the groundwork for Charley’s future music career.\n\nAfter a disastrous 1963 tryout with the New York Mets in Clearwater, Florida it became clear that a major league baseball career was not in the cards.  Charley chose to return to Montana via Tennessee because Red Sovine had told him that if he ever became serious about a singing career and decided to come to Nashville, he should stop by Cedarwood Publishing, the company that booked Sovine’s shows.  \n\nFrom the bus station in Nashville, Charley walked straight over to Cedarwood’s office and by sheer luck ended up meeting Jack Johnson, who had been actively searching for a promising black Country singer.  Johnson made a simply produced recording of Charley performing a couple of songs and then immediately drove him back to the bus station with the promise of a management contract.  Johnson quickly made good on that promise and it was the beginning of a working relationship that would start off slow, but prove to be very fruitful over the next decade.\n\nJohnson ran into significantly more resistance than he had anticipated as he shopped around the crude demo recording that he had made of Charley to the record labels in Nashville.  It wasn’t until 1965 that forward progress was made.  Charley came to Nashville and Johnson introduced him to producer, Jack Clement.  Clement gave Charley seven songs to learn and within a week they cut three of these songs–“The Snakes Crawl At Night”, “Atlantic Coastal Line”  and “Just Between You And Me”–during a three-hour studio session with top-notch session players.\n\nEven with the professionally produced sides, Johnson and Clement continued to have a difficult time as they shopped Charley around to the Nashville labels.  But finally in 1966, Chet Atkins decided to trust his ears and signed Charley to RCA Records.  Atkins took Charley under his wing, nurtured his talent and figured out how to dance past the race issue, which was no small feat during mid 1960s America.  Although Charley’s first couple of singles failed to jump-start his career, “Just Between You and Me” caught fire in 1967, breaking into the Top-10 Country chart and garnering Charley his first Grammy nomination. \n\nWhat happened next is Country Music history.  Charley Pride quickly became Country Music’s first African-American superstar.  Between 1967 and 1987, he amassed no fewer than 52 Top-10 Country hits and went on to sell tens of millions of records worldwide.  In 1971, Charley won two Grammy Awards related to his Gospel album Did You Think To Pray –“Best Sacred Performance, Musical (Non-Classical)” for the album, as well as “Best Gospel Performance Other Than Soul” for the single “Let Me Live.”  Later that year, his #1 crossover hit “Kiss An Angel Good Mornin’” sold over a million singles and helped him to win the Country Music Association’s “Entertainer of the Year” award and the “Top Male Vocalist” awards of 1971 and 1972.  It also brought him a “Best Male Country Vocal Performance” Grammy Award in 1972.  Some of Charley’s hits from his 1960s, 1970s and early 1980s output include “All I Have To Offer You Is Me,” “Is Anybody Goin’ To San Antone,” “Amazing Love,” “Mississippi Cotton Pickin’ Delta Town,” “Burgers And Fries,”  “Roll On Mississippi” and “Mountain Of Love.”  After parting ways with RCA Records in 1986, Charley spent the remainder of the decade releasing albums on the 16th Avenue Records label.  \n\nIn 1993, Charley was inducted into the Grand Ole Opry, 26 years after he had first played there as a guest.  On December 9th of that year he performed at the White House for President Bill Clinton, Hillary Rodham Clinton and many others during the Lighting of the National Christmas Tree celebration at President's Park.\n\nPride: The Charley Pride Story, an autobiography that Charley wrote with the assistance of Jim Henderson, was published in 1994.  This book covers the events of the 1960s, 1970s and 1980s in significantly more depth.\n\nIn 1994, he opened the Charley Pride Theatre in Branson Missouri where he performed for 4 years, doing nearly 200 shows yearly. Also in 1994, Pride was honored by the Academy of Country Music with its prestigious Pioneer Award.  And from 1994 until 1997, Pride released several albums on the Honest Entertainment record label.  \n\nIn 2000, Pride was honored with an induction into the Country Music Hall of Fame.  Shortly thereafter, he began releasing new music on the Music City Records label, including his critically acclaimed A Tribute To Jim Reeves (2001) and Pride And Joy: A Gospel Music Collection (2006) albums.\n\nCharley appeared in the 2009 documentary film, The Black List: Vol. 2, which aired on HBO.  The film is a component of The Black List Project, which interviews, films and photographs prominent African Americans of various professions, disciplines and backgrounds.\n\nOn July 21, 2009 Charley performed for President Barack Obama and guests in the historic East Room of the White House. His performance was part of a concert and educational workshop event (the White House Music Series) that also featured Brad Paisley and Alison Krauss. Hosted by Michelle Obama, the purpose of the event was to support the arts and demonstrate the continuing importance of arts education in America.\n\nAs part of an investment group spearheaded by Hall Of Game pitcher, Nolan Ryan, Charley became one of the owners of the Texas Rangers major league baseball team in 2010.  The investment group purchased the team in a federal bankruptcy auction just weeks before the Rangers appeared in the World Series for the first time in team history.  Charley has a long history with the Texas Rangers–he was invited to work out with the team during spring training in the 1970s and has continued to do so every year since.  Each February and March, Charley blocks off several weeks from his schedule so that he can work out with the team at their Arizona spring training facility.  In addition, Pride was drafted in 2008 by the Rangers during Major League Baseball’s ceremonial Special Negro League Player Draft.\n\nCharley’s latest studio album Choices will be released on March 8, 2011.  It features 13 new recordings written by such songwriters as Ted Harris (who wrote “Crystal Chandeliers”) and Ben Peters (who wrote “Kiss An Angel Good Morning” and many other Pride hits) as well as tracks penned by such fellow Country music stars as Eddy Raven and Richie McDonald (Lonestar).  \n\nCharley calls Dallas, Texas home.  He relocated his family from Helena to Great Falls, Montana in 1967 and then to Dallas in 1969.  \n\nAs of 2011, Charley continues to play 30 to 40 concert dates a year throughout the United States, Canada and Europe.  He also performs at the Grand Ole Opry several times each year and hosts an annual fan club breakfast in Nashville each June.  In addition to performing, recording new music and spending spring training with the Texas Rangers, he enjoys playing golf and spending time with his family.\n\nCharley Pride's official website is at www.charleypride.com and his official Facebook page is at www.facebook.com/charleypride\n <a href=\"https://www.last.fm/music/Charley+Pride\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
