{"artist":{"name":"Charlie Haden","mbid":"1f0cdc02-c8d5-4228-8227-37ec0c289b48","url":"https://www.last.fm/music/Charlie+Haden","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/276f3f05b59e44d08b78438ca71de9f0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/276f3f05b59e44d08b78438ca71de9f0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/276f3f05b59e44d08b78438ca71de9f0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/276f3f05b59e44d08b78438ca71de9f0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/276f3f05b59e44d08b78438ca71de9f0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/276f3f05b59e44d08b78438ca71de9f0.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"85942","playcount":"861431"},"similar":{"artist":[{"name":"Charlie Haden Quartet West","url":"https://www.last.fm/music/Charlie+Haden+Quartet+West","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3ef0ad31b4cb42968ceea2da77f9d71d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3ef0ad31b4cb42968ceea2da77f9d71d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3ef0ad31b4cb42968ceea2da77f9d71d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3ef0ad31b4cb42968ceea2da77f9d71d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3ef0ad31b4cb42968ceea2da77f9d71d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3ef0ad31b4cb42968ceea2da77f9d71d.png","size":""}]},{"name":"Brad Mehldau","url":"https://www.last.fm/music/Brad+Mehldau","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9f235f9d7f134ce5b35a3fc887daa8dd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9f235f9d7f134ce5b35a3fc887daa8dd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9f235f9d7f134ce5b35a3fc887daa8dd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9f235f9d7f134ce5b35a3fc887daa8dd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9f235f9d7f134ce5b35a3fc887daa8dd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9f235f9d7f134ce5b35a3fc887daa8dd.png","size":""}]},{"name":"Keith Jarrett & Charlie Haden","url":"https://www.last.fm/music/Keith+Jarrett+&+Charlie+Haden","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e748ceb0e127439b8814a2ae7e75cd0e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e748ceb0e127439b8814a2ae7e75cd0e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e748ceb0e127439b8814a2ae7e75cd0e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e748ceb0e127439b8814a2ae7e75cd0e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e748ceb0e127439b8814a2ae7e75cd0e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e748ceb0e127439b8814a2ae7e75cd0e.png","size":""}]},{"name":"Gonzalo Rubalcaba","url":"https://www.last.fm/music/Gonzalo+Rubalcaba","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c02144418e874d5294497726d130f016.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c02144418e874d5294497726d130f016.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c02144418e874d5294497726d130f016.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c02144418e874d5294497726d130f016.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c02144418e874d5294497726d130f016.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c02144418e874d5294497726d130f016.png","size":""}]},{"name":"Pat Metheny","url":"https://www.last.fm/music/Pat+Metheny","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/37fdf480763247688d90d51b74d81557.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/37fdf480763247688d90d51b74d81557.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/37fdf480763247688d90d51b74d81557.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37fdf480763247688d90d51b74d81557.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37fdf480763247688d90d51b74d81557.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37fdf480763247688d90d51b74d81557.png","size":""}]}]},"tags":{"tag":[{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"bass","url":"https://www.last.fm/tag/bass"},{"name":"modern jazz","url":"https://www.last.fm/tag/modern+jazz"},{"name":"jazz bass","url":"https://www.last.fm/tag/jazz+bass"},{"name":"free jazz","url":"https://www.last.fm/tag/free+jazz"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Charlie+Haden/+wiki"}},"published":"29 Dec 2006, 15:21","summary":"Charles Edward \"Charlie\" Haden (August 6, 1937 – July 11, 2014) was an American jazz double bass player, known for his long association with saxophonist Ornette Coleman, pianist Keith Jarrett, and his Liberation Music Orchestra, a group he co-led with pianist Carla Bley.\n\nHaden was born in Shenandoah, Iowa, and was raised on a farm. His family was exceptionally musical; they performed together frequently on the radio, playing country music and American folk songs as the Haden Family Band. <a href=\"https://www.last.fm/music/Charlie+Haden\">Read more on Last.fm</a>","content":"Charles Edward \"Charlie\" Haden (August 6, 1937 – July 11, 2014) was an American jazz double bass player, known for his long association with saxophonist Ornette Coleman, pianist Keith Jarrett, and his Liberation Music Orchestra, a group he co-led with pianist Carla Bley.\n\nHaden was born in Shenandoah, Iowa, and was raised on a farm. His family was exceptionally musical; they performed together frequently on the radio, playing country music and American folk songs as the Haden Family Band. Haden was musical from an early age, and made his professional debut as a singer, when he was two years old, on the Haden Family's radio show. He continued singing with his family until he contracted a bulbar form of polio around his throat and facial muscles when he was 15. The polio damaged his throat muscles and vocal cords, and as a result, Haden was unable to control his pitch while singing. At age 14, before he had contracted polio, Haden had become interested in jazz, and began playing his older brother's double bass. He developed this interest after he lost the ability to sing. Haden's interest in the instrument was not sparked by jazz bass alone, but by the classical bass he heard frequently on the radio. He was particularly fascinated by the bass he heard in compositions by Bach. Eventually he set his sights on Los Angeles, and to save money for the trip took a job as house bassist for ABC-TV's Ozark Jubilee in Springfield, Missouri.\n\nHaden moved to Los Angeles in 1957 in search of pianist Hampton Hawes. He turned down a scholarship at Oberlin College, which did not have an established jazz program at the time, to attend Westlake College of Music in Los Angeles. His first recordings were made that year with Paul Bley, with whom he worked until 1959. He also played with Art Pepper for four weeks in 1957, and with Hampton Hawes from 1958-1959.\n\nHe began recording with Ornette Coleman shortly after, including the important The Shape of Jazz to Come. Haden's folk-influenced style complemented the microtonal, Texas blues elements of Coleman. In 1959, the Coleman Quartet moved to New York City and secured a residency at the Five Spot Café. This residency lasted six weeks, and represented the beginnings of free, or avant-garde jazz. The Ornette Coleman Quartet played everything by ear, as Haden explained: “At first when we were playing and improvising, we kind of followed the pattern of the song, sometimes. Then, when we got to New York, Ornette wasn’t playing on the song patterns, like the bridge and the interlude and stuff like that. He would just play. And that’s when I started just following him and playing the chord changes that he was playing: on-the-spot new chord structures made up according to how he felt at any given moment.” Haden’s narcotics addiction forced him to leave Coleman’s band in August, 1960. He went to rehabilitation in September, 1963 at Synanon houses in Santa Monica, California and San Francisco, California.\n\nHe resumed his career in 1964, working with John Handy and Danny Zeitlin’s trio, and performing with Archie Shepp in California and Europe. He also did freelance work from 1966 to 1967, performing with Henry “Red” Allen, Pee Wee Russell, Attila Zoller, Bobby Timmons, Tony Scott, and the Thad Jones—Mel Lewis Orchestra. He recorded with Roswell Rudd in 1966, and returned to Ornette Coleman’s group in 1967. This group remained active until the early 1970s. Haden was known for being able to follow the shifting directions and modulations of Coleman’s improvised lines skillfully.\n\nHaden joined Keith Jarrett's trio and his 'American Quartet' from 1967 to 1976 with Paul Motian and Dewey Redman. The group also consisted of percussionist Guilherme Frano. He also played in the collective Old and New Dreams, which consisted of Don Cherry, Dewey Redman, and Ed Blackwell, who were members of Coleman’s band. These musicians believed they understood and could perform Coleman’s improvisational concept, and applied it to their work in this band, continuing to play Coleman’s music in addition to their own original compositions.\n\nHaden went on to lead the Liberation Music Orchestra in the 1970s. Largely arranged by Carla Bley, their music was very experimental, exploring the realms of free jazz and political music at the same time; the first album focused specifically on the Spanish Civil War. Carla Bley’s arrangements underscore compositions by Antonín Dvořák, Samuel Barber, Bill Frisell, and Pat Metheny. They also quote lines from songs such as “Dixie,” “The Star Spangled Banner,” and “Battle Hymn of the Republic,” which the LMO intentionally satirized and portrayed ironically. The LMO has had a shifting membership comprising a \"who's who\" of jazz instrumentalists, and consisted of twelve members from multicultural backgrounds. Some of the members included Ahnee Sharon Freeman (French horn), Joe Daley (tuba), Michael Rodriguez (trumpet), Miguel Zenón (alto saxophone), Chris Cheek (tenor saxophone), Curtis Fowlkes (trombone), Steve Cardenas (guitar), and Matt Wilson (drums). Through Bley's arranging, they have concentrated on a wide palette of brass instruments, including tuba, French horn, and trombone, in addition to the more standard trumpet and reed section. The group won multiple awards in 1970, including France’s Grand Prix du Disque from the Académie Charles Cros, and Japan’s Gold Disc Award from Swing Journal.\n\nIn 1971, while on tour with the Ornette Coleman Quartet in Portugal (at the time under a fascist dictatorship), Haden decided to dedicate a performance of his \"Song for Che\" to the anticolonialist revolutionaries in the Portuguese colonies of Mozambique, Angola, and Guinea-Bissau. The following day, he was detained at Lisbon Airport, jailed, and interrogated by the DGS (the Portuguese secret police). He was promptly released the same day after the intervention of the American cultural attaché, though he was later interviewed by the FBI in the United States about his choice of dedication.\n\nThe LMO's 1982 album The Ballad of the Fallen commented again on the Spanish Civil War as well as the political instability and United States involvement in Latin America. Haden’s involvement with the LMO began at the height of the Vietnam War, out of his frustration that so much of the government’s energy was spent on the war (in which there were many fatalities), while so many internal problems in the United States (such as poverty, civil rights, mental illness, drug addiction, and unemployment), were neglected. Haden’s goal was to use the LMO to amplify unheard voices of oppressed people. He wanted to express his solidarity with progressive political movements from around the world by performing music that made a statement about how to initiate and celebrate liberating change. The LMO toured most extensively throughout the 1980s and 1990s. In 1990, the orchestra returned with Dream Keeper, a more heterogeneous album which drew on American gospel music and South African music to comment on politics in Latin America and apartheid in South Africa. The album featured choral contributions from the Oakland Youth Chorus. Haden performed with Carla Bley and the Jazz Composer’s Orchestra through the 1980s and 1990s as well. Following Dream Keeper, LMO released the album Not In Our Name. Unlike the previous albums, the material on Not In Our Name came solely from American composers, and was intended to convey a sense of patriotism towards the United States, while simultaneously stressing the necessity for political reform.\n\nThematic exploration of genres not typically considered to be jazz standards became one of the signature approaches of the \"Quartet West\". Started in 1987, the Quartet consists of Ernie Watts on sax, Alan Broadbent on piano, and Larance Marable on drums. Quartet West's albums feature lush, romantic arrangements by Broadbent, often with strings, of music from the 1930s and 1940s, often music associated with films of that period. Haden’s vision for Quartet West was the beginning of modernism in jazz. Their work combined forties pop ballads and originals by Haden or Alan Broadbent, and they played a noir infused, bop-oriented style. The group has been together for over twenty years and is one of the rare groups in jazz that has performed together for so long.\n\nA brief collaboration with Joe Henderson and Al Foster, players not normally associated with Haden or his immediate circle, showcased Haden's playing in a more hard-driving jazz context. In 1982, Haden established the jazz studies program at California Institute of the Arts. His program emphasized smaller group performance and the spiritual connection to the creative process. He encouraged students to discover their individual sounds, melodies, and harmonies. Haden was honored by the Los Angeles Jazz Society as “Jazz Educator of the Year” for his educational work in this program. Haden’s students have included the tenor saxophonist Ravi Coltrane, the trumpeter Ralph Alessi, and the bassist Scott Colley.\n\nIn 1989, Haden was featured at the Montreal Jazz Festival, and performed in concert every night of the festival, with different combos and bands. Each of these events was recorded, and most have been released in the series The Montreal Tapes. In 1995, Haden released Steal Away: Spirituals, Hymns and Folk Song with pianist Hank Jones, an album based on traditional spirituals and folk songs. Haden both played on the album and produced it. In late 1996, he collaborated with Pat Metheny on the album Beyond the Missouri Sky (Short Stories), exploring the music that influenced them in their childhood experiences in Missouri with what they call \"contemporary impressionistic Americana\". Haden was awarded his first Grammy award for the album, for Best Jazz Instrumental Performance.\n\nIn 1997, classical composer Gavyn Bryars wrote an extended adagio for Charlie Haden. Instrumentation included strings, bass clarinet, and percussion. The piece was recorded with the English Chamber Orchestra on the album Farewell to Philosophy, and is a synthesis of jazz and classical chamber music, featuring resonant pizzicato notes and gut strings in imitation of Haden’s bass sound.\n\nIn 2001, Haden won the Latin Grammy Award for Best Latin Jazz CD for his album Nocturne, which contains boleros from Cuba and Mexico. In 2003 he won the Latin Grammy Award for Best Latin Jazz Performance for his album Land of the Sun. Haden reconvened the Liberation Music Orchestra in 2005, with largely new members, for the album Not In Our Name, released on Verve Records. The album dealt primarily with the contemporary political situation in the United States.\n\nHaden's 2008 release, Rambling Boy, features several members of his immediate family, along with Béla Fleck, Pat Metheny, Elvis Costello, Rosanne Cash, Bruce Hornsby, and several others. The album consists his co-producer Ruth Cameron, and instrumentalists Haden, his wife Ruth Cameron, his four children (Petra, Rachel, Tanya, and Josh Haden), and his son-in-law Jack Black (each of whom have careers in music). The album, released on 23 September 2008, hearkens back to his days of playing Americana and bluegrass music with his parents on their radio show. The idea came to Haden when his wife Ruth Cameron gathered the Haden family together for his mother's 80th birthday, and they all sang \"You Are My Sunshine\" in the living room. This reunited Haden with an idea that was in his mind for a long time, and reminded him of his country and bluegrass roots. Rambling Boy was intended to connect music from his early childhood in the Haden family band to the new generation of the Haden family as well. The album includes songs made famous by the Stanley Brothers, the Carter Family, and Hank Williams, in addition to fabled traditional songs and original compositions. A concert tour with Quartet West (with a new drummer) took place in the late summer of 2008, the year the album was released.\n\nIn 2009, Swiss film director Reto Caduff released a film about Haden’s life, entitled Rambling Boy. It premiered at Telluride and Vancouver International Film Festivals festivals in 2009. In the summer of 2009, Haden performed many concert reunions with Ornette Coleman at the Meltdown Festival in Southbank, London. He also performed and produced duet recordings with Hank Jones on the album Steal Away, and with Kenny Baron on the album Kenny Baron Night and the City. In February 2010, Haden and Hank Jones recorded a companion to Steal Away: Spirituals, Hymns and Folk Songs called Come Sunday. Jones died three months after the recording of the album. In 2012, Haden was a recipient of the NEA Jazz Masters Award. The award was given to him and four other honorees at Lincoln Center in New York City.\n\nWhile he did not orient himself with a specific religious orientation, Haden was interested in spirituality, especially in association with music. His teaching method relied heavily on spirituality. He believed that in order to establish an individual musical voice, one must first establish a spiritual posture. This physical and mental position will allow the individual to find their own unique musical voice and bring it to their instrument. He also encourages his students to enter a meditative state when they play, one in which they focus solely on the present moment: “there’s no yesterday or tomorrow, there’s only right now,” he claims. In order to find this state, and ultimately to find one’s spiritual self, Haden urged that one must have humility and respect for beauty; they must be thankful for the ability to make music, and to give back to the world with the music they create. He claimed that music taught him this process of exchange, so he teaches it to his students in return. Music, Haden believed, also teaches incredibly valuable lessons about life: \"I learned at a very young age that music teaches you about life. When you're in the midst of improvisation, there is no yesterday and no tomorrow — there is just the moment that you are in. In that beautiful moment, you experience your true insignificance to the rest of the universe. It is then, and only then, that you can experience your true significance.\"\n\nHaden viewed jazz as the “music of rebellion,” and felt it was his responsibility and mission to challenge the world through music, and through artistic risks that expressed his own individual artistic vision. He believed that all music originates from the same place, and because of this, he resisted the tendency to divide music into categories. He was democratic in his tastes and musical partners, and interested in musical collaboration with any individual who shares his views on music and life. His music (especially his music created with the LMO), was frequently political, and intended to help the oppressed find a voice, and ultimately improve the political state of the world around him. Haden spoke to this in reference to his 2002 album American Dreams, stating: “I always dreamed of a world without cruelty and greed, of a humanity with the same creative brilliance of our solar system, of an America worthy of the dreams of Martin Luther King, and the majesty of the Statue of Liberty...This music is dedicated to those who still dream of a society with compassion, deep creative intelligence, and a respect for the preciousness of life -- for our children, and for our future.”\n\nHaden was known for his warm tone and subtle vibrato on the double bass, in addition to his lyrical playing. He focused on simplicity and melodic playing rather than intricate bass lines, or complicated, horn-like solos. His approach to the bass stemmed from his belief that the bassist should move from an accompanying role to a more direct role in group improvisation. This is particularly clear in his work with the Ornette Coleman Quartet; he frequently improvised melodic responses to Coleman’s free-form solos instead of playing previously written lines. He frequently closed his eyes while performing, and assumed a posture in which he bent himself around the bass until his head was almost at the bottom of the bridge of the bass.\n\nHaden owned one three-quarter sized bass, and one seven-eighths sized bass. The larger bass is one of a small number of basses made by Jean-Baptiste Vuillaume, a French luthier, in the mid nineteenth century. He greatly valued this bass, playing it only at recording sessions and jobs that are in close proximity to his home so he does not damage it in transit. He attributed the bass’s special and valuable nature to the varnish used by Villaume, which is similar to Italian varnish.\n\nHaden suffered from tinnitus, a ringing in both ears that he believed he received from an extremely loud free jazz concert he played with tenor saxophonist Archie Shepp and trombonist Roswell Rudd in the late 1960s. He also suffered from hyperacousis, or sensitivity to loud noises. As a result, when he played with a drummer, he had to play behind a Plexiglass divider.\n\nHis son Josh Haden is a bass guitarist and singer. His triplet daughters, Petra, Tanya and Rachel Haden, are all musicians, collectively the Haden Triplets. Petra and Rachel were in that dog.; Petra was a member of progressive folk group The Decemberists, Rachel played in the rock band The Rentals, and Tanya is married to actor Jack Black.\n\nHaden died in Los Angeles on July 11, 2014 after a prolonged illness. <a href=\"https://www.last.fm/music/Charlie+Haden\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
