{"artist":{"name":"Charlie McCoy","mbid":"eaf2d37b-324f-44a7-85b2-3b247e8984fc","url":"https://www.last.fm/music/Charlie+McCoy","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/789a3f4694c181bac54d78a382c2944f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/789a3f4694c181bac54d78a382c2944f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/789a3f4694c181bac54d78a382c2944f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/789a3f4694c181bac54d78a382c2944f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/789a3f4694c181bac54d78a382c2944f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/789a3f4694c181bac54d78a382c2944f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"6955","playcount":"54551"},"similar":{"artist":[{"name":"Carlos Del Junco","url":"https://www.last.fm/music/Carlos+Del+Junco","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/716926f56dcd45388c0eb5ac99e4827c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/716926f56dcd45388c0eb5ac99e4827c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/716926f56dcd45388c0eb5ac99e4827c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/716926f56dcd45388c0eb5ac99e4827c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/716926f56dcd45388c0eb5ac99e4827c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/716926f56dcd45388c0eb5ac99e4827c.png","size":""}]},{"name":"Lee Oskar","url":"https://www.last.fm/music/Lee+Oskar","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b02ab38844194aa2a2fad9fb2b325ea1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b02ab38844194aa2a2fad9fb2b325ea1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b02ab38844194aa2a2fad9fb2b325ea1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b02ab38844194aa2a2fad9fb2b325ea1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b02ab38844194aa2a2fad9fb2b325ea1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b02ab38844194aa2a2fad9fb2b325ea1.png","size":""}]},{"name":"Mark Hummel","url":"https://www.last.fm/music/Mark+Hummel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cc8f6d7576cb447f8e565d4c21f6679d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cc8f6d7576cb447f8e565d4c21f6679d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cc8f6d7576cb447f8e565d4c21f6679d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cc8f6d7576cb447f8e565d4c21f6679d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cc8f6d7576cb447f8e565d4c21f6679d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cc8f6d7576cb447f8e565d4c21f6679d.png","size":""}]},{"name":"Mojo Buford","url":"https://www.last.fm/music/Mojo+Buford","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bd79b216d744fb2446b06ebd7072e333.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bd79b216d744fb2446b06ebd7072e333.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bd79b216d744fb2446b06ebd7072e333.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bd79b216d744fb2446b06ebd7072e333.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bd79b216d744fb2446b06ebd7072e333.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bd79b216d744fb2446b06ebd7072e333.png","size":""}]},{"name":"De Ford Bailey","url":"https://www.last.fm/music/De+Ford+Bailey","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ab83e9392c7b424a8cdff292bd99608d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ab83e9392c7b424a8cdff292bd99608d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ab83e9392c7b424a8cdff292bd99608d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ab83e9392c7b424a8cdff292bd99608d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ab83e9392c7b424a8cdff292bd99608d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ab83e9392c7b424a8cdff292bd99608d.png","size":""}]}]},"tags":{"tag":[{"name":"harmonica","url":"https://www.last.fm/tag/harmonica"},{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"folk","url":"https://www.last.fm/tag/folk"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Charlie+McCoy/+wiki"}},"published":"29 Sep 2007, 17:22","summary":"There are two artists known as Charlie McCoy:\n\n#1 Charles \"Papa Charlie\" McCoy (May 26, 1909 – July 26, 1950) was an African American delta blues musician and songwriter.\n\n#2 Charles Ray \"Charlie\" McCoy (born March 28, 1941 in Oak Hill, West Virginia) is an American session musician noted for his work on a wide variety of instruments. In his career, McCoy has backed several notable musicians including Bob Dylan, Johnny Cash, Tom Astor, Elvis Presley and Ween. <a href=\"https://www.last.fm/music/Charlie+McCoy\">Read more on Last.fm</a>","content":"There are two artists known as Charlie McCoy:\n\n#1 Charles \"Papa Charlie\" McCoy (May 26, 1909 – July 26, 1950) was an African American delta blues musician and songwriter.\n\n#2 Charles Ray \"Charlie\" McCoy (born March 28, 1941 in Oak Hill, West Virginia) is an American session musician noted for his work on a wide variety of instruments. In his career, McCoy has backed several notable musicians including Bob Dylan, Johnny Cash, Tom Astor, Elvis Presley and Ween. He has also recorded thirty-seven studio albums, including fourteen for Monument Records. Thirteen of his singles have entered the Billboard country charts. He was a member of Area Code 615 and Barefoot Jerry.\n\n#1 Charlie McCoy was born in Jackson, Mississippi, he was best known by the nickname 'Papa Charlie'. He became one of the major blues accompanists of his time. A guitarist and mandolin player, he played in the Mississippi area with his band, The Mississippi Hot Footers.\nMcCoy recorded several sides with Bo Carter as the 'Mississippi Mud Steppers'. Among the tracks recorded with Carter were two variations of Cow Cow Davenport's \"Cow Cow Blues\" . The first, an instrumental, was released as \"The Jackson Stomp\". The second, with lyrics and vocals by McCoy, as \"The Lonesome Train, That Took My Girl From Town\". They also wrote and recorded \"The Vicksburg Stomp\" which was resurrected and recorded by Mike Compton, of O Brother, Where Art Thou? fame.\nHis nimble, sensitive guitar work enriched recordings from performers including Tommy Johnson and Ishman Bracey. He recorded regularly in the late 1920s, often alongside Walter Vincson. He dated blues singer and guitar player Geeshie Wiley around 1928. He also sat in with the Mississippi Sheiks, Rubin Lacy, Son Spand and the many other Delta bluesmen who passed through the Jackson area in the years that followed. He also backed his then sister-in-law, Memphis Minnie in the mid 1930s.\nAs a slide guitarist, McCoy recorded as under the name of Tampa Kid, and released \"Keep On Trying\".\nMcCoy also joined and performed with his brother (Kansas Joe McCoy) for many years, and they released records under the title of \"The McCoy Brothers\".\nHe eventually migrated to Chicago where he organized two bands, \"Papa Charlie's Boys\" and with his older brother Kansas Joe McCoy, the Harlem Hamfats, that performed and recorded during the second half of the 1930s. However, service with the United States Army during World War II cut short McCoy’s career.\nIn poor health, McCoy never returned to music after the war, and he died in Chicago, Illinois in 1950 from paralytic brain disease, only a few months after his brother had died. They are both buried in the Restvale Cemetery in Alsip, Illinois.\nMcCoy's composition, \"Too Long\" was recorded several times by both black and white artists.\n\n#2 Charlie McCoy and his family moved to nearby Fayetteville when he was a boy and then to Miami, Florida. At age eight, he began playing the harmonica and the guitar and later, in his teens, he also learned to play the bass and trumpet. In high school in Miami his skills had developed to such an extent that he decided to pursue a career in music. He joined a local rock and roll band as guitarist and singer. When he was sixteen years old he reluctantly accompanied a friend to visit a country barn dance radio show in Miami called the \"Old South Jamboree\". Upon their arrival, McCoy's friend left him in the crowd and went to talk to Happy Harold, the host of the show, with the intention of coaxing McCoy up on stage to sing. McCoy's performance that night, along with the positive response from the show's audience, led to him and his rock band being signed to the Old South Jamboree. His band consisted of Donny Young, later known as Johnny Paycheck, on bass; Bill Johnson on steel-guitar; Charlie Justice on guitar; and Bill Phillips, vocal. About this time the band took part in a local rock and roll contest winning first prize. Following an invitation from Mel Tillis, the eighteen-year-old McCoy went to Nashville, Tennessee for a week's stay in 1959. During his stay in Nashville he visited numerous producers and record companies but all to no avail. Since his efforts to start a musical career in Nashville had failed he went back to Miami. He enrolled at the Miami University[citation needed] majoring in musical education. His goal was now to become a teacher. Meanwhile he continued to perform on the \"Jamboree\". When Miami faculty members discovered that he was playing rock and roll for a square dance they warned him to continue with this \"lower forms of music\". McCoy replied that he was willing to quit his work at the barn dance if they would give him a scholarship. The faculty rejected his request.\nMcCoy, who still wanted to make a career in music, applied for the vacant job as guitarist in John Ferguson's band. But when he arrived in Nashville, due to some misunderstanding, his job was already taken by guitarist Vance Bullock. After a short discussion Ferguson decided to hire McCoy as a drummer instead. McCoy bought a drum set and joined the band. John Ferguson's band was unsuccessful and shortly they disbanded. After a month of unemployment he joined Stonewall Jackson as a drummer. The job came to an end in the autumn that year. Then he received a call from the booking agent Jim Denney who informed him that Archie Bleyer of Cadence Records had listened to McCoy's tapes and wanted to sign him. McCoy cut his first single for the Cadence label and \"Cherri Berri Wine\" reached No. 99 in the Billboard chart. In Nashville, Denney gave him the advice to do demo sessions and to concentrate on the harmonica. Next, McCoy joined Wayne Moss as a bass player performing at Fort Campbell in Kentucky.\nChet Atkins heard one of McCoy's demo tapes and immediately hired him in May 1961. Thus, his first recording as a harmonica player was on a song, \"I Just Don't Understand\", by Ann-Margret for RCA. Fred Foster of Monument Records also heard about McCoy and hired him as harmonica player on Roy Orbison's song \"Candy Man\". It became a million-seller. McCoy's reputation as harmonica player and studio musician increased. McCoy continued to record for the Monument label without a written contract. Although some of his singles and albums at this time did not sell, Foster believed in McCoy's music. Tex Davis, the promotion manager of Monument Records, was persuaded by Charlie Dillard of WPFA to release \"Today I Started Loving You Again\" as a single. It had previously been released on McCoy's second LP. When the single came out in 1972 it sold 750 000 copies. The single went to No. 16 in the Billboard country charts. For his next album, \"The Real McCoy\", he won a grammy from the National Academy of Recording Arts and Sciences. His album \"Good Time Charlie\" reached No. 1 in the Billboard country chart. In the 1970s, McCoy, as a studio musician, took part in more than 400 sessions a year. He has won 2 CMA Awards and 7 ACM Awards.\nFrom there, he went on to play harmonica for other acts, Elvis Presley, Perry Como, Joan Baez, Johnny Cash, Buffy Sainte-Marie, Kris Kristofferson, Paul Simon, Ringo Starr, Barefoot Jerry, \"Gene Summers In Nashville\" LP and Ween. He also played guitar on Dylan's \"Desolation Row\", from the album Highway 61 Revisited, and \"Sad Eyed Lady of the Lowlands\", from the album Blonde on Blonde,) bass guitar (on all the tracks from Bob Dylan's John Wesley Harding,) keyboards, and drums plus on several wind and brass instruments. For 19 years McCoy worked as music director for the popular television show, Hee Haw, and was a member of the Million Dollar Band.\nOn May 17, 2009 Charlie was inducted into the Country Music Hall of Fame along with Roy Clark and Barbara Mandrell. He is also a member of the International Musicians' Hall of Fame, and the West Virginia Music Hall of Fame.\nCharlie has two children with his first wife, and five grandchildren. All of his grandchildren have contributed to one of his albums in some way. His second granddaughter did the artwork for one of the albums covers (Somewhere Over The Rainbow) and sang on one of his Christmas CDs. His oldest granddaughter has played flute and sang on a few of his albums. All of the youngest three kids have sung on one of his albums, as has his son (Charlie, Jr.) and daughter (Ginger). <a href=\"https://www.last.fm/music/Charlie+McCoy\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
