{"artist":{"name":"Charlie Rich","mbid":"9fb7fe77-4e8b-4cbd-ba8f-84bcd80a24bc","url":"https://www.last.fm/music/Charlie+Rich","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/049fee4e0916415eaf683c2ddfd3f2fd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/049fee4e0916415eaf683c2ddfd3f2fd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/049fee4e0916415eaf683c2ddfd3f2fd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/049fee4e0916415eaf683c2ddfd3f2fd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/049fee4e0916415eaf683c2ddfd3f2fd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/049fee4e0916415eaf683c2ddfd3f2fd.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"146006","playcount":"780046"},"similar":{"artist":[{"name":"Conway Twitty","url":"https://www.last.fm/music/Conway+Twitty","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2605666eebf14ed4ad35a891e213c46e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2605666eebf14ed4ad35a891e213c46e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2605666eebf14ed4ad35a891e213c46e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2605666eebf14ed4ad35a891e213c46e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2605666eebf14ed4ad35a891e213c46e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2605666eebf14ed4ad35a891e213c46e.png","size":""}]},{"name":"Bobby Bare","url":"https://www.last.fm/music/Bobby+Bare","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a89394935317423388bbd28a58fd9d6e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a89394935317423388bbd28a58fd9d6e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a89394935317423388bbd28a58fd9d6e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a89394935317423388bbd28a58fd9d6e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a89394935317423388bbd28a58fd9d6e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a89394935317423388bbd28a58fd9d6e.png","size":""}]},{"name":"Tom T. Hall","url":"https://www.last.fm/music/Tom+T.+Hall","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a8310097a12e424c9c2db81b32b4b0c5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a8310097a12e424c9c2db81b32b4b0c5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a8310097a12e424c9c2db81b32b4b0c5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a8310097a12e424c9c2db81b32b4b0c5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a8310097a12e424c9c2db81b32b4b0c5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a8310097a12e424c9c2db81b32b4b0c5.png","size":""}]},{"name":"George Jones","url":"https://www.last.fm/music/George+Jones","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/68a9b55c3e204cedb9f51d2b95da7cad.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/68a9b55c3e204cedb9f51d2b95da7cad.png","size":""}]},{"name":"Tammy Wynette","url":"https://www.last.fm/music/Tammy+Wynette","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf1d8053ad4b43e3b7e11e4816d32bc8.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"classic country","url":"https://www.last.fm/tag/classic+country"},{"name":"soul","url":"https://www.last.fm/tag/soul"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"Rock and Roll","url":"https://www.last.fm/tag/Rock+and+Roll"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Charlie+Rich/+wiki"}},"published":"31 Dec 2006, 23:39","summary":"Charles (Charlie) Rich (December 14, 1932 – July 25, 1995) was an American country music singer and musician. His eclectic-style of music was often hard to classify in a single genre, encompassing in the rockabilly, jazz, blues, country, and gospel genres.\nIn the latter part of his life, Rich acquired the nickname The Silver Fox. He is perhaps best remembered for a pair of 1973 hits, \"Behind Closed Doors\" and \"The Most Beautiful Girl\". \"The Most Beautiful Girl\" topped the U. <a href=\"https://www.last.fm/music/Charlie+Rich\">Read more on Last.fm</a>","content":"Charles (Charlie) Rich (December 14, 1932 – July 25, 1995) was an American country music singer and musician. His eclectic-style of music was often hard to classify in a single genre, encompassing in the rockabilly, jazz, blues, country, and gospel genres.\nIn the latter part of his life, Rich acquired the nickname The Silver Fox. He is perhaps best remembered for a pair of 1973 hits, \"Behind Closed Doors\" and \"The Most Beautiful Girl\". \"The Most Beautiful Girl\" topped the U.S. country singles charts, as well as the pop singles charts and earned him two Grammy Awards.\n\nThough he resided in Benton, Arkansas, from around 1960 to 1981, Rich was born in Colt, Arkansas, to rural cotton farmers. His professional musical career began while he was in the U.S. Air Force in the early 1950s. His first musical group, the Velvetones, played jazz and blues and featured his fiancée, Margaret Ann, on lead vocals. Rich left the military in 1955 and tried to farm five acres in Tennessee. He also began performing in clubs around the Memphis area, playing both jazz and R&B. It was during these hard times that he began writing his own material.\n\nRich was a session musician for Judd Records, owned by Judd Phillips, the brother of Sun Records founder Sam Phillips. After recording some demos for Sam Phillips at Sun Records that Phillips didn't find commercial enough, and too jazzy, legend has it that he was given a stack of Jerry Lee Lewis records and told: \"come back when you get that bad.\" A September 6, 2010 NPR airing of 1992 interview with Fresh Air host Terry Gross Charlie Rich tells the story himself of Bill Justis telling Rich's wife those exact words. In 1958, Rich became a regular session musician for Sun Records playing on records by Lewis, Johnny Cash, Bill Justis, Warren Smith, Billy Lee Riley, Carl Mann, and Ray Smith. He also wrote songs for Lewis, Cash, and others.\nHis third single for the Sun subsidiary, Phillips International Records, was the 1960 Top 30 hit, \"Lonely Weekends,\" noted for its Presley-like vocals. None of his seven follow-up singles was a success, though several of the songs became staples in his live set, including \"Who Will the Next Fool Be,\" \"Sittin' and Thinkin',\" and \"No Headstone on My Grave.\" These songs were often recorded by others to varying degrees of success, such as the Bobby Bland version of \"Who Will the Next Fool Be.\"\nRich's career stalled, and he left the struggling Sun label in 1963, signing with a subsidiary of RCA Records, Groove. His first single for Groove, \"Big Boss Man,\" was a minor hit, but again his Chet Atkins-produced follow-ups all stiffed. Rich moved to Smash Records early in 1965. Rich's new producer, Jerry Kennedy, encouraged the pianist to emphasize his country and rock & roll leanings, although Rich considered himself a jazz pianist and had not paid much attention to country music since his childhood. The first single for Smash was \"Mohair Sam,\" an R&B-inflected novelty-rock number, and it became a Top 30 pop hit. Unfortunately again for Rich, none of his follow-up singles were successful. Rich was forced to change labels, moving over to Hi Records, where he recorded blue-eyed soul music and straight country, but none of his singles made a dent on the country or pop charts. One Hi Records track Love Is After Me from 1966 belatedly became a white soul favourite in the early 1970s.\n\nDespite his lack of consistent commercial success, Epic Records signed Rich in 1967, mainly on the recommendation of producer Billy Sherrill. Sherrill helped Rich refashion himself as a Nashville Sound balladeer during an era when old rock n' rollers like Jerry Lee Lewis and Conway Twitty were finding a new musical home in the country and western format. This new \"Countrypolitan\" Rich sound paid off in the summer of 1972, when \"I Take It on Home\" went to number six in the country charts. The title track from his 1973 album, Behind Closed Doors, became a number one hit early in that year, crossing over into the Top 20 on the pop charts. This time his follow-up did not disappoint, as \"The Most Beautiful Girl\" spent three weeks at the top of the country charts and two weeks at the top of the pop charts. Now that he was established as a country music star, Behind Closed Doors won three awards from the Country Music Association that year: Best Male Vocalist, Album of the Year, and Single of the Year. The album was also certified gold. Rich won a Grammy Award for Best Male Country Vocal Performance, and he took home four ACM awards. One of RCA's several resident songwriters, Marvin Walters, co-wrote for three years with Charlie producing four recordings including a very popular \"Set Me Free\".\nAfter \"The Most Beautiful Girl\", number one hits came quickly, as five songs topped the country charts in 1974 and crossed over to the pop charts. The songs were \"There Won't Be Anymore\" (Pop No. 18), \"A Very Special Love Song\" (Pop No. 11), \"I Don't See Me In Your Eyes Anymore\" (Pop No. 47), \"I Love My Friend\" (Pop No. 24), and \"She Called Me Baby\" (Pop No. 47). Both RCA and Mercury (Smash was a subsidiary of Mercury which was absorbed into the main company in 1970) re-released his previously recorded material from the mid-1960s, as well. All of this success led the CMA to name him Entertainer of the Year in 1974. In the same year he performed the Academy Award nominated theme song I feel love (Benji's Theme) from the film Benji. Rich had three more top five hits in 1975, but even though he was at the peak of his popularity, Rich began to drink heavily, causing considerable problems off-stage.\nRich's destructive personal behavior famously culminated at the CMA awards ceremony for 1975, when he presented the award for Entertainer of the Year, while visibly intoxicated. Instead of reading the name of the winner, who happened to be John Denver, he set fire to the envelope with a cigarette lighter, before announcing the award had gone to \"My friend Mr. John Denver.\" Some considered it an act of rebellion against the Music Row-controlled Nashville Sound. But many speculated that Rich's behavior was a protest against the award going to Denver, whose music Rich had considered too \"pop,\" and not enough \"country.\"[2] Others, including industry insiders, were outraged, and Rich had trouble having hits throughout 1976, and only had one top ten with \"Since I Fell For You.\"\nThe slump in his career was exacerbated by the fact that his records began to sound increasingly similar: pop-inflected country ballads with overdubbed strings and little of the jazz or blues Rich had performed his entire life. He did not have a top ten hit again until \"Rollin' With the Flow\" in 1977 went to number one. Early in 1978, he signed with United Artists Records, and throughout that year, he had hits on both Epic and UA. His hits in 1978 included the top ten hits \"Beautiful Woman,\" \"Puttin' In Overtime At Home,\" and his last number one with \"On My Knees,\" a duet with Janie Fricke.\n\nRich struggled throughout 1979 having hits with United Artists and Epic. His singles were moderate hits that year, the biggest of them on either UA or Epic was a version of \"Spanish Eyes,\" which became a top 20 country hit. Rich appeared as himself in the 1978 Clint Eastwood movie, Every Which Way but Loose, in which he performed the song \"I'll Wake You Up When I Get Home.\" This song hit number three on the charts in 1979 and was his last top ten single. In 1980, he switched labels again to Elektra Records, and released a number twelve single, \"A Man Just Don't Know What a Woman Goes Through\" in the fall of that year. One more Top 40 hit followed, the Gary Stewart song \"Are We Dreamin' the Same Dream\" early in 1981, but Rich decided to remove himself from the spotlight. For over a decade, Rich was silent, living off his investments in semi-retirement and only playing occasional concerts. Also played a bit part in the 1981 movie Take This Job and Shove It as a recent oil millionaire looking for an investment into the Beer Brewery Business.\nIn 1992, Rich released Pictures and Paintings, a jazzy record that was produced by journalist Peter Guralnick. It was released on Sire Records. Pictures and Paintings received positive critical reviews and restored Rich's reputation as a musician, but it would be his last record. One of his opening acts in these years was Tom Waits, who mentioned him in the song \"Putnam County\" from his album Nighthawks at the Diner with the lyric: \"The radio's spitting out Charlie Rich... He sure can sing, that son of a bitch.\"\n\nCharlie Rich was traveling to Florida with his wife from Natchez, Mississippi, where he watched his son perform with Freddy Fender at a local casino, when he experienced a bout of severe coughing. After visiting a doctor in St. Francisville, Louisiana and receiving antibiotics, he continued traveling until he stopped to rest for the night. He died in his sleep on July 25, 1995, in a Hammond, Louisiana motel. He was 62 years old. The cause of death was a pulmonary embolism. He was buried in the Memorial Park Cemetery in Memphis, Tennessee.\nAt the time, Charlie Rich was survived by his wife of 43 years, Margaret; two sons, Allan and Jack; two daughters, Rene and Laurie; and grandchildren Maggie Carber Yelverton, Wesley Carber, and Christian Cole Lee. Margaret Rich passed away in Germantown, Tennessee on September 22, 2010 and was buried next to her husband.\n\n\n\n\nCharlie Rich was simultaneously one of the most critically acclaimed and most erratic country singers of post-World War II era. Rich had all the elements of being one of the great country stars of the '60s and '70s, but his popularity never matched his critical notices. What made him a critical favorite also kept him from mass success. Throughout his career, Rich willfully bended genres, fusing country, jazz, blues, gospel, rockabilly, and soul. Though he had 45 country hits in a career that spanned nearly four decades, he became best-known for his lush, Billy Sherrill-produced countrypolitan records of the early '70s. Instead of embracing the stardom those records brought him, Rich shunned it, retreating into semiretirement by the '80s.\n\nRich began his professional musical career while he was enlisted in the U.S. Air Force in the early '50s. While he was stationed in Oklahoma, he formed a group called the Velvetones, which played jazz and blues and featured his fiancée, Margaret Ann, on lead vocals. Rich left the military in 1956, and he began performing clubs around the Memphis area, playing both jazz and R&B; he also began writing his own material. Rich managed to land a job as a session musician for Judd Records, which was owned by Judd Phillips, the brother of Sun Records founder Sam Phillips. Around this time, saxophonist and Sun recording artist Bill Justis heard Rich play at the Sharecropper Club and asked the pianist to write arrangements for him. Sam saw Rich perform with Justis at a club gig and asked him to record some demos at Sun Studios. Phillips rejected the resulting demos, claiming they were too jazzy. After absorbing some Jerry Lee Lewis records Justis gave him, Rich returned to Sun quickly and became a regular session musician for the label in 1958, playing and/or singing on records by Lewis, Johnny Cash, Justis, Warren Smith, Billy Lee Riley, Carl Mann, and Ray Smith. He was also writing songs, including \"Break Up\" for Lewis, \"The Ways of a Woman in Love\" for Cash, and \"I'm Comin' Home\" for Mann, which was later cut by Elvis Presley.\n\nIn August of 1958, Rich released his first single, \"Whirlwind,\" for the Sun subsidiary Phillips International. Throughout 1959, he recorded a number of songs at Sun, though only a handful were actually released. Rich didn't have a hit until 1960, when his third Phillips International single, \"Lonely Weekends,\" became a Top 30 pop hit. However, none of its seven follow-up singles were a success, though several of the songs would become staples in his set, including \"Who Will the Next Fool Be?,\" \"Sittin' and Thinkin',\" and \"Midnight Blues.\" In the early '60s, Rich's career remained stalled. He left Sun Records in 1964, signing with Groove, a newly established subsidiary of RCA. His first single, \"Big Boss Man,\" was an underground, word-of-mouth hit, but its Chet Atkins-produced follow-ups all stiffed. On Groove, he jazzily interpreted standards, but he also performed a handful of originals, including \"Tomorrow Night\" and \"I Don't See Me in Your Eyes Anymore.\" Groove went out of business by the beginning of 1965, leaving Rich without a record contract.\n\nUnder the direction of Shelby Singleton, Smash Records signed Rich early in 1965. Singleton and Rich's producer, Jerry Kennedy, encouraged the pianist to emphasize his country and rock & roll leanings. The first single for Smash was \"Mohair Sam,\" an R&B-inflected novelty number written by Dallas Frazier. \"Mohair Sam\" became a Top 30 pop hit, but none of its follow-ups were successful. Again, Rich changed labels, moving over to Hi Records, where he recorded straight country, but none of his singles for the label made any impression on the country charts.\n\nDespite his lack of consistent commercial success, Epic Records signed Rich in 1967, mainly on the recommendation of producer Billy Sherrill. Sherrill helped Rich refashion himself as a Nashville-based, smooth, middle-of-the-road balladeer. At first, the singles were only moderately successful — \"Set Me Free\" and \"Raggedy Ann\" charted in the mid-40s in 1968 — but persistence paid off in the summer of 1972, when \"I Take It on Home\" rocketed to number six. \"I Take It on Home\" set the stage for Rich's big breakthrough into the mainstream, 1973's Behind Closed Doors album. The title track from the record became a number one hit early in 1973, crossing over into the Top 20 on the pop charts. Following the success of \"Behind Closed Doors,\" RCA re-released \"Tomorrow Night,\" which reached the Top 30, but it was \"The Most Beautiful Girl,\" the proper follow-up to his first number one single, that established him as a star. \"The Most Beautiful Girl\" spent three weeks at the top of the country charts and two weeks at the top of the pop charts. Behind Closed Doors won three awards from the Country Music Association that year: Best Male Vocalist, Album of the Year, and Single of the Year for the title track. The album was also certified gold, Rich won a Grammy for Best Country Vocal Performance, Male, and he also took home four ACM awards.\n\nAfter \"The Most Beautiful Girl,\" number one hits came quickly — \"There Won't Be Anymore\" (re-released from his RCA sessions), \"A Very Special Love Song,\" \"I Don't See Me in Your Eyes Anymore\" (also from RCA), \"I Love My Friend,\" and \"She Called Me Baby\" (RCA) all topped the country charts, and several of the songs also crossed over into the pop charts. Mercury began re-releasing his Smash recordings, and two of them — \"A Field of Yellow Daisies\" and \"Something Just Came Over Me\" — became minor hits. All of this success led the CMA to name him Entertainer of the Year in 1974.\n\nRich didn't quite dominate the charts in 1975 as he did the previous year, but he did have three Top Five hits: \"My Elusive Dreams,\" \"Every Time You Touch Me (I Get High),\" and \"All Over Me,\" plus the Top Ten \"Since I Fell For You.\" Even though he was at the peak of his popularity, Rich had begun to drink heavily, causing considerable problems off-stage. His destructive behavior culminated at the CMA ceremony for 1975, when he presented the award for that year's Entertainer of the Year. Instead of reading the name of the winner, he set fire to the certificate that named the new winner, who happened to be John Denver. Fans and industry insiders were outraged, and Rich had trouble having hits throughout 1976 — none of his singles cracked the Top 20.\n\nThe slump in his career couldn't be completely attributed to Rich's behavior. His records had begun to sound increasingly similar, as he and Sherrill were working over the same territory they began exploring in 1968. There were exceptions — such as 1976's acclaimed gospel record, Silver Linings — but it took Rich until 1977 to break back into the Top Ten with the number one \"Rollin' With the Flow.\" Early in 1978, he signed with United Artists and throughout that year had hits on both Epic and UA. Rich worked at United Artists with Larry Butler, a producer who had a similar style to Sherrill. Epic continued to have hits, as \"Beautiful Woman\" reached the Top Ten in the summer and a duet with Janie Fricke, \"On My Knees,\" became his last number one hit that fall. \"I'll Wake You Up When I Get Home,\" taken from the Clint Eastwood movie Every Which Way but Loose, was a number three hit early in 1979; it would be his last Top Ten single.\n\nRich struggled to have a big hit throughout 1979, but none of his singles were anything more than a minor success. In 1980, he switched labels to Elektra, resulting in the number 12 single \"A Man Just Don't Know What a Woman Goes Through\" in the fall of that year. One more Top 40 hit followed — \"Are We Dreamin' the Same Dream\" early in 1981 — but Rich decided to remove himself from the spotlight. For over a decade, Rich was silent, living in semiretirement and only playing the occasional concert. He returned in 1992 with Pictures and Paintings, a jazzy record produced by journalist Peter Guralnick and released on Sire.\n\nPictures and Paintings received positive reviews and restored Rich's reputation, but it would be his last record. Rich died from a blood clot in his lung in the summer of 1995, when he was travelling to Florida with his wife, Margaret Ann.\n\n <a href=\"https://www.last.fm/music/Charlie+Rich\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
