{"artist":{"name":"Charly García","mbid":"f1cd52dc-49d1-4df6-93ea-3587d8fba30b","url":"https://www.last.fm/music/+noredirect/Charly+Garc%C3%ADa","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c624afe53f4e48c09dee1e8522c768a3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c624afe53f4e48c09dee1e8522c768a3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c624afe53f4e48c09dee1e8522c768a3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c624afe53f4e48c09dee1e8522c768a3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c624afe53f4e48c09dee1e8522c768a3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c624afe53f4e48c09dee1e8522c768a3.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"128239","playcount":"3285225"},"similar":{"artist":[{"name":"Serú Girán","url":"https://www.last.fm/music/Ser%C3%BA+Gir%C3%A1n","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f9c2c27699984d76886bcdce8b85173a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f9c2c27699984d76886bcdce8b85173a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f9c2c27699984d76886bcdce8b85173a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9c2c27699984d76886bcdce8b85173a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9c2c27699984d76886bcdce8b85173a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9c2c27699984d76886bcdce8b85173a.png","size":""}]},{"name":"Luis Alberto Spinetta","url":"https://www.last.fm/music/Luis+Alberto+Spinetta","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a7900eb5346e442ebb69e8bf2e2d2d44.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a7900eb5346e442ebb69e8bf2e2d2d44.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a7900eb5346e442ebb69e8bf2e2d2d44.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a7900eb5346e442ebb69e8bf2e2d2d44.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a7900eb5346e442ebb69e8bf2e2d2d44.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a7900eb5346e442ebb69e8bf2e2d2d44.png","size":""}]},{"name":"Fito Páez","url":"https://www.last.fm/music/Fito+P%C3%A1ez","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/74dbb364263047e19c8c297ed7590844.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/74dbb364263047e19c8c297ed7590844.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/74dbb364263047e19c8c297ed7590844.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/74dbb364263047e19c8c297ed7590844.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/74dbb364263047e19c8c297ed7590844.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/74dbb364263047e19c8c297ed7590844.png","size":""}]},{"name":"Sui Generis","url":"https://www.last.fm/music/Sui+Generis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a8894cefaf42406086ed743806bdec68.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a8894cefaf42406086ed743806bdec68.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a8894cefaf42406086ed743806bdec68.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a8894cefaf42406086ed743806bdec68.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a8894cefaf42406086ed743806bdec68.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a8894cefaf42406086ed743806bdec68.png","size":""}]},{"name":"Los Abuelos de la Nada","url":"https://www.last.fm/music/Los+Abuelos+de+la+Nada","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/eae7bab996d5474d999ca89026b5e2b2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/eae7bab996d5474d999ca89026b5e2b2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/eae7bab996d5474d999ca89026b5e2b2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eae7bab996d5474d999ca89026b5e2b2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eae7bab996d5474d999ca89026b5e2b2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/eae7bab996d5474d999ca89026b5e2b2.png","size":""}]}]},"tags":{"tag":[{"name":"Rock Argentino","url":"https://www.last.fm/tag/Rock+Argentino"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"argentina","url":"https://www.last.fm/tag/argentina"},{"name":"Rock en Espanol","url":"https://www.last.fm/tag/Rock+en+Espanol"},{"name":"rock argento","url":"https://www.last.fm/tag/rock+argento"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/Charly+Garc%C3%ADa/+wiki"}},"published":"12 Jun 2006, 17:13","summary":"One of the most important rock musicians in Latin America, Carlos Alberto García Moreno, better known as Charly García is a keyboardist, guitarist and singer-songwriter, born in Buenos Aires, Argentina in 1951. \n\nA former member of the legendary bands Sui Generis (1972-1975), Porsuigieco (1976), La Máquina de Hacer Pájaros (1977-1978) and Serú Girán (1978-1982), García has behind him a 40-year musical career that includes these bands -and his solo work- that carries on to this day. <a href=\"https://www.last.fm/music/+noredirect/Charly+Garc%C3%ADa\">Read more on Last.fm</a>","content":"One of the most important rock musicians in Latin America, Carlos Alberto García Moreno, better known as Charly García is a keyboardist, guitarist and singer-songwriter, born in Buenos Aires, Argentina in 1951. \n\nA former member of the legendary bands Sui Generis (1972-1975), Porsuigieco (1976), La Máquina de Hacer Pájaros (1977-1978) and Serú Girán (1978-1982), García has behind him a 40-year musical career that includes these bands -and his solo work- that carries on to this day.\n\nCharly García was the eldest son in an upper-middle class family. His father taught mathematics and physics in elementary school, while his mother produced radio music shows, mainly shows featuring folkloric music.\n\nCharly began to show musical talent at an early age. At three, he received a toy piano as a gift, and soon he surprised his mother with his ability to compose and play coherent melodies, leading her to enlist him in a prestigious conservatory, the Thibaud Piazzini. At age twelve, he received the title of Music Professor. Charly developed perfect pitch as a child.\n\nThe beginning: Sui Generis\n\nThe Beatles appeared in Charly's life when he was thirteen. Having previously only been exposed to classical music and folk, he would describe the Beatles as \"classical music from Mars\". In high school he met Carlos Alberto \"Nito\" Mestre and the two fused their bands to give birth to Sui Generis.\n\nThe band at first experimented with psychedelic rock, but its style would quickly establish as folk-rock with some little influence from the symphonic rock of the day. At their first big gig, the band's bassist, guitarist and drummer all failed to appear. Only Charlie (García spelled his name with \"ie\" back then) and Nito Mestre showed up, playing piano and flute respectively. They were forced to play on their own, and were a hit with the audience despite the other musicians' absence. The band's strength lay in the songs' musical simplicity and romantic lyrics, which appealed widely to teenagers.\n\nAs the band gained in popularity, García faced mandatory military service. He performed extravagant stunts in an attempt to be discharged from service; for example, he took a corpse in a wheelchair for a walk in the sun because \"he was too pale\". Eventually, García ingested a large dose of amphetamines and feigned a heart attack, after which he was taken to a military hospital. There, he composed two songs: Botas locas (\"Crazy Boots\"), which was censored at the time, and Canción para mi muerte (\"Song for my Death). He was released from the military due to his purported mental health problems.\n\nIn 1972, Sui Generis released its first LP, Vida, which quickly became popular among Argentinian teenagers. Confesiones de invierno (\"Winter Confessions\"), their second LP, was released in 1973. This album showcased higher production values and better studio equipment, and was very successful commercially.\n\n1974 was a year of changes. Charlie lost interest in \"the piano and flute\" sound that Sui Generis had been developing, and decided that Sui Generis needed a change; the band would evolve to a more traditional rock sound, incorporating bass and drums. To that end, Rinaldo Rafanelli and Juan Rodríguez joined the band. In many live shows, Sui Generis also counted in with a gifted guitar player, David Lebón, whom Charly admired very much.\n\nWith new lining and style, the band was ready to launch its new album. Originally titled \"Instituciones\", its name was changed to \"Pequeñas anécdotas de las instituciones\" at the producer's suggestion. The album was intended as a reflection on the unstable nature of Argentinian social and political institutions at the time. Charlie's initial concept was to write a song for every traditional institution: the Catholic Church, the Government, the family, the Judicial System, the Police, the Army, and so on. However, two songs, Juan Represión, about the police, and Botas locas, about the army, were eliminated from the album by the censors. Two more, which referred to censorship itself, had to be partially modified. While Sui Generis achieved a different, more mature sound with \"Instituciones\", its public did not embrace it, preferring the old one. The album sold poorly.\n\nAround this time Charlie met his future wife, María Rosa Yorio, a singer who became the mother of his first son, Miguel García.\n\nCharly García continued composing, and during 1975, he prepared what would be Sui Generis´ fourth album, \"Ha sido\" (\"Has Been\"). However, growing frictions between Charlie and Nito and a wearying public prevented the album's release, and the decision was made to dissolve the band. Many songs from that ill-fated album were later included in other García´s LPs, such as \"Bubulina\" (1976) and Eiti Leda (1978).\n\nGoodbye, Sui Generis. The beginning of \"La máquina\"\n\nFinally, on September 9, 1975, Sui Generis scenified its farewell at the Luna Park Stadium, giving two shows for 20 thousand people — the largest audience in the history of Argentinian rock at the time. Many years later, Charlie said that before the show he was going around the stadium in a car, scared by the huge number of people. He was so nervous, he said, that he smoked 24 joints (cannabis cigarettes). In the 1970s, he has said, weed was \"like a religious thing\". The shows have been recalled as delirium-inducing, adrenaline-fueled delivery of great music. Two LP's recorded at the live shows were released that year, Adiós Sui Generis (\"Goodbye Sui Generis\") volumes I and II.\n\nIn 1976, Sui Generis also recorded a long play with Argentine musicians León Gieco, Raúl Porchetto (who musically resembles a soft-pop version of Gieco) and María Rosa Yorio. The LP was called \"Porsuigieco\" (mix of Raúl PORchetto, SUI Generis, León GIECO).\n\nAfter Sui Generis, certain things changed in Charly's life. From now on, he would be Charly instead of Charlie. Right after his son's birth, he broke up with María Rosa Yorio, who left with Nito Mestre. Charly met Marisa Parendeiras (nicknamed \"Zoca\"), who was from Brazil, and they became lovers.\n\nCharly continued working on musical projects. He now wanted to form a symphonical rock band. With Gustavo Bazterrica (guitar), Carlos Cutaia (keyboards), [artistJosé Luis Fernández (bass and cello), Oscar Moro (drums) and Charly García (keyboards and voice), \"La Máquina de Hacer Pájaros\" (\"The bird-making machine\") was born. Clarín, the most widely-read newspaper in Argentina, carried a comic strip called \"El Sr. García y la máquina de hacer pájaros\" (\"Mr. García and the bird making machine\") by Crist. Liking the name, Charly chose it for the band — not for egotistical motives, as it may seem.\n\nLa Máquina de Hacer Pájaros recorded two albums: La Máquina de Hacer Pájaros (1976) and Películas (\"Movies\", 1977). Some of the songs on \"Movies\" contained a political message directed against the military government of those years, during which Jorge Rafael Videla was the president of Argentina. At that time, repression, disappearances and censorship reached new heights. Perhaps as a result of the ambitious and complicated nature of its musical project, the band did not achieve popularity.\n\nFinally, in that year, the band said goodbye during the \"Festival del amor\" (\"Festival of Love\"), which was recorded, and released three years later on the LP Música del alma (\"Music of the soul\"). After the concert, Charly went to a hotel with Zoca. There they made a decision to escape to Sao Paulo, Brazil.\n\nSão Paulo. The birth of a new sound: Serú Girán\n\nIn São Paulo, Charly met Zoca's parents. The Parendeiras being a family of artists, they were fascinated with Charly. Artistically speaking, García was influenced by certain Brazilian artists, notably Milton Nascimento. Despite Sui Generis' commercial successes, Charly was destitute. In 1978, he lived a nature-centered lifestyle with Zoca in Brazil, fishing and gathering fruit . Soon David Lebón, an Argentinian musician and a friend of Sui Generis, joined them. Having a new musical partner, Charly again played, and the seed of a new musical project was planted. Charly was now determined to form a new band, but he was still broke. Making his way back to Buenos Aires, he began a new search for bandmates.\n\nCharly needed a bass player and a drummer, and he found both when he saw a band called Pastoral play. There he recruited a talented 19-year-old bass player, Pedro Aznar, as well his old partner from La Máquina de Hacer Pájaros, drummer Oscar Moro. The new band comprised Charly García on keyboards, guitar and voice, David Lebón on guitar, percussion and voice, Pedro Aznar on bass, keyboards and voice, and Oscar Moro on drums. Charly and David were the main songwriters.\n\nCharly now had a complete band, but still lacked money. At this point Charly signed a contract with a production group, although the terms of this deal were not advantageous to Charly. He did raise enough money to return to Sao Paulo with his new band mates members and record their first album. The band chose the name Serú Girán. \"Serú Girán\" was a combination of meaningless words Charly had invented as part of an eponymous nonsense song he wrote in Sao Paulo. The other band members liked the name so much that they also called their first long play Serú Girán, featuring the song Serú Girán, by Serú Girán.\n\nThe band returned to Buenos Aires and great expectations for García's new project. Their first show, in the traditional stadium Obras Sanitarias, was again advertised as \"Charly García... and Serú Girán\", due to contractual reasons. Thereafter, however, the name \"Charly García\" would no longer appear in the advertising — the band would simply go by Serú Girán. That first show was poorly received, the public having expected a new incarnation of Sui Generis. Serú Girán was completely different. The band had a new sound in which bass was very important, and a striking aesthetic with lyrics full of poetry. Puzzled audiences requested Sui Generis' old songs. In 1978, disco music was fashionable in Argentina. As a joke, Serú Girán played a song called Disco Shock, angering the public, whose rejection marred the show.\n\nThe following day, the \"specialized\" press called Serú Girán the worst band in Argentina and charged that David Lebón's vocals on their songs sounded \"homosexual.\" The band's relationship with the media was not cordial. One number of a popular Argentine magazine called Gente carried a disparaging article titled \"Charly García: ¿Ídolo o qué?\" (\"Idol or what?\"). Despite the chilly reception, Serú Girán's members were convinced they had a good project and persisted, organizing more shows. They eventually garnered some acceptance from an audience that warmed up to their style.\n\nSerú Girán carried on during 1979 and evolved markedly. Their new LP was titled \"La grasa de las capitales\" (\"Grease,\" or \"Fat,\" \"of the Capitals\") and its cover was a joke directed at the magazine Gente. The stronger and more direct nature of the lyrics, which criticized the media, including specifically magazines (especially Gente), fashionable music, radio and so on almost got them sent to jail. The public, however, gave the album an enthusiatic reception. The band's shows improved progressively, and eventually were performed in larger venues. The \"specialized\" press changed its tune, and a romance seemed to develop between the people and Serú Girán.\n\n1980: The \"Argentinian Beatles\"\n\nExpectations were high in 1980 for Serú Girán's new long play, which would be called Bicicleta (\"Bicycle\") -- a name that Charly had favored for the band (but was panned by the other members). The band sounded more mature on this record. The music was modern and strong, a key feature being the melodies. The role of the bass guitar was again central, and Pedro Aznar's work became more prominent.\n\nIn 1979, Charly almost went to jail because of the band's lyrics, considered too clear and direct in some quarters. Even as the music's political message became stronger, it was concealed in an effort to avoid censorship and another close call with the authorities. But the message remained, ready to be heard by ears that wanted to hear it. Canción de Alicia en el país (\"Song of Alice in the (Wonder)Land\") drew an uncanny analogy between Lewis Carroll's story and the Argentinian military government. Encuentro con el diablo (\"Meeting with the Devil\") is a reference to the band's meeting with Albano Harguindeguy, who was frequently referred to, behind his back, as the \"Devil.\" A military man, he was Security Minister during those years. He gave talks to some artists, ordering them to tone down their work or leave the country -- a policy that led many artists to leave Argentina at that time.\n\nThe band was very successful commercially, and fans found its shows amazing and considered the music Charly's best ever. Serú Girán was dubbed \"The Argentinian Beatles\", and Charly began to receive recognition as a great artist. Serú Girán was the first popular rock band that drew a following from among both the rich and the poor; rock was no longer circumscribed to its historically marginal position. In a recent interview, David Lebón said, \"Actually we were much more like Procul Harum than the Beatles, a legendary band: a rock \"viola\" player (Lebón), a classical pianist (García) an infernal percussionist (Moro) and a virtuoso bass player (Aznar)\".\n\nLuis Alberto Spinetta was another Argentine rock star of the time. His first band, Almendra, was one of the first in Argentinian rock, getting its start before Sui Generis; now he had a band called Spinetta Jade. Perhaps because his style was darker, more complicated, and found harder to understand by many, he was a less popular star than Charly, and they were portrayed as enemies. Luis and Charly put that myth to bed on September 13, 1980, as their bands, Serú Girán and Spinetta Jade, played together in what has been considered one of the greatest shows in the history of Argentinian rock.\n\nPatricia Perea, a journalist who worked for a magazine called El Expreso Imaginario (\"Imaginary Express\"), was not among the fans of Serú Girán. The magazine disliked them and criticized them strongly after they played in Córdoba, the city Ms. Perea was from. Serú Girán took revenge on Ms. Perea through their fourth LP: Peperina, directed at her, featuring a song about her which was also called Peperina. In Córdoba, the traditional Argentinian infusion yerba mate is mixed with the herb \"menta peperina\" (Bystropogon mollis, similar to peppermint), which is also used as a tea. Followers of the band considered Peperina a fantastic album with great melodies, superb performance from Aznar, and the songs -- which are critical, especially of high society -- poetic. Peperina can be viewed as a summary of Serú Girán's work.\n\nOne of the songs on Peperina is titled Llorando en el espejo (\"Crying in the mirror\"), and contains a phrase that says \"La línea blanca se terminó/no hay señales en tus ojos y estoy/llorando en el espejo...\" (\"The white line has finished/there aren't any signs in your eyes and I'm/crying in the mirror...\"). With its sad melody, the tears, the mirror, and that \"white line,\" the song seems to portray cocaine addiction. At the time, those lyrics did not draw much attention.\n\n\"Peperina\" carried a political message. The song \"José Mercado\" (\"Joseph Market\") was a clear reference to José Martínez de Hoz, the minister of economy. The lyrics \"José Mercado compra todo importado (...) / José es licenciado en economía, pasa la vida comprando porquerías\" (which translate as \"Joseph Market buys only imported products (...) Joseph has a degree in economy, spends his life buying garbage\") referred to Argentina's policy of economic liberalism, with its profusion of imported (and often low-quality) products.\n\n1981 may have been the best year for the band in terms of live performances. In 2000, a Serú Girán fan found some tape recordings of a December 1981 show at the Teatro Coliseo and took them to Serú Girán drummer Oscar Moro, who \"cleaned\" them for the CD Yo no quiero volverme tan loco (\"I don't want to go that crazy\") published in 2000.\n\nIn early 1982, Pat Metheny, who was one of Pedro Aznar's favorite musicians, invited Pedro to join his band. Feeling that he could not pass up this opportunity, Aznar accepted the offer and left Serú Girán. In March of that year, Serú returned to Obras Sanitarias and put on a highly successful show which was recorded, and published that year as \"No llores por mí, Argentina\" (\"Don't cry for me, Argentina\"). With the loss of Pedro, the band initially considered the idea of having David Lebón play both guitar and bass. But David and Charly had some differences chalked up to \"musical taste\", and without Pedro things were not the same. Moreover, both were mature enough to begin their own careers. That was the end of Serú Girán, for the time.\n\nGoodbye Serú Girán. Hello Charly García\n\nIn 1982, Argentina was undergoing political change. After the Malvinas War (in the Falkland Islands) in June, social chaos erupted and the military government lost much of its power. The kidnappings had stopped and censorship had weakened.\n\nCharly García debuted as a soloist with a double LP, Pubis Angelical (\"Angelical Pubis\"), which was the eponymous movie's soundtrack, and the powerful Yendo de la cama al living (\"Going from the bed to the living room\"). Four hit songs from this album left their historical mark:\n\n   1. No bombardeen Buenos Aires (\"Do not bomb Buenos Aires\") showed the panic in lived out in the city during the Falklands war, and strongly criticized the army, especially the President Leopoldo Galtieri.\n   2. Yendo de la cama al living used the experience of being trapped in a confined space as a symbol of the repression of ideas.\n   3. Inconsciente colectivo (\"Collective unconscious\") was a message of hope for the stricken Argentinian people.\n   4. Yo no quiero volverme tan loco (\"I don't want to go that crazy\") was a beautiful song about the adolescent spirit of freedom and rebelliousness.\n\nThe LP's presentation took place in December at the Ferrocarril Oeste Stadium (or Ferro). As the song No bombardeen Buenos Aires drew to a close near the end of the show, backdrop props simulating Buenos Aires were destroyed with fireworks.\n\nIn 1983, Charly left Buenos Aires with a small suitcase. When he came back to Buenos Aires from New York, he brought a quality LP titled Clics Modernos (\"Modern Clix\") that was different from anything previously done in Argentinian rock — it was highly singable rock music you could also dance to. Its strong message referred the past years: Exodus in Plateado sobre plateado (huellas en el mar (\"Silver on Silver, Footprints on the Sea\"), repression in Nos siguen pegando abajo (\"They keep hitting us down there\"), and Los dinosaurios (\"The Dinosaurs\"), a nostalgic but defiant remembrance of those who were kidnapped or killed.\n\nOn December 10, the course of Argentinian history took a turn as the government became a Democracy. Charly performed many well-received shows in 1984, and recorded another album during its last months. García also recorded a LP called Terapia intensiva (\"Intensive cares\"), another movie soundtrack. Piano Bar was released in 1984, completing García's golden trilogy. But in the grips of cocaine, García's personality was changing — he became more violent, unpleasant, and sometimes infantile. This new García's music also changed. While Piano Bar had great songs, the calm of the Sui Generis' days had given way to a cocaine-induced fury. Demoliendo hoteles (\"Demolishing Hotels\") expresses that anger, and its name recalls a hotel room that Charly destroyed completely because he did not like the décor. The song was also a release after so many years of not being able to say what he thought.\n\nDuring these years, García's band was home to many future Argentinian music stars, including Andrés Calamaro, Fito Páez, Pablo Guyot, Willy Iturri, Alfredo Toth and Fabiana Cantilo.\n\n1985–1989 Still a \"normal\" rock star\n\nAfter the success of Piano Bar, which was García's consecration as a soloist, 1985 was a year to slow down. Charly met again with Pedro Aznar in New York by chance, but they took advantage of this meeting and recorded Tango. It was a calm stage for García after his days of anger. The disc had some interesting material, but it did not achieve commercial success primarily due to limited distribution.\n\nIn 1987, García came back with Parte de la Religión (\"Part of the Religion\"), a very interesting LP. Many songs from that LP became hits. Two of them, No voy en tren (\"I don't take the train\") and Necesito tu amor (“I need your love”) are the perfect symbol of García's dichotomies: the first one says No necesito a nadie a nadie alrededor (“I don't need anybody around me”), and the second one says Yo necesito tu amor/tu amor me salva y me sirve (“I need your love/your love saves me and is useful to me”). This LP is also featured a song, Rezo por vos (“I pray for you”), which was part of a project with Luis Alberto Spinetta that was never finished.\n\nHis personal life was changing. After ten years with Zoca, Charly's behavior with other women brought disorder to their relationship; they were still together, but their relationship was of a different nature.\n\nIn 1988, Charly made his acting debut at the age of 36, playing a nurse in the movie Lo que vendrá (“What is to come”), the soundtrack of which he also composed. Being a nurse had long been one of García's obsessions. Later that year, the Amnesty International festival wrapped up in Buenos Aires. Starring international and local rock stars, Peter Gabriel, Bruce Springsteen, Sting, Charly García and León Gieco were there. Before the show began, Charly was extremely nervous, sitting and standing up on a chair. It has been reported that Peter Gabriel was surprised, and Bruce looked at Charly askance, at which Charly confronted Bruce and told him, almost yelling, \"Here, in Argentina, I'm the boss.\" The situation was tense, Springsteen was angry, and Sting forced Charly to sit down and began to massage him. Years later, Sting would be asked about Charly García: \"Charly? Quite a character...\" At that show, Charly was in a sorry condition: he was nervous and he could hardly sing. He was already a star, and he was applauded anyway.\n\nIn 1989, Charly released a new album, Cómo conseguir chicas (“How to get girls”). This would probably be his last \"normal\" album. He described it as \"Just a bunch of songs that were never published for different reasons\".\n\nCharly's father had long ago told him, \"Never write an anagram for someone if you don't want him or her to be pissed off\". During the Serú Girán years, his friend David Lebón told him something similar: \"Do not write a song for a woman if you love her, because she'll leave you\". The LP includes a song titled \"Shisyastawuman\" (a deliberately direct transliteration of \"She's just a woman\"), the first song García recorded in English that was written to a woman. The woman left him after hearing the song, just like Lebón had warned. A song named Zocacola that Charly dedicated to Zoca was included in this LP as well. A couple of months after the disc was released, Zoca left him.\n\nGarcía had changed. Physically, he looked older. His music was dark, and the earlier symphonical García from \"La Máquina de Hacer Pájaros\" was gone. Now, Charly's sound was closer to either punk rock, with violent songs such as No toquen (“Do Not Touch”), or a depressive and dark style as shown in No me verás en el subte (“You Won't See Me in the Subway”). Different and adverse times lay ahead.\n\nFor the international tour in 1989/1990, García formed a new band with Hilda Lizarazu, who sang backup vocals for Charly. He called her \"the First Lady\", but once in a show in Bolivia, García spat on Hilda. She hid her tears during the show, but quit the band afterwards.\n\n1990-1993 The days of excess\n\nIn 1990, Charly had many ideas but no band. Another important member of the band, Fabián \"Zorrito\" Von Quintiero, had left to another band, Los ratones paranoicos (“The Paranoid Mice”). Hilda Lizarazu and Carlos García López started a band called Man Ray. Charly was now alone. For his new disc, Filosofía barata y zapatos de goma (“Cheap Philosophy and Rubber Shoes”), he called many of his old friends, who helped record most of the songs. Assisting him, among others, were Andrés Calamaro, Rinaldo Rafanelli, Fabiana Cantilo, Nito Mestre, Pedro Aznar, Fabián Von Quintiero and even Hilda Lizarazu. The first issue came once the disc was released. Its last song was a rock version of the Himno Nacional Argentino, or the Argentinian national anthem. Amid controversy, García's version of the national anthem was forbidden for some days, but García was victorious, a judge authorizing the song. Many people liked it, seeing it as a fresh, sincere, strong and respectful version of the old song.\n\nCharly's social life changed with Zoca's absence. Using cocaine and other narcotics, he could go days and days without getting any sleep as he searched for the precious \"estado alfa\" (“Alpha Condition”), as he called the ideal moment of inspiration for songwriting. He played every night in nightclubs until morning and drank whisky prodigiosly, causing his friends to worry about him. He has said of that time: \"Creatively, I was great, better than ever. But my mind and body weren't synchronized, my body was taking a different direction\". That year, the Government of Buenos Aires organized \"Mi Buenos Aires Rock\" (\"My B.A. rock\"), a public rock festival on Avenue 9 de Julio, the city's most famous. The artists were to play for one half-hour, but Charly played for over two hours. He closed the festival with his version of the national song before one hundred thousand people.\n\nThose strong days ended in June of 1991. It became evident that Charly was feeling unwell, and he realized what had been clear to everybody else — he needed to rest. To this end, he went to a farm owned by evangelist preacher Carlos Novellis. Charly spent a few weeks there, but when he discovered that the place was actually a drug rehabilitation clinic, he decided to leave, and had a fierce argument with Novellis. While in the farm, he was only allowed visits with his friend Pedro Aznar. Those days gave rise to a new disc: Tango 4, illustrated with drawings of García's from that time at the farm. After Charly's stay at the farm, Zoca came back, becoming Charly's personal nurse for a time in 1991. But before the year was out, she had gotten completely tired of García's behaviour and left him for good.\n\nIn December, Charly returned to Ferro, the stadium where in 1982 he had introduced Yendo de la cama al living, after nine years. This time he arrived at the stadium exiting an \"ambulance\", assisted by some \"doctors\"; his band had even been re-baptized \"The nurses\". Charly thus chose to mock his \"health problems\". At that show, García seemed to have gained a good deal of weight, which was surprising since he had always been quite thin. Charly's fans felt that, far from helping him in any way, the management at the farm had taken money from him and brought about his weight gain. His voice was not the same, but he was still there.\n\nIn December 1992, Charly again embraced his past and surprisingly re-joined Serú Girán — Charly García, David Lebón, [Pedro Aznar] and Oscar Moro were back after ten years. A new album was recorded, titled Serú 92. It enjoyed great commercial success, but musically was sharply different from Serú Girán's other discs.\n\nSerú Girán performed two huge shows at the River Plate Stadium - Buenos Aires' largest. Serú Girán had always been at its best when live, the four members playing very well together. This time, in Moro's words, \"the show sounded like Charly García and Serú Girán\". Charly's demons were replacing Charly the artist. In the second show, Charly mocked David Lebón so much that David got upset and left the stage. Aznar followed him and convinced him to come back to finish the show. Things were obviously not the same. After that image, the dreams of those who looked forward to a new era for Serú Girán all but vanished. The Serú Girán reunion was just a meeting. \"Of course it was for the money, what did you think?\" commented García jokingly some time after the shows.\n\nDuring that year, García's friends saw him in especially miserable conditions, and convinced his mother Carmen to sign an authorization that forced Charly to be confined at a clinic in order to get over his addictions. Things did not work as hoped; Charly escaped only a few days after being admitted, and was enraged with his mother, with whom he does not speak today because of that episode. Charly was free again to continue with his self-destructive lifestyle.\n\n1994-1999 The Say no More era\n\nAfter not having released any new solo material since 1990, in 1994 García was ready to strike back. The new project was called La hija de \"La Lágrima\" (“«The Tear»'s Daughter”). It was a conceptual project which struck many as confusing and strange. It carried a prominent motif: the mercury tear, with which the album's cover is illustrated. Rumor had it that Charly had experimented, injecting himself with mercury. Officially, he spoke about \"a fantasy of mine, in which there was a whole underground society that worshiped the mercury tear\". The streets of Buenos Aires were filled with advertising: \"The genius has come back\". But this Charly seemed only a shadow of what he used to be. This LP would be an introduction to the future concept of \"Say no more\".\n\nIn 1994, Kurt Cobain, the leader of Nirvana, tragically ended his own life, adding to his legendary status in the eyes of the fans who saw him as a hero. Being one of them, García dyed his hair blonde.\n\nAlso during 1994, the Soccer World Cup was being played in the USA. Soccer player legend Diego Armando Maradona was involved in a dispute with FIFA regarding a drug test for ephedrine doping, which he failed, preventing him from playing. After Diego was sent home, Argentina lost two important matches and was knocked out of the World Cup. When the last match was about to end, Charly called Diego on his cell phone and sang to him \"live\" the Maradona's Blues, a song he composed for him. Diego cried when he heard \"Un accidente no es pecado/y no es pecado estar así\" (“An accident is not a sin/And is not a sin to feel like this”), and the two struck up a friendship.\n\nThis friendship would be threatened two years later, when Maradona became the poster boy for an anti-drug campaign let by the Argentinian government whose slogan was \"Sol Sin Drogas\"(\"Sun without drugs\"). Charly was among those who criticized the initiative as nasty, corrupt and altogether childish; during a concert he mocked the campaign with a play in words, saying \"I bet 'Drugs Without Sun\" is a whole lot better than 'Sun Without Drugs'.\" The remark earned him several appearances before a judge, accused of being an apologist for drugs. Charly was ultimately absolved.\n\nAfter a fight with his mother he changes his name from \"Carlos García Moreno\" to \"Carlos García Lange\", removing his mother's surname and changing it for the second surname of his father.\n\n1995 was again a musical year. García formed a new band for touring on summertime (with María Gabriela Epumer, Juan Bellia, Fabián Von Quintiero, Jorge Suárez and Fernando Samalea) and named it as \"Casandra Lange\". His idea with the band was play songs Charly had heard as a teen, such as \"Sympathy for the devil\" (Mick Jagger-Keith Richards) and \"There's a place\" (John Lennon-Paul McCartney). He recorded the performances and edit a live album, \"Estaba en llamas cuando me acosté\" (\"It was on fire when I went to bed\"). All of the songs in this album are in English except for \"Te recuerdo invierno\" (\"I remember you, winter\"), which García had written in the early 70's but never recorded with Sui Generis.\n\nIn May, Charly recorded \"Hello! MTV Unplugged\", often considered the last time that the rock star played his music to his full potential.\n\n\"Say no more\" arrived in 1996. Charly's life was terribly twisted: drugs, arguments with old friends, and public scandals. \"Say no more\" was a new concept for García: \"'Say no more' would be in music what painting directly on the canvas would be for a painter\", he explained. He also said that the LP \"will only be understood in 20 years\". Some sparks of his genius showed, but longtime fans of Charly were not very fond of it at first. Today, the album is considered García's masterpiece, and \"Say no more\" the classic slogan identifying Charly García and all his music.\n\nDuring 1997, García recorded \"Alta Fidelidad\" (\"High Fidelity\") with Mercedes Sosa. Both had known each other since his childhood, so they decided to publish a collaborative work on which Mercedes would sing her favorite García songs of all time.\n\nIn 1998, \"El aguante\" (\"Holding On\") was released. This production featured many covers translated to Spanish by García, like \"Tin Soldier\" (Small Faces), or \"Roll over Beethoven\" (Chuck Berry). A significant song which was not included was \"A whiter shade of pale\", originally released by Procol Harum, a band that Charly had always admired. Apparently, the former members of Procol Harum did not authorize García's version because it had a sly reference to cocaine, so it had to be removed from the album shortly before its release. The new version said: \"(..)yo soy una cajita / con un polvo ya lo ves / todo parece ir conexo / con su blanca palidez(...)\", which means \"I'm just a tiny box / with a dust, as you see / everything seems to be connected / with its whiter shade of pale\".\n\nIn February 1999, García performed at the close of the free public-rock festival \"Buenos Aires Vivo III\" (BA Live III). There he played a huge concert for 250.000 fans who attended one of the biggest concerts in Argentina to date. In July 1999, Charly agreed to give a private performance at the Quinta de Olivos (the Argentine Presidential residence), at the invitation of the president, Carlos Saúl Menem. On a televised bit of this event he was seen in good spirits, carrying out antics such as playing with the security cameras, or trying to teach the president how to play the piano. A limited edition of a disc memorializing the famous concert, \"Charly & Charly\", was released that year.\n\nMaravillización 2000-2003\n\nIn 2000, Charly and Nito Mestre decided to bring Sui Generis back to life. For the special occasion, they both composed the songs for a new LP, \"Sinfonías para adolescentes\" (\"Symphonies for Teenagers\"). Of course, things were very different after 25 years, but young and older fans were excited by the idea of the return of Sui Generis. This new period would be marked by García's new \"sound concept\" of Maravillización or \"Making something marvellous\", replacing the old dark \"Say no more\" style.\n\nFinally Sui Generis played again in the Boca Juniors's Stadium, for 25.000 fans on December 7th, 2000. Charly respected his fans and his old partner, and played for almost four hours in front of a delighted public, despite of the \"differences\" between the old and the new model Sui Generis, as regards sound, Charly's voice and behaviour, etc\n\nMany journalists and some fans criticized this return, stating that the main cause for it was the money and that both members of the band had changed so much, that the new album and show had nothing to do with the \"real\" Sui Generis.\n\nDuring 2001, ¡Si! Detrás de las paredes (“B [the musical note]! Behind the Walls”) was edited as the second and last Sui Generis's LP in this new era. It was a mash up between live versions of the Boca Juniors's concert, new songs (as \"Telepáticamente\") and some versions of old songs. (such as \"Rasguña Las Piedras\", featuring Gustavo Cerati, former leader of Soda Stereo).\n\nBesides on October the 23rd 2001, Charly reached age 50, despite of the forecasts of many journalists who forecasted that his lifestyle would not let him to reach his sixth decade. For the occasion, a special concert in the Colliseum Theater was organized.\n\nAfter this interruption in his solo Career, Charly got back to the spotlight after releasing \"Influencia\" (\"Influence\") in 2002. This new disc contained some interesting songs that made an impact in the Latin American world of Rock, such as \"Tu Vicio\" (\"Your Vice\"), \"Influencia\" (\"Influence\", translated cover from Todd Rundgren's original \"Influenza\") and \"I'm Not In Love\" (featuring Tony Sheridan). Even though it included old songs as \"Happy And Real\" (From Tango IV, 1991) or \"Uno A Uno\" (\"One to one\", from \"El Aguante\", 1998) and different versions of the same songs, this was probably García's best album since 1994.\n\nLive concerts of \"Influencia\" were probably Charly's best in a long, long time. With the strong support of María Gabriela Epumer in chorus and guitar, Charly showed up in many different concerts, such as two in the Luna Park Stadium, Viña del Mar and Cosquín Rock with correct performances.\n\nIn a confusing and unfortunate episode, María Gabriela suddenly passed away on June 31 2003. The \"first lady\" or the \"Charly's Angel\" was just 39 years old and suffered a heart attack after having lived a very healthy life. García was hit by this, and his concerts were never the same.\n\nFinally in October 2003, Charly released \"Rock and Roll, Yo\" (\"Rock and Roll, Me\"), dedicated to María Gabriela. The songs weren't as good as those in \"Influencia\", his voice often sounds out of tune and, once again the LP contained too many versions and translated convers such as \"Linda Bailarina\" (\"Pretty Ballerina\", Michael Brown) or \"Wonder\" (\"Love´S In Need Of Love Today\" by Stevie Wonder). This time his shows weren't so convincent, and Epumer's absence could be felt by the fans.\n\nSince 2004\n\nGarcía's shows in the latest years have changed. Lately, his absences, tantrums, shows that he abandons after a couple of songs have become more and more frequent. He gets really angry when the sound is not as good as he would like, and that has led him to cancel a lot of shows. This has become so common that in one of his last shows the organizer printed \"We don't assume the responsibility for the length of the show\" on the tickets.\n\nHis most remarkable \"positive\" landmark was probably to play once again in Casa Rosada, the Argentine government palace. This was one of the many concerts organized there by the Argentine president, Néstor Kirchner.\n\nSince 2004, all his musical projects have been abandoned by himself before they could be released.\n\nDuring 2006 Garcia recorded \"Kill Gil\".\n\nWikipedia® <a href=\"https://www.last.fm/music/+noredirect/Charly+Garc%C3%ADa\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
