{"artist":{"name":"Chico","mbid":"a2b0affd-963f-46a3-9a8d-5b9d1332ccb3","url":"https://www.last.fm/music/Chico","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1e9f9e8e448d4fb0bb0c6783738d2000.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1e9f9e8e448d4fb0bb0c6783738d2000.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1e9f9e8e448d4fb0bb0c6783738d2000.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1e9f9e8e448d4fb0bb0c6783738d2000.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1e9f9e8e448d4fb0bb0c6783738d2000.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1e9f9e8e448d4fb0bb0c6783738d2000.png","size":""}],"streamable":"0","ontour":"1","stats":{"listeners":"16351","playcount":"111723"},"similar":{"artist":[{"name":"CO.IN.","url":"https://www.last.fm/music/CO.IN.","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1a14ed0854fc44f2a7a65ac95080ceef.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1a14ed0854fc44f2a7a65ac95080ceef.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1a14ed0854fc44f2a7a65ac95080ceef.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1a14ed0854fc44f2a7a65ac95080ceef.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1a14ed0854fc44f2a7a65ac95080ceef.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1a14ed0854fc44f2a7a65ac95080ceef.png","size":""}]},{"name":"Ctrl-Alt-Del","url":"https://www.last.fm/music/Ctrl-Alt-Del","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/031774ee7d0b4b599e0f52a385040dd2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/031774ee7d0b4b599e0f52a385040dd2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/031774ee7d0b4b599e0f52a385040dd2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/031774ee7d0b4b599e0f52a385040dd2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/031774ee7d0b4b599e0f52a385040dd2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/031774ee7d0b4b599e0f52a385040dd2.png","size":""}]},{"name":"Degree","url":"https://www.last.fm/music/Degree","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c6a273f6e5254335bb7158096bbf9e81.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c6a273f6e5254335bb7158096bbf9e81.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c6a273f6e5254335bb7158096bbf9e81.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c6a273f6e5254335bb7158096bbf9e81.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c6a273f6e5254335bb7158096bbf9e81.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c6a273f6e5254335bb7158096bbf9e81.png","size":""}]},{"name":"Alozade","url":"https://www.last.fm/music/Alozade","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/aabe1f0d5424457ab305b423db2ad1b0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/aabe1f0d5424457ab305b423db2ad1b0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/aabe1f0d5424457ab305b423db2ad1b0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aabe1f0d5424457ab305b423db2ad1b0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aabe1f0d5424457ab305b423db2ad1b0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aabe1f0d5424457ab305b423db2ad1b0.png","size":""}]},{"name":"Hawkeye","url":"https://www.last.fm/music/Hawkeye","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0e952ceeeab14cf3b939b54dc6ca0cb1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0e952ceeeab14cf3b939b54dc6ca0cb1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0e952ceeeab14cf3b939b54dc6ca0cb1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0e952ceeeab14cf3b939b54dc6ca0cb1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0e952ceeeab14cf3b939b54dc6ca0cb1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0e952ceeeab14cf3b939b54dc6ca0cb1.png","size":""}]}]},"tags":{"tag":[{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"Nu Metal","url":"https://www.last.fm/tag/Nu+Metal"},{"name":"polish","url":"https://www.last.fm/tag/polish"},{"name":"dancehall","url":"https://www.last.fm/tag/dancehall"},{"name":"reggae","url":"https://www.last.fm/tag/reggae"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Chico/+wiki"}},"published":"21 Jul 2006, 16:13","summary":"There are four artists with the name Chico:\n\n1) Yousseph \"Chico\" Slimani (born April 2, 1971) is a Moroccan pop singer who rose to prominence in the United Kingdom after reaching the finals of the 2005 series of the talent show The X Factor.\n\nChico was born in Wales but moved to Morocco when he was a baby. While in Morocco he was a mountain goat herder until the age of 13, before once again moving back to the UK at age 14 to live in Crawley, West Sussex. <a href=\"https://www.last.fm/music/Chico\">Read more on Last.fm</a>","content":"There are four artists with the name Chico:\n\n1) Yousseph \"Chico\" Slimani (born April 2, 1971) is a Moroccan pop singer who rose to prominence in the United Kingdom after reaching the finals of the 2005 series of the talent show The X Factor.\n\nChico was born in Wales but moved to Morocco when he was a baby. While in Morocco he was a mountain goat herder until the age of 13, before once again moving back to the UK at age 14 to live in Crawley, West Sussex. Chico has had a number of jobs in his life. He was a hairdresser and also an electrician, before joining exotic dance troupe Extreme Force, to raise money for his ill grandmother. He then auditioned for The X Factor. Chico says he practised his singing most in the bathroom, and he grew up with Arabic and Indian music. Chico became a Sufi disciple 16 months ago.\n\nDuring The X Factor competition, Chico was mentored by manager Sharon Osbourne. Slimani's dancing impressed X Factor judges, and he was popular with viewers, but he failed to reach the final of the ITV talent show, being voted out in the penultimate episode. It was eventually won by singer Shayne Ward in December 2005. Slimani had originally planned to release his single, which he performed during the talent show, before Christmas. \"I'm absolutely loving every minute of it, and looking forward to releasing the single at last,\" he was stated saying.\n\nThe ex-goatherd and stripper released his debut single, \"It's Chico Time\", in February 2006, entering the UK Singles Chart at #1 on 5 March 2006. He is taking part in a nationwide X Factor tour, which begins in Newcastle upon Tyne next month. \"The whole thing has been unbelievable,\" the 34-year-old said.\n\n2/ The distinctively haunting It Go So Now that tickles your senses in any session, club or mixtape can only be delivered by Dancehall singer Chico. Born Patrick Walker, the sole son found in a family full of girls, Chicos childhood transported him from the quaint town of Maverly over to Spanish Town settling later in one of Jamaicas widely known district; Waterhouse. It was there that he was dubbed the nickname Patchico as several of his new friends though he had a multi-ethic look, Chinese being the dominate feature noticed. Chico was the final result as the shortened version of this nickname.\n\nWhile many entertainers have had the ambition for artistry since childhood, Chico was on a steady business path, bent on being an accountant far into high school. However, fate would intervene and while singing in church as a soloist he developed the thirst for performing and something solidified deep within his soul; singing was his calling. Much like ministry, the trek into the music industry has had its challenges.\n\nTaking on a job after high school, Chico eventually made his way to King Jammys studio in 1993 where he recorded a cover version of Tevin Campbells Why Oh Why. Before long, Chico was a fixture at Main Street studios where he quickly became a part of the growing talent associated with the studio. Chicos song Stamina Body, produced by Richard Browne, nephew to Danny Browne the owner of Main Street studios, broke Chicos velvety voice into the open arms of Dancehall fans. He backed this up with Make Noise recorded with producer Donovan Germaine for the Penthouse Label.\n\nChico managed to do what most artists in Jamaica seek out to accomplish in the duration of their career; record with the esteemed producer Dave Kelly. Together they laced the track Naah Stoop featuring deejay Goofy. Before long, Chico became associated with Daves own Madhouse Records Camp, recording hits like; Yuh No Care, Enemy and Yuh Have Your Own. Sticking with the la crème de crop of producers has awarded Chico solid selector favorites like Hold Yuh Man with Jermey Harding, Rail Up by Richie D, Pavarotti, Hard, So Fly, Chemistry, No Change, Pop No Style and more!\n\nIn 2003, Chico recorded the collaboration Ganja Breed with dancehall deejay Sean Paul for Seans Platinum selling Dutty Rock album. While the song wasnt released as a single, it was a favorite amongst hip hop massives who tuned into Sean Paul due to his smokers oriented tunes like Gimmie The Light. Chicos also linked up with the other formidable Kelly producer; Tony CD Kelly, whose timeless riddims have helped add top quality meat to his catalog with tunes like; Lock Di Endz and Me Dat.\n\nWith a worldwide focus, Chico recorded the song Hey Sexy Wow with Universal Frances recording artist Lord Kossity, resulting in a number one hit for both artists. The two are presently recording the follow up albums lead single. Locally, Chicos collaboration with Alozade for his song Bad Out Deh and Screwface also featuring Kiprich has resulted in a resurgence of his popularity. With practically 100 songs to his credit, Chico has a solid catalog allowing him to tour worldwide in countries such as; Canada, Costa Rica, England, Japan, St. Vincent, the US, and he has performed three times on the annual German Splash where he was very well received. With his creativity Chico is undoubtedly destined for Stardom.\n\n3) CHICO are a band from POLAND, fusing rock with Hardcore and enhancing their music with a Silesian drum n' bass, ragga and jazz flow.\nTheir debut album is called \"One Big Alternative\".\n\nSites:\nwww.myspace.com/chicomusic or www.chico.pl\n\n4) Chico is a lesser-known Japanese artist who has done songs for various bishôjo games, including 光を探して (Hikari o Sagashite) for LOVE.EXE and Girls, Be Ambitious!! for Omakase! Trouble Angel. She often works with 桃井はるこ (Momoi Haruko/Halko) under the NAKiD label.\n <a href=\"https://www.last.fm/music/Chico\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
