{"artist":{"name":"Chico Hamilton","mbid":"699067a0-ae8c-45fc-82c1-6227d91f9bb4","url":"https://www.last.fm/music/Chico+Hamilton","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/29965fb5e7d042a3b360da0829393e02.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/29965fb5e7d042a3b360da0829393e02.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/29965fb5e7d042a3b360da0829393e02.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29965fb5e7d042a3b360da0829393e02.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29965fb5e7d042a3b360da0829393e02.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29965fb5e7d042a3b360da0829393e02.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"76588","playcount":"346585"},"similar":{"artist":[{"name":"Chico Hamilton Quintet","url":"https://www.last.fm/music/Chico+Hamilton+Quintet","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c56f3ed74b1e4d89491fe9ce7265d93c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c56f3ed74b1e4d89491fe9ce7265d93c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c56f3ed74b1e4d89491fe9ce7265d93c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c56f3ed74b1e4d89491fe9ce7265d93c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c56f3ed74b1e4d89491fe9ce7265d93c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c56f3ed74b1e4d89491fe9ce7265d93c.png","size":""}]},{"name":"Gabor Szabo","url":"https://www.last.fm/music/Gabor+Szabo","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1aaa1250a9ec45649cc9a1037f3c0780.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1aaa1250a9ec45649cc9a1037f3c0780.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1aaa1250a9ec45649cc9a1037f3c0780.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1aaa1250a9ec45649cc9a1037f3c0780.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1aaa1250a9ec45649cc9a1037f3c0780.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1aaa1250a9ec45649cc9a1037f3c0780.png","size":""}]},{"name":"Gerry Mulligan","url":"https://www.last.fm/music/Gerry+Mulligan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/df3dd3a69bf1480a9c6ed1c8154471fe.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/df3dd3a69bf1480a9c6ed1c8154471fe.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/df3dd3a69bf1480a9c6ed1c8154471fe.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df3dd3a69bf1480a9c6ed1c8154471fe.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df3dd3a69bf1480a9c6ed1c8154471fe.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/df3dd3a69bf1480a9c6ed1c8154471fe.png","size":""}]},{"name":"Jimmy McGriff","url":"https://www.last.fm/music/Jimmy+McGriff","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/06bf9294034b40598627b49329dded8a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/06bf9294034b40598627b49329dded8a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/06bf9294034b40598627b49329dded8a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06bf9294034b40598627b49329dded8a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06bf9294034b40598627b49329dded8a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06bf9294034b40598627b49329dded8a.png","size":""}]},{"name":"Jimmy Giuffre","url":"https://www.last.fm/music/Jimmy+Giuffre","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9c2a714117244697bdee76b219c809e7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9c2a714117244697bdee76b219c809e7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9c2a714117244697bdee76b219c809e7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c2a714117244697bdee76b219c809e7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c2a714117244697bdee76b219c809e7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c2a714117244697bdee76b219c809e7.png","size":""}]}]},"tags":{"tag":[{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"drums","url":"https://www.last.fm/tag/drums"},{"name":"cool jazz","url":"https://www.last.fm/tag/cool+jazz"},{"name":"blue note","url":"https://www.last.fm/tag/blue+note"},{"name":"funk","url":"https://www.last.fm/tag/funk"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Chico+Hamilton/+wiki"}},"published":"06 Jan 2007, 04:46","summary":"Chico Hamilton (Foreststorn Hamilton) (September 21, 1921, Los Angeles - died Nov 25 2013) was a jazz musician.\n\nHe was born in Los Angeles in 1921 and was raised locally as the Central Avenue jazz scene was beginning to coalesce. In the 1940s, he performed with Lionel Hampton, Duke Ellington and Count Basie. He appears in the \"March Milastaire\" number in the film You'll Never Get Rich (1941) as part of the backing group supporting Fred Astaire. He was one of the original members of the Gerry Mulligan quartet of the early 1950s. <a href=\"https://www.last.fm/music/Chico+Hamilton\">Read more on Last.fm</a>","content":"Chico Hamilton (Foreststorn Hamilton) (September 21, 1921, Los Angeles - died Nov 25 2013) was a jazz musician.\n\nHe was born in Los Angeles in 1921 and was raised locally as the Central Avenue jazz scene was beginning to coalesce. In the 1940s, he performed with Lionel Hampton, Duke Ellington and Count Basie. He appears in the \"March Milastaire\" number in the film You'll Never Get Rich (1941) as part of the backing group supporting Fred Astaire. He was one of the original members of the Gerry Mulligan quartet of the early 1950s. During the late 1950s, Hamilton pioneered a style sometimes called chamber jazz. He performed on the soundtrack of the Bing Crosby/Bob Hope film, \"The Road to Bali\" and on a number of tours with Lena Horne. In 1958, he brought Eric Dolphy to wider prominence.\n\nThe group changed directions in the 1960s. New talents such as saxophonist Charles Lloyd and guitarists Gabor Szabo and Larry Coryell started out performing with him. He composed the soundtracks for films such as Roman Polanski's \"Repulsion\".\n\nOver the years, Hamilton has performed with legendary artists such as Ella Fitzgerald, Billie Holiday and Nat King Cole.\n--------------------------------------------------------------------------------------------------------------------------------------\nLegendary jazz drummer and bandleader Foreststorn Chico Hamilton, born September 21st, 1921 in Los Angeles, had a fast track musical education in a band with his schoolmates Charles Mingus, Illinois Jacquet, Ernie Royal, Dexter Gordon, Buddy Collette and Jack Kelso. Engagements with Lionel Hampton, Slim & Slam, T-Bone Walker, Lester Young, Count Basie, Duke Ellington, Charlie Barnett, Billy Eckstine, Nat King Cole, Sammy Davis Jr., Billie Holiday, Gerry Mulligan and six years with Lena Horne established this young West Coast prodigy as a jazz drummer on the rise, before striking out on his own as a bandleader in 1955.\n\nChicos impact upon jazz includes the introduction of two unique and distinct sounds: first in 1955 with his Original Quintet which combined the sounds of his drums, the bass of Carson Smith, the guitar of Jim Hall, the cello of Fred Katz, and the flute of Buddy Collette; and the second in 1962 with his own drums, the bass of Albert Stinson, the guitar of Gabor Szabo, the tenor sax of Charles Lloyd, and the trombone of George Bohanon.\n\nIn 1997, Chico received the New School University Jazz & Contemporary Music Programs Beacons in Jazz Award in recognition for his \"significant contribution to the evolution of Jazz\". In 2002, Chico was awarded the WLIU-FM Radio Lifetime Achievement Award. At the IAJE in NYC January 2004, Hamilton was awarded a NEA Jazz Master Fellowship, presented to him by Roy Haynes. In December 2006, Congress confirmed the President’s nomination of Chico to the Presidents Council on the Arts. And in 2007, Chico received a Living Legacy Jazz Award as part of The Kennedy Centers Jazz in Our Time Festival, as well as receiving a Doctor of Fine Arts from The New School.\n\nDynamic as ever at the age of 87, Chico Hamilton has a resume that includes scores for film, original compositions, commercial jingles, 50 + albums as a leader, and countless international tours. In 2006, Chico released four CD’s on Joyous Shout! in celebration of his 85th birthday: “Juniflip” featuring guest appearances from- legendary Love front-man Arthur Lee, criminally under-rated vocalist (and successful actor) Bill Henderson, and former Hamilton band members trombonist George Bohanon and bass trombonist Jimmy Cheatham; “Believe” with Special Guest appearances from vocalist and R & B Diva Fontella Bass and trombonist George Bohanon; “6th Avenue Romp” featuring Special Guest appearances from guitarist Shuggie Otis, trumpeter Jon Faddis, trombonist George Bohanon, vocalist Brenna Bavis and percussionist Jaimoe of the Allman Brothers Band; and “Heritage” with Special Guest appearances from vocalist Marya Lawrence and tromboist George Bohanon. September 2007, Chico released \"Hamiltonia\" sampling his original compositions from the four albums released in 2006. \"Hamiltonia\" is an impassioned statement of purpose- an emphatic endorsement of writing and performing THIS music in the NOW, the way the GREATS did in their time, and confirms Hamilton's status as one of the most important living jazz artists and composers.\n\nOver the years, Chico has had a series of dance floor successes, including his signature song \"Conquistadors\" from his 60's Impulse album \"El Chico\", and the Brazilian influenced song \"Strut\" from Chico's 1979 outing on Elektra \"Nomad\", which became so successful on the Northern Soul Scene in the U.K. that it had its own dance!! \"Conquistadors\" also was the signature track for E-man when he rocked the dance floor at Frank's Cocktail Lounge in Brooklyn. In 2002 a track titled \"For Mods Only\" from Chico's 1968 Impulse album \"The Dealer\", was included on the Thievery Corporations \"SOUNDS FROM THE VERVE HI-FI\". This past Fall, Rong Music released the 12\" vinyl Kerry's Caravan from Mudd & Chico Hamilton, a moody yet stunning slice of modern music and a molten melting pot ready made for filling the dance floor with remixes from long-term Idjut Boys collaborator and Fiasco imprint boss Ray Mang!! And the recent Impulsive! Remix Project features Mark De Clive Lowe’s take on Chicos classic 60s track El Toro. OUT NOW is the limited edition 12\" 180 gram vinyl from SoulFeast (Brian Michel Bacchus & Joaquin \"Joe\" Claussell) with their reworking of \"Mysterious Maiden\" from Chico's 1980 \"Nomad\" release. Available thru www.dopejams.net (sales@dopejams.net).\n\nChico is presently teaching at New School University Jazz Program; touring extensively in North America with \"Euphoria\" group which includes Cary DeNigris on guitar, Paul Ramsey on bass, Evan Schwam on flute, tenor and soprano saxes, Eddie Barbash on flute, soprano, alto and baritone saxes, and Jeremy Carlstedt on percussion; recording with his \"Euphoria\" group and special guests; composing and performing music for film; and working on autobiography.\n\n2008 has seen four releases from Chico, two EP’s and two previously unreleased recordings, each of which provide a different perspective on the Chico Hamilton experience.\n\nPaying homage to Chico's past, the \"It's About Time!\" EP revisits his first ever recording project as band leader/percussionist. In 1955, Chico recorded a trio album for Pacific Jazz with George Duvivier and Howard Roberts; fast-forward 53 years, and Chico has recasted it with his long time collaborators Cary DeNigris on guitar and Paul Ramsey on bass. According to Chico, both recordings emphasize the rhythm section as the lead instruments. \"The bass and guitar serve as my right hand and left hand. I wanted the emphasis of the music to be on keeping time and swinging time, essentially, \"It's About Time!\". This EP features \"Nuttye\", a track composed by Chico's dear friend Jimmy Cheatham from the original 1955 session. \"Cheatham passed away recently and we dedicate our version to him\".\n\nChico's distinctive grooves have been rediscovered and refused on the \"The Alternative Dimensions of El Chico\" EP, a collection of dance/remix tracks and collaborative works with some of today's hottest turntablists including Fertile Ground, SoulFeast (Joe Claussell and Brian Michel Bacchus), Mark de Clive-Lowe, and Blaze. Chico's stature amongst tastemakers throughout the DJ community is longstanding and profound. Over the years, Chico has had a series of dance floor successes from his signature song \"Conquistadors\" to the Brazilian influenced \"Strut\". \"I'm told that people still dance to my music in nightclubs,\" says Chico. \"There's no greater compliment than that!\"\n\nOn \"Dreams Come True\", recorded in 1993, NEA Jazz Masters Andrew Hill and Chico Hamilton deliver a masterpiece of modern improvised music. The two giants are repositories of the history of this music, and here they create a document containing more then is stored in all the history books, sharing and preserving ancient stories and traditions thru their mutual song.\n\n“Rubbing against each other, this remarkable duo’s distinct, at times even antithetical, musical idioms are a master class in jazz linguistics. How they engage, prod and jab and lure each other, is a marvel to hear. Far from submerging their egos, they engage them fully—and connect.” From Gene Santoro’s liner notes.\n\nAnd “Trio! Live @ Artpark”, recorded in 1994, documents a blazing performance from a power trio led by Hamilton, with guitarist Cary DeNigris and bassist Matthew Garrison- the son of the late Jimmy Garrison. Witness the remarkable synergy and energy between the three as Hamilton leads his steeds thru a series of originals and a heady romp on \"Tickle Toe\".\n\n“Chico’s always got one foot solidly planted in the jazz tradition and yet he simultaneously strides forward with open ears and an open mind. On this live outing he mixes it up in volatile fashion with cats less than half his age, and he’s right there with them, bringing the funk, slamming with authority and swinging his ass off. Whatever the music calls for, Chico is fully committed, always dealing, strictly in the moment. And the results on this live outing are positively scintillating.” From Bill Milkowski’s liner notes. \n------------------------------------------------------------------------------------------------------\nHamilton had a fast track musical education in a band with his schoolmates Charles Mingus, Illinois Jacquet, Ernie Royal, Dexter Gordon, Buddy Collette and Jack Kelso. Engagements with Lionel Hampton, Slim & Slam, T-Bone Walker, Lester Young, Count Basie, Duke Ellington, Charlie Barnett, Billy Eckstine, Nat King Cole, Sammy Davis Jr., Billie Holiday, Gerry Mulligan and six years with Lena Horne established this young West Coast prodigy as a jazz drummer on the rise, before striking out on his own as a band leader in 1955.\n\nHamilton appeared in the March Milastaire number in the film You'll Never Get Rich (1941) as part of the backing group supporting Fred Astaire, and performed on the soundtrack of the Bing Crosby/Bob Hope film Road to Bali.\n\nHe recorded his first LP as leader in 1955 with George Duvivier and Howard Roberts for Pacific Jazz; in 1955 he formed an unusual quintet in L.A. featuring cello, flute, guitar, bass and drums. The original personnel included Buddy Collette, Jim Hall, Fred Katz and Jim Aton; Carson Smith later replaced Aton on bass; Hamilton continued to tour using different personnel, 1957 to 1960; the group including Paul Horn and John Pisano was featured in the film Sweet Smell of Success in 1957; the group including Nate Gershman and Eric Dolphy appeared in the film Jazz on a Summer's Day in 1960; Dolphy marked his first recordings with Hamilton on With Strings Attached, Gongs East, The Three Faces of Chico, and That Hamilton Man.\n\nHamilton revamped the group in 1961 with Charles Lloyd, Gabor Szabo, George Bohanon and Albert Stinson; the group recorded for Columbia, Reprise and Impulse and also recorded the soundtrack for the industrial film Litho in 1962, the first American film to be shown behind the Iron Curtain. Hamilton formed a commercial and film production company in 1965; scored the feature films Repulsion, Mr. Rico, By Design, Liebe Auf Den Ersten Blick, Die Sonnengottin, and A Practical Man; scored for television Portrait of Willie Mays and the popular children's series Gerald McBoing Boing; and scored hundreds of commercials for TV and radio.\n\nHe formed a new group with Larry Coryell, Richard Davis and Arnie Lawrence in '66 and recorded The Dealer for Impulse. Performed at Montreux and North Sea Jazz Festivals in 1972 and 1973. Formed a new \"Players\" group in 1975 with Arthur Blythe, Steve Turre, Barry Finnerty and Abdullah; also, wrote and performed the musical score for the movie, Coonskin, in 1975; toured with \"Players\" using different personnel in 1976-1980; recorded for Blue Note, Mercury Records, Nautilus and Elektra. Originating faculty member in 1987 of New School University Jazz & Contemporary Music Program.\n\nHe formed the new group \"Euphoria\" in 1987 with Eric Person, Cary DeNigris and Reggie Washington; recorded Euphoria in 1987; toured Europe with Euphoria '87, '88, '90. Performed at Verona, Bolzano, Vienne, Nice, North Sea and Montreux Jazz Festivals in '89 with regrouped original quintet with Buddy Collette, Fred Katz, John Pisano, Carson Smith; recorded Reunion for Soul Note. For Soul Note records Arroyo with Euphoria group, Trio! w. Eric Person, Cary DeNigris, Eric Dolphy tribute My Panamanian Friend with Euphoria group, and solo drum session Dancing to a Different Drummer. Toured Europe with Euphoria in 1994. Hamilton was the subject of a documentary film by director Julian Benedikt, Dancing to a Different Drummer.\n\nHamilton released Foreststorn in 2001 featuring Euphoria with Cary DeNigris on guitar, Paul Ramsey on bass, and a new two horn front line featuring Eric Lawrence on alto and soprano saxes and Evan Schwam on tenor sax, as well as special guest appearances from former band members Arthur Blythe, Steve Turre and his wife Akua Dixon, Eric Person, former Spin Doctors guitarist Eric Schenkman (a student of Chico's), Blues Traveler front man John Popper (also a student of Chico's), and Charlie Watts of The Rolling Stones. In August 2001 he performed in front of 2300 people at Lincoln Center My Funny Valentine: A Tribute to Chico Hamilton with Euphoria plus special guest appearances from Joe Beck, Arthur Blythe, Larry Coryell, Akua Dixon, Rodney Jones and Eric Person. In fall 2002 he released Thoughts of… with Euphoria, with special guest appearances from guitarists and former band members Joe Beck, Larry Coryell and Rodney Jones.\n\nIn 1997, Hamilton received the New School University Jazz & Contemporary Music Programs Beacons in Jazz Award in recognition for his \"significant contribution to the evolution of Jazz.\" In 2002, he was awarded the WLIU-FM Radio Lifetime Achievement Award. At the IAJE in NYC January 2004, Hamilton was awarded a NEA Jazz Master Fellowship, presented to him by Roy Haynes. In December 2006, Congress confirmed the President's nomination of Chico Hamilton to the Presidents Council on the Arts. And in 2007, Hamilton received a Living Legend Jazz Award as part of The Kennedy Center Jazz in Our Time Festival, as well as receiving a Doctor of Fine Arts from The New School.\n\nHamilton has a resume that includes scores for film, original compositions, commercial jingles, 50+ albums as a leader, and countless international tours. In 2006, he released four CDs on Joyous Shout! in celebration of his 85th birthday: Juniflip featuring guest appearances from Love front-man Arthur Lee, vocalist (and successful actor) Bill Henderson, and former Hamilton band members trombonist George Bohanon and bass trombonist Jimmy Cheatham; Believe with special guest appearances from vocalist and R & B diva Fontella Bass and trombonist George Bohanon; 6th Avenue Romp featuring special guest appearances from guitarist Shuggie Otis, trumpeter Jon Faddis, trombonist George Bohanon, vocalist Brenna Bavis and percussionist Jaimoe of the Allman Brothers Band; and Heritage with special guest appearances from vocalist Marya Lawrence and trombonist George Bohanon. In September 2007, he released Hamiltonia sampling his original compositions from the four albums released in 2006. Hamiltonia confirms Hamilton's status as one of the most important living jazz artists and composers.\n\nOver the years, Hamilton has had a series of dance successes, including his signature song \"Conquistadors\" from his '60s Impulse album El Chico, and the Brazilian influenced song \"Strut\" from Hamilton's 1980 Elektra album, Nomad, which became so successful on the Northern Soul scene in the U.K. that it had its own dance. In 2002 a track titled \"For Mods Only\" from Hamilton's 1968 Impulse album The Dealer, was included on the Thievery Corporation's Sounds from the Verve Hi-Fi. In fall 2006, Rong Music released the 12\" vinyl Kerry's Caravan from Mudd & Chico Hamilton, with remixes from long-term Idjut Boys collaborator and Fiasco imprint boss Ray Mang. And the recent Impulsive! Remix Project features Mark De Clive Lowe's take on Chico's '60s track \"El Toro.\" Released December of 2007 from SoulFeast (Joaquin 'Joe' Claussell & Brian Michel Bacchus) on 12\" limited edition vinyl is their recasting of Chico's classic track \"Mysterious Maiden,\" and coming in Spring 2008 from SoulFeast is a CD & double vinyl 12\" EP Chico Hamilton Presents: Alternative Dimensions of El Chico.\n\nHamilton is presently teaching at The New School for Jazz and Contemporary Music in New York City; touring extensively in North America with Euphoria, which includes Cary DeNigris on guitar, Paul Ramsey on bass, Evan Schwam on flute, tenor and soprano saxes, Eddie Barbash on flute, alto and soprano saxes, and Jeremy Carlstedt on percussion; recording with his group and special guests; composing and performing music for film; and working on his autobiography. His brother was the actor Bernie Hamilton.\n\n\n\n <a href=\"https://www.last.fm/music/Chico+Hamilton\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
