{"artist":{"name":"Chico Hamilton Quintet","mbid":"9b1236b0-f3d7-4b64-88d3-43dff9bfff5a","url":"https://www.last.fm/music/Chico+Hamilton+Quintet","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c56f3ed74b1e4d89491fe9ce7265d93c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c56f3ed74b1e4d89491fe9ce7265d93c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c56f3ed74b1e4d89491fe9ce7265d93c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c56f3ed74b1e4d89491fe9ce7265d93c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c56f3ed74b1e4d89491fe9ce7265d93c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c56f3ed74b1e4d89491fe9ce7265d93c.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"5266","playcount":"38540"},"similar":{"artist":[{"name":"Chico Hamilton","url":"https://www.last.fm/music/Chico+Hamilton","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/29965fb5e7d042a3b360da0829393e02.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/29965fb5e7d042a3b360da0829393e02.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/29965fb5e7d042a3b360da0829393e02.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29965fb5e7d042a3b360da0829393e02.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29965fb5e7d042a3b360da0829393e02.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29965fb5e7d042a3b360da0829393e02.png","size":""}]},{"name":"Foehn Trio","url":"https://www.last.fm/music/Foehn+Trio","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Paul Lay","url":"https://www.last.fm/music/Paul+Lay","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3cb06977ac56d3d7f58abe5e9c91db07.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3cb06977ac56d3d7f58abe5e9c91db07.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3cb06977ac56d3d7f58abe5e9c91db07.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3cb06977ac56d3d7f58abe5e9c91db07.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3cb06977ac56d3d7f58abe5e9c91db07.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3cb06977ac56d3d7f58abe5e9c91db07.png","size":""}]},{"name":"David Enhco","url":"https://www.last.fm/music/David+Enhco","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5a3cbb942b124f13882735fc5875a1c1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5a3cbb942b124f13882735fc5875a1c1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5a3cbb942b124f13882735fc5875a1c1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a3cbb942b124f13882735fc5875a1c1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a3cbb942b124f13882735fc5875a1c1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a3cbb942b124f13882735fc5875a1c1.png","size":""}]},{"name":"Anne Ducros","url":"https://www.last.fm/music/Anne+Ducros","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b7b9a6d57cf8453b8221f0bbce1fb746.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b7b9a6d57cf8453b8221f0bbce1fb746.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b7b9a6d57cf8453b8221f0bbce1fb746.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b7b9a6d57cf8453b8221f0bbce1fb746.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b7b9a6d57cf8453b8221f0bbce1fb746.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b7b9a6d57cf8453b8221f0bbce1fb746.png","size":""}]}]},"tags":{"tag":[{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"drums","url":"https://www.last.fm/tag/drums"},{"name":"instrumental","url":"https://www.last.fm/tag/instrumental"},{"name":"cool jazz","url":"https://www.last.fm/tag/cool+jazz"},{"name":"percussion","url":"https://www.last.fm/tag/percussion"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Chico+Hamilton+Quintet/+wiki"}},"published":"18 Feb 2009, 11:58","summary":"The Chico Hamilton Quintet was a unique Fifties chamber-jazz ensemble. Hamilton was the drummer -- ordinarily an odd choice to lead this kind of group, but Hamilton was probably the most musical drummer in jazz, equal to his contemporary, Shelly Manne, in subtlety and finesse, but tempered by his seven years with singer Lena Horne into a greater musical sensitivity. A west coast jazz deejay, Sleepy Stein, said of Hamilton, “this man plays music, not drums.”  <a href=\"https://www.last.fm/music/Chico+Hamilton+Quintet\">Read more on Last.fm</a>","content":"The Chico Hamilton Quintet was a unique Fifties chamber-jazz ensemble. Hamilton was the drummer -- ordinarily an odd choice to lead this kind of group, but Hamilton was probably the most musical drummer in jazz, equal to his contemporary, Shelly Manne, in subtlety and finesse, but tempered by his seven years with singer Lena Horne into a greater musical sensitivity. A west coast jazz deejay, Sleepy Stein, said of Hamilton, “this man plays music, not drums.” \n\nThe Quintet was equally unique in its instrumentation and its focus on musical forms more commonly associated with classical music than jazz.  Yet the Quintet depended on spontaneous improvised interplay between its musicians.  They were Buddy Collette (saxes, flutes, oboe, clarinet), Jim Hall (guitar), Fred Katz (cello), and Carson Smith (bass). This lineup of instruments survived several turnovers in personnel, as Paul Horn replaced Collette, and was himself much later replaced by Eric Dolphy; John Pisano replaced Hall; Hal Gaylor replaced Smith; and Nate Gershman replaced Katz (at the same time Dolphy came in). When eventually Hamilton hired Charles Loyd to replace Dolphy, he also abandoned the original Quintet format and its music. \n\nIn its original form the Quintet was a musical equal to its contemporary, the Modern Jazz Quartet. Both played chamber jazz: subtle, contrapuntal music to which each instrument contributed its own line. With the array of instrumentation available to it, the Quintet could cover a broader territory, ranging from the blues propelled by a tenor sax -- or a walking bass -- to something more ethereal from oboe and cello.  The “chamber” aspects of the music had less to do with the unusual instrumentation itself than with its dynamics and subtle tonal shadings.  The Quintet played in a softer, quieter range than most jazz groups, thus forcing its audiences to stop talking to each other and listen more closely to the music. \n\nThis was immediately obvious with their first album, The Chico Hamilton Quintet Featuring Buddy Collette (Pacific Jazz PJ-1209), which was recorded in August, 1955 and released later that year.  Side one was recorded in a studio on August 23rd, but side two was recorded in a Long Beach club, The Strollers, on August 4th, only a few weeks after the Quintet’s formation, and the club ambience is clearly audible.  This album was one of the first 12-inch LPs released by Richard Bock’s Pacific Jazz label, and is now valued at $30 to $75 by collectors, depending on its condition. \n\nThe gig at The Strollers was originally for only two weeks, but stretched into eight months, giving the Quintet a residency which allowed them to settle in and grow.  Then radio station KFOX began a series of live broadcasts from the club, and once the first album was released the Quintet began to acquire a national following.  (Copies of tapes from those broadcasts, recorded off the air by jazz fans on home equipment, are very rare and highly valued by collectors.  None has been released as a commercial recording.)  Down Beat magazine gave the first album a five-star (its top rating) review. \n\nOn January 4th, 1956 the Quintet was back in the studio, recording their second album, The Chico Hamilton Quintet In Hi-Fi (PJ-1216).  The “Fi” is in fact no higher than on the first album, but “Hi-Fi” was just coming into existence as a sales buzz-word, and a number of record labels of the time were incorporating it into their album titles.  Indeed, the monophonic recordings of Bock’s Pacific Jazz label were exemplary, setting standards rarely exceeded since then.  By now the Quintet had half a year of playing behind it and its style had matured.   Richard Bock was also developing a West Coast Artist Series for his album covers, and this album was the fifth in the series.  The cover photograph shows the Quintet in the background and in the foreground a sculptor and his abstract sculpture.  The sculptor was identified only as “Vito,” and in the photo his hands are blurred with movement as he apparently continues to sculpt.  This album is also valued at $30 to $75, depending on its condition. \n\nThat was to be the last album recorded by the original Quintet.  Buddy Collette got a job with the Jerry Fielding orchestra on the Groucho Marx radio and TV shows.  Jim Hall left to join the Jimmy Giuffre 3.  Multi-reed man Paul Horn replaced Collette and guitarist John Pisano replaced Hall.  The revamped Quintet went into Los Angeles’ Forum Theatre to record the next album on October 21st and 24th.   Richard Bock liked the acoustics there, and the recording bears out his judgment.  This album, released in early 1957, was called Chico Hamilton Quintet (PJ-1225), a startlingly uninspired title and the third Quintet album to have essentially the same name.  It was recorded in both mono and stereo, although the stereo version was not released until 1958, when the album was reissued on Bock’s new successor to the Pacific Jazz label, World Pacific (ST-1005).  The album’s cover was a striking abstract painting which seemed to evoke a bass or cello and drums in its images, and was by Keith Finch – the 6th in the West Coast Artist Series. The original Pacific Jazz release is valued at $30 to $75, depending on its condition, but the World Pacific reissues (in both mono and stereo) are worth less to collectors, ranging from $20 to $50.  The mono version is worth more than the stereo version.  <a href=\"https://www.last.fm/music/Chico+Hamilton+Quintet\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
