{"artist":{"name":"Chops","mbid":"f0406955-c20b-4922-8258-894d8065e8d8","url":"https://www.last.fm/music/Chops","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/54fecc26eea1493a9e60acd8ac835ae8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/54fecc26eea1493a9e60acd8ac835ae8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/54fecc26eea1493a9e60acd8ac835ae8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/54fecc26eea1493a9e60acd8ac835ae8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/54fecc26eea1493a9e60acd8ac835ae8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/54fecc26eea1493a9e60acd8ac835ae8.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"6653","playcount":"57243"},"similar":{"artist":[{"name":"Trump","url":"https://www.last.fm/music/Trump","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b8ebc37f0f694178b9816d985dcf5d28.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b8ebc37f0f694178b9816d985dcf5d28.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b8ebc37f0f694178b9816d985dcf5d28.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8ebc37f0f694178b9816d985dcf5d28.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8ebc37f0f694178b9816d985dcf5d28.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8ebc37f0f694178b9816d985dcf5d28.png","size":""}]},{"name":"Jonaty Garcia","url":"https://www.last.fm/music/Jonaty+Garcia","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/37841285c91146f8a38b213f57410858.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/37841285c91146f8a38b213f57410858.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/37841285c91146f8a38b213f57410858.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37841285c91146f8a38b213f57410858.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37841285c91146f8a38b213f57410858.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/37841285c91146f8a38b213f57410858.png","size":""}]},{"name":"Pudge","url":"https://www.last.fm/music/Pudge","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0988fd9fe7d71f3b8040068852419bbe.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0988fd9fe7d71f3b8040068852419bbe.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0988fd9fe7d71f3b8040068852419bbe.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0988fd9fe7d71f3b8040068852419bbe.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0988fd9fe7d71f3b8040068852419bbe.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0988fd9fe7d71f3b8040068852419bbe.png","size":""}]},{"name":"Mountain Brothers","url":"https://www.last.fm/music/Mountain+Brothers","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/29b409b1753841db99ba1a326e1fc325.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/29b409b1753841db99ba1a326e1fc325.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/29b409b1753841db99ba1a326e1fc325.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29b409b1753841db99ba1a326e1fc325.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29b409b1753841db99ba1a326e1fc325.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/29b409b1753841db99ba1a326e1fc325.png","size":""}]},{"name":"Tee-Double","url":"https://www.last.fm/music/Tee-Double","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a09801db128d4c7fcc8ea0b9dea79520.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a09801db128d4c7fcc8ea0b9dea79520.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a09801db128d4c7fcc8ea0b9dea79520.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a09801db128d4c7fcc8ea0b9dea79520.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a09801db128d4c7fcc8ea0b9dea79520.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a09801db128d4c7fcc8ea0b9dea79520.png","size":""}]}]},"tags":{"tag":[{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"producer","url":"https://www.last.fm/tag/producer"},{"name":"hip hop","url":"https://www.last.fm/tag/hip+hop"},{"name":"rap","url":"https://www.last.fm/tag/rap"},{"name":"alternative rap","url":"https://www.last.fm/tag/alternative+rap"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Chops/+wiki"}},"published":"23 Nov 2006, 02:51","summary":"CHOPS (1): US hip hop solo artist and producer from Philly (???? -)\nCHOPS (2): UK avant-wonk-pop group from Leeds (2007 -)\n\n(1) CHOPS, from the Philly-based group the Mountain Brothers, has become a successful solo artist and producer. His album Virtuosity featured Kanye West, Raekwon, Ras Kass, Talib Kweli, and others. The soundtrack to the movie Dark was entirely by CHOPS. CHOPS's music has been featured on commercials and TV shows. His remixes have been very popular. <a href=\"https://www.last.fm/music/Chops\">Read more on Last.fm</a>","content":"CHOPS (1): US hip hop solo artist and producer from Philly (???? -)\nCHOPS (2): UK avant-wonk-pop group from Leeds (2007 -)\n\n(1) CHOPS, from the Philly-based group the Mountain Brothers, has become a successful solo artist and producer. His album Virtuosity featured Kanye West, Raekwon, Ras Kass, Talib Kweli, and others. The soundtrack to the movie Dark was entirely by CHOPS. CHOPS's music has been featured on commercials and TV shows. His remixes have been very popular. CHOPS's work on mixtapes is noted, appearing on mixtapes by the Game, Fabolous, and ODB. \n\n*CHOPS started out as a young hip hop fan growing up in Texas.  As a kid, he spent countless hours in front of the family stereo, making \"pause tapes\" of songs and radio shows.  When a classmate brought an old, pocket-sized drum machine to school one day, it was love at first button-press.  He borrowed the machine and managed to not return it for the next several months.  In school he signed up for music classes, learning various instruments, history, and how to read and write music.  Over time, he learned drum patterns and notes from his favorite rap and soul records, and began to get equipment of his own.  \"While other kids were saving up for video games and sneakers, I'd be saving for recording tape and speakers.\"  CHOPS remembers.  \n\nHis family moved around a lot leading to him eventually settling in Philly.  There he connected with local fellow aspiring artists, among them two other Asian kids with a knack for rhyming, who encouraged him to join them on the mic as well as behind the boards.  They formed a group called Mountain Brothers - named after a Robin Hood-like squad of bandits from Chinese legend - and earned a reputation in the underground locally and worldwide thru a number of independent records.  They began to receive even more global attention after earning the status of being the first Asian rap artists signed to a major label.  After struggling with a label that \"didn't know what to do with another White group\" (actual quote), they released their work independently, to critical acclaim.  Much of this acclaim came from CHOPS' unique, original production style, which led to his working with a growing number of artists around the country, as well as overseas. Those names include Kanye West, Snoop Dogg, Paul Wall, and Bun B.  Former Swishahouse member Magno and his CHOPS produced \"Magnificent Bout His Cash\" single are currently getting heavy spins on Hot 97 in NYC and is up to #2 on Funk Master Flex's countdown. Also look for CHOPS' production on upcoming projects for Paul Wall, Slim Thug, DJ Clue, Funk Master Flex and many more to be announced. CHOPS' music has appeared in numerous TV shows, films, and ads from companies such as Warner Brothers, Fox, Nike, Coca Cola, and more. \n\nCurrent projects include the successful \"It's Going Down\" remix mixtape series (MTV.com \"Notable Mentions 2 weeks running), a full length underground CD with Houston newcomer Kiotti and Freeway's upcoming single featuring Lil Jon.  CHOPS has over 500 mixtape appearances in the last year alone making him the producer to go to if you want that street yet musical sound.  CHOPS creates all of his music. He plays all of his beats without sampling.  Yet other major producers find CHOPS an inspiration. The famed Just Blaze told CHOPS,\" I used one of your records to make P.S.A.\" (the hit record off of Jay-Z's Black Album)\n\n*Bio information from www.chopsmusic.com\n\n==============================================================================\n\n(2) CHOPS was formed by Dominic Clare, Richard \"Moz Morris and Leon Carey in January 2007, utilising drums, vintage and digital synths, alto sax, guitar, home made electronics (such as tone generators), shifted vocals and hoardes of effects pedals. In 2007 they distributed somewhere around 700 CDR copies of home-recordings of their first jams and live performances, all containted in a minimalist no-fi package of regular white and brown postal envelopes. CHOPS have a split 12\" with Helheston due to be released on Upset The Rhythm records in early 2008, and have contributed to compilations for Chinchilla-Tone, Room237 and a forthcoming Stench Of Muscle compliation. CHOPS were described by a Guardian Unlimited blog article (about a percieved dominance of US underground music in the UK) as one of the UK's \"new sonic pioneers\" providing \"light at the end of the tunnel\" for the UK underground. CHOPS music is often improvised, veering between  techno, broken RnB pop, chaotic noise rock and minimalist lounge jazz. That noted, CHOPS does not believe in labelling music as a productive measure. They have played gigs with bands such as Clark (Warp Records), Death Sentence: Panda! (Upset The Rhythm Records), Marnie Stern (Kill Rock Stars), Gay Against You (Adaadat Records), a.P.A.t.T. (Pickled Egg Records), etc.\n\nCHOPS are a self-sufficient unit, powered by their own excessive amplification, and not requiring a stage, PA or sound engineer to play, and enjoying the chance to perform in and amongst the audience for a \"friendlier, more immediate experience\". CHOPS relish witnessing the slow collapse of corporate entertainments, and taking part in activities destined to undermine their financial systems. Although not forthright with their political stance, their views are clearly evident amongst their actions in their Do It Yourself approach. For example, CHOPS' avoidance of institutions such as major labels and chain-operated venues that place making money above musical progression, and taking a stance against using music to advertise unethical corporations. \n\nThe members of CHOPS are also involved with The Chinchilla Collective (a UK DIY record label, gig promoter and occassional comic publisher), as well as playing in bands such as Quack Quack, Two Minute Noodles, EYE HAI, Inecto School, Sense Or This?, etc. Moz has been a sound-engineer in Leeds for well over 5 years. Dominic is well known across Europe for his busy touring schedule (over 30 tours in the last two years), with bands such as Lightning Bolt, T.I.T.S., Errase Errata, Coughs, HEALTH, The Mae Shi, Chrome Hoof, Kling Klang, etc.\n\n* Bio composed from texts available at http://www.chinchillaweb.co.uk, http://www.chinchillaweb.co.uk/chops and http://www.myspace.com/mightychops <a href=\"https://www.last.fm/music/Chops\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
