{"artist":{"name":"Chris Brown","mbid":"c234fa42-e6a6-443e-937e-2f4b073538a3","url":"https://www.last.fm/music/Chris+Brown","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0d5f2c61460c80879a3129d6fdd9bbe8.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0d5f2c61460c80879a3129d6fdd9bbe8.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0d5f2c61460c80879a3129d6fdd9bbe8.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0d5f2c61460c80879a3129d6fdd9bbe8.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0d5f2c61460c80879a3129d6fdd9bbe8.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0d5f2c61460c80879a3129d6fdd9bbe8.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"2538422","playcount":"44625357"},"similar":{"artist":[{"name":"Trey Songz","url":"https://www.last.fm/music/Trey+Songz","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ad4e04ad453c4a5190d75b7c26708d76.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ad4e04ad453c4a5190d75b7c26708d76.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ad4e04ad453c4a5190d75b7c26708d76.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad4e04ad453c4a5190d75b7c26708d76.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad4e04ad453c4a5190d75b7c26708d76.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ad4e04ad453c4a5190d75b7c26708d76.png","size":""}]},{"name":"Chris Brown & Tyga","url":"https://www.last.fm/music/Chris+Brown+&+Tyga","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8751eeaaa26c4de7cda176f65adaacf1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8751eeaaa26c4de7cda176f65adaacf1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8751eeaaa26c4de7cda176f65adaacf1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8751eeaaa26c4de7cda176f65adaacf1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8751eeaaa26c4de7cda176f65adaacf1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8751eeaaa26c4de7cda176f65adaacf1.png","size":""}]},{"name":"Usher","url":"https://www.last.fm/music/Usher","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/71476bd59f4c707b273e65369e85ecde.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/71476bd59f4c707b273e65369e85ecde.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/71476bd59f4c707b273e65369e85ecde.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/71476bd59f4c707b273e65369e85ecde.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/71476bd59f4c707b273e65369e85ecde.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/71476bd59f4c707b273e65369e85ecde.png","size":""}]},{"name":"Omarion","url":"https://www.last.fm/music/Omarion","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fddbfa41ba094665add57e85afb6e4a7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fddbfa41ba094665add57e85afb6e4a7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fddbfa41ba094665add57e85afb6e4a7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fddbfa41ba094665add57e85afb6e4a7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fddbfa41ba094665add57e85afb6e4a7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fddbfa41ba094665add57e85afb6e4a7.png","size":""}]},{"name":"August Alsina","url":"https://www.last.fm/music/August+Alsina","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/94a217c7ae81c7e491b115a22bc50e9f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/94a217c7ae81c7e491b115a22bc50e9f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/94a217c7ae81c7e491b115a22bc50e9f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94a217c7ae81c7e491b115a22bc50e9f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94a217c7ae81c7e491b115a22bc50e9f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94a217c7ae81c7e491b115a22bc50e9f.png","size":""}]}]},"tags":{"tag":[{"name":"rnb","url":"https://www.last.fm/tag/rnb"},{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"Chris Brown","url":"https://www.last.fm/tag/Chris+Brown"},{"name":"rap","url":"https://www.last.fm/tag/rap"},{"name":"hip hop","url":"https://www.last.fm/tag/hip+hop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Chris+Brown/+wiki"}},"published":"05 Jun 2006, 15:41","summary":"There is more than one artist with this name:\n\n1) Christopher Maurice Brown (born May 5, 1989) from Tappahannock, Virginia.\n\nIn late 2005, he released his first studio album, Chris Brown, which spawned the Billboard Hot 100 number-one debut single, \"Run It!\" which was produced by Scott Storch and featured Juelz Santana. The album also produced two other top ten singles: \"Yo (Excuse Me Miss)\" and \"Say Goodbye.\" Brown's second studio album, Exclusive was released worldwide in November 2007. <a href=\"https://www.last.fm/music/Chris+Brown\">Read more on Last.fm</a>","content":"There is more than one artist with this name:\n\n1) Christopher Maurice Brown (born May 5, 1989) from Tappahannock, Virginia.\n\nIn late 2005, he released his first studio album, Chris Brown, which spawned the Billboard Hot 100 number-one debut single, \"Run It!\" which was produced by Scott Storch and featured Juelz Santana. The album also produced two other top ten singles: \"Yo (Excuse Me Miss)\" and \"Say Goodbye.\" Brown's second studio album, Exclusive was released worldwide in November 2007. It has spawned his second US number one hit, \"Kiss Kiss\" which was produced by T-Pain, who was also featured in the song . The third single, \"With You\", has reached number 2 on the Billboard Hot 100, and has entered into the top ten in several countries across the world, becoming one of his most successful worldwide releases to date.\n\nThe second single, \"Kiss Kiss\", was nominated for the 50th Annual Grammy Awards in the category for Best Rap/Sung Collaboration.\n\nBrown, one of two children, was born and raised in the small town of Tappahannock, Virginia, the son of Joyce Hawkins and Clinton Brown. Brown was influenced by the artists his parents played on the home radio, such as Michael Jackson and Sam Cooke. A dancer since the age of two, Brown was not aware of his vocal talents until the age of eleven. Before becoming a vocalist, he was interested in becoming a rapper.\n\nAt thirteen, Brown was discovered by a local production team who visited his father's gas station searching for new talent. Since then, he began his recording career and moved to New York, staying there for two years. Brown's local production team organized an audition before Def Jam Vice President Tina Davis, who currently works as his manager. At the age of 15, Brown was then sent to perform for L.A. Reid and was subsequently signed in 2004 to Jive Records. By early 2005, Brown began work for his debut album, working with the likes of Scott Storch, The Underdogs, Dre, Vidal, Bryan Michael Cox, Bow Wow, and Jermaine Dupri.\n\nBrown left school in late 2004 to begin working on his self-titled debut album which was released on November 29, 2005. The album debuted at #2 on the Billboard 200 selling over 155,000 copies in first week of sales. Five weeks later, became certified platinum, and within a year, went double platinum. His debut single \"Run It!,\" was #1 in the United States, New Zealand, and Australia. Following \"Run It!,\" \"Yo (Excuse Me Miss)\" became Brown's second top 10 hit in the US, peaking at #7, and #13 in the UK. It has been certified platinum by the RIAA.\n\nHis third single \"Gimme That\" was released in March 2006 which featured Lil Wayne for a remix, originally not featured on the Chris Brown album, but was later included. The single debuted on the U.S. Billboard Hot 100 at #80 and climbed the charts quickly peaking at #15. Chris also co-directed his music videos for \"Yo (Excuse Me Miss)\" and \"Gimme That.\" His fourth single is the ballad \"Say Goodbye,\" which is also a part of the Step Up Soundtrack. On June 13, 2006, Brown released a DVD entitled, Chris Brown's Journey, which shows footage of him travelling in England and Japan, getting ready for his first visit to the Grammys, behind the scenes of his music videos and bloopers.\n\nOn August 17, 2006 to further promote the album, Brown kicked off his major co-headlining tour, The Up Close and Personal Tour. Due to the tour, production for his next album was pushed back two months a second summer tour is in the works once the album is completed the tour may include artists: Pretty Ricky, Bow Wow, Lil Wayne, Juelz Santana, Ne-Yo, Ciara, and Cherish.'. Chris also has been the opening act for R&B singer Beyonce Knowles on the Australian leg of her The Beyonce Experience tour.\n\nExclusive is the second studio album by Brown. The album was released in November, 2007. It served as the sophomore album for Brown and was both critically and commercially successful.  The album was supported by five singles including the songs \"Kiss Kiss\" and \"With You\". Exclusive has gone on to sell over three million copies. \n\nGraffiti was released in 2009 and included the top-twenty single \"I Can Transform Ya\". Brown's fourth album F.A.M.E. was released in 2011 becoming Chris Brown's first studio album to top the Billboard 200. The album earned Brown his first Grammy Award for Best R&B Album. \n\nHis fifth album entitled Fortune was released in 2012. \n\nBrown's latest album X was released in September, 2014. \n\nChris Brown has also started to act in movies and has appeared in Stomp The Yard and This Christmas as well as several episodes of The O.C.  \n\nWebsites of interest:\n- Chris Brown Web \n- UChris \n- Chris Brown World \n\n\n2) Chris Brown (born 1953) is a composer, pianist, and electronic musician, who creates music for acoustic instruments with interactive electronics, for computer networks, and for improvising ensembles.\n\nBorn and raised in Chicago, he moved to California to study electronic music with Gordon Mumma and composition with William Brooks at University of California, Santa Cruz, and with David Rosenboom at Mills College. He was active early in his career as an inventor and builder of electroacoustic instruments; he has also performed widely as an improvisor and pianist with groups as \"Room\" and the \"Glenn Spearman Double Trio.\" In 1986 he co-founded the pioneering computer network music ensemble \"The Hub\". He is also known for his recorded performances of music by Henry Cowell, Luc Ferrari, and John Zorn. He has received commissions from the Berkeley Symphony, the Rova Sexophone Quartet, the Abel-Steinberg-Winant Trio, the Gerbode Foundation, the Phonos Foundation and the Creative Work Fund. His recent music includes the poly-rhythm installation \"Talking Drum\", the \"Inventions\" series for computers and interactive performers, and the radio performance \"Transmissions\" series, with composer Guillermo Galindo.\n\nHis 1992 epic electroacoustic work \"Lava\", for brass, percussion, and electronics is also available on Tzadik Records. He teaches Composition and Electronic Music at Mills College in Oakland, where he is Co-Director of the Center for Contemporary Music (CCM). He is not to be confused with R & B artist Chris Brown.\n\n\n3) Chris Brown is a Canadian singer-songwriter and multi-instrumentalist.\n\nBrown was one of the primary singers and songwriters for the alternative rock band Bourbon Tabernacle Choir in the 1980s and 1990s. When that band broke up, he continued performing as a duo with his Bourbon bandmate Kate Fenner. Brown has accompanied dozens of notable musicians on stage, such as in 1998 when he spent six months filling in for Kevin Hearn as a member of Barenaked Ladies while Hearn battled leukemia.\n\nBrown released a solo album, Burden of Belief, in 2003. He performs this material both solo and with Tony Scherr, Anton Fier, and Teddy Kumpel as Chris Brown and the Citizens' Band. The group's album Oblivion was released in 2007.\n\n\n4) A San Francisco-area based power pop singer-songwriter.\n\n\n5) A UK DJ/Remixer and part of Ruff Driverz. <a href=\"https://www.last.fm/music/Chris+Brown\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
