{"artist":{"name":"Cindy Morgan","mbid":"84abfd2a-89a1-4eb2-91ea-36ee5dac9a23","url":"https://www.last.fm/music/Cindy+Morgan","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d055057b08bd4ba49f38135986123bac.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d055057b08bd4ba49f38135986123bac.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d055057b08bd4ba49f38135986123bac.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d055057b08bd4ba49f38135986123bac.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d055057b08bd4ba49f38135986123bac.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d055057b08bd4ba49f38135986123bac.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"16706","playcount":"105727"},"similar":{"artist":[{"name":"Margaret Becker","url":"https://www.last.fm/music/Margaret+Becker","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/253cb1d83c634677bb90ff9fe03591a3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/253cb1d83c634677bb90ff9fe03591a3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/253cb1d83c634677bb90ff9fe03591a3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/253cb1d83c634677bb90ff9fe03591a3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/253cb1d83c634677bb90ff9fe03591a3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/253cb1d83c634677bb90ff9fe03591a3.png","size":""}]},{"name":"Susan Ashton","url":"https://www.last.fm/music/Susan+Ashton","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cbbb74147bdb45de8d120c4e74637737.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cbbb74147bdb45de8d120c4e74637737.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cbbb74147bdb45de8d120c4e74637737.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cbbb74147bdb45de8d120c4e74637737.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cbbb74147bdb45de8d120c4e74637737.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cbbb74147bdb45de8d120c4e74637737.png","size":""}]},{"name":"Out Of The Grey","url":"https://www.last.fm/music/Out+Of+The+Grey","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/411be0fd6fd94fdba94c0491fee6f7b2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/411be0fd6fd94fdba94c0491fee6f7b2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/411be0fd6fd94fdba94c0491fee6f7b2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/411be0fd6fd94fdba94c0491fee6f7b2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/411be0fd6fd94fdba94c0491fee6f7b2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/411be0fd6fd94fdba94c0491fee6f7b2.png","size":""}]},{"name":"Wayne Watson","url":"https://www.last.fm/music/Wayne+Watson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d335c42c2e0744418ac9d654e4b6918d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d335c42c2e0744418ac9d654e4b6918d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d335c42c2e0744418ac9d654e4b6918d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d335c42c2e0744418ac9d654e4b6918d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d335c42c2e0744418ac9d654e4b6918d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d335c42c2e0744418ac9d654e4b6918d.png","size":""}]},{"name":"Clay Crosse","url":"https://www.last.fm/music/Clay+Crosse","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/95f9f035689146ff8785df1858f4b2c7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/95f9f035689146ff8785df1858f4b2c7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/95f9f035689146ff8785df1858f4b2c7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95f9f035689146ff8785df1858f4b2c7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95f9f035689146ff8785df1858f4b2c7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/95f9f035689146ff8785df1858f4b2c7.png","size":""}]}]},"tags":{"tag":[{"name":"christian","url":"https://www.last.fm/tag/christian"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"contemporary christian","url":"https://www.last.fm/tag/contemporary+christian"},{"name":"pop","url":"https://www.last.fm/tag/pop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Cindy+Morgan/+wiki"}},"published":"06 May 2007, 20:48","summary":"Cindy Morgan’s latest project ‘Beautiful Bird’ is her first official venture into producing her own  record. “I have produced my own demos for years and spent the better part of my adult life in a  studio, but until now haven’t felt completely ready for such a task. I have been very fortunate to  work with so many great producers over the years. The last couple of years, there has been a  little voice in my head telling me to step out and stand on my own two creative feet. <a href=\"https://www.last.fm/music/Cindy+Morgan\">Read more on Last.fm</a>","content":"Cindy Morgan’s latest project ‘Beautiful Bird’ is her first official venture into producing her own  record. “I have produced my own demos for years and spent the better part of my adult life in a  studio, but until now haven’t felt completely ready for such a task. I have been very fortunate to  work with so many great producers over the years. The last couple of years, there has been a  little voice in my head telling me to step out and stand on my own two creative feet. So that is  what I decided to do. I am heading up the production of this record, but certainly not without a lot of help on the technical side of things with my engineer and co-producer Stephen Leiweke.”  (Jars Of Clay, Margaret Becker, Kids In The Way) “My weaknesses are Stephen’s strengths.  Among other things he is so good about allowing me take all the time I need to explore an idea and figure out how to get it onto tape.”\n\nThe outcome is an album that represents the multiple facets of Cindy’s life as a wife, mother, and storyteller. “One of the greatest things in my life is being a mother to my two girls, Olivia and Savannah. I love seeing the world through their eyes; they teach me so much everyday and, of course, they inspire me. \n\nSong Snapshots\n\n‘Lay Me Down’ \n ‘Lay Me Down’ starts off the record. “I wrote this song with my good friend and soul man Phil Madiera.” The music was inspired by the music from ‘O Brother Where Art Thou’ and came to her while gardening. “I was at our home in Canada, digging in the dirt and had my shovel out trying to break through this huge rock. I started singing this lyric based on a Psalm, Oh lay me down in your green pastures.” \n\n‘The Sun Shines Through’ \n“This song like many was inspired by a few people in my life… all true stories of how we are sometimes handed a hard road and we wonder how we’ll make it through. It is so good to know that God will not leave us or forsake us, but bring about to completion the good work which He has started in us”. \n\nMorgan has intentionally released few details about this record, preferring to keep it under wraps until just before the release date. In keeping with this path she has also decided to brave the digital frontier, releasing ‘Beautiful Bird’ exclusively in digital format through her website (cindymorganmusic.com) and iTunes, as well as, other hand picked online outlets.  “The wonderful thing about doing a record like this is that you throw the rule book out the window… it really sets the creative spirit free to let each song, and the record as a whole, be what it is without boundaries that often squash the creative process.”\n\nThis record is a mix of all the musical styles Morgan has been a fan of. “It is a mix of Pop, Appalachia, Country, and Symphonic.  I can’t choose the cello over the doboro so I wanted to make a record where they could live together.  I am also a great admirer and pursuer of the art of writing a great country song and many of the lyrics are from that approach.” Morgan, who is a dynamic vocalist and pianist, has added to her musical quiver, the lap dulcimer.  “I have written on the piano for so many years, it was great writing on different instruments. This really brings about different melodies and character of songwriting… I play the dulcimer and a little guitar.”\n\n\nA songwriter's songwriter, Morgan has garnered eighteen number one hits that include ‘Listen’, ‘Praise the King’, ‘Take my life’, and ‘I Know You’; as well as Point of Grace’s recent hit ‘How You Live’.  Morgan has garnered several Dove Awards and Billboard Music Video Award nominations. Her songs have been recorded by luminaries such as Michael W. Smith, Point Of Grace, Avalon, Rachael Lampa, Brit Nicole, Mandisa, The Martins, Michael English, BeBe \nWinans, Sandi Patty, Jaci Velasquez, Mark Schultz, John Tesh, and Natalie Grant.\n\n“A few years ago, I decided it was time for a rest from the road and take more seriously my  desire to become a better songwriter. I decided of all places, to do this in Los Angeles. Along with my husband and our then one year old daughter, we headed to our little apartment in Burbank, California.” In Burbank, Morgan worked as a full-time songwriter in the Christian, pop, and country genres, crafting hits including Christy  \"It was so great to be around people who were not necessarily Christians because I recognized that their search goes on earnestly, and I felt so blessed that I knew what I believed and that I felt truth in that \nbelief.\"\n\nEventually, the family returned to Nashville and bought a house where they still make their home six months of the year. In this jambalaya of settings, Morgan engaged in a journey toward new self-discovery. She stretched as a wife and mother, and matured as a woman and musician. First and foremost, she drank deeply from a spiritual well and grew stronger in her faith. “Everyday is a new journey for me...I think we just keep on struggling and walking toward the path that God has set before us. I am so thankful to be here and to have a wonderful husband and two healthy children. I am so happy that I know Jesus and that He knows me and  hears the prayers of my heart. I pray that whatever gifts he has given me, that I make the most of these gifts…never letting anything stand in the way of making manifest the wonderful goodness of God and the good news of what He has done for us.”  <a href=\"https://www.last.fm/music/Cindy+Morgan\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
