{"artist":{"name":"Claude François","mbid":"1cfbf85c-dc74-42d6-915e-77033afd0204","url":"https://www.last.fm/music/+noredirect/Claude+Fran%C3%A7ois","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/4256f7113fe649d7aac2023d92f9ccc5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/4256f7113fe649d7aac2023d92f9ccc5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/4256f7113fe649d7aac2023d92f9ccc5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4256f7113fe649d7aac2023d92f9ccc5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4256f7113fe649d7aac2023d92f9ccc5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/4256f7113fe649d7aac2023d92f9ccc5.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"88956","playcount":"745646"},"similar":{"artist":[{"name":"Michel Delpech","url":"https://www.last.fm/music/Michel+Delpech","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/133c496882e846329448cba6ab11211d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/133c496882e846329448cba6ab11211d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/133c496882e846329448cba6ab11211d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/133c496882e846329448cba6ab11211d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/133c496882e846329448cba6ab11211d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/133c496882e846329448cba6ab11211d.png","size":""}]},{"name":"Michel Sardou","url":"https://www.last.fm/music/Michel+Sardou","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/92159293412744fac439cc92a33623de.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/92159293412744fac439cc92a33623de.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/92159293412744fac439cc92a33623de.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/92159293412744fac439cc92a33623de.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/92159293412744fac439cc92a33623de.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/92159293412744fac439cc92a33623de.png","size":""}]},{"name":"Johnny Hallyday","url":"https://www.last.fm/music/Johnny+Hallyday","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/bc402949615844749b3449656b98936d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/bc402949615844749b3449656b98936d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/bc402949615844749b3449656b98936d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bc402949615844749b3449656b98936d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bc402949615844749b3449656b98936d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/bc402949615844749b3449656b98936d.png","size":""}]},{"name":"Daniel Balavoine","url":"https://www.last.fm/music/Daniel+Balavoine","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/093bd6d2831043438d79d168f50f9920.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/093bd6d2831043438d79d168f50f9920.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/093bd6d2831043438d79d168f50f9920.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/093bd6d2831043438d79d168f50f9920.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/093bd6d2831043438d79d168f50f9920.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/093bd6d2831043438d79d168f50f9920.png","size":""}]},{"name":"Mike Brant","url":"https://www.last.fm/music/Mike+Brant","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8b68381281174a25bc732da32d198866.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8b68381281174a25bc732da32d198866.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8b68381281174a25bc732da32d198866.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8b68381281174a25bc732da32d198866.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8b68381281174a25bc732da32d198866.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8b68381281174a25bc732da32d198866.png","size":""}]}]},"tags":{"tag":[{"name":"french","url":"https://www.last.fm/tag/french"},{"name":"chanson francaise","url":"https://www.last.fm/tag/chanson+francaise"},{"name":"Disco","url":"https://www.last.fm/tag/Disco"},{"name":"pop","url":"https://www.last.fm/tag/pop"},{"name":"chanson","url":"https://www.last.fm/tag/chanson"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/+noredirect/Claude+Fran%C3%A7ois/+wiki"}},"published":"12 Feb 2006, 15:21","summary":"The son of an Italian mother and a French father, Claude François was born in Ismaïlia, Egypt, where his father, Aimé François, was working as a shipping traffic controller on the Suez Canal. In 1951 the job took the family to the city of Port Tawfik on the Red Sea.\n\nClaude François’ mother was very musical and had her son take piano and violin lessons. On his own, the boy learned to play the drums. As a result of the 1956 Suez Crisis, the family returned to live in Monaco <a href=\"https://www.last.fm/music/+noredirect/Claude+Fran%C3%A7ois\">Read more on Last.fm</a>","content":"The son of an Italian mother and a French father, Claude François was born in Ismaïlia, Egypt, where his father, Aimé François, was working as a shipping traffic controller on the Suez Canal. In 1951 the job took the family to the city of Port Tawfik on the Red Sea.\n\nClaude François’ mother was very musical and had her son take piano and violin lessons. On his own, the boy learned to play the drums. As a result of the 1956 Suez Crisis, the family returned to live in Monaco, where they struggled financially after Claude’s father fell ill and could not work. A young Claude found a job as a bank clerk and at night earned extra money playing drums with an orchestra at the luxury hotels along the French Riviera. With a good but untested singing voice, he was offered a chance to sing at a hotel in the fashionable Mediterranean resort town of Juan-les-Pins. His show was well received and eventually he began to perform at the glamorous night-clubs along the Côte d’Azur. While working the clubs, he met Janet Woolcoot, an English dancer whom he married in 1960.\n\nAmbitious, Claude François moved to Paris, where there were many more opportunities to pursue his career. At the time, American Rock and Roll was taking hold in France and he took a job as part of a singing group in order to make a living. With the goal of eventually making it as a solo act, he paid the cost to record a 45rpm. Trying to capitalize on the American dance craze « The Twist », Claude François recorded a song titled « Nabout Twist » that proved a resounding failure. Undaunted, in 1962 he recorded a cover version in French of an Everly Brothers song, « Made to Love » (aka Girls Girls Girls). Written by Phil Everly, it had been only a minor hit in America, but Claude François’ rendition titled « Belles Belles Belles » rocked to the top of the French charts, selling close to two million copies and making him an overnight star.\n\nUnder a new manager, Claude François’ career continued to blossom. In 1963 he followed the first success with another French adaptation of an American song. This time, doing Trini Lopez’s « If I Had a Hammer » in French as « Si j’avais un marteau ». Claude François met Michel Bourdais who was working for the well-known French magazine “Salut les Copains” in English as « Hi Buddies ». He liked the rigor and the precision of Michel’s drawings and asked him to draw his portrait. This drawing has remained very famous until now. Capitalizing on his blond good looks, he mimicked Elvis Presley’s stage style as well as the slicked-back hair. Performing in sequined suits, François gave high-energy stage performances that had hordes of adoring teenage fans racing to the music shops to purchase his latest record or lining up to buy a ticket for his shows.\n\nIn 1964 he headlined at the Paris Olympia, a sign that he had arrived. At the end of that year Claude François created original new dance steps and Michel Bourdais drew them. For the first time, they brought up the idea of setting-up a show with female dancers. In January 1965, while returning from a trip to Las Vegas, Claude Francois fascinated by the American shows decided to take them as a model and eventually the project of performing on the stage with a female dancer band became clear in his mind.\n\nA dedicated professional, Claude François worked hard to achieve success producing a string of massively popular hit songs and touring constantly. With the onslaught of Beatlemania, he covered their hits in French, adjusted the hair style a little and kept his success moving ahead. But his talent extended beyond copying the works others had made famous, and he wrote songs for himself and displayed a melodic voice doing romantic ballads.\n\nIn 1966, François created a complete new stage act using four female dancers as backup. Named « Les Clodettes, » the sexy girls danced in the background while François did his own energetic work center stage. In a return to the Paris Olympia he added eight musicians and a full orchestra to his backup dancers, putting on a spectacular show that filled every seat in the large theater and left fans standing in the street for lack of tickets.\n\nDivorced from his wife, in 1967 he began a relationship with France Gall, another famous French singer. Their affair was short lived and he soon met Isabelle Forêt, with whom he had two sons in two years. Flushed with enormous success and confidence, he established his own record company. In 1968, he and Jacques Revaux wrote a song in French called Comme d’habitude, which became a hit in francophone countries. The song was inspired by his recent break-up with France Gall. Canadian singing star Paul Anka reworked it for the English-speaking public into the now legendary hit most famously sung by Elvis Presley and Frank Sinatra as « My Way ». Although Claude François continued his successful formula of adapting English and American rock and roll hits for the French market, by the 1970s the market had changed and the disco craze that swept North America took root in France. For the versatile François, this was not a problem. He simply re-invented himself as the king of French disco, recording « La plus belle des choses, » a French version of a Bee Gees hit record.\n\nHe worked non-stop, touring across Europe, Africa and at major venues in Quebec in Canada. However, his workload caught up with him in 1971 when he collapsed on stage from exhaustion. After a brief period off, he returned to the recording studios, releasing several best-selling hits throughout the early 1970s. He expanded from owning his own record company to acquiring a celebrity magazine and a modeling agency. Although driven to achieve financial success, in 1974 he organized a concert to raise funds for a charity for handicapped children and the following year he participated in a Paris concert to raise funds for medical research. By the mid-1970s he was single again, dating several well-known European stars. He continued to perform while overseeing his numerous business interests. In 1975, while in London, he narrowly escaped death when an IRA bomb exploded and two years later a fan tried to shoot him. In 1977 and 1978, more than 15 years after his first hit record, he was still topping the musical charts with multi-million sales from hits such as « Alexandrie Alexandra » and performing to large audiences.\n\nAfter working in Switzerland, on Saturday, March 11, 1978 he returned to his Paris apartment in order to appear the next day on « Rendez-vous du Dimanche » with TV host Michel Drucker. His demise was caused by his obsession with cleanliness and order. He was accidentally electrocuted when he tried to fix a broken light bulb while standing in a filled bathtub. At only 39 years of age, his early death brought a wave of public sympathy for a national French star.\n\nClaude François owned a home near the village of Dannemois in the Essonne departement about 35 miles south of Paris. It was a place where he liked to escape to relax in the quiet countryside and it was there that he was interred in the local cemetery.\n\nOn March 11, 2000, on the 22nd anniversary of his death, Place Claude-François in Paris was named in his memory, right in front of the building where he died.\n\nIn 2004 the movie 'Podium' was released. It's a story about a Claude François impersonator (played by Benoît Poelvoorde).\n\nHis hits include Alexandrie, Alexandra; Cette Année-la; Je vais à Rio. <a href=\"https://www.last.fm/music/+noredirect/Claude+Fran%C3%A7ois\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
