{"artist":{"name":"Aeoliah","mbid":"585a9c75-dcca-4019-97df-899921f841f9","url":"https://www.last.fm/music/Aeoliah","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/43cf089e8c474a019b257f37bc844d8d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/43cf089e8c474a019b257f37bc844d8d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/43cf089e8c474a019b257f37bc844d8d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43cf089e8c474a019b257f37bc844d8d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43cf089e8c474a019b257f37bc844d8d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/43cf089e8c474a019b257f37bc844d8d.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"64423","playcount":"702406"},"similar":{"artist":[{"name":"Constance Demby","url":"https://www.last.fm/music/Constance+Demby","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e4ae20e8f038470f83203c69fcc2e0fb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e4ae20e8f038470f83203c69fcc2e0fb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e4ae20e8f038470f83203c69fcc2e0fb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e4ae20e8f038470f83203c69fcc2e0fb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e4ae20e8f038470f83203c69fcc2e0fb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e4ae20e8f038470f83203c69fcc2e0fb.png","size":""}]},{"name":"Liquid Mind","url":"https://www.last.fm/music/Liquid+Mind","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f9f28840eb924aaa836e36551d00aa41.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f9f28840eb924aaa836e36551d00aa41.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f9f28840eb924aaa836e36551d00aa41.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9f28840eb924aaa836e36551d00aa41.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9f28840eb924aaa836e36551d00aa41.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9f28840eb924aaa836e36551d00aa41.png","size":""}]},{"name":"2002","url":"https://www.last.fm/music/2002","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/47422050e6864bf4b95db9479ebb8c74.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/47422050e6864bf4b95db9479ebb8c74.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/47422050e6864bf4b95db9479ebb8c74.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/47422050e6864bf4b95db9479ebb8c74.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/47422050e6864bf4b95db9479ebb8c74.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/47422050e6864bf4b95db9479ebb8c74.png","size":""}]},{"name":"Deuter","url":"https://www.last.fm/music/Deuter","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5fadc931e7234bcab8290dbf3dfdd046.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5fadc931e7234bcab8290dbf3dfdd046.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5fadc931e7234bcab8290dbf3dfdd046.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5fadc931e7234bcab8290dbf3dfdd046.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5fadc931e7234bcab8290dbf3dfdd046.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5fadc931e7234bcab8290dbf3dfdd046.png","size":""}]},{"name":"Parijat","url":"https://www.last.fm/music/Parijat","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/66080c0b3a094d1b842729616454a49f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/66080c0b3a094d1b842729616454a49f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/66080c0b3a094d1b842729616454a49f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/66080c0b3a094d1b842729616454a49f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/66080c0b3a094d1b842729616454a49f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/66080c0b3a094d1b842729616454a49f.png","size":""}]}]},"tags":{"tag":[{"name":"new age","url":"https://www.last.fm/tag/new+age"},{"name":"ambient","url":"https://www.last.fm/tag/ambient"},{"name":"relax","url":"https://www.last.fm/tag/relax"},{"name":"space","url":"https://www.last.fm/tag/space"},{"name":"Mellow","url":"https://www.last.fm/tag/Mellow"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Aeoliah/+wiki"}},"published":"10 May 2007, 13:12","summary":"Aeoliah (pronounced: Ay-oh-lee-ya) was born and raised in Germany until he was ten when he immigrated to the US with his parents in 1960. He completed his university training at the University of New Mexico in 1972, graduating cum laude with a degree in fine arts. His works of art have been exhibited in world museums such as the Art Institute of Chicago and the Stedelijk Museum in Amsterdam. During his early teens, he took formal music lessons on the violin and played in his local high school orchestra. <a href=\"https://www.last.fm/music/Aeoliah\">Read more on Last.fm</a>","content":"Aeoliah (pronounced: Ay-oh-lee-ya) was born and raised in Germany until he was ten when he immigrated to the US with his parents in 1960. He completed his university training at the University of New Mexico in 1972, graduating cum laude with a degree in fine arts. His works of art have been exhibited in world museums such as the Art Institute of Chicago and the Stedelijk Museum in Amsterdam. During his early teens, he took formal music lessons on the violin and played in his local high school orchestra. However, his true love was always the piano. In 1979, while he was in process of completing a painting entitled Music of the Spheres, he began to hear tonal harmonies that corresponded to the healing tones and colors in the painting. He then got the idea that light and sound are somehow linked as universal forms of energy, and this in turn, became his inspiration and vision to create his first album, Inner Sanctum in 1980.\n\nWhat started out as impressionistic, improvisational textures of electronic and acoustic instruments blending together in rich harmonic overtones of transparent, ethereal sound, later evolved into more structured compositions which have since, become well known classics of the New Age meditation & healing music genre.\n\nAeoliah firmly believes that to continue to categorize music that may contain various styles and elements such as classical, deep space music, or pop into one narrow category of New Age, is much too limiting to the broad appeal of the music. His music is steadily moving into more mainstream outlets such as Barnes & Noble, Best Buy, I-Tunes, Tower Records, and a large chain of department stores in Europe. . His recordings have also been featured on Continental and KLM Airlines as part of their in-flight program.\n\nOne of his big hits is Angel Love, which was released in 1985, and still continues to be on the top charts of the alternative music market today. In 1989 and 1991, Angel Love was featured as a top ten best seller in the East Coast publication of 'New York Naturally', a resource directory for the tri-state area of New York, New Jersey, and Connecticut. Among the top recording artists featured were Aeoliah, Enya, Suzanne Cianni, Yanni, Ray Lynch, Mike Rowland, Bruce BecVar and Kitaro. Then in late 1993, Marla Maples Trump gave birth to her first child, Ariana Trump, and played Angel Love for Children, during her birthing process. Shortly after giving birth, Marla appeared as a guest on CBS This Morning, and handed a copy of that recordi ng to Paula Zahn, (also pregnant at the time) who was hosting the show, and said that Angel Love was one of her favorite pieces of music. Quite a few other celebrities such as Ashley Judd and others also enjoy the soothing and healing aspect of his music.\n\nAnother album of Aeoliah's th at many people enjoy is Chambers of the Heart (released as Angels of the Heart in Europe), which was inspired by some of the neo-classical romantic piano music of the late nineteenth century. This album has a universal appeal to a wide and varied audience, and is very accessible for the mainstream market. His other top sellers include a series of four compact discs entitled, Music For Reiki Vol 1-4 , which are in demand both in the US and European market. In the past, Aeoliah has done some extensive concert tours in Europe, and one concert in Tokyo in 1991. He was interviewed on NRK, one the main national Japanese television networks, who aired his interview on prime time television in Japan at that time.\n\nAeoliah's music has a wide appeal to many health professionals around the world. His music is known for its therapeutic quality which has benefited hundreds of thousands of people throughout the world who work with his healing music privately, in hospitals, hospices and in-care centers. To date, Aeoliah has created twenty five musical recordings available on CD. He has also produced several self-help recordings consisting of guided imagery with his meditation music.\n\nHe is also an accomplished Visionary Artist, Reiki Master, and an author. Receiving a special award for his first book, Awakening Your Inner Light, published in 1992, was awarded Best Book of the Year in the New Age Category in 1992, by the North American Bookdealer's Exchange. He has recently completed his second book, The Secret Gardens of The Heart, a metaphysical romance novel.\n\nIn the early part of 2007, he will create his first 60-minute music video, combining his many talents as composer and visionary artist.\n\nAeoliah clearly describes the intention behind his healing and meditation music; \"The music I compose is created to help lift humanity out of denser, mundane consciousness and into more expanded states of harmonic resonance and awareness by opening new sonic dimensions that help to rebalance the chakras & nervous system.\nThe healing and meditation music becomes a vehicle for self-healing when it assists the listener to make contact with, unite, and merge with their innermost self. This sustained harmonic resonance helps us to shift out of the conditioned torpor of the mundane, and opens us up to a more loving, open, receptive, conscious, and compassionate state of being and self-acceptance. It is through this dynamic interactive process with the music, that the inner self is awakened, and the transformation of healing is initiated.\" <a href=\"https://www.last.fm/music/Aeoliah\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
