{"artist":{"name":"Colin James","mbid":"d943c745-baf9-4aa4-b1ee-df76db44bec8","url":"https://www.last.fm/music/Colin+James","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6cd5a902fa3e490c8a357be190997e63.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6cd5a902fa3e490c8a357be190997e63.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6cd5a902fa3e490c8a357be190997e63.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cd5a902fa3e490c8a357be190997e63.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cd5a902fa3e490c8a357be190997e63.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cd5a902fa3e490c8a357be190997e63.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"36551","playcount":"364398"},"similar":{"artist":[{"name":"Tommy Castro","url":"https://www.last.fm/music/Tommy+Castro","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5f9621b913b242dc99b50d18f9382191.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5f9621b913b242dc99b50d18f9382191.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5f9621b913b242dc99b50d18f9382191.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f9621b913b242dc99b50d18f9382191.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f9621b913b242dc99b50d18f9382191.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5f9621b913b242dc99b50d18f9382191.png","size":""}]},{"name":"Big Sugar","url":"https://www.last.fm/music/Big+Sugar","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1dfd559dfb4b4531a910d50f5066df39.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1dfd559dfb4b4531a910d50f5066df39.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1dfd559dfb4b4531a910d50f5066df39.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1dfd559dfb4b4531a910d50f5066df39.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1dfd559dfb4b4531a910d50f5066df39.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1dfd559dfb4b4531a910d50f5066df39.png","size":""}]},{"name":"54-40","url":"https://www.last.fm/music/54-40","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8bda578ee388431ba773e2c90a7dd82f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8bda578ee388431ba773e2c90a7dd82f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8bda578ee388431ba773e2c90a7dd82f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8bda578ee388431ba773e2c90a7dd82f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8bda578ee388431ba773e2c90a7dd82f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8bda578ee388431ba773e2c90a7dd82f.png","size":""}]},{"name":"Ronnie Baker Brooks","url":"https://www.last.fm/music/Ronnie+Baker+Brooks","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b3bf69248844180ee3537369288d6f16.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b3bf69248844180ee3537369288d6f16.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b3bf69248844180ee3537369288d6f16.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b3bf69248844180ee3537369288d6f16.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b3bf69248844180ee3537369288d6f16.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b3bf69248844180ee3537369288d6f16.png","size":""}]},{"name":"Wide Mouth Mason","url":"https://www.last.fm/music/Wide+Mouth+Mason","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f9ee0032ed2149358a15de7319353b6c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f9ee0032ed2149358a15de7319353b6c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f9ee0032ed2149358a15de7319353b6c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9ee0032ed2149358a15de7319353b6c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9ee0032ed2149358a15de7319353b6c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f9ee0032ed2149358a15de7319353b6c.png","size":""}]}]},"tags":{"tag":[{"name":"blues","url":"https://www.last.fm/tag/blues"},{"name":"Canadian","url":"https://www.last.fm/tag/Canadian"},{"name":"blues rock","url":"https://www.last.fm/tag/blues+rock"},{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"swing","url":"https://www.last.fm/tag/swing"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Colin+James/+wiki"}},"published":"06 Aug 2006, 16:22","summary":"Colin James (born Colin James Munn, August 17, 1964) is a Canadian rock and blues singer and songwriter. James has been nominated for 15 Juno Awards, winning six times.\n\nJames was only 18-years old when he captured the attention of guitar legend Stevie Ray Vaughan, who marveled at this prodigious guitar talent, and immediately decided to take him on the road through the Canadian prairies, and later the United States. It wasn't long after that the young musician began opening for the likes of John Lee Hooker <a href=\"https://www.last.fm/music/Colin+James\">Read more on Last.fm</a>","content":"Colin James (born Colin James Munn, August 17, 1964) is a Canadian rock and blues singer and songwriter. James has been nominated for 15 Juno Awards, winning six times.\n\nJames was only 18-years old when he captured the attention of guitar legend Stevie Ray Vaughan, who marveled at this prodigious guitar talent, and immediately decided to take him on the road through the Canadian prairies, and later the United States. It wasn't long after that the young musician began opening for the likes of John Lee Hooker, ZZ Top, Steve Winwood and Keith Richards, Colin's 1988 self-titled debut Colin James was the fastest-selling album in Canadian music history featuring the smash hits \"Why'd You Lie?”, “Voodoo Thing” and “Five Long Years\". It featured a team of three top producers, including Tom Dowd (Eric Clapton, Lynyrd Skynyrd,  The Allman Brothers), Danny Kortchmar (Bon Jovi, Billy Joel, Daryl Hall & John Oates, Stevie Nicks, Neil Young) and Bob Rock (Jann Arden, Michael Bublé, Bush, The Cult, Loverboy, Sarah McLachlan, Metallica).  \n\nJames followed up his record-breaking debut with a strong 1990 release, Sudden Stop, which was produced by Joe Hardy (.38 Special, Steve Earle, The Jeff Healey Band, ZZ Top ). This release has two top forty radio hits: \"Just Came Back\" and, \"Keep On Loving Me Baby\", and features Bonnie Raitt singing backing vocals on \"Give It Up\". This sophomore album further helped established Colin's integrity as an artist to lookout for.  \n\nJames formed The Little Big Band in early 1990's and would eventually release a trilogy of CDs fronting this 1930's-50's style punchy horn section band, playing classics and originals featuring his stellar guitar fills and confident vocals. The first Colin James and The Little Big Band was released in 1993, and it was produced by Chris Kinsley (The Cult, Duran Duran, Psychedelic Furs, The Rolling Stones). The second Colin James and The Little Big Band II was released in 1998 on Warner Music, while the third, Colin James & The Little Big Band 3 was distributed on Maple Music in Canada and Universal Music Group globally in 2006, and he would eventually do a fourth with the band, a holiday album Colin James & The Little Big Band Christmas.   \n\nIn 2008 he took home three Maple Blues Awards (Toronto Blues Society), which included Entertainer of the Year, while his release Limelight also went gold in Canada.\n\nJames released his twelfth album Rooftops and Satellites on October 6th, 2009, and it was a return to his guitar Blues-Rock roots.  The album was primarily co-written by Tom Wilson (Junkhouse, Blackie and The Rodeo Kings,  Lee Harvey Osmond) and Thomas \"Tawgs\" Salter, co-writer and producer of Lights' debut and Josh Groban's Awake, and it has generated four Canadian radio singles, “Man’s Gotta Be A Stone”, “Lost Again”, “Wavelength” and “Johnny Coolman.” \n\n2011's 'Take It From The Top: The Best Of’ pays tribute to James's career's first 23 years and serves as a celebration of Colin’s return back where he started his recordings, Virgin/EMI.  This Greatest Hits collection also features two newly recorded tracks, “It’s Gonna Be Alright“ as well as an innovative cover of the Buddy Miles' classic “Them Changes”, that were recorded in Vancouver with veteran producer Bob Rock (Michael Bublé, Metallica), reuniting the two after almost twenty years.\n\nOn June 12th, 2012, James released his fifteenth album, appropriately entitled  Fifteen, which was produced by Joe Hardy (ZZ Top, Brooks & Dunn, Jeff Healey, Steve Earle), who had handled three of Colin's previous album productions including his successful sophomore release.  Colin co-writes with Gordie Johnson (Big Sugar, Grady) on the opener “Sweets Gone Sour” and the rocker “I Need You Bad.”  Colin also re-teamed with Tom Wilson and Thomas “Tawgs” Salter on four high-octane tracks, including the bluesy “No Time to Get There” and the driving “Stone Faith,” the album’s first single.\n\nFifteen also features two beautiful co-writes with Ron Sexsmith that reveal Colin’s seductive side: “Finally Wrote a Song for You”, a soulful love ballad; and “Shoulder to Cry On,” a moving acoustic number that highlights his vocal range, while closing the album.  The disc also features some inspiring covers, including John Lennon's \"Jealous Guy\",  Peter Green's (Fleetwood Mac) \"Oh Well\", [artis]Foy Vance’s gospel-tinged “Shed A Little Light,” and Allen Toussaint's funky \"Sneakin' Sally Through The Alley\", which has perhaps become best known by Robert Palmer's cover.\n\nOn February 3, 2015, James released Hearts On Fire which was produced by Colin Linden at House of Blues Studios in Nashville, and this twelve track collection is distributed by Universal Music. The title track and all but two of the songs were written or co-written by Colin.\n\nIn 2016, James was named an inductee into the Western Canadian Music Hall of Fame presented by FACTOR (The Canadian Foundation Assisting Canadian Talent on Recordings). In addition to this honour, Colin headlined the Western Canadian Music Awards Show at Casino Regina on October 13th, 2016, kicking off BreakOut West’s 14th year of celebrating Western Canada’s talent.\n\nJames's studio album Blue Highways features thirteen Classic Blues covers from guitar-hero greats like Blind Willie McTell, Freddie King, Peter Green, and Robert Johnson. The CD was released on October 16th, 2016. Recording and Production was primarily handled in Vancouver by Colin James and Dave Meszaros, with recording and mixing assistance from Eric Mosher, Chris Stringer and Jason Jaknunas. Blue Highways is being distributed by True North Records, and iTunes. \n\nOver his illustrious career, James has earned 16 Maple Blues Awards, and he has worked and toured with the 'who’s who' in the international music scene (in alphabetical order): Luther Allison, Jann Arden, The Chieftains, Albert Collins, Robert Cray, Tom Dowd, Buddy Guy, Johnny Hallyday, John Hammond Jr., Gordie Johnson, Albert King, Bobby King and Terry Evans, Danny Kortchmar, Lenny Kravitz, Little Feat, The Memphis Horns, Craig Northey, Bill Payne, Bonnie Raitt, Keith Richards, Bob Rock, The Rolling Stones, Roomful Of Blues, Carlos Santana, Mavis Staples, Roebuck \"Pops\" Staples, Stevie Ray Vaughan, Tom Wilson, Betty Wright and ZZ Top. In addition to writing most of his own material, his music has been covered by artists like Maria Muldaur, Johnny Halliday and Lucinda Williams. \n <a href=\"https://www.last.fm/music/Colin+James\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
