{"artist":{"name":"Connie Francis","mbid":"5fcd7daf-25e1-47fd-9ba1-830b42708f84","url":"https://www.last.fm/music/Connie+Francis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/77fdf774625a4384890c6770090e3f27.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/77fdf774625a4384890c6770090e3f27.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/77fdf774625a4384890c6770090e3f27.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/77fdf774625a4384890c6770090e3f27.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/77fdf774625a4384890c6770090e3f27.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/77fdf774625a4384890c6770090e3f27.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"314364","playcount":"5133643"},"similar":{"artist":[{"name":"Brenda Lee","url":"https://www.last.fm/music/Brenda+Lee","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5ab3c7ca48c94de8a3cdbc69eea434ab.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5ab3c7ca48c94de8a3cdbc69eea434ab.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5ab3c7ca48c94de8a3cdbc69eea434ab.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5ab3c7ca48c94de8a3cdbc69eea434ab.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5ab3c7ca48c94de8a3cdbc69eea434ab.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5ab3c7ca48c94de8a3cdbc69eea434ab.png","size":""}]},{"name":"Neil Sedaka","url":"https://www.last.fm/music/Neil+Sedaka","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ae4c863a8696433c9deedc63ea794c51.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ae4c863a8696433c9deedc63ea794c51.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ae4c863a8696433c9deedc63ea794c51.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ae4c863a8696433c9deedc63ea794c51.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ae4c863a8696433c9deedc63ea794c51.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ae4c863a8696433c9deedc63ea794c51.png","size":""}]},{"name":"Pat Boone","url":"https://www.last.fm/music/Pat+Boone","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/03b1579cdd224d97879a9b9befb7c92c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/03b1579cdd224d97879a9b9befb7c92c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/03b1579cdd224d97879a9b9befb7c92c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/03b1579cdd224d97879a9b9befb7c92c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/03b1579cdd224d97879a9b9befb7c92c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/03b1579cdd224d97879a9b9befb7c92c.png","size":""}]},{"name":"Helen Shapiro","url":"https://www.last.fm/music/Helen+Shapiro","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/81bde5f88a1d45d0bb272709d6083372.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/81bde5f88a1d45d0bb272709d6083372.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/81bde5f88a1d45d0bb272709d6083372.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/81bde5f88a1d45d0bb272709d6083372.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/81bde5f88a1d45d0bb272709d6083372.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/81bde5f88a1d45d0bb272709d6083372.png","size":""}]},{"name":"Johnny Tillotson","url":"https://www.last.fm/music/Johnny+Tillotson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/982932dc8abf4aca99c516d164c82560.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/982932dc8abf4aca99c516d164c82560.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/982932dc8abf4aca99c516d164c82560.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/982932dc8abf4aca99c516d164c82560.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/982932dc8abf4aca99c516d164c82560.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/982932dc8abf4aca99c516d164c82560.png","size":""}]}]},"tags":{"tag":[{"name":"oldies","url":"https://www.last.fm/tag/oldies"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"50s","url":"https://www.last.fm/tag/50s"},{"name":"60s","url":"https://www.last.fm/tag/60s"},{"name":"pop","url":"https://www.last.fm/tag/pop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Connie+Francis/+wiki"}},"published":"05 Nov 2006, 22:35","summary":"Connie Francis (born 12 December 1938 in Newark, New Jersey, USA) is an American pop singer best known for international hit songs such as \"Who's Sorry Now?,\" \"Where The Boys Are\", and \"Everybody's Somebody's Fool\".\n\nBorn Concetta Rosa Maria Franconero in Newark's Italian Down Neck or Ironbound section of Newark, New Jersey neighbourhood, she is considered the most prolific and popular female rock 'n' roll hit-maker of the early rock era -- the late 1950s to the early 1960s. <a href=\"https://www.last.fm/music/Connie+Francis\">Read more on Last.fm</a>","content":"Connie Francis (born 12 December 1938 in Newark, New Jersey, USA) is an American pop singer best known for international hit songs such as \"Who's Sorry Now?,\" \"Where The Boys Are\", and \"Everybody's Somebody's Fool\".\n\nBorn Concetta Rosa Maria Franconero in Newark's Italian Down Neck or Ironbound section of Newark, New Jersey neighbourhood, she is considered the most prolific and popular female rock 'n' roll hit-maker of the early rock era -- the late 1950s to the early 1960s. After an appearance on Startime, Francis was advised to change her name from Franconero to something more easily pronounceable, as well as to quit the accordion and focus on singing.\n\nFrancis' first single \"Freddy\" (1955) met with little success. Her next nine singles were also failures, and she began considering a career in medicine; however, \"Who's Sorry Now\" (a cover version of a 1923 song) launched her into super-stardom worldwide. Francis recorded the song at what was to have been her final recording session for MGM, as the label was about to drop her since her previous singles had generated little activity. She has said (paraphrased from The Billboard Book of Number One Singles by Fred Bronson) that she recorded it at the suggestion of her father, who convinced her it stood a chance of becoming a hit because it was a song adults already knew and that teenagers would dance to if it were released with a more contemporary arrangement.\n\nThe gamble paid off. In April 1958, \"Who's Sorry Now\" reached No. 1 on the UK Singles Chart (number four in the USA); in 2000, it was named one of the Songs of the Century. On January 1, 1958, she debuted it on Dick Clark's American Bandstand television show; by mid-year over a million copies were sold. This was followed by many other hits over the next decade, as Connie Francis became one of the most popular vocalists in the world.\n\nFrancis specialized in downbeat ballads delivered in her trademark \"sobbing\" style -- such as \"My Happiness,\" \"I'm Sorry I Made You Cry,\" \"Among My Souvenirs,\" \"Together,\" \"Breakin' In a Brand New Broken Heart,\" and the Italian song \"Mama,\" many of which were remakes of old standards. However, she also had success with a handful of more upbeat, rock-and-roll-oriented compositions, such as \"Stupid Cupid,\" \"Lipstick On Your Collar,\" and \"Vacation.\" Among her other notable performances were \"In the Summer of His Years\" (a tribute to slain U.S. President John F. Kennedy) and Bert Kaempfert's \"Strangers In The Night\" (although the latter song is more identified with Frank Sinatra). Both \"Everybody's Somebody's Fool\" and \"My Heart Has a Mind of Its Own\" went to No.1 on the Billboard music charts in 1960. In 1962 she had another No.1 hit with \"Don't Break the Heart That Loves You.\" \n\n\nFrancis recorded in nine languages during her career, including English, Italian, French, Spanish, German, and even Japanese, and remade many of her hits in foreign languages, including \"Everybody's Somebody's Fool\" and her signature song, \"Where the Boys Are.\" In fact, her biggest hit album in the U.S. was 1960's Italian Favorites, and she followed it with several more albums of Italian songs over the years, as well as collections of Spanish-language and Jewish songs, among others.\n\n\"Where The Boys Are,\" one of many Neil Sedaka/Howard Greenfield compositions Francis recorded during her career (others included \"Stupid Cupid\" and \"Everybody's Somebody's Fool\"), gained wide exposure through its inclusion in the 1960 motion picture with the same title. Francis had a role in the film and sang the title song. During the first half of the 1960s she starred in three additional films -- Follow the Boys (1963) (the title song of which became a No. 17 Billboard single for Francis), Looking for Love (1964) and When the Boys Meet the Girls (1965).\n\nIn 1960 Francis became the youngest headliner to sing in Las Vegas, where she played 28 days a year for nine years. In 1961 she was successful in starring in her own television special on ABC television sponsored by Brylcreem titled Kicking Sound Around, singing and acting along-side Tab Hunter, Eddie Foy Jr. and Art Carney. She appeared on the Ed Sullivan Show on July 1, 1962 with French singing star Johnny Hallyday in a show that was taped at the famous Moulin Rouge nightclub in Paris, France. On July 3, 1963 she played a Command performance before Queen Elizabeth II at the Alhambra Theatre in Glasgow, Scotland. By 1967, she had 35 U.S. Top 40 hits, and three number ones.\n\nConnie Francis has always been a great fan of country music and recorded several albums of country standards during her pop career. In 1969 she had a modest country hit with \"The Wedding Cake\" and made the country charts again in 1982 with \"There's Still a Few Good Love Songs Left in Me.\" Several country singers found chart success remaking Francis' pop hits for the country market, including Marie Osmond (\"Who's Sorry Now\" in 1975), Susan Raye (\"My Heart Has a Mind of Its Own\" in 1972), Margo Smith (\"Don't Break The Heart That Loves You\" in 1978), and Debby Boone.\n\nDuring the height of the Vietnam War in 1967, Connie Francis performed for U.S. troops.\n\nFrancis ended her recording career in 1969. She returned in 1973 with \"The Answer,\" a song written just for her, and soon began performing again. Her son Joey was born in 1974. Tragedies followed soon after. In 1974 she was sexually assaulted in a hotel following a performance in Westbury, New York. Nasal surgery to correct a sensitivity to air conditioning deprived her of her ability to sing professionally for four years. Her brother was murdered in 1981.\n\nFrancis' autobiography, Who's Sorry Now? was published in 1984. Francis was diagnosed with bipolar disorder, a mental disease which includes severe depressions and manic highs. She uses the drug Lithium to balance out the emotional highs and lows caused by the disease. Connie Francis resumed her career in 1989 after discovering the drug and has continued singing and recording since then. Francis still holds a world-wide appeal shown through continued music sales and sold-out appearances.\n\nHer latest CD The American Tour contains performances from recent shows. In late December 2004, Francis headlined in Las Vegas for the first time since 1989.\n\nIn March of 2007, Francis performed to a sold-out crowd -- composed of gay urbanites and conservative suburbanites -- in San Francisco. The \"little diva\" belted out versions of her \"woebegone ballads . . . in full force,\" according to the San Franciso Chronicle's music critic.\nConnie's fan club: www.conniefrancis.com\n <a href=\"https://www.last.fm/music/Connie+Francis\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
