{"artist":{"name":"Connie Smith","mbid":"6fe09087-5693-4189-aa12-8d148f294121","url":"https://www.last.fm/music/Connie+Smith","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/269042450f9347cb901749a928fc1209.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/269042450f9347cb901749a928fc1209.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/269042450f9347cb901749a928fc1209.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/269042450f9347cb901749a928fc1209.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/269042450f9347cb901749a928fc1209.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/269042450f9347cb901749a928fc1209.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"28011","playcount":"6659637"},"similar":{"artist":[{"name":"Lynn Anderson","url":"https://www.last.fm/music/Lynn+Anderson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c92230dce8bc47f392765b409232ea19.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c92230dce8bc47f392765b409232ea19.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c92230dce8bc47f392765b409232ea19.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c92230dce8bc47f392765b409232ea19.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c92230dce8bc47f392765b409232ea19.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c92230dce8bc47f392765b409232ea19.png","size":""}]},{"name":"Patty Loveless","url":"https://www.last.fm/music/Patty+Loveless","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c39d87318fdf4667a6707e53a78a09c4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c39d87318fdf4667a6707e53a78a09c4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c39d87318fdf4667a6707e53a78a09c4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c39d87318fdf4667a6707e53a78a09c4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c39d87318fdf4667a6707e53a78a09c4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c39d87318fdf4667a6707e53a78a09c4.png","size":""}]},{"name":"Billie Jo Spears","url":"https://www.last.fm/music/Billie+Jo+Spears","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/db2e468fccde4b188e21365754f39249.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/db2e468fccde4b188e21365754f39249.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/db2e468fccde4b188e21365754f39249.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db2e468fccde4b188e21365754f39249.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db2e468fccde4b188e21365754f39249.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/db2e468fccde4b188e21365754f39249.png","size":""}]},{"name":"Billy Dean","url":"https://www.last.fm/music/Billy+Dean","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/3d3d56df62d841b08012ac457ed60ea5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/3d3d56df62d841b08012ac457ed60ea5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/3d3d56df62d841b08012ac457ed60ea5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d3d56df62d841b08012ac457ed60ea5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d3d56df62d841b08012ac457ed60ea5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/3d3d56df62d841b08012ac457ed60ea5.png","size":""}]},{"name":"Gene Watson","url":"https://www.last.fm/music/Gene+Watson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/91e1f1f921cc4133c11015cb9c0cfce1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/91e1f1f921cc4133c11015cb9c0cfce1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/91e1f1f921cc4133c11015cb9c0cfce1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/91e1f1f921cc4133c11015cb9c0cfce1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/91e1f1f921cc4133c11015cb9c0cfce1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/91e1f1f921cc4133c11015cb9c0cfce1.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"classic country","url":"https://www.last.fm/tag/classic+country"},{"name":"female vocalists","url":"https://www.last.fm/tag/female+vocalists"},{"name":"connie smith","url":"https://www.last.fm/tag/connie+smith"},{"name":"oldies","url":"https://www.last.fm/tag/oldies"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Connie+Smith/+wiki"}},"published":"05 Nov 2007, 08:08","summary":"\nConnie Smith (born Constance June Meador 14 August 1941, in Elkhart, Indiana) is an American country music singer. She is best known for her 1964 hit song \"Once a Day\", which spent 8 weeks at No. 1 on Billboard's Country music charts, the longest of any female country music artist in history. This was Smith's only single to reach the No. 1 spot on the Billboard charts.\n\nIn less than a year, Connie Smith moved from being a small-town Ohio housewife to country stardom with a number one single to her credit. <a href=\"https://www.last.fm/music/Connie+Smith\">Read more on Last.fm</a>","content":"\nConnie Smith (born Constance June Meador 14 August 1941, in Elkhart, Indiana) is an American country music singer. She is best known for her 1964 hit song \"Once a Day\", which spent 8 weeks at No. 1 on Billboard's Country music charts, the longest of any female country music artist in history. This was Smith's only single to reach the No. 1 spot on the Billboard charts.\n\nIn less than a year, Connie Smith moved from being a small-town Ohio housewife to country stardom with a number one single to her credit. Perhaps overly compared to and identified with Patsy Cline, Smith is still considered by many to be one of the best and most underrated vocalists in country history. Her lonely desperation came straight from the heart, also: Her father was abusive when she was a child, causing Smith to suffer a mental breakdown while she was in her teens. [1]\n\n\"Once a Day\" launched Connie Smith straight to the top of the country music industry and, for a brief period, she was one of the top female stars of the genre during the mid 1960s. Although she never achieved the level of commercial success as some of her contemporaries, Loretta Lynn, Tammy Wynette, Lynn Anderson and Dolly Parton, she is often hailed by music critics as one of the finest voices in country music, voted in 2001 by fellow artists and members of the Country Music industry as #9 of the 40 Greatest Women of Country Music of all time (CMT).Biography & career\n\n[edit] Early life & rise to fame\nSmith was born Constance June Meador in 1941 in Elkhart, Indiana. Although she was born in Indiana, she spent much of her early years in West Virginia and later in Ohio. Both of Smith's parents were from West Virginia. Her father was abusive when she was a child, causing Smith to suffer a mental breakdown while she was in her teens. [2] In West Virginia, she began to start singing locally. She was soon married and became a housewife and had children. By the early 1960s, Smith had already become a married woman with a four-month old son, living in Marietta, Ohio. During this time, Smith started singing locally again and appeared on local TV shows around her hometown area. While singing near Columbus, Ohio in August 1963, she was discovered by country singer Bill Anderson after winning a talent show contest. He recognized Smith's talents and offered his help into getting Smith a recording contract, Smith accepted his offer. A few months later, she was signed onto RCA Records, where she worked with legendary RCA producer Chet Atkins.\n\n\n[edit] The success of \"Once a Day\" & the peak of her career in the 60s\nAt RCA, Smith recorded her signature song, \"Once a Day\" during one of her first sessions at the studio. The song, written by Bill Anderson took him over two years to write. He finally finished the song after hearing Smith needed songs for her recording sessions. \"Once a Day\", was released as a single in September and hit the top of the country charts, reigning as number one for eight weeks. [3]\n\nTo date, \"Once a Day\" is still the longest song in Country music history to stay at the No. 1 spot on the Country charts. The only other frmale singer who has recently came close to Smith's long-standing record was Carrie Underwood, who's 2006's \"Jesus Take the Wheel\" spent six weeks at the No. 1 spot. \"Once a Day\" is Smith's only No. 1 Country hit to date.\n\nImage:Connie Smith-Opry.jpg \nConnie Smith performing at the Grand Ole Opry in Nashville, Tennessee in June 2004.Smith's follow-up, \"Then and Only Then,\" hit number four (even the flip side reached the Top 25), and her Top Ten streak continued until late 1968, including the big hits \"If I Talk to Him,\" \"Ain't Had No Lovin',\" and \"The Hurtin's All Over.\" [4] Between 1965 and 1966 Smith had three No. 1 Billboard Country albums, Connie Smith, Cute 'n' Country, and Born to Sing. At this time, Smith was one of the most successful female vocalists of the genre, having the similar success Loretta Lynn and Tammy Wynette would later have. During this time, Smith had been twice nominated for Grammy Awards, one for \"Once a Day\" in 1965 and another for \"Ain't Had No Lovin'\" in 1967.\n\nMeanwhile, her success began to take a toll; constant appearances on the road, in films, and on The Lawrence Welk Show pushed Smith to the brink of suicide in 1968. She credits her Christian faith with saving her from killing herself. [5] In 1969, Smith did a cover version of Marty Robbins' 1965 No. 1 hit \"Ribbon Of Darkness,\" that made it to No. 13 on the Country singles chart. That same year, she recorded a duet album with Nat Stuckey entitled Young Love. A single also called \"Young Love\", which was originally a hit for Sonny James in 1956, only made it to No. 20 for Smith. Connie and Nat also did a gospel album in 1970 called Sunday Morning With Connie and Nat -- later re-released in 2001 under the title God Will.\n\nShe was a top draw in country music concert venues and even branched into minor movie stardom, appearing in such films as Las Vegas Hillbillys (1966) with Ferlin Husky and Jayne Mansfield, and \"Hell's Angels on Wheels\" (1967) with Marty Robbins. Nevertheless, Smith did not give her career 100 percent like many of her contemporaries, touring considerably less, stating her main priority was being a wife and mother.\n\n\n[edit] Career slows down in the 1970s\nAfter Smith recovered from the pressure of being a female country star, she began to balance chart success with a lighter schedule. Though her country hits were rarer than in her mid-'60s heyday, she was a better performer — and person — for it. Smith still managed the Top Tens \"You and Your Sweet Love\" in 1969, \"I Never Once Stopped Loving You\" the following year, and \"Just One Time\" in 1971. Her most successful year during the '70s was 1972. She recorded three big hits: the number five \"Just What I Am,\" the number seven \"If It Ain't Love (Let's Leave It Alone),\" and the number eight \"Love Is the Look You're Looking For.\" [6] Smith continued to cut a lot of hits by Bill Anderson, but also cut a lot by Dallas Frazier, including, \"If It Ain't Love (Let's Leave It Alone)\".\n\nBy 1972, Smith began to incorporate more Gospel into her act. With the help of her third husband, Evangelist Marshall Haynes, she turned her live show into a traveling gospel road show and signed with Columbia, which permitted her to record more straight gospel songs. Though the material didn't score as well on the charts as her secular singles had, she managed to stay in the Top 20 during much of the '70s. [7] Smith recorded more Gospel albums under Columbia, including 1974's God Is Abundant, and was nominated for Grammy for Best Gospel Performance for her song, \"All the Praises\". Smith's Country career, didn't remain as successful, her hits rarely hit the Top 10. Her last Top 10 came in 1976 with \"('Til) I Kissed You\", which peaked at No. 10, the very top of the top 10.\n\nImage:Connie Smith-Newer.jpg \nConnie Smith later photo.When Smith was signed to Monument, she broke away from recording too much Gospel. Instead, Smith's Country music got more Pop-sounding, as Smith was keeping up with the times, during a the time when Country music was becoming more Pop-sounding. This type of sound was evident in some of her biggest hits from the late 70s, including the Top 10, \"(Till) I Kissed You\" and \"I Don't Want to Talk It Over Anymore\".\n\nAfter she signed with Monument in 1977, most of her singles dropped out of the Top 40. [8] Her 1978 single \"I Just Want to Be Your Everything\" was Smith's last significant hit on the country music charts, making it to No. 14. The single was originally a hit for Barry Gibb, who formed the popular Pop group The Bee Gees. Smith's version has been said to be the only notable cover version because it sounds like the original. As for her other singles released between 1978 and 1979 (most notably, \"Smooth Sailin'\" and \"Ten Thousand and One\"), they failed to become hits, and peaked outside the Country Top 40. Although these songs were updated to fit the time period, Smith was not one hundred percent focused on touring, performing and promotiing, focusing more of her time on family and later raising her children, which is one of the reasons for why she later temporarily left the business.\n\nSmith was nominated three times for the Country Music Association \"Female Vocalist of the Year\" award and earned 10 various Grammy nominations but has won neither. Smith has also occasionally dabbled in songwriting, penning over 30 songs and earning a Broadcast Music Incorporated award for her 1967 hit \"I'll Come Running.\" Another Smith-penned hit \"You've Got Me Right Where You Want Me\" was later recorded by Reba McEntire.\n\n\n[edit] Later career & life today\nSmith left Monument records in 1979, and officially left recording and touring for awhile for Smith to raise her children. However, in 1985, Smith returned on the Epic Records label to record one single titled, \"A Far Cry From You\", which peaked at only at No. 71. No album was ever released from the label. Smith did not release any studio albums in the 1980s.\n\nIn 1992, she released her first album in many years called The Wayward Wind. The following year, Smith did a live album entitled Live In Branson, Missouri, USA. Since 1997, she has been married to 90s Neo-Traditionalist Country star Marty Stuart, 17 years her junior. Connie and Marty actually met back in the 60's when as a kid he went to see her in concert. On the way home he reportedly told his mother \"One day I'll marry her!\" The two met again while Stuart was producing Smith's 1998 comeback album, Connie Smith. Although the album didn't gain any attention, Smith co-wrote nine of the ten tracks on the album. The album was released on Stuart's label, Warner Brothers. In 2003, Connie Smith released a Christian album with Barbara Fairchild and Sharon White (from the country group The Whites) entitled Love Never Fails.\n\nIn 2002, Smith was voted at No. 9 on CMT's 40 Greatest Women of Country Music, one of the highest honors of her career. George Jones also credits Smith as his favorite female country music singer in his book I Lived To Tell It All.\n\nDolly Parton has also credited Smith by once saying, \"There’s only three real female singers: Barbra Streisand, Linda Ronstadt, and Connie Smith. The rest of us are only pretending.\" The quote was put on Smith's 1995 comnpilation album by RCA, The Essential Connie Smith.\n\nMost recently country singer Martina McBride recorded a cover version of Smith's signature tune \"Once a Day\" and was put in McBride's 2005 album, Timeless. Smith continues to be a regular member of the Grand Ole Opry, and when not on the Opry, she does occasional dates with her husband. As a solo artist, Smith continues to tour on her own. In May 2007, she sang \"A World of Our Own\", a hit for Sonny James, at the Country Music Hall of Fame's Medallion Ceremony honoring James' induction into the Hall of Fame. In 2007, Smith joined her husband on his album, Compadres for a duet.\n\n\n[edit] Personal life\nSmith has been through many marriages. Now Smith is married to Stuart. Smith has five children and five grandchildren. One of children lives overseas in Norway. Smith is a devout Christian, and has made pilgrimages to Israel in the past, including one with Waylon Jennings and his wife, Country singer Jessi Colter.\n\n\n[edit] Awards & Nominations\nYear Award Program Award Result \n1964 Grammy Awards Best Female Country Vocal, \"Once a Day\" Nominated \n1964 Grammy Awards Best New Country Artist Nominated \n1964 Grammy Awards Best Country & Western Single, \"Once A Day\" Nominated \n1966 Grammy Awards Best Female Country Vocal, \"Ain't Had No Lovin'\" Nominated \n1966 Grammy Awards Best Sacred Recording, \"Connie Smith Sings Great Sacred Songs\" Nominated \n1967 Grammy Awards Best Female Country Vocal, \"Cincinnati, Ohio\" Nominated \n1967 CMA Awards Female Vocalist of the Year Nominated \n1969 Grammy Awards Best Female Country Vocal, \"Ribbon Of Darkness\" Nominated \n1969 Grammy Awards Best Sacred Performance, \"Whispering Hope\" with Nat Stuckey Nominated \n1970 CMA Awards Female Vocalist of the Year Nominated \n1972 CMA Awards Female Vocalist of the Year Nominated \n1972 Music City News Top Female Vocalist Nominated \n1973 Grammy Awards Best Inspirational Performance, \"All the Praises\" Nominated \n1974 Music City News Top Female Vocalist Nominated \n1975 Music City News Top Female Vocalist Nominated \n1975 Grammy Awards Best Gospel Performance (Other Than Soul Gospel), \"Connie Smith Sings Hank Williams Gospel\" Nominated \n1979 Music City News Gospel Group/Act of the Year Won \n\n\n[edit] Discography\nMain article: Connie Smith discography\n\n[edit] DVD Releases featuring Connie Smith\n1966 Second Fiddle to a Steel Guitar (performs \"Once a Day\"). Time Life, 2006. See review of the movie on this URL: In the Balcony - Latest DVD Views. \n1966 The Las Vegas Hillbillys (performs \"Nobody But a Fool (Would Love You)\"). VCI Home Video, 2000. URL: VCI Entertainment \n1967 Road to Nashville (performs \"I'll Never Get Over Loving You\", \"Nobody But a Fool (Would Love You)\"). Rhino, 2000. URL:Rhino. \n1967 Hell on Wheels (performs 2 songs). Rhino, 2000. \n\n[edit] References\n^ Connie Smith at All Music Guide \n^ Connie Smith at All Music Guide \n^ Connie Smith at All Music Guide \n^ Connie Smith at All Music \n^ Connie Smith at All Music Guide \n^ Connie Smith at All Music Guide \n^ Connie Smith biography at All Music Guide \n^ Connie Smith at All Music Guide \nCooper, Daniel. (1998). \"Connie Smith\". In The Encyclopedia of Country Music. Paul Kingsbury, Editor. New York: Oxford University Press. pp. 490-1. \n\n[edit] External links\nConnie Smith at CMT.com \nConnie Smith at Opry.com \nConnie Smith at All Music Guide \nConnie Smith Brief Biography & Annotated discography \nConnie Smith at LP Discography to the left: scroll down to 'S' and to 'SMITH Connie' (this discography is quite complete w/ original picture sleeves, chart positions and lyrics) \n\n\n\n <a href=\"https://www.last.fm/music/Connie+Smith\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
