{"artist":{"name":"Corb Lund","mbid":"2546bbcd-01b9-481f-95e0-81bdd821f823","url":"https://www.last.fm/music/Corb+Lund","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/aabffeeae6d44eeeb30f7d6e64cc1347.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/aabffeeae6d44eeeb30f7d6e64cc1347.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/aabffeeae6d44eeeb30f7d6e64cc1347.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aabffeeae6d44eeeb30f7d6e64cc1347.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aabffeeae6d44eeeb30f7d6e64cc1347.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/aabffeeae6d44eeeb30f7d6e64cc1347.png","size":""}],"streamable":"0","ontour":"1","stats":{"listeners":"27372","playcount":"534870"},"similar":{"artist":[{"name":"Turnpike Troubadours","url":"https://www.last.fm/music/Turnpike+Troubadours","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/fa71fa4f0ac14f5b89f52fb7e2df1435.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/fa71fa4f0ac14f5b89f52fb7e2df1435.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/fa71fa4f0ac14f5b89f52fb7e2df1435.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa71fa4f0ac14f5b89f52fb7e2df1435.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa71fa4f0ac14f5b89f52fb7e2df1435.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/fa71fa4f0ac14f5b89f52fb7e2df1435.png","size":""}]},{"name":"Dale Watson","url":"https://www.last.fm/music/Dale+Watson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d11b04f9d2b84a77af5b108444e2b73d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d11b04f9d2b84a77af5b108444e2b73d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d11b04f9d2b84a77af5b108444e2b73d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d11b04f9d2b84a77af5b108444e2b73d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d11b04f9d2b84a77af5b108444e2b73d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d11b04f9d2b84a77af5b108444e2b73d.png","size":""}]},{"name":"Wayne Hancock","url":"https://www.last.fm/music/Wayne+Hancock","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6cbc5e8d0341461f91642332fae8cf2c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6cbc5e8d0341461f91642332fae8cf2c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6cbc5e8d0341461f91642332fae8cf2c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cbc5e8d0341461f91642332fae8cf2c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cbc5e8d0341461f91642332fae8cf2c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6cbc5e8d0341461f91642332fae8cf2c.png","size":""}]},{"name":"Rosanne Cash","url":"https://www.last.fm/music/Rosanne+Cash","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8f6d89eead5344af8135853f3afa12f6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8f6d89eead5344af8135853f3afa12f6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8f6d89eead5344af8135853f3afa12f6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8f6d89eead5344af8135853f3afa12f6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8f6d89eead5344af8135853f3afa12f6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8f6d89eead5344af8135853f3afa12f6.png","size":""}]},{"name":"Blue Rodeo","url":"https://www.last.fm/music/Blue+Rodeo","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b8b1c1989b2648bdaa835d1eb1ddd535.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b8b1c1989b2648bdaa835d1eb1ddd535.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b8b1c1989b2648bdaa835d1eb1ddd535.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8b1c1989b2648bdaa835d1eb1ddd535.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8b1c1989b2648bdaa835d1eb1ddd535.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b8b1c1989b2648bdaa835d1eb1ddd535.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"Canadian","url":"https://www.last.fm/tag/Canadian"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"folk","url":"https://www.last.fm/tag/folk"},{"name":"cowboy","url":"https://www.last.fm/tag/cowboy"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Corb+Lund/+wiki"}},"published":"12 Aug 2006, 18:47","summary":"Cabin Fever is the seventh studio album by Corb Lund. Available worldwide from New West Records. This is Corb's second album to be released in the United States. Said to be \"a different sound.\"\n\nLosin’ Lately Gambler, is the 6th album from Corb Lund, Alberta’s acclaimed, alternative country star.\nProduced by the noted Nashville drummer and vocalist Harry Stinson (of Marty Stuart’s Fabulous Superlatives), this is Lund’s first album on his new record label New West Records. <a href=\"https://www.last.fm/music/Corb+Lund\">Read more on Last.fm</a>","content":"Cabin Fever is the seventh studio album by Corb Lund. Available worldwide from New West Records. This is Corb's second album to be released in the United States. Said to be \"a different sound.\"\n\nLosin’ Lately Gambler, is the 6th album from Corb Lund, Alberta’s acclaimed, alternative country star.\nProduced by the noted Nashville drummer and vocalist Harry Stinson (of Marty Stuart’s Fabulous Superlatives), this is Lund’s first album on his new record label New West Records.\n \nLund’s latest series of songs on Losin’ Lately Gambler, features a gallery of subjects drawn from real life.\n \nHe says, “A lot of my ancestors pop into the songs. I’ve got quite a cast of characters to draw from. I feel a real kinship with the old West. A lot of my ancestors were ranchers, but one of my great-grandpas was a road gambler in Montana in the 1880s. I’ve got some miners in there. My grandpas in particular were full of lore – they had lots of stories.”\n \nLund’s great-grandfather may be the model for the hard-luck gambler of the new album’s “A Game in Town Like This.” His own rodeo experience animates “Steer Rider’s Blues.” And Lund’s father, a veterinarian, likely served as the inspiration of “Horse Doctor, Come Quick” and “Talkin’ Veterinarian Blues.” Some characters, like the deadly female gunslinger of “Devil’s Best Dress,” hail from Western folklore, while others – the busted-out rancher of “Long Gone to Saskatchewan,” the farmer displaced by oil drillers in “This is My Prairie” – spin stories torn from the daily papers.\n \nThese vivid depictions of the Canadian West are never less than universal. Lund notes, “My gut feeling at the beginning, which I think has been borne out, is if you write about what is familiar to you and do a good job of it, the specifics fade away and the universality of the message comes through. When I was younger, listening to Springsteen singing about the slums of New Jersey, that was alien to me, but I got it, because the music is so good. That’s what I aspire to – to paint a picture that’s intriguing.”\n \nLund is backed on the collection by his longtime band the Hurtin’ Albertans – bassist Kurt Ciesla, drummer Brady Valgardson, and guitarist-banjoist Grant Siemens.\n \nHe has already impressed listeners and critics: Lund has been named Roots Artist of the Year by the Canadian Country Music Association for the last five years running and was again nominated this year. He collected the Roots and Traditional Album of the Year trophy for his album Hair in My Eyes Like a Highland Steer at the 2006 JUNO Awards (the Canadian Grammys), and took home a CCMA Album of the Year award for the set as well. His ambitious 2007 song cycle Horse Soldier, Horse Soldier! was nominated for the prestigious critical accolade, the Polaris Music Prize.\n \nLund came by all the praise naturally: Unlike many so-called “country artists” these days, he is no drugstore cowboy – he’s the real McCoy.\n \n“My family is all ranchers and rodeo people,” Lund says. “They’ve been in Canada for about 100 years, and before that they were raising cattle in Utah and Nevada. Some of my relatives are still down there. I grew up rodeoing. (I was a steer rider) – that’s like the junior version of bull riding. I was on horseback pretty much as soon as I could walk.”\n \nLund’s interest in musical storytelling was bred by his boyhood love of Marty Robbins (whose classic 1959 LP Gunfighter Ballads and Trail Songs was a crucial discovery) and Johnny Horton (whose hits like “The Battle of New Orleans” and “North to Alaska” impressed the budding history buff). Lund acknowledges the impact of other performers – Kris Kristofferson (now a New West label mate), Ramblin’ Jack Elliott. But some even more important influences ran in the family.\n \n“My grandpas used to sing all these old Western cowboy ballads,” Lund says. “Those songs come from before recorded music -- they’re traditional numbers that the cowboys always sing in camp, or just for fun, to entertain themselves. My grandpas knew all those songs. The first song I ever knew was called ‘The Strawberry Roan,’ (a cowboy song that’s at least 150 years old.)”\n \nCountry and Western music has always run in Lund’s blood, but before he began performing it full-time, he was swept away by indie rock. From 1989 to 2001, he worked with the aggressive Edmonton band the Smalls.\n \n“They call it punk rock – they say that because it was an indie kind of project – but it was more like a modern kind of Black Sabbath thing,” Lund says. “It was a very do-it-yourself, independent-scene kind of thing. So it was kind of punky. We did four records. It was good – we sold about 40,000 records. I think if the band had been from Chicago or New York or Los Angeles, we might have been able to take it further, but it was a niche music, and we took it about as far as we could take it in Western Canada.”\n \nHe continues, “About 1993 or ’94, I started playing country gigs. That’s the stuff I grew up with. I never really stopped playing it and liking it. There was quite a long period where I was doing both. From a writing standpoint, it’s not as different as you might think. I would compare it to sketching in pencil versus doing oil paintings.”   \n \nLund and his group, who will support Losin’ Lately Gambler with extensive touring, have already made their mark as a top concert act. The Hurtin’ Albertans routinely sell out arenas, and they’ve enlisted a legion of fans in the U.S. from Montana to Texas with appearances with alt-country stars like Robert Earl Keen and Hayes Carll.\n \nTheir audiences are not restricted to country enthusiasts, however: Lund has appeared on eclectic bills at high-profile events like England’s Glastonbury Festival (alongside the Who and the Alarm), Canada’s Virgin Festival (with Stone Temple Pilots), and Australia’s Byron Bay Blues Festival (co-billed with Buddy Guy and David Gray). He appeared at New West’s 2009 showcase at Austin’s South By Southwest Music Festival.\n           \n\"We play folk fests and rock fests and country fests.\" Lund says. \"I write my own stuff, and a lot of the regular country guys don't. I think there is a kind of quirkiness to the writing that opens it up a little bit to people who might not normally pick up on country & Western stuff. I'm in a unique situation: I grew up country, and I spent 10 years in a rock band, in a situation where you were encouraged to be unique and strive for new sounds. I bring that kind thing back to my country writing. There's enough of an irreverence to it where it steps outside the boundaries of what's traditionally expected.\"\n \nAbout the Hurtin' Albertans:\nKurt Ciesla, upright bass player for the Corb Lund Band, was raised in Lethbridge, Alberta. An extremely versatile musician, he is a former member of funk acts Blue Locutus and Bubba and is a familiar and respected musician in the Edmonton Jazz music scene. He has performed a number of times with\nthe Lethbridge Symphony Orchestra, including a live concert on the MacIntyre Ranch. Kurt is all about the bass.\n\nThe very talented and capable Brady Valgardson of Taber, Alberta is the band's drummer. Brady comes from a family of drummers and has performed with several bands in southern Alberta where he currently lives and works on his family farm.\n\nGrant Siemens is the 2008 CCMA Guitar Player of The Year winner. A Winnipeg native, Grant lends his talents as a lead guitar, lap steel and banjo player, providing a refreshing fourth dimension to the band's sound.\n <a href=\"https://www.last.fm/music/Corb+Lund\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
