{"artist":{"name":"DMX","mbid":"f3bf61f8-97d4-4e52-a73d-2ddbbe8196c8","url":"https://www.last.fm/music/DMX","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9c52559efca74297bc5425f71c7401b6.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9c52559efca74297bc5425f71c7401b6.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9c52559efca74297bc5425f71c7401b6.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c52559efca74297bc5425f71c7401b6.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c52559efca74297bc5425f71c7401b6.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9c52559efca74297bc5425f71c7401b6.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"1381575","playcount":"15694086"},"similar":{"artist":[{"name":"50 Cent","url":"https://www.last.fm/music/50+Cent","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/35c148085b274e718ae636e0059a47ca.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/35c148085b274e718ae636e0059a47ca.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/35c148085b274e718ae636e0059a47ca.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35c148085b274e718ae636e0059a47ca.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35c148085b274e718ae636e0059a47ca.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35c148085b274e718ae636e0059a47ca.png","size":""}]},{"name":"Xzibit","url":"https://www.last.fm/music/Xzibit","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/1c5c786cd6c849ddb0981d5ccae8c3bd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/1c5c786cd6c849ddb0981d5ccae8c3bd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/1c5c786cd6c849ddb0981d5ccae8c3bd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1c5c786cd6c849ddb0981d5ccae8c3bd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1c5c786cd6c849ddb0981d5ccae8c3bd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/1c5c786cd6c849ddb0981d5ccae8c3bd.png","size":""}]},{"name":"Busta Rhymes","url":"https://www.last.fm/music/Busta+Rhymes","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/64b13c93419b434ba7e933b617826dd4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/64b13c93419b434ba7e933b617826dd4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/64b13c93419b434ba7e933b617826dd4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/64b13c93419b434ba7e933b617826dd4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/64b13c93419b434ba7e933b617826dd4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/64b13c93419b434ba7e933b617826dd4.png","size":""}]},{"name":"2Pac","url":"https://www.last.fm/music/2Pac","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9193ad906c444231a8015cf794fcab4c.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9193ad906c444231a8015cf794fcab4c.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9193ad906c444231a8015cf794fcab4c.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9193ad906c444231a8015cf794fcab4c.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9193ad906c444231a8015cf794fcab4c.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9193ad906c444231a8015cf794fcab4c.png","size":""}]},{"name":"G-Unit","url":"https://www.last.fm/music/G-Unit","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/39ee5ab2ac2643a98db400cf2e1ced1e.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/39ee5ab2ac2643a98db400cf2e1ced1e.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/39ee5ab2ac2643a98db400cf2e1ced1e.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/39ee5ab2ac2643a98db400cf2e1ced1e.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/39ee5ab2ac2643a98db400cf2e1ced1e.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/39ee5ab2ac2643a98db400cf2e1ced1e.png","size":""}]}]},"tags":{"tag":[{"name":"rap","url":"https://www.last.fm/tag/rap"},{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"Gangsta Rap","url":"https://www.last.fm/tag/Gangsta+Rap"},{"name":"hip hop","url":"https://www.last.fm/tag/hip+hop"},{"name":"dmx","url":"https://www.last.fm/tag/dmx"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/DMX/+wiki"}},"published":"12 Feb 2006, 00:37","summary":"Earl Simmons (born December 18, 1970 in Mount Vernon, New York), better known by his stage name DMX (Dark Man X), is an American rapper from Yonkers, New York and actor signed to Ruff Ryders Entertainment. In 1998 he released his debut solo album, It's Dark and Hell Is Hot, and has since released 1998's Flesh of My Flesh, Blood of My Blood, 1999's ...And Then There Was X, 2001's The Great Depression, 2003's Grand Champ and 2006's Year of the Dog.. <a href=\"https://www.last.fm/music/DMX\">Read more on Last.fm</a>","content":"Earl Simmons (born December 18, 1970 in Mount Vernon, New York), better known by his stage name DMX (Dark Man X), is an American rapper from Yonkers, New York and actor signed to Ruff Ryders Entertainment. In 1998 he released his debut solo album, It's Dark and Hell Is Hot, and has since released 1998's Flesh of My Flesh, Blood of My Blood, 1999's ...And Then There Was X, 2001's The Great Depression, 2003's Grand Champ and 2006's Year of the Dog...Again. He has plans to release two more albums, Walk with Me Now and the gospel inspired You'll Fly with Me Later, but his incarceration on drug possession charges had prevented him from doing so until early 2010.\n\nFollowing the deaths of Tupac Shakur and the Notorious B.I.G., DMX took over as the reigning, undisputed king of hardcore rap. He was that rare commodity: a commercial powerhouse with artistic and street credibility to spare. His rapid ascent to stardom was actually almost a decade in the making, which gave him a chance to develop the theatrical image that made him one of rap's most distinctive personalities during his heyday. Everything about DMX was unremittingly intense, from his muscular, tattooed physique to his gruff, barking delivery, which made a perfect match for his trademark lyrical obsession with dogs. Plus, there was substance behind the style; much of his work was tied together by a fascination with the split between the sacred and the profane. He could move from spiritual anguish one minute to a narrative about the sins of the streets the next, yet keep it all part of the same complex character, sort of like a hip-hop Johnny Cash. The results were compelling enough to make DMX the first artist ever to have his first five albums enter the charts at number one.\n\nBiography\n\nEarl Simmons was the second of three children of a single mother, and was born in Mount Vernon, New York Simmons ended up growing up in the School Street housing projects of Yonkers, New York. He began rapping around the age of 13, amusing crowds of children with rhymes that relied on spelled-out words, a style he called \"spellbound.\" A local rapper eventually asked the young Earl to beatbox for him, and Simmons agreed, adopting the stage name DMX, which stands for \"Dark Man of the Unknown,\" X being an algebraic expression for unknown. But at the time, stood for a drum system that delivered amazing beats. Eventually he decided to try his hand at serious rapping, and honed his skills during a stint at a group home. He also got into fights and frequently was on the run from police. During this period, he also began doing shows and battling other rappers (Once battling and defeating Jay-Z), making a name for himself in the New York area. He released his first album called \"DMX: Unleashed and Unreleased\" which was an instant hit on the streets of Yonkers. He was also featured in the Unsigned Hype section of The Source in 1988.\n\nHe stated he wanted to be a preacher when he retires from his rapping career as he stated in his reality TV Show DMX: Soul Of A Man.\n\nDMX is a fan of the Pit Bull type dogs (American Pit Bull Terriers and American Staffordshire Terriers). He has a tattoo of one of his deceased dogs, on his back, which reads \"One Love Boomer\". He later contributed over $1 million to the United Negro Association for unfortunate black children in New York City.\n\n\n\nRecording career\n\nIn and out of jail, DMX decided to focus solely on his rap career. He began seriously looking for a deal and linked up with Pete McCormick Schaub, an A&R for Small Island at the time. Eventually, he signed a management deal with Ruff Ryders. They negotiated deals with both Bad Boy and Death Row Records, but he eventually landed at Def Jam. He is currently at Sony BMG, set to release his first of three albums on August 1st 2006. Rumors also arose that DMX had signed for 50 Cent's G-Unit Records, but were dismissed in a public news conference.\n\nIt's Dark and Hell Is Hot\n\nBefore It's Dark and Hell Is Hot, DMX released the single \"Born Loser\" which was banned on MTV due to the video's graphic images. DMX's debut single was \"Get At Me Dog\", which was an instant hit. His critically-acclaimed debut album, It's Dark and Hell Is Hot, is often credited with revitalizing Hardcore Rap in the mainstream scene, after the death of Tupac Shakur, and after Puff Daddy and Bad Boy Entertainment briefly dominated the charts with their pop-oriented and sample-reliant tunes.\n\nIn 1997, DMX earned a second major-label shot with Def Jam, and made a successful guest appearance on LL Cool J's \"4, 3, 2, 1.\" Additional guest spots on Ma$e's \"24 Hours to Live\" and fellow Yonkers MCs the The LOX's \"Money, Power, & Respect\" created an even stronger buzz, and in early 1998, he released his debut Def Jam single, \"Get At Me Dog.\" The song went gold and was a hit on the rap and dance charts. The single paved the way for DMX to release his classic first full-length album, It's Dark and Hell Is Hot, which debuted as number one on the pop charts.\n\nProduced mostly by Damon \"Dame Grease\" Blackman, (Swizz Beatz produced the \"Ruff Ryders' Anthem\", paving the way for future projects between the two). It's Dark and Hell Is Hot earned DMX numerous comparisons to Tupac Shakur for his booming and aggressive presence on the mic. The album went on to sell over four million copies and earned him credit for revitalizing Hardcore Rap after the deaths of Tupac Shakur and The Notorious B.I.G. Shortly after the album's release in May 1998, DMX was accused of raping a stripper in the Bronx, but was later cleared by DNA evidence. He made his film debut together with Nas and Method Man in Hype Williams' mildly successful film Belly. Although not a critical success, the film found a strong following with hip hop audiences.\n\nFlesh of My Flesh, Blood of My Blood\n\nDMX completed his second album before the end of 1998, and a pending buyout of Def Jam pushed the record into stores December 15. Flesh of My Flesh, Blood of My Blood entered the charts at number one and eventually went triple platinum. This number one hit made DMX the first rapper to have two number one albums in the same year. The cover photo of the rapper covered in pig's blood caused some controversy. The single \"Slippin'\" became his first chart hit in the UK. DMX hit the road with Jay-Z and the Method Man/Redman team on the blockbuster Hard Knock Life tour the following year. He had a song called \"Jack Moves\" with the legendary rap group Bone Thugs-N-Harmony, but the song did not appear on the album.\n\nA warrant for his arrest was issued in connection with a stabbing during a tour stop in Denver, of which he was later cleared. He was accused of assaulting a Yonkers man who'd allegedly harassed his wife in May (the charges were once again dropped). More serious charges were brought that summer, when DMX's uncle/manager was accidentally shot in the foot at a New Jersey hotel. DMX's home was raided by police, and they filed animal cruelty, weapons, and drug possession charges against the rapper and his wife. He eventually reached a plea bargain, receiving only fines, probation and community service.\n\n...And Then There Was X\n\nDMX released his third album on December 21, 1999, ...And Then There Was X, which was his third straight album to debut at number one. Party Up was his biggest single since \"Get at Me Dog\" which became his first Top Ten hit on the R&B charts. His next singles off the album, \"What's My Name\" & \"What These Bitches Want\" feat. Sisqó were also popular. ...And Then There Was X is the rapper's best-selling album to date, going 6x platinum and 9x platinum worldwide, & one of the fastest made by DMX : Def Jam urged him to realise the tracks within a month, while DMX used to take a year to write songs.\n\nThe Great Depression\n\nAfter resolving his legal problems, DMX returned to the studio and completed his fourth album, The Great Depression. Released October 3, 2001, it was DMX's fourth straight album to debut at number one. The album demonstrated his still strong allegiance with the Ruff Ryders. The Great Depression went platinum quickly, but lacked the staying power of his previous releases.\n\nGrand Champ\n\nReleased in 2003, Grand Champ was DMX's fifth straight album to debut at number one, extending DMX's position as the only artist in history to have 5 albums (his entire album catalog at that point) debut at #1. Fans and critics claimed disappointment with the album, most stating that it felt formulaic. After its release, DMX informed the public that he planned on retiring from the rap game and that Grand Champ would be his final album. He later ended his brief retirement and announced his plans to record the album Year of the Dog...Again. It debuted with approximately 125,000 albums sold, but failed to give DMX a sixth consecutive #1 album. The album is his lowest selling to date, and has yet to reach Gold in the U.S.\n\nYear of the Dog...Again\n\nReleased August 1st 2006, Year of the Dog...Again had numerous problems due to DMX switching record labels, as well as numerous delays. The album's five predeccesors debuted at #1, while this album missed the top spot by only a few thousand sales. In March, 2006 it was announced that the album had been renamed to \"Year of the Dog, Again,\" from \"Here We Go, Again.\" When DMX switched to Sony, Def Jam allowed him to keep all of the tracks he had created for the album. It was reported that most of the tracks were being reworked, with updated production, however the reworked album has also been leaked. DMX has also appeared on Busta Rhymes' \"Touch It (The Remix)\". He has also released his new singles \"Lord Give Me A Sign\", and \"We In Here\" feat. Swizz Beatz, which are included in \"Year of the Dog...Again\".\n\nUntitled\n\nComing 2007...\n\n\n\n\nCriminal history\n\nDMX has a criminal history originating with an arrest in 1999 in Teaneck, New Jersey, when police found a pistol, crack pipes, and 13 pit bulls (dog fighting) on the premises of his home. He pleaded guilty to charges of animal cruelty, disorderly conduct and possession of drug paraphernalia and was sentenced to make public service announcements for the Humane Society.\n\nIn June of 2003, he was arrested for swearing during a concert before a crowd of about 3,000 in St Kitts and Nevis in the Caribbean. The country's Information Minister alleged that a contract signed before the concert stipulated there would be no indecent language on stage. DMX was released on bail. ($376)\n\nIn June of 2004, DMX and a friend were arrested in the parking lot of Kennedy Airport in New York for allegedly attempting to steal a car and impersonating a federal agent. Police questioned Simmons, who claimed to be a \"special agent.\" However, agents were aware of his status as an entertainer and not an agent. DMX was taken to central lockup in Queens and held on charges of attempted robbery, criminal impersonation and criminal mischief. He pleaded guilty to reckless endangerment in December and was sentenced to a conditional discharge. His driver's license was suspended for the incident and he had to forfeit his 1998 Ford Expedition.\n\nIn April of 2005, DMX was arrested in The Bronx for driving with a suspended license after his car crashed into a police cruiser.\n\nIn October of 2005, DMX was sentenced to 60 days in prison after pleading guilty to two traffic violations while his license was suspended, one being the incident in April and the other involving driving his car at 104 miles per hour near his Westchester home on Interstate 684.\n\nIn May of 2006, DMX was arrested at a London airport for causing a disturbance after he refused to put on a seat belt and became abusive on a flight from New York to London. He was released with a \"caution,\" a British law term for basically saying he has accepted responsibility and a record will be made of the incident.\n\nOn September 4, 2006 Bobby Brown, DMX, and Busta Rhymes were all arrested for possession drugs for personal use.\n\nDMX mentions his criminal attorney, Murray Richman, also known as \"Don't Worry Murray\", in E.A.R.L.: The Autobiography of DMX.\n\nAs of December 31, 2008, DMX has pleaded guilty to charges of drug possession, theft and animal cruelty and was sentenced to 90 days.[19][20] On Feb 22, 2009, while serving his sentence, Simmons was re-booked for aggravated assault after allegedly throwing a dinner tray at a corrections officer and refusing to attend work assignments.If he is convicted of the assault, his probation may be revoked and he could face a longer sentence.\n\n\nRivalries\n\nDMX has had several outstanding issues with other artists in his career, some low-profile and some played out with help from the media and radio.\n\n* K-Solo, of Erick Sermon's Def Squad, was a rapper DMX battled in jail. When Solo was released, he had a respectable hit song wherein he used the \"spellbound\" style DMX claims to have invented. DMX responded in 1998, on It's Dark and Hell is Hot. Solo did not reply until 2001. However, in a recent interview, DMX challenged the rapper (who is also a smalltime boxer) to a fight.\n\nA scene in the documentry Beef had K-Solo taking a polygraph test answering questions about the \"spellbound\" style, but the results were not in favor of either of the two.\n\n* Kurupt, of the Dogg Pound, accused DMX of sleeping with Foxy Brown. The beef was squashed at the encouragement of Snoop Dogg.\n\n* Eminem and DMX were rumored to have sent subliminals at each other on a freestyle and DMX's 1999 hit \"Party Up (Up in Here)\" respectively. The two rappers later teamed up to record a track belittling Ja Rule called Go To Sleep with Obie Trice included on the Cradle 2 the Grave soundtrack.\n\n* The LOX and DMX allegedly had some problems stemming from their time living in Yonkers that was talked out in 2004. It is rumored a line on the song \"Trina Moe\", from The Great Depression, was aimed at the trio. However in the same \"recent interview\" which saw DMX reigniting the beef with K-Solo, the artist also gave a shout out to LOX and suggested that they collaborate on future work. Leaked versions of the upcoming DMX album are noted for featuring at least two tracks with prominent D-Block artists Jadakiss and Styles P.\n\n* Contrary to popular belief, DMX and Jay-Z were never on the Murder Inc. record label. Murder Inc. was originally supposed to be a band, rather than a label, with Jay-Z, DMX, and Ja Rule as members. DMX accused former cohort Ja Rule of getting rich from his style, teaming up with Eminem, 50 Cent, and others to diss the label. There's been recent rumors that DMX has ended his beef with Ja Rule as an interview with allhiphop.com has said.\n\n* DMX and Jay-Z have began to form a feud after X left Def Jam for Sony/Columbia at which point DMX says that they are both too big and that he can't work under him. This also caused a small feud between X & Rihanna. When DMX was asked why he made the sudden change, he said \"I can't work under him (speaking of Jay-Z) anymore. I have nothing against the label itself, I just can't work under him.\" DMX has also accused Jay-Z of being a poor Def Jam President and has thrown a shot at Jay-Z \"We In Here.\" He has shown support to Cam'Ron in his feud with Jay-Z on Funkmaster Flex's radio show on Hot 97. Which has caused Jay to throw a line aimed at X in his album Kingdome Come. <a href=\"https://www.last.fm/music/DMX\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
