{"artist":{"name":"Airto Moreira","mbid":"dd2abaa1-0b73-4ded-82ed-c80cce8d6378","url":"https://www.last.fm/music/Airto+Moreira","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/365beaeab9664b64cbf9fabce508d85d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/365beaeab9664b64cbf9fabce508d85d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/365beaeab9664b64cbf9fabce508d85d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/365beaeab9664b64cbf9fabce508d85d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/365beaeab9664b64cbf9fabce508d85d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/365beaeab9664b64cbf9fabce508d85d.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"23773","playcount":"164546"},"similar":{"artist":[{"name":"Flora Purim","url":"https://www.last.fm/music/Flora+Purim","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7727598c676a47019be99ec7c9de5770.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7727598c676a47019be99ec7c9de5770.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7727598c676a47019be99ec7c9de5770.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7727598c676a47019be99ec7c9de5770.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7727598c676a47019be99ec7c9de5770.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7727598c676a47019be99ec7c9de5770.png","size":""}]},{"name":"Airto","url":"https://www.last.fm/music/Airto","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/496e747c14ae909ac09bf34bd2cfae28.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/496e747c14ae909ac09bf34bd2cfae28.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/496e747c14ae909ac09bf34bd2cfae28.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/496e747c14ae909ac09bf34bd2cfae28.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/496e747c14ae909ac09bf34bd2cfae28.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/496e747c14ae909ac09bf34bd2cfae28.png","size":""}]},{"name":"Hermeto Pascoal","url":"https://www.last.fm/music/Hermeto+Pascoal","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2c51dfed2bbf45be8e63fe6a03b13fbb.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2c51dfed2bbf45be8e63fe6a03b13fbb.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2c51dfed2bbf45be8e63fe6a03b13fbb.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c51dfed2bbf45be8e63fe6a03b13fbb.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c51dfed2bbf45be8e63fe6a03b13fbb.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2c51dfed2bbf45be8e63fe6a03b13fbb.png","size":""}]},{"name":"Quarteto Novo","url":"https://www.last.fm/music/Quarteto+Novo","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ce6e9444f06d4f63b258d0370336a2dd.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ce6e9444f06d4f63b258d0370336a2dd.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ce6e9444f06d4f63b258d0370336a2dd.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ce6e9444f06d4f63b258d0370336a2dd.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ce6e9444f06d4f63b258d0370336a2dd.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ce6e9444f06d4f63b258d0370336a2dd.png","size":""}]},{"name":"Baden Powell","url":"https://www.last.fm/music/Baden+Powell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d29e4c703b8c45d1909a91321c2e22da.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d29e4c703b8c45d1909a91321c2e22da.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d29e4c703b8c45d1909a91321c2e22da.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d29e4c703b8c45d1909a91321c2e22da.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d29e4c703b8c45d1909a91321c2e22da.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d29e4c703b8c45d1909a91321c2e22da.png","size":""}]}]},"tags":{"tag":[{"name":"jazz","url":"https://www.last.fm/tag/jazz"},{"name":"brazilian","url":"https://www.last.fm/tag/brazilian"},{"name":"latin","url":"https://www.last.fm/tag/latin"},{"name":"Fusion","url":"https://www.last.fm/tag/Fusion"},{"name":"samba","url":"https://www.last.fm/tag/samba"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Airto+Moreira/+wiki"}},"published":"12 Aug 2007, 20:20","summary":"Airto Moreira was born in 1941 in the small village of Itaiopolis - south Brasil, and was raised in Curitiba. Even before he could walk he would start shaking and banging on the floor every time the radio played a hot song. This worried his mother, but his grandmother recognized his potential and encouraged him to express himself. By the time he was six years old he had won many music contests by singing and playing percussion. The city gave him his own radio program every Saturday afternoon. <a href=\"https://www.last.fm/music/Airto+Moreira\">Read more on Last.fm</a>","content":"Airto Moreira was born in 1941 in the small village of Itaiopolis - south Brasil, and was raised in Curitiba. Even before he could walk he would start shaking and banging on the floor every time the radio played a hot song. This worried his mother, but his grandmother recognized his potential and encouraged him to express himself. By the time he was six years old he had won many music contests by singing and playing percussion. The city gave him his own radio program every Saturday afternoon. At thirteen he became a professional musician, playing percussion, drums, and singing in local dance bands. He moved to Sao Paulo at the age of sixteen and performed regularly in nightclubs and television as a percussionist, drummer and singer.\n\nIn 1965 he met the singer Flora Purim in Rio de Janeiro. Flora moved to the USA in 1967 and Airto followed her shortly after. When in New York Airto began playing with musicians such as Reggie Workman, JJ Johnson, Cedar Walton and bassist Walter Booker. It was through Booker that Airto began playing with the greats - Cannonball Adderley, Lee Morgan, Paul Desmond and Joe Zawinul,\nto name a few. Zawignul recommended Airto to Miles Davis for a recording session in 1970 for the “Bitches Brew” album. Davis then invited Airto to join his group, which included such jazz icons as Wayne Shorter, Dave Holland, Jack DeJohnette, Chick Corea and later John McLaughlin and Keith Jarrett. He remained with Miles for two years, and appears on such releases as “Live/Evil”, “Live at the Fillmore”, “On the Corner”, “The Isle of Wight”, “Bitches Brew” and later releases including the “Fillmore Sessions”.\n\nFollowing his stint with Miles Davis, Airto was invited to form the original Weather Report with Wayne Shorter, Joe Zawinul, Miroslav Vitous and Alphonse Mouzon with whom he recorded “The Weather Report”. Soon after, he joined Chick Corea’s original Return to Forever group with Flora Purim, Joe Farrell and Stanley Clarke and they recorded the albums, “Return to Forever” and “Light as a Feather”.\n\nIn 1974 Airto formed his first band in the U.S., “Fingers” with Flora Purim. Since then they have performed constantly all over the world and recorded their own album for major record companies in Europe and America. Airto remains one of popular music’s most in demand percussionists. His collection of instruments, along with his knack for playing the right sound at the right moment, has made him the first choice of many producers and bandleaders. His work with Quincy Jones, Herbie Hancock, George Duke and Paul Simon, Carlos Santana, Gil Evans, Gato Barbieri, Michael Brecker, The Crusaders, Chicago, and many others including contributions to movie sound tracks such as The Exorcist, Last Tango in Paris, King of the Gypsies and Apocalypse Now, represents only a small number of the musical contributions Airto has made over the last three decades.\n\nHis impact was so powerful that Downbeat magazine added the category of percussion to its readers and critic’s polls, which he has won over twenty times since 1973. In the past few years he was voted number one percussionist by Jazz Times, Modern Drummer, Drum Magazine, Jazzizz Magazine, Jazz Central Station’s Global Jazz Poll on the Internet, as well as in many European, Latin American and Asian publications.\n\nHe has been advancing the cause of world and percussion music as a member of the “Planet Drum” percussion ensemble, with Mickey Hart, drummer for “The Grateful Dead”, and master conga player Giovanni Hidalgo and tabla virtuoso Zakir Hussain, along with Flora Purim, Babatunde Olatunji, Sikiru Adepoju and Vikku Vinayakram. Planet Drum won a Grammy Award in 1991 for World Music. Airto also contributed to another Grammy Award winning ensemble, “Dizzy Gillespie’s United Nations Orchestra\", which received the award for Best Live Jazz Album.\n\nAirto’s love for the music and the people of his native country of Brazil takes him back every year to visit old friends and relatives as well as to pay respects to his spiritual guides and elders. Airto has been involved in “Spiritism” since an early age and used to go to the “sessions” with his father José Rosa Moreira, who was a spiritual healer all of his life. His lifelong interest in spirituality led him to record The Other Side of This, an exploration into the healing powers of music and the spiritual world. Airto also composed and performed his “Brazilian Spiritual Mass” for a two hour special on German television, with the WDR Philharmonic Orchestra in Cologne, Germany. This rare performance was reproduced on Vinyl for the classical record label “Harmonia Mundi” and licensed as a video by WDR, broadcast around the world.\n\nAirto performed as a guest star with the Boston Pops Philharmonic Orchestra on a special for the PBS TV, the Smashing Pumpkins “Unplugged” for MTV, the Japan based percussion group Kodo and Depeche Mode’s latest CD “Exciter”. In 2001 when Airto recorded with Kodo, he contributed with two of his compositions: “Maracatu” and “Berimbau Jam”. The song “Maracatu” was chosen to be one of the official songs for the 2002 World Cup in Asia to open the ceremonies for the event in Japan.\n <a href=\"https://www.last.fm/music/Airto+Moreira\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
