{"artist":{"name":"Darden Smith","mbid":"ae2a2620-fac8-456b-b9ea-14b609879dca","url":"https://www.last.fm/music/Darden+Smith","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/639ee244c4c94c78a6b9d06ca01b0f71.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/639ee244c4c94c78a6b9d06ca01b0f71.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/639ee244c4c94c78a6b9d06ca01b0f71.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/639ee244c4c94c78a6b9d06ca01b0f71.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/639ee244c4c94c78a6b9d06ca01b0f71.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/639ee244c4c94c78a6b9d06ca01b0f71.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"7644","playcount":"68413"},"similar":{"artist":[{"name":"Peter Himmelman","url":"https://www.last.fm/music/Peter+Himmelman","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/35b1021d5ac24ffaaf34c0c33ac671b1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/35b1021d5ac24ffaaf34c0c33ac671b1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/35b1021d5ac24ffaaf34c0c33ac671b1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35b1021d5ac24ffaaf34c0c33ac671b1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35b1021d5ac24ffaaf34c0c33ac671b1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/35b1021d5ac24ffaaf34c0c33ac671b1.png","size":""}]},{"name":"Cheryl Wheeler","url":"https://www.last.fm/music/Cheryl+Wheeler","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/203c3b8fdf564b66aa0644185d45809f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/203c3b8fdf564b66aa0644185d45809f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/203c3b8fdf564b66aa0644185d45809f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/203c3b8fdf564b66aa0644185d45809f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/203c3b8fdf564b66aa0644185d45809f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/203c3b8fdf564b66aa0644185d45809f.png","size":""}]},{"name":"Bill Morrissey","url":"https://www.last.fm/music/Bill+Morrissey","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f7484655add5411f961272da9ab25af3.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f7484655add5411f961272da9ab25af3.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f7484655add5411f961272da9ab25af3.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f7484655add5411f961272da9ab25af3.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f7484655add5411f961272da9ab25af3.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f7484655add5411f961272da9ab25af3.png","size":""}]},{"name":"Kate Campbell","url":"https://www.last.fm/music/Kate+Campbell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2602e5b6fe2d46f587fa6181aeeea2c0.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2602e5b6fe2d46f587fa6181aeeea2c0.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2602e5b6fe2d46f587fa6181aeeea2c0.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2602e5b6fe2d46f587fa6181aeeea2c0.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2602e5b6fe2d46f587fa6181aeeea2c0.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2602e5b6fe2d46f587fa6181aeeea2c0.png","size":""}]},{"name":"Greg Trooper","url":"https://www.last.fm/music/Greg+Trooper","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f2c3756654d546edaa5ece2eb03480ed.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f2c3756654d546edaa5ece2eb03480ed.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f2c3756654d546edaa5ece2eb03480ed.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2c3756654d546edaa5ece2eb03480ed.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2c3756654d546edaa5ece2eb03480ed.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f2c3756654d546edaa5ece2eb03480ed.png","size":""}]}]},"tags":{"tag":[{"name":"singer-songwriter","url":"https://www.last.fm/tag/singer-songwriter"},{"name":"americana","url":"https://www.last.fm/tag/americana"},{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"folk","url":"https://www.last.fm/tag/folk"},{"name":"lesser known yet streamable artists","url":"https://www.last.fm/tag/lesser+known+yet+streamable+artists"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Darden+Smith/+wiki"}},"published":"27 Apr 2006, 13:28","summary":"Darden Smith (born March 11, 1962, in Brenham, Texas) is an Austin-based singer-songwriter known for his lyrics and for weaving folk and Americana influences with rock, pop, and the musical roots of his home state.\n\nDuring his career, Texas singer-songwriter Smith has recorded in folk, country and pop settings. He has co-written songs with a British rocker, released 10 critically-acclaimed albums, created works for dance theater, done symphonic collaborations and taught music to children. <a href=\"https://www.last.fm/music/Darden+Smith\">Read more on Last.fm</a>","content":"Darden Smith (born March 11, 1962, in Brenham, Texas) is an Austin-based singer-songwriter known for his lyrics and for weaving folk and Americana influences with rock, pop, and the musical roots of his home state.\n\nDuring his career, Texas singer-songwriter Smith has recorded in folk, country and pop settings. He has co-written songs with a British rocker, released 10 critically-acclaimed albums, created works for dance theater, done symphonic collaborations and taught music to children. Smith has made himself at home in studios in Manhattan, Nashville and London, as well as Austin. As this CDs show, his style is always shifting, yet remains true to his roots.\n\nAs melodic a collection as he has ever recorded, Field of Crows shows Smith continuing to explore rhythms, sounds and lyric themes. As it has on all of his recent Dualtone albums, his work on the nylon-string guitar adds a distinctive texture to the music. He plays more piano on this album than any of his previous collections. “I tend to write sitting at the piano, holding a guitar, and go back and forth between them.,” he says. “Over the last 10 years, the keyboard has become more involved in how I hear songs.”\n\nDeparting from the way he has recorded other albums, Smith cut Field Of Crows almost live in the studio with the band all in the same room collaborating. Co-produced with Stewart Lerman, the entire record was recorded and mixed over the course of three weeks in May 2005. Field of Crows is highlighted by contributions from drummer Sammy Merendino, multi-instrumentalist Steuart Smith, bassist Roscoe Beck, steel guitar and violinist David Mansfield, percussionist Jose Galeano and co-producer/guitarist Lerman.\n\n“I’ve known these people a long time,” comments Darden Smith. “They are my friends, which makes them better collaborators. I feel really blessed to be able to work with people I enjoy so much, who are also musicians of such a high caliber. They make me want rise to the moment.”\n\nThe themes on Field Of Crows alternate between hope and despair, which Smith says is a reflection of our troubled times. Most of the songs came together over the past year, and were highly colored by the war in Iraq, the 2004 election, and the Tsunami in Southeast Asia.\n\n“It always strikes me that in times like these, with all the craziness in the world, all the personal loss and tragedy, that hope holds a high value. It means something when there seems to be so little of it. These days as well, it’s obvious the world is pretty small and we’re all joined. We need each other for the place to keep working, on a personal level and for the big picture. We crave connection. It calms us and can drive us mad at the same time. The songs on ‘Field of Crows’ are about our connection with others-- finding it, holding it, losing it, and the never ending desire for more.”\n\nThe album’s philosophical underpinning is the folk-pop title tune. Like a lonely scarecrow beset by flocks of crows, we must all stand and fight, even though it seems hopeless, Smith seems to be saying. The stately, inspirational piano ballad “Fight for Love” sings of peace and brotherhood. “Golden Age” sounds jaunty, but its lyric is a dark meditation on how much pain there is in this world.\n\nThere are further musical contrasts and shadings on Field of Crows. The bluesy “Spinning Wheel” is about uplifting love. Yet the dreamy soundscape of “Wide Open” backs a lyric of heartbreak. The airy, soaring “Talk Me Down” is comforting. But the whispered, folkie “All That I Wanted” is as downbeat as anything on the record. The coolly percussive “Mary” is a single father’s conversation to his young daughter. On the other hand is the jazzy, smiling “It Takes Two.” One key track is “Satisfied.” The ballad’s lyric speaks of true love residing in everyday reality while an eloquent acoustic guitar figure weaves a lovely spell.\n\nSmith’s wrote or co-wrote all the songs on Field of Crows. His co-writers include Gary Nicholson (“Talk Me Down”, “Mary”, and “Anyway to Treat Your Lover”), J.D. Martin (“Satisfied”) and Phil Roy (“Fight For Love.”)\n\nAll in all, Field of Crows is a fine illustration of why a critic once dubbed Darden Smith, “a Texas Van Morrison.”\n\nThat Field of Crows is another musical exploration will surprise few who have followed this restlessly creative spirit’s career. Born in 1962, Darden Smith was raised in rural Brenham, Texas. He says that Leon Russell’s Carney LP of 1972 was one of his earliest musical influences. When he was in the fifth grade, Smith’s guitar teacher taught him the songs on Neil Young’s Harvest and After the Gold Rush albums. She explained to the boy that Young was the composer of his songs.\n\n“That was the first time it clicked to me that every song is written by somebody,” Smith recalls. “I was already writing poetry at the time. She said, ‘All it is, is just poems and melody.’ That’s all I needed to hear.”\n\nWhen he was in junior high, his family moved to suburban Houston. Culture shocked and out-of-place, the former farm boy sat in his room and wrote songs constantly from that point onward. Smith studied the structures of the songs of writers such as Guy Clark and Townes Van Zant and John Prine. He had his head spun around by Bob Dylan, The Allman Brothers and Jackson Browne. He began playing in clubs while still in high school. By the time he graduated from the University of Texas in Austin, Darden Smith was a fully realized talent and a regular on stages in the city’s thriving nightclub scene.\n\nThe folk-flavored Native Soil appeared as his debut album in 1986. Fellow newcomers Lyle Lovett and Nanci Griffith provided harmony vocals. Signed by Epic Records, he issued Darden Smith in 1988. Produced by Asleep at the Wheel’s Ray Benson, the collection spawned “Little Maggie” and “Day After Tomorrow” as country-chart singles.\n\nAt this point came the first of Smith’s shifts in direction. A song publisher teamed him up with Boo Hewerdine of the British band The Bible. The songwriters couldn’t have had more different backgrounds, but their collaborations resulted in the 1989 duet album Evidence.\n\n“I pride myself in being a Texas singer-songwriter. It’s who I am, and I will never get away from that. But that world was all I knew until I met Boo Hewerdine. I’d never created music outside of my little niche. But I was listening to things like Elvis Costello, Nick Lowe and The Pretenders. And the experience with Boo showed me that I could write music from a broader place than I had ever done before.”\n\nFollowing the critical acclaim of ‘Evidence’, the record company moved him over to its pop division, and onto Columbia Records, for 1990’s Trouble No More and 1993’s Little Victories, the latter of which produced the hit pop single, “Loving Arms.” In keeping with the crazy logic of the record business, the label released him from his contract after this, his most successful album to date.\n\nThe next several years were hard ones in Smith’s personal and professional life. Compounding the professional setback was the ending of his marriage.\n\nOut of that dark time came a sterling collection of folk-tinged pop called Deep Fantastic Blue in 1996. It was followed by Extra Extra in 2000. But by then, Darden Smith was disheartened, discouraged and contemplating getting out of the music business.\n\n“It was a tough time,” he recalls. “Then, in late 2000, I was having dinner with friends in New York. Sammy (Merendino) and Stewart (Lerman) suggested we should do one album more before I quit, but that we should do it only to have fun.” At the time I didn’t have a label, a manager or an agent. I started writing and recording purely out of the love of making music, and through that experience, fell back in love with the whole process.”\n\nSmith signed with Dualtone Records and turned in the brilliant and acclaimed Sunflower in 2002. Its songs “Perfect Moment” and “After All This Time” climbed the charts in the UK, with “After All This Time” reaching ..3 on the BBC2. Stateside, he was embraced by the emerging Americana format. Darden Smith now views that record as another watershed, personally and stylistically.\n\n“Music should come from the heart,” he says. “I had lost touch with that notion. Sunflower brought it back.”\n\nSunflower included guest vocals by Patti Griffin and Kim Richey. Both Shawn Colvin and Richey contributed vocals to Circo, his moody, adventurous 2004 release. Field of Crows features guest vocalist Eliza Gylkison as well as the invaluable contributions of Steuart Smith, Merendino, Beck, Mansfield, Galeano and Lerman.\n\n“I still like to explore musically,” Darden Smith comments about his musical diversity. “Some people do their exploring with different styles before they ever start putting out records. I kind of did mine as I was making the records.”\n\nRecords are just part of his musical wanderings. Beginning in 1989, Smith began composing music for experimental dance-theater works. Three full evening works followed, and in 1999 he was commissioned to create an orchestral work with the Austin Symphony Orchestra. The result was Grand Motion in 2000. He is currently working on a new theater piece. A radio documentary on Texas songwriters that he is creating for the BBC2, “Songs From The Big Sky”, will air March 2006. His ongoing “Be an Artist” program puts him in workshops, helping children see that they are all born artists and that creativity is inside all of us.\n\nAbout his extraordinary career, Darden Smith says, “I don’t worry about a lot of the stuff I used to worry about. This is my 10th record and my 20th anniversary in this business, and I realize how fortunate I am to be able to make a living being a musician, doing what I love to do. Why fight it? This is who I am, so I’m just going to groove along and enjoy the ride. I feel great, better than ever. So here we go.” <a href=\"https://www.last.fm/music/Darden+Smith\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
