{"artist":{"name":"Dark Fortress","mbid":"5074ddf4-3d57-49d9-a0b8-c36afe60a475","url":"https://www.last.fm/music/Dark+Fortress","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/06c084c5d15c455e83a02deb0210a1ac.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/06c084c5d15c455e83a02deb0210a1ac.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/06c084c5d15c455e83a02deb0210a1ac.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06c084c5d15c455e83a02deb0210a1ac.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06c084c5d15c455e83a02deb0210a1ac.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/06c084c5d15c455e83a02deb0210a1ac.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"53396","playcount":"2071348"},"similar":{"artist":[{"name":"Naglfar","url":"https://www.last.fm/music/Naglfar","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/585e6a75c7424f56a3380b73967377b9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/585e6a75c7424f56a3380b73967377b9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/585e6a75c7424f56a3380b73967377b9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/585e6a75c7424f56a3380b73967377b9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/585e6a75c7424f56a3380b73967377b9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/585e6a75c7424f56a3380b73967377b9.png","size":""}]},{"name":"Carach Angren","url":"https://www.last.fm/music/Carach+Angren","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5de444841474408abfe7becc84eb8eec.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5de444841474408abfe7becc84eb8eec.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5de444841474408abfe7becc84eb8eec.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5de444841474408abfe7becc84eb8eec.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5de444841474408abfe7becc84eb8eec.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5de444841474408abfe7becc84eb8eec.png","size":""}]},{"name":"Keep of Kalessin","url":"https://www.last.fm/music/Keep+of+Kalessin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2afa38381065455c83f1d9383f7465a9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2afa38381065455c83f1d9383f7465a9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2afa38381065455c83f1d9383f7465a9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2afa38381065455c83f1d9383f7465a9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2afa38381065455c83f1d9383f7465a9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2afa38381065455c83f1d9383f7465a9.png","size":""}]},{"name":"Thulcandra","url":"https://www.last.fm/music/Thulcandra","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/cf79b1b5015d48fb97bf57a23e92fee4.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/cf79b1b5015d48fb97bf57a23e92fee4.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/cf79b1b5015d48fb97bf57a23e92fee4.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf79b1b5015d48fb97bf57a23e92fee4.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf79b1b5015d48fb97bf57a23e92fee4.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/cf79b1b5015d48fb97bf57a23e92fee4.png","size":""}]},{"name":"Dark Funeral","url":"https://www.last.fm/music/Dark+Funeral","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/40824ad7e6aa46b2b121db4527c92abe.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/40824ad7e6aa46b2b121db4527c92abe.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/40824ad7e6aa46b2b121db4527c92abe.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40824ad7e6aa46b2b121db4527c92abe.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40824ad7e6aa46b2b121db4527c92abe.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/40824ad7e6aa46b2b121db4527c92abe.png","size":""}]}]},"tags":{"tag":[{"name":"black metal","url":"https://www.last.fm/tag/black+metal"},{"name":"melodic black metal","url":"https://www.last.fm/tag/melodic+black+metal"},{"name":"Symphonic Black Metal","url":"https://www.last.fm/tag/Symphonic+Black+Metal"},{"name":"german","url":"https://www.last.fm/tag/german"},{"name":"metal","url":"https://www.last.fm/tag/metal"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Dark+Fortress/+wiki"}},"published":"26 Mar 2006, 11:24","summary":"Over the years the German black metal outfit DARK FORTRESS have established themselves in the top ranks of the genre with intense live shows and fascinating, pitch black full-length masterpieces. Hailing from Landshut since 1994,   they have released six studio albums, a split album and a demo album.\n\nTheir first musical sign of life was the 1996 released demo \"Rebirth Of The Dark Age\" which as a matter of fact was the hour of birth of a soon to become truly dark and mesmerizing band. <a href=\"https://www.last.fm/music/Dark+Fortress\">Read more on Last.fm</a>","content":"Over the years the German black metal outfit DARK FORTRESS have established themselves in the top ranks of the genre with intense live shows and fascinating, pitch black full-length masterpieces. Hailing from Landshut since 1994,   they have released six studio albums, a split album and a demo album.\n\nTheir first musical sign of life was the 1996 released demo \"Rebirth Of The Dark Age\" which as a matter of fact was the hour of birth of a soon to become truly dark and mesmerizing band. In 1997 the original line-up consisting of band founder Asvargr (guitar), vocalist Azathoth, Njord on bass, drummer Charon established the band's first live line-up with the addition of a second guitarist named Crom and keyboardist Thamuz. Debuting live in February 1997 the young horde soon shared the stage with such underground figureheads as Lunar Aurora, Desaster and Nagelfar. Dark Fortress' first label release was the Split MCD with Barad Dür entitled \"Towards Immortaliy\" which featured two new tracks by the band and was released on Fog Of The Apocalypse Records. A third track was recorded during the same session and was used for the compilation CD \"From The Mystic Forest - Part II\". The band kept busy composing material for the first full-length, but a studio date already scheduled for 1998 did not come into being and the recording did not take place until August 2000 when Dark Fortress entered Klangschmiede Studio E and with Markus Stock (of Empyrium fame) behind the knobs completed one of the strongest melodic yet viciously aggressive black/death metal debuts ever to emerge from Germany: \"Tales From Eternal Dusk\". Taking inspiration from such renowned acts like Dissection, Unanimated and Satyricon the album received nothing but praise and offered a magnificent mixture of hauntingly beautiful guitar melodies, morbid and tormented snarling and diversified song structures… a destined to be classic release!\n\nChanges:\nLine-up changes (Charon and Crom left due to conflicting musical interests) delayed further live and studio activities, but with signing to US label Red Stream for two albums and the addition of new drummer Seraph and guitarist Santura, Dark Fortress was back with a vengeance! Recorded at famous Grieghallen Studio in Norway (Mayhem, Emperor, Immortal…) \"Profane Genocidal Creations\" was an ambitious yet delayed album due to problems during the mixing/mastering process. It was not released until February 2003 and showcased Dark Fortress further developing the epic and sinister elements in their sound honouring the classic traditions of black metal as well as daring to keep continuously progressing as composers and musicians. With a stable line-up consisting of Azathoth (vocals), Asvargr (guitar), V. Santura (guitar), Draug (bass), Paymon (keyboards) and Seraph (drums) more live shows and even festival appearances ensued seeing Dark Fortress share stage with such outstanding extreme metal acts like Behemoth, Impaled Nazarene, Pungent Stench, God Dethroned as well as countless underground acts and thus establishing the sextet further as a band that dares to evolve without betraying its roots.\n\n2000 - Present\nThe hither to musical peak of their career then hit the metal scene with the 2004 released, superbly produced \"Stab Wounds\" (Black Attakk). Crowned by a gloomy artwork by well-known artist Travis Smith (Opeth, Nevermore, Anathema, Death) \"Stab Wounds\" was overwhelmingly positive received not only by the band's underground following but also mainstream metal press, e.g. German Rock Hard praised it as \"too good, too original and heavy to be ignored. Simply the best German black metal has to offer!\". Their newest strike was a skilfully composed pitch black musical journey through man's darkest valleys of emotion. Suicidal despair and foreboding melancholy bewitched the listener as well as furious aggression and contempt in this piece of black art. A fantastic interpretation of Katatonia's \"Endtime\" - a gem not so easy for such a band to cover - was included on the limited CD Digipak, while an excellent cover version of Emperor's \"I Am The Black Wizards\" graced the double-LP version (released by Imperium Records, 2005).\n\n“Séance” was the next step to establish Dark Fortress not only as one of Germany's most hopeful black metal acts, but as one that does not have to fear the international competition. Once more ennobled by a marvellous artwork of Travis Smith, the album evolves around the conceptual idea of the direct contrast between the here and now and the hereafter, the fragility of human existence with its most striking weaknesses - ignorance, arrogance and false illusions - and the crass finality of death. The central motif lyrically of “Séance” dares to leave the stereotypical, cliché-ridden black metal paths and instead deals with the idea of paranormal beings, their individual experiences which are focused on during the course of the album. The musical side supports this conceptual idea with majestic, gloomy guitar melodies, twisted and morbid passages, ultimately grim vocals and an amount of inventiveness hard to find in the genre nowadays. “Séance” is a diversified, frighteningly extreme and highly creative effort, that should not be ignored.\n\n\"Eidolon\" was another pearl that came out after \"Séance\" and it proved to be very mature product after Azathoth was gone and Morean jumped into his place. Morean already appeared on \"Séance\" as the composer of the song \"Incide\" and the arranger of the string section used in the song \"While They Sleep\". The reason he became a member was based on his musical and vocal abilities, his personage and dedication to extreme and dark music. He is responsible for the lyrical concept of \"Eidolon\".\nThis release is a concept album based on the Greek idea of an astral double, which is similar to the German concept of a doppelgänger.\n“Eidolon\" is a concept album which in its nine chapters describes the initiation, dehumanization and unearthly rebirth of a transcending soul by mirror magic and astral projection.\n\nContrary to the  Dark Fortress album “Eidolon”, “Ylem” is not strictly a concept album; however, most songs have a common theme - invocations of the death principle from different perspectives. “Ylem\" is the term for the state of the elements before the Big Bang; in alchemy, it refers to the primordial matter from which all elements were created. The return to a state of “Ylem” automatically signifies the end of everything that exists now. There is a spark of life in every living cell, but also a seed of entropy and death. This inevitable process and its aftermath is sped up and described in different scenarios, ranging from personal (“Osiris”, “Wraith”) to magical (“Ylem”, “Redivider”), religious (“Nemesis”, “The Valley”) and cosmic angles (“Silence”, “As the World Keels Over”). The insignificance of the feeble evolutionary detour that is man is evident, for our future is clear: we will be nothing but dust and bones on a scorched, lifeless rock waiting to be devoured by the sun. This vision is also the basis of Stephen Lenfestey's artwork for the album. \n\nMusically, it is safe to say that they took the next step in their development - as Dark Fortress have always done. “We all keep growing as musicians, and we would never make the same album twice. Where “Eidolon” was a compact missile, shot to kill instantly, on “Ylem” we explore the stylistic diversity inherent in this band deeper than ever before. There is a lot of slow, very heavy stuff going on, some truly rotten clean parts, but also insane blastbeats, some orchestral darkness, and tons of killer riffs to break your neck to. It is our ambition that every song is its own world and has a strong and unmistakable identity. We exploited this ambition to the fullest here”, explains Morean (vocals). \n\nDark Fortress recorded in V. Santura's (guitars, also guitars in Triptykon and Noneuclid, and former live-guitarist for Celtic Frost ) Woodshed studio without any outside influences or distractions, which was a great pleasure after the difficult circumstances in which the last two albums came to life. “Most of the music is Santura's, but we others did contribute substantially. For guest vocals on the track \"Wraith\" we invited Mortal, a good friend of ours, and in a certain sense it became the most extreme track in the history of this band.” \n\nCurrent Lineup:\nMorean - Vocals (Noneuclid) (2007-)\nAsvargyr - Guitar (Carnage (Ger)) (1994-)\nV. Santura - Guitar (The Shroud, Noneuclid, Celtic Frost (live), Triptykon) (2001-)\nDraug (formerly T. Killer) - Bass (The Shroud) (2000-)\nPaymon - Keyboards (1998-)\nSeraph - Drums (The Shroud, Noneuclid, Obscura (Ger)}(2001-)\n\nFormer band members:\nAzathoth (Matthias Jell) - Vocals (Sindecade, Eudaimony) (1994-2007)\nNjord - Bass (1994-1997)\nZoltan (Alex Stütz) - Bass (1997-2000) (Cremation (Ger))\nCharon - Drums (1997-2001)\nCrom - Guitar, Bass (1997-2001) (Crom (Ger), Sindecade)\nThamuz - Keyboards (1997) <a href=\"https://www.last.fm/music/Dark+Fortress\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
