{"artist":{"name":"Darryl Worley","mbid":"fac3bb7e-4e51-4fb7-85e4-741d69b6d779","url":"https://www.last.fm/music/Darryl+Worley","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/8a80499e86b14b8388faa5653c2c9a0b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/8a80499e86b14b8388faa5653c2c9a0b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/8a80499e86b14b8388faa5653c2c9a0b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8a80499e86b14b8388faa5653c2c9a0b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8a80499e86b14b8388faa5653c2c9a0b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/8a80499e86b14b8388faa5653c2c9a0b.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"168162","playcount":"987273"},"similar":{"artist":[{"name":"Tracy Byrd","url":"https://www.last.fm/music/Tracy+Byrd","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f09f1dcf9cc64af687a5f486ad86cdf9.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f09f1dcf9cc64af687a5f486ad86cdf9.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f09f1dcf9cc64af687a5f486ad86cdf9.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f09f1dcf9cc64af687a5f486ad86cdf9.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f09f1dcf9cc64af687a5f486ad86cdf9.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f09f1dcf9cc64af687a5f486ad86cdf9.png","size":""}]},{"name":"Montgomery Gentry","url":"https://www.last.fm/music/Montgomery+Gentry","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b1cbc9cee4d74920b437f87628ff4e41.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b1cbc9cee4d74920b437f87628ff4e41.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b1cbc9cee4d74920b437f87628ff4e41.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b1cbc9cee4d74920b437f87628ff4e41.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b1cbc9cee4d74920b437f87628ff4e41.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b1cbc9cee4d74920b437f87628ff4e41.png","size":""}]},{"name":"Emerson Drive","url":"https://www.last.fm/music/Emerson+Drive","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/066fd5f334904ef08881f13882de2d44.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/066fd5f334904ef08881f13882de2d44.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/066fd5f334904ef08881f13882de2d44.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/066fd5f334904ef08881f13882de2d44.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/066fd5f334904ef08881f13882de2d44.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/066fd5f334904ef08881f13882de2d44.png","size":""}]},{"name":"Joe Nichols","url":"https://www.last.fm/music/Joe+Nichols","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f33cf141620c45eebd7ba0bf0a19403f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f33cf141620c45eebd7ba0bf0a19403f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f33cf141620c45eebd7ba0bf0a19403f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f33cf141620c45eebd7ba0bf0a19403f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f33cf141620c45eebd7ba0bf0a19403f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f33cf141620c45eebd7ba0bf0a19403f.png","size":""}]},{"name":"Aaron Tippin","url":"https://www.last.fm/music/Aaron+Tippin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/13a973435c4f491bbe765c5a14e9ef34.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/13a973435c4f491bbe765c5a14e9ef34.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/13a973435c4f491bbe765c5a14e9ef34.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/13a973435c4f491bbe765c5a14e9ef34.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/13a973435c4f491bbe765c5a14e9ef34.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/13a973435c4f491bbe765c5a14e9ef34.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"Darryl Worley","url":"https://www.last.fm/tag/Darryl+Worley"},{"name":"modern country","url":"https://www.last.fm/tag/modern+country"},{"name":"soft rock","url":"https://www.last.fm/tag/soft+rock"},{"name":"pop","url":"https://www.last.fm/tag/pop"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Darryl+Worley/+wiki"}},"published":"30 Jun 2007, 03:42","summary":"Through five albums and seventeen chart hits, Darryl Worley has produced one of the most impressive and wide-ranging catalogs in contemporary music.  He has for ten years been a mainstay of modern country, a distinctive singer and first-rate songwriter whose music has chronicled life, love and the world situation with equal facility.\n \nHe has topped the charts with singles including \"I Miss My Friend,\" \"Awful, Beautiful Life\" and \"Have You Forgotten?\" which accomplished the feat for one, two and an incredible seven weeks respectively. <a href=\"https://www.last.fm/music/Darryl+Worley\">Read more on Last.fm</a>","content":"Through five albums and seventeen chart hits, Darryl Worley has produced one of the most impressive and wide-ranging catalogs in contemporary music.  He has for ten years been a mainstay of modern country, a distinctive singer and first-rate songwriter whose music has chronicled life, love and the world situation with equal facility.\n \nHe has topped the charts with singles including \"I Miss My Friend,\" \"Awful, Beautiful Life\" and \"Have You Forgotten?\" which accomplished the feat for one, two and an incredible seven weeks respectively. He hit the Top 20 with the first three singles from his impressive major-label debut, Hard Rain Don't Last - \"When You Need My Love,\" \"A Good Day to Run\" and \"Second Wind\" and followed with smashes like \"If Something Should Happen,\" \"I Just Came Back From A War\" and the iconic \"Tennessee River Run.\"\n \nAlong the way, he has sold nearly two million albums, earned nominations for five major ACM and CMA awards, including \"Song of the Year\" and \"Single of the Year,\" and has written songs for other major artists, including George Jones.\n \nNow, with the release of his sixth album, Sounds Like Life, Worley reasserts himself as one of country’s true creative forces. Sounds like Life showcases Worley as a songwriter of depth and passion and a singer whose versatility and believability have grown stronger through the years. The project is a microcosm of his life and career, with the sometimes rocky, sometimes triumphant road he’s traveled infusing every track, and it bears both the sense of detail and the universality we’ve come to expect from the 6’6“ hit-maker.\n \nThe album is at once a reinvention and a return to the people and approach that marked Worley's dramatic entry into the national spotlight a decade ago. Sounds Like Life is a master storyteller’s take on modern life, a project that runs the gamut from show business itself (\"Honkytonk Life\") to hard-won wisdom (\"You Never Know,\" \"Nothing But Money\"). It is a journey through love (\"Best Of Both Worlds,\" \"Everyday Love,\" \"Tequila On Ice\") and loss (\"Slow Dancin’ With A Memory\"), and from sensuality (\"Messed Up In Memphis\") to philosophy (\"Doin’ What’s Right\").\n \nWorley jumped quickly back into the Top 20 with the single \"Sounds Like Life To Me,\" a song as accessible as it is profound. Another of the album’s real high points is \"Don't Show Up (If You Can't Get Down),\" a groove song that attracted an all-star cast of participants including Jamey Johnson, Bill Anderson, Mel Tillis, John Anderson, Steve Harwell of Smashmouth, John Cowan of the New Grass Revival and Ira Dean.\n \nThe album is at once a reinvention and a return to the people and approach that marked Worley’s dramatic entry into the national spotlight a decade ago.\n \n\"I consciously made a decision I wanted this record to have the same kind of substance as my very first record,\" he says. \"That album was pretty straightforward country and it had some really great songwriters’ songs on there well crafted, clever, but with substance. I also wanted something uplifting and fun, something that sounded different and had great grooves.\"\n \nHaving left behind two record deals after a corporate restructuring and a label demise, he was free to, as he says, \"wipe the slate completely clean.\" He told his new management team he wanted to use his own money to record a project with his road band and with two long-time friends Jim \"Moose\" Brown and Kevin \"Swine\" Grantt producing.\n \n\"The guys play these songs every night,\" he says, \"so it only made sense to go in the studio and cut the record just like we play on stage. And it worked. This is a group of people who have hung together for 15 years and there are no duds in there. They’re all very real people with one thing in mind make the best possible music, whether it’s songwriting, producing, or recording as an artist. I felt like we’d capture some cool stuff and that’s what happened. It meant a lot to us as friends to be able to do this, too.\"\n \nOutside the industry’s parameters or politics, he and that close cohort of musicians put together an album that reflects everything Worley does well.\n \n\"We didn’t set out to make the record that would define me as an artist,\" he adds. \"I said, ’Let’s just be more concerned about the music. We don't have anybody breathing down our neck. Let’s go in there and do what we always said we wanted do and just have fun, get all the guys together and when the moment’s right, let’s cut one and keep it.’\"\n \nPhoto of Darryl Worley Once the album was cut, Worley began meeting with labels and was about to sign a deal when James Stroud, who had signed him to his first deal a decade earlier, called and said he was launching a new label, Stroudavarious Records, with businessman/entrepreneur Ronnie Gilley.\n \n\"Ronnie and James and I had been doing business together for eight or nine years,\" says Worley. \"James taught me a lot of what I know about the music business. He and I had a lot of success together and a lot of fun together, and we had gotten to know each other inside and out.\n \n\"I wanted a real partnership,\" he says. \"That’s what we’ve got, and that’s why it’s working.\"\n \nSounds Like Life launches the latest chapter in one of modern country music’s most amazing odysseys. It began in Hardin County, Tennessee, part of a three-state region where the elements of life included hard work, economic hardship, deep religious conviction and bootleg liquor. It paid to be tough and smart, and Worley was both.\n \nHe was also musical his grandfather played old country and bluegrass on the banjo and his mother sang in church. Worley was drawn in both directions, balancing the hellion and the seeker as he grew up. Tall and athletic, Worley might have earned an athletic scholarship to college, but he broke his back playing basketball and lost that opportunity. Still, he earned a degree in biology with a minor in organic chemistry, playing music in honky-tonks and raising hell all the while.\n \nHe continued playing as he worked in the chemical business and taught school for a year, torn between the pressure he felt to establish a secure career and his deep-seated need to pursue music. Finally, his preacher father helped him sort it out.\n \n\"One day he said, ’If you’re still thinking about that music thing you better do it now’,\" says Worley, \"’because if you don’t, you’ll be trapped by the obligation of the debt and the responsibilities that come with life.’ That was all I needed to hear.\"\n \nA gifted and hard-working songwriter, he signed a deal with Fame Publishing in Muscle Shoals, Alabama, to write songs for $150 a week. Years of playing bars and hard living made their way into his music, and artists like George Jones cut his early work. He was signed to Nashville’s EMI Publishing and in 1994 he made his way to Nashville. After half a decade of sometimes frustrating development deals, in 1999 he earned the label deal that moved his career into high gear.\n \nWorley has not wavered in his support for those who put their lives on the line for democracy It is telling that Worley was quick to turn his celebrity to good purpose. In 2002, he traveled to Afghanistan, Kuwait and Uzbekistan to entertain troops, and the experience was transforming. He wrote \"Have You Forgotten?\" and began a series of visits here and overseas, including to Iraq, to support those who wear their country’s uniform.\n \nHe calls those trips \"the best work I’ve done since I’ve been in this business. I’ve never done it for accolades or for publicity. I do it because I want to do it.\"\n \nStill, accolades have come. He has received the VFW’s Americanism Award and the USO’s Merit Award, and the Tennessee House of Representatives cited him for his contributions to country music.\n \nHis experiences overseas helped spur him to launch major charitable efforts back home.\n \n\"Coming off some of those trips really made me want to dig in and do more for my home area  Savannah, Hardin County, that whole Tri-state area,\" he says. \"My parents said, ’You need to remember where you come from,’ and the Darryl Worley Foundation became the way to do that.\"\n \nWhat began as a way to provide assistance to people who might not be able to afford insurance who faced catastrophic losses has expanded over time. His Tennessee River Run, a weeklong festival capped by several major concerts, has raised money for all kinds of projects, including medical facilities.\n \n\"I’ve seen friends and family affected by cancer, and at one point I said, ’Can we do something here in the county to help some of them?’ We built this small outpatient chemotherapy wing on the Hardin County Medical Center and we were immediately overwhelmed by the people who just poured in there. They were literally in the hallways getting chemotherapy. Now we’re in the process of planning a cancer treatment center.\"\n \nPhoto of Darryl Worley on a motorcycle For a man whose career single-mindedness and whose wild and restless streak once wrought havoc in his personal life, he has found more peace than ever since his marriage to his wife Kimberly and the birth of his daughter Savannah.\n \n\"My wife and my child have put everything in perspective,\" he says. \"I didn’t think it would ever happen to me. For once in my life I feel like I've got my priorities in order.\"\n \nThat sense of perspective has only strengthened his music. His happiness has found its way onto Sounds Like Life, an album whose title is a summation of the reason for his popularity.\n \n\"The songs I’d had really big success with are songs that are just a big chunk of reality or a day in the life of somebody,\" he says. \"That's what people expect from Darryl Worley. ’Have You Forgotten?’ ’Awful, Beautiful Life,’ ’If Something Should Happen’ those songs are something somebody went through. It’s real. It’s not contrived, not made up, and there’s a difference. You hear songs every day where you say, ’I love that, but it's a little bit out there. It’s probably not a real thing.’ But this album is about reality. There’s some stuff about the family. There’s some stuff about the new baby. It’s got both really cool grooves and real life.\"\n \nSuch songs have made Darryl Worley a vital part of the fabric of the modern musical landscape for a decade, and Sounds Like Life is convincing proof he will carry that position forward.  <a href=\"https://www.last.fm/music/Darryl+Worley\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
