{"artist":{"name":"David Johansen","mbid":"3cb2ba2a-81f9-49b6-8e9d-71dcf5fb56cc","url":"https://www.last.fm/music/David+Johansen","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/104a75a8351043238f2c7a9af242346f.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/104a75a8351043238f2c7a9af242346f.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/104a75a8351043238f2c7a9af242346f.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/104a75a8351043238f2c7a9af242346f.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/104a75a8351043238f2c7a9af242346f.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/104a75a8351043238f2c7a9af242346f.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"25443","playcount":"116744"},"similar":{"artist":[{"name":"Mott the Hoople","url":"https://www.last.fm/music/Mott+the+Hoople","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a09e81be48724b789bb495a90ef49970.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a09e81be48724b789bb495a90ef49970.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a09e81be48724b789bb495a90ef49970.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a09e81be48724b789bb495a90ef49970.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a09e81be48724b789bb495a90ef49970.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a09e81be48724b789bb495a90ef49970.png","size":""}]},{"name":"New York Dolls","url":"https://www.last.fm/music/New+York+Dolls","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/068ce4b47d9848e594fcf8597421c89d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/068ce4b47d9848e594fcf8597421c89d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/068ce4b47d9848e594fcf8597421c89d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/068ce4b47d9848e594fcf8597421c89d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/068ce4b47d9848e594fcf8597421c89d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/068ce4b47d9848e594fcf8597421c89d.png","size":""}]},{"name":"Ty Taylor","url":"https://www.last.fm/music/Ty+Taylor","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a8c865c9d50e4d1a9ce0deea9c944874.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a8c865c9d50e4d1a9ce0deea9c944874.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a8c865c9d50e4d1a9ce0deea9c944874.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a8c865c9d50e4d1a9ce0deea9c944874.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a8c865c9d50e4d1a9ce0deea9c944874.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a8c865c9d50e4d1a9ce0deea9c944874.png","size":""}]},{"name":"Soda Machine","url":"https://www.last.fm/music/Soda+Machine","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Slade","url":"https://www.last.fm/music/Slade","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2975d4c658b343499cb9c98bf15e8105.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2975d4c658b343499cb9c98bf15e8105.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2975d4c658b343499cb9c98bf15e8105.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2975d4c658b343499cb9c98bf15e8105.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2975d4c658b343499cb9c98bf15e8105.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2975d4c658b343499cb9c98bf15e8105.png","size":""}]}]},"tags":{"tag":[{"name":"rock","url":"https://www.last.fm/tag/rock"},{"name":"glam rock","url":"https://www.last.fm/tag/glam+rock"},{"name":"80s","url":"https://www.last.fm/tag/80s"},{"name":"classic rock","url":"https://www.last.fm/tag/classic+rock"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/David+Johansen/+wiki"}},"published":"28 May 2007, 16:49","summary":"David Roger Johansen (born January 9, 1950) is an American rock, protopunk, blues, and pop singer, as well as a songwriter and actor. He is best known as a member of the seminal protopunk band New York Dolls.  \n\n Early lifeJohansen was born in the New York City borough of Staten Island, New York to a librarian mother and an insurance sales representative father. Johansen's family was Catholic. His mother was Irish American and his father was Norwegian American. <a href=\"https://www.last.fm/music/David+Johansen\">Read more on Last.fm</a>","content":"David Roger Johansen (born January 9, 1950) is an American rock, protopunk, blues, and pop singer, as well as a songwriter and actor. He is best known as a member of the seminal protopunk band New York Dolls.  \n\n Early lifeJohansen was born in the New York City borough of Staten Island, New York to a librarian mother and an insurance sales representative father. Johansen's family was Catholic. His mother was Irish American and his father was Norwegian American.\n\n[edit] CareerJohansen began his career in the late 1960s as a lead singer in the local Staten Island band the Vagabond Missionaries and later in the early 1970s as the singer/songwriter in the protopunk band the New York Dolls. The Dolls only released two albums, their self-titled debut (1973), and Too Much Too Soon (1974). The bulk of the material was written by Johansen and guitarist Johnny Thunders. The Dolls were critics' darlings with a cult following, but their failure to break commercially may be due to their being ahead of their time in that their sound and image both anticipated and influenced aspects of the later 1970s' punk rock movement.\n\nDrugs played a role in the departure of Thunders and drummer Jerry Nolan from the band in 1975. Johansen and Sylvain Sylvain, along with Peter Jordan, Chris Robison and Tony Machine, continued on briefly, as their already booked gigs as the New York Dolls. Later that year, Johansen embarked on a solo career. His first two albums, David Johansen and In Style, featured several enduring originals. His fellow ex-Doll Sylvain Sylvain frequently performed with him, and his band covered many Dolls tunes in concert; his live albums Live It Up and The David Johansen Group Live document Johansen's reputation as an exceptional concert performer. The studio releases Here Comes the Night (which includes a signature number, \"Heart of Gold\") and Sweet Revenge again showcased his strengths as a writer of new material and featured a guest appearance by jazz saxophone player Big Jay McNeely. A number of the songs on \"Here Comes the Night\" were co-written with South African musician Blondie Chaplin.\n\nIn the late 1980s, Johansen achieved a commercial breakthrough under the pseudonym Buster Poindexter, accompanied by The Uptown Horns, performing a mixture of jazz, lounge, calypso, and novelty songs, and appearing as part of the house band on the television program Saturday Night Live. As Poindexter he scored his first hit song, \"Hot Hot Hot,\" which in an interview on National Public Radio's Fresh Air he called \"the bane of my existence,\" owing to its pervasive popularity. \"Hot Hot Hot\" was initially written and recorded by Montserratian Soca artist Arrow. As Poindexter, Johansen often appeared with his band The Banshees of Blue. The initial Poindexter releases combined an eclectic selection of cover versions with Johansen's own compositions. Johansen/Poindexter went on to issue Buster Poindexter's Happy Hour, a CD of songs thematically linked by their subject matter: alcohol. Probably his most obviously jazz-influenced release to date, it also leaned towards '50s rock and roll. Following that came Buster Poindexter's Spanish Rocket Ship, a Latin album.\n\nJohansen acted in several films during the 1980s and 1990s, and had a brief role on the HBO drama Oz. He also appeared in the television series The Adventures of Pete & Pete in the episode \"On Golden Pete,\" in which he played a park ranger. Among his more prominent roles are that of the wisecracking ghost of Christmas past in Scrooged as well as the part of 'Looney' in the movie, Let It Ride, playing opposite Richard Dreyfuss. He was also in the movie based on the old television series Car 54, Where Are You?. He can also be seen in the Jim White documentary film Searching for the Wrong Eyed Jesus in which he does a version of \"Last Kind Words\" (by Geeshie Wiley) while in a motel room.\n\nJohansen then turned to the rendition of country blues with his back-up group, The Harry Smiths. The group was named in tribute to Harry Everett Smith, who compiled the Anthology of American Folk Music; \"James Alley Blues\" and some of the other songs covered on their eponymously titled debut come from the Anthology. Johansen's second album with the Harry Smiths is titled Shaker. He also had a supporting role with Mick Jagger and Emilio Estevez in the movie Freejack and a supporting role as Looney in the comedy Let It Ride.\n\nJohansen is currently touring with a re-formed version of the New York Dolls. Owing to the success of the tour, in 2006 the Dolls released One Day It Will Please Us to Remember Even This, their first album in nearly thirty years. It was critic Robert Christgau's choice for album of the year.[3] Johansen hosts a weekly show on Sirius Satellite Radio while continuing to write and perform.\n\nIn October 2007, Johansen participated in “The Staten Island Composers Project,” featuring work by three musicians who call the island home: Mr. Johansen; Vernon Reid, founder of the ’80s rock-metal pioneers Living Colour; and Galt MacDermot, best known as the composer of the musical Hair. The Council on the Arts and Humanities for Staten Island commissioned the program and asked each artist to write 20 minutes of music conveying something of his connection to the island often referred to as New York City’s forgotten borough. Mr. Johansen’s opus, a cinematic and unabashedly romantic Adagio scored mostly for strings, is called “Mara Dreams the Moon Gate of Uncommon Beauty.” Inspired by The Moon Gate of Uncommon Beauty, a round portal between two rockscapes in the Chinese Scholar’s Garden at the Staten Island Botanical Gardens. In September 2009, he appeared on Anthony Bourdain: No Reservations, the Travel Channel TV program, in which he toured Staten Island with the program's host.\n\nIn addition to his own albums, Johansen contributed songs to the soundtracks of the films Times Square and The Aviator (\"Flowers of the City\" and \"Ain't Cha Glad\" respectively) and guests on About Them Shoes, a CD by veteran blues man Hubert Sumlin. Another non-album track of his, \"Johnsonius\", appears on the 1984 compilation A Diamond Hidden in the Mouth of a Corpse and \"The Rope (The Let Go Song)\", a track recorded during the sessions for his eponymous first album but not included on that, surfaced on the B-side of the single, \"Funky But Chic\".\n\nAn artist noted for his musical unpredictability and versatility, Johansen has been a consistent blues enthusiast since the earliest days of the Dolls, with covers of songs by Bo Diddley and Sonny Boy Williamson having been among their earliest numbers. The 2006 Dolls CD Private World : The Complete Early Studio Demos 1972/3 featured the Dolls performing songs by Otis Redding, Gary US Bonds, Chuck Berry, The Shangri-Las, and Muddy Waters in addition to versions of songs from their two Mercury albums. Also featured on the CD was a previously unreleased Dolls number, \"Endless Party\".\n\nDuring a career that has seen many changes, Johansen nevertheless has worked consistently with certain musicians, including Sylvain Sylvain, drummer Tony Machine (a member of one of the later Dolls line-ups and a fixture in many David Johansen groups and throughout the Buster Poindexter period) and Brian Koonin, guitarist and banjo player with Buster Poindexter and The Harry Smiths as well as keyboard player with the New York Dolls for the reunion gig and the One Day It Will Please Us To Remember Even This CD & tour.\n\n <a href=\"https://www.last.fm/music/David+Johansen\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
