{"artist":{"name":"David Lynch","mbid":"752d58e6-d33f-4dcd-b40c-37acc14242f2","url":"https://www.last.fm/music/David+Lynch","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2955c2b81e844450b88c1a0e69f675ef.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2955c2b81e844450b88c1a0e69f675ef.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2955c2b81e844450b88c1a0e69f675ef.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2955c2b81e844450b88c1a0e69f675ef.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2955c2b81e844450b88c1a0e69f675ef.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2955c2b81e844450b88c1a0e69f675ef.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"155111","playcount":"2989989"},"similar":{"artist":[{"name":"David Lynch and John Neff","url":"https://www.last.fm/music/David+Lynch+and+John+Neff","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d88573b1795d48979e0aa9e3cebd9e64.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d88573b1795d48979e0aa9e3cebd9e64.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d88573b1795d48979e0aa9e3cebd9e64.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d88573b1795d48979e0aa9e3cebd9e64.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d88573b1795d48979e0aa9e3cebd9e64.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d88573b1795d48979e0aa9e3cebd9e64.png","size":""}]},{"name":"Angelo Badalamenti and David Lynch","url":"https://www.last.fm/music/Angelo+Badalamenti+and+David+Lynch","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9f10f417f85c4487bad039b576bbd7b2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9f10f417f85c4487bad039b576bbd7b2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9f10f417f85c4487bad039b576bbd7b2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9f10f417f85c4487bad039b576bbd7b2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9f10f417f85c4487bad039b576bbd7b2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9f10f417f85c4487bad039b576bbd7b2.png","size":""}]},{"name":"Johnny Jewel","url":"https://www.last.fm/music/Johnny+Jewel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/52e6c59ef0b7ad2034ccbc36af749544.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/52e6c59ef0b7ad2034ccbc36af749544.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/52e6c59ef0b7ad2034ccbc36af749544.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/52e6c59ef0b7ad2034ccbc36af749544.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/52e6c59ef0b7ad2034ccbc36af749544.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/52e6c59ef0b7ad2034ccbc36af749544.png","size":""}]},{"name":"Dale Cooper Quartet & The Dictaphones","url":"https://www.last.fm/music/Dale+Cooper+Quartet+&+The+Dictaphones","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ace59507eeab45a2c530788c8f7a62a7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ace59507eeab45a2c530788c8f7a62a7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ace59507eeab45a2c530788c8f7a62a7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ace59507eeab45a2c530788c8f7a62a7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ace59507eeab45a2c530788c8f7a62a7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ace59507eeab45a2c530788c8f7a62a7.png","size":""}]},{"name":"Coil","url":"https://www.last.fm/music/Coil","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5b07509f4f1445dda4c753bfefe161f2.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5b07509f4f1445dda4c753bfefe161f2.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5b07509f4f1445dda4c753bfefe161f2.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5b07509f4f1445dda4c753bfefe161f2.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5b07509f4f1445dda4c753bfefe161f2.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5b07509f4f1445dda4c753bfefe161f2.png","size":""}]}]},"tags":{"tag":[{"name":"experimental","url":"https://www.last.fm/tag/experimental"},{"name":"dark ambient","url":"https://www.last.fm/tag/dark+ambient"},{"name":"Avant-Garde","url":"https://www.last.fm/tag/Avant-Garde"},{"name":"ambient","url":"https://www.last.fm/tag/ambient"},{"name":"Soundtrack","url":"https://www.last.fm/tag/Soundtrack"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/David+Lynch/+wiki"}},"published":"19 Feb 2006, 16:18","summary":"There is more than one artist by this name:\n1) A film director, writer and musician born in Missoula, MT, United States.\n2) An acoustic blues guitarist and songwriter from San Luis Obispo, CA, United States.\n3) A Saxophonist born in Los Angeles, CA, United States, currently living in Greece.\n4) A jazz musician born in Signal Hill, CA, United States.\n\n1) David Lynch (born 20 January 1946 in Missoula, Montana, United States) is an American filmmaker, television director, visual artist, comic book artist, musician and occasional actor. <a href=\"https://www.last.fm/music/David+Lynch\">Read more on Last.fm</a>","content":"There is more than one artist by this name:\n1) A film director, writer and musician born in Missoula, MT, United States.\n2) An acoustic blues guitarist and songwriter from San Luis Obispo, CA, United States.\n3) A Saxophonist born in Los Angeles, CA, United States, currently living in Greece.\n4) A jazz musician born in Signal Hill, CA, United States.\n\n1) David Lynch (born 20 January 1946 in Missoula, Montana, United States) is an American filmmaker, television director, visual artist, comic book artist, musician and occasional actor. Known for his surrealist films, he has developed his own unique cinematic style, which has been dubbed \"Lynchian\", and which is characterized by its dream imagery, and meticulous sound design. The surreal, and in many cases violent, elements to his films have earned them the reputation that they \"disturb, offend or mystify\" their audiences.\nBorn to a middle class family in Missoula, Montana, Lynch spent his childhood traveling around the United States, before going on to study painting at the Pennsylvania Academy of Fine Arts in Philadelphia, where he first made the transition to producing short films. Deciding to devote himself more fully to this medium, he moved to Los Angeles, where he produced his first motion picture, the surrealist horror Eraserhead (1977). After Eraserhead became a cult classic on the midnight movie circuit, Lynch was employed to direct The Elephant Man (1980), from which he gained mainstream success. Then being employed by the De Laurentiis Entertainment Group, he proceeded to make two films: the science-fiction epic Dune (1984), which proved to be a critical and commercial failure, and then a neo-noir crime film, Blue Velvet (1986), which was highly critically acclaimed.\nProceeding to create his own television series with Mark Frost, the highly popular murder mystery Twin Peaks (1990–1992), he also created a cinematic prequel, Fire Walk With Me (1992); a road movie, Wild at Heart (1990) and a family film, The Straight Story (1999), in the same period. Turning further towards surrealist filmmaking, three of his following films worked on \"dream logic\" non-linear narrative structures, Lost Highway (1997), Mulholland Drive (2001) and Inland Empire (2006). Meanwhile, Lynch proceeded to embrace the internet as a medium, producing several web-based shows, such as the animation Dumbland (2002) and the surreal sitcom Rabbits (2002).\nIn the course of his career, Lynch has received three Academy Award nominations for Best Director, and a nomination for best screenplay. Lynch has twice won France's César Award for Best Foreign Film, as well as the Palme d'Or at the Cannes Film Festival and a Golden Lion award for lifetime achievement at the Venice Film Festival. The French government awarded him the Legion of Honor, the country's top civilian honor, as a Chevalier in 2002 and then an Officier in 2007, while that same year, The Guardian described Lynch as \"the most important director of this era\". Allmovie called him \"the Renaissance man of modern American filmmaking\", while the success of his films have led to him being labelled \"the first popular Surrealist.\"\nAs a musician, Lynch has released several recordings, including the collaboration album\"BlueBob\" (2001, with John Neff. His debut solo album, the electropop record \"Crazy Clown Time\" was issued on Play It Again Sam in 2011.\n\n2) A native of Southern California, David Lynch grew up near the beach immersed in the surf culture. \nHe majored in Math at the University of California Santa Barbara and spent a lot of his time in \"The Pit\" (the audio section of the film department), multi-tracking original songs on quarter inch tape. This led him to a successful career in post-production sound, for which he has already earned an Emmy and 2 Golden Reel awards.  He currently works for Warner Bros.\nBefore settling down with his wife and kids in San Luis Obispo, California, Lynch spent six weeks in Austin, Texas and six weeks in Nashville, Tennessee, while David went after the self imposed goal of 100 live shows.\nThe new album “DOZEN” by David Lynch and Friends features the fantastic Dobro work of Frank Duncan, and the outstanding Mandolin stylings of Mark Travis. Lighter and more accessible than “Good Wood” (his inspired release of 2001) or “David Lynch” (his self-titled release of 1996), the extra instrumentation gives the brilliant song writing some “get up and go.”\n\n3) David Lynch (born in 1961 in Los Angeles, California, United States) is one of the most respected and accomplished musicians on the contemporary Greek music scene today. Though obviously not of Greek descent, the unique musical language he has developed by submerging his own expressive idiom into that of the Greek musical experience has earned him the reputation as being a musician of extraordinary sensitivity and versatility.\nOf Irish and Eastern European ancestry, David was born and raised in Los Angeles. He studied jazz music with James Moody, Charles Lloyd, Ralph Bowen and John Coltrane associate, Garvin Buschell. After receiving various music awards and scholarships, David continued his studies at Dick Grove Music Workshops and began his professional career playing in numerous clubs, studios and with a variety of big bands.\nAt age 21, his need and desire to broaden his musical and personal horizons brought him to Europe. After an extended period of traveling he settled in Athens, where the environment seemed right for introspection and exploration.\nDavid's insatiable quest for new and creative forms of expression quickly brought him in contact with some of Greece's most outstanding musicians, writers and singers from all parts of the country and from different traditions. David, since, has played on hundreds of albums, numerous movie soundtracks, and has co-founded several bands including The Missing Lynch, Faros, Trio, The David Lynch Project, Iskra, and Human Touch (along with Stavros Lantsias and Yiotis Kiourtsoglou have internationally released recordings).\nHe has also written music for film, theatre, radio, television and dance. He's played with Arturo Sandoval, Trilok Gurtu, Arild Anderson, Milcho Leviev, Marcus Stockhausen, The Temptations, Barry White and others. Of major importance in David's musical journey was his collaboration with the late traditional clarinettist, Vassilis Soukas. This experience, and its lasting influence, was the crossroad leading David deeper into his own spirit of \"Greekness\" and his internal \"world music\".\nAs a solo artist, David has released three CDs, \"Lit'l Song\", \"Music With a View\", and \"Wandering Home\". The latter featured renowned Irish uilleann piper Davy Spillane and was recorded live at the Athens Concert Hall.\nIn 2003, along with cellist/multi-instrumentalist Yiorgos Kaloudis, David co-founded the duet \"Faros\", an innovative duo which creates on-the-spot loops and spontaneous in-depth arrangements. One of David's latest projects of pride was the re-working of the music of the late-great innovator, Manos Hatzidakis. The recording is expected to be released in 2007 with Hatzidakis protege Elly Paspala and guest Blaine Reinenger (Raining Pleasure). David's most recent endeavor is the band \"The Missing Lynch\" where he appears as singer/songwriter.\nOfficial site: http://www.davidlynchmusic.net\n\n4) David Lynch is a jazz musician born in Signal Hill, California, United States. He released \"A New View Through the Window Vol 1\" (2002), \"A New View Through the Window Vol 2\" (2003) and \"Jazz Lobster\" (2004). <a href=\"https://www.last.fm/music/David+Lynch\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
