{"artist":{"name":"David Nail","mbid":"a73662ac-647d-4ca4-b26d-162a0d5c5a8e","url":"https://www.last.fm/music/David+Nail","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2d18bbc4bc45a247612ddbb846005809.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2d18bbc4bc45a247612ddbb846005809.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2d18bbc4bc45a247612ddbb846005809.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2d18bbc4bc45a247612ddbb846005809.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2d18bbc4bc45a247612ddbb846005809.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2d18bbc4bc45a247612ddbb846005809.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"218272","playcount":"1417633"},"similar":{"artist":[{"name":"Jake Owen","url":"https://www.last.fm/music/Jake+Owen","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/dd84346edf3deaa0b5e1dd488bb58629.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/dd84346edf3deaa0b5e1dd488bb58629.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/dd84346edf3deaa0b5e1dd488bb58629.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dd84346edf3deaa0b5e1dd488bb58629.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dd84346edf3deaa0b5e1dd488bb58629.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/dd84346edf3deaa0b5e1dd488bb58629.png","size":""}]},{"name":"Cole Swindell","url":"https://www.last.fm/music/Cole+Swindell","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/81bfa78d16a849993cdbf4aa95a2feae.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/81bfa78d16a849993cdbf4aa95a2feae.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/81bfa78d16a849993cdbf4aa95a2feae.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/81bfa78d16a849993cdbf4aa95a2feae.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/81bfa78d16a849993cdbf4aa95a2feae.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/81bfa78d16a849993cdbf4aa95a2feae.png","size":""}]},{"name":"Dierks Bentley","url":"https://www.last.fm/music/Dierks+Bentley","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/f1a5069cd6da40668e421c1978fae1e5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/f1a5069cd6da40668e421c1978fae1e5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/f1a5069cd6da40668e421c1978fae1e5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f1a5069cd6da40668e421c1978fae1e5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f1a5069cd6da40668e421c1978fae1e5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/f1a5069cd6da40668e421c1978fae1e5.png","size":""}]},{"name":"Chris Young","url":"https://www.last.fm/music/Chris+Young","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/11c519ca1bd24cabb570b8237e094a93.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/11c519ca1bd24cabb570b8237e094a93.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/11c519ca1bd24cabb570b8237e094a93.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11c519ca1bd24cabb570b8237e094a93.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11c519ca1bd24cabb570b8237e094a93.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/11c519ca1bd24cabb570b8237e094a93.png","size":""}]},{"name":"Randy Houser","url":"https://www.last.fm/music/Randy+Houser","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/86676a23ae2646c9b0f90bf7ae3176ce.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/86676a23ae2646c9b0f90bf7ae3176ce.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/86676a23ae2646c9b0f90bf7ae3176ce.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/86676a23ae2646c9b0f90bf7ae3176ce.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/86676a23ae2646c9b0f90bf7ae3176ce.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/86676a23ae2646c9b0f90bf7ae3176ce.png","size":""}]}]},"tags":{"tag":[{"name":"country","url":"https://www.last.fm/tag/country"},{"name":"male vocalists","url":"https://www.last.fm/tag/male+vocalists"},{"name":"contemporary country","url":"https://www.last.fm/tag/contemporary+country"},{"name":"Alt-country","url":"https://www.last.fm/tag/Alt-country"},{"name":"new country","url":"https://www.last.fm/tag/new+country"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/David+Nail/+wiki"}},"published":"17 Sep 2009, 17:35","summary":"Growing up in a small southeastern Missouri town, David Nail might’ve chosen to follow any of the dreams that drifted by like the riverboats on the mighty Mississippi: but in the end, it was music that called his name. “I was definitely more into sports growing up,” says the Midwest native, “I think I was expected to play in college, but as I grew older I became more interested in music. After my senior year, I had a few small college offers to play baseball. <a href=\"https://www.last.fm/music/David+Nail\">Read more on Last.fm</a>","content":"Growing up in a small southeastern Missouri town, David Nail might’ve chosen to follow any of the dreams that drifted by like the riverboats on the mighty Mississippi: but in the end, it was music that called his name. “I was definitely more into sports growing up,” says the Midwest native, “I think I was expected to play in college, but as I grew older I became more interested in music. After my senior year, I had a few small college offers to play baseball. My coach came to me and said ‘David, you need to decide where you’re going to school,’ and out of the blue I just said, ‘Do you know anybody in Nashville?’”\n\nFor singer-songwriter Nail, it was a history-making moment -- small town boy decides to chase a big city dream -- and a theme that has informed his music ever since. On his first album from MCA Nashville, he neatly bridges the divide, laying claim to his hometown roots while keeping a firm grip on the future, and all the deeply emotional territory in between.\n\n“I feel like regardless of where you grew up, city, small town, east coast, west coast or whatever, there’s something in this music that you can relate to,” he says. “They might not all be exactly the same, but everyone has those moments; the first time you left home, falling in love, losing love. That’s what moves me, what I can dig into.”\n\nNail, son of a former high school band director, cut his musical teeth on a record collection that included Stevie Wonder, Elton John and the Beatles. “Elton John was one of the main reasons I started singing, and is still a tremendous influence,” he says. “I think he and the Beatles are probably two of the greatest melody makers of all time.” Then he moved on to country: “I ‘discovered’ country music in the early 90’s along with everyone else my age,” he says, “but I guess I kind of got more obsessive than everybody else. I found myself looking back as far as the late ‘60s and early ‘70s, exposing myself to some of the biggest stars of that era. It was then that I fell in love with Glen Campbell, who is still one of my all-time favorites.”\n\nDrawn to Music City after high school, Nail took that first step on his long and winding road, following the music. “I had been to Nashville as a small child but I had no memories of what it was like and obviously had no idea what the music business was like,” he says. “I had no idea what I was supposed to be doing.” Overwhelmed, he ended up moving back to Missouri in less than a year.\n\nReturning to Nashville two years later, Nail became frustrated once again in early 2005 with the lack of movement with his music career. David spent the next two summers helping an old college buddy coach the Twitty City Knights, a select group of some of Nashville’s best baseball talent. “I did it just to get away from the reality of what my career had become at that time, and it was being around those kids that recharged my batteries. It reminded me how free and easy life is at 17 and 18 years old and how truly blessed I’d been, both growing up, and now, being able to chase my dream. I will forever look back on that time and those kids for getting me back on track.” Shortly thereafter, mutual friend Brian Wright, who’d recently become V.P., A&R, for both the MCA and Mercury Nashville labels, introduced Nail to Frank Liddell, who 10 years earlier had produced one of Nail’s all-time favorite records, Chris Knight’s self-titled Decca debut.\n\nThrough the ups and downs of a life in the music business, Nail was persistent – and his dream became a realization with I’m About To Come Alive, a collection of songs that captures the highs and lows and the hometown flavor of his own experiences. “I wanted to take something from the people who’ve inspired me,” he says, “but also put myself in there, and just make something I could be proud of. It’s definitely a moody record, there’s definitely going to be some heartbreak in there, definitely going to be some dark times. But there’s music you listen to when you’re feeling good, and music you listen to when you’re down and out, and I think this is a record that satisfies both needs.”\n\nFrom the second he started recording, Nail was determined to bridge the gap between traditional country and the soulful styling’s of a Lionel Ritchie and Ray Charles. “I’ve got to have a piano player with a lot of fire, a little more recklessness!” he says. Liddell (Miranda Lambert) offered up legendary player Chuck Leavell, who brought his inspired piano into the mix with Nail’s smooth, yet soulful vocals to create magic on tracks like “Mississippi.” “It’s a very reflective ballad about a guy from a small town who’s in the city,” Nail says. “Very moody and Ray Charles-esque. Chuck went in there and started playing the intro and suddenly I felt as if I was back in those early days of recording. His playing sent me to another level of singing.”\n\n“Turning Home” had that same soulful emotion and drew Nail’s attention as a demo. “When I first heard it, it was a lot of what I was feeling at the time. I just kept listening to it over and over. I felt like I had always been searching for a song I could really sing, put some emotion, pain and hurt into, and then here was this song,” he said. The result is a perfect match between singer and song, with that same church-meets-honky-tonk piano on the side, and vocals reminiscent of another one of Nail’s big influences, Vince Gill.\n\nNail wrote five of the eleven I’m About To Come Alive tracks, including “Missouri.” “I was in the middle of a two-year bout with depression,” said Nail. “It’s without a doubt the most honest and personal song I’ve written. I’d been in a relationship for a year or so and could sense something was wrong with me. It was more or less me crying out, pleading for her to leave me because I didn’t have the courage to do it myself.” Along side Scooter Carusoe “Anything But Mine” Nail also wrote “Clouds,” which, he explains, is about one of his most recent misses at romance. “The best songs I’ve ever written just kind of come to me. You don’t have a choice in the matter, they just more or less pour out. Both ‘Missouri’ and ‘Clouds’ were like that.”\n\nWith all that emotion going into his songs, he admits he’s a guy who’s always looking for the happy ending. “This is a confession – I’m a man of many extremes, whether working or playing,” he says. “I’m a songwriter, so I’m a sensitive guy. I long for the storybook life.” And it’s produced a lot of good material. “I think the really great singers and writers are able to dig a little deeper and find that other level of emotion,” Nail says. “And I think that’s what makes them better than the rest. I always pride myself on trying to find that place with every song.”\n\nAnd it’s that moment of raw emotional connection that Nail hopes to pass on to listeners. “I’m more or less just trying to join the fray of good music,” he says. “People ask me all the time how I’d describe my music and I say ‘Well, I hope it’s good.’ Hopefully people will just enjoy it for being good music and take from it whatever it makes them feel.”\n\nHard knocks and heartache, good times and bad, small towns and big cities – it’s all in his music. “They’re all aspects of life,” he says. “I’m still growing as both a person and artist, and will hopefully continue getting better in regards to both.” <a href=\"https://www.last.fm/music/David+Nail\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
