{"artist":{"name":"David Robertson","mbid":"d0ad4635-ed3a-41cd-8f91-53ba0b929015","url":"https://www.last.fm/music/David+Robertson","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/0912a743e1b64543bb37822a916dfb25.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/0912a743e1b64543bb37822a916dfb25.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/0912a743e1b64543bb37822a916dfb25.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0912a743e1b64543bb37822a916dfb25.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0912a743e1b64543bb37822a916dfb25.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/0912a743e1b64543bb37822a916dfb25.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"344","playcount":"2737"},"similar":{"artist":[{"name":"Brian Barrett","url":"https://www.last.fm/music/Brian+Barrett","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/7d1550346660487fa9ce059a46c974fa.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/7d1550346660487fa9ce059a46c974fa.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/7d1550346660487fa9ce059a46c974fa.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7d1550346660487fa9ce059a46c974fa.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7d1550346660487fa9ce059a46c974fa.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/7d1550346660487fa9ce059a46c974fa.png","size":""}]},{"name":"Marcia Minton","url":"https://www.last.fm/music/Marcia+Minton","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Andy Landis","url":"https://www.last.fm/music/Andy+Landis","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/2070e477d52447bfa926d278bc44f675.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/2070e477d52447bfa926d278bc44f675.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/2070e477d52447bfa926d278bc44f675.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2070e477d52447bfa926d278bc44f675.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2070e477d52447bfa926d278bc44f675.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/2070e477d52447bfa926d278bc44f675.png","size":""}]},{"name":"Buddy Morrow et ses solistes, Ray Martin","url":"https://www.last.fm/music/Buddy+Morrow+et+ses+solistes,+Ray+Martin","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]},{"name":"Linnae Reeves","url":"https://www.last.fm/music/Linnae+Reeves","image":[{"#text":"","size":"small"},{"#text":"","size":"medium"},{"#text":"","size":"large"},{"#text":"","size":"extralarge"},{"#text":"","size":"mega"},{"#text":"","size":""}]}]},"tags":{"tag":[]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/David+Robertson/+wiki"}},"published":"09 Oct 2010, 05:26","summary":"David Eric Robertson (born 19 July 1958) is an American conductor. He is currently the music director of the Saint Louis Symphony Orchestra, and Principal Guest Conductor of the BBC Symphony Orchestra.\n\nEarly life\nRobertson was born and raised in Malibu, California, and grew up in a music-loving family. His father was a research scientist at Hughes Laboratory and his mother studied literature, but later had a career as a caterer. In grade school, he played French horn and violin, and first conducted at age 12. <a href=\"https://www.last.fm/music/David+Robertson\">Read more on Last.fm</a>","content":"David Eric Robertson (born 19 July 1958) is an American conductor. He is currently the music director of the Saint Louis Symphony Orchestra, and Principal Guest Conductor of the BBC Symphony Orchestra.\n\nEarly life\nRobertson was born and raised in Malibu, California, and grew up in a music-loving family. His father was a research scientist at Hughes Laboratory and his mother studied literature, but later had a career as a caterer. In grade school, he played French horn and violin, and first conducted at age 12. He later studied horn, composition, and conducting as a college student at the Royal Academy of Music in London.\n\nCareer\nAfter his college years, he began to receive conducting offers in Europe and performed often in both symphonic and operatic repertoire. His early career was also given a boost by speaking engagements contracted by the U.S. Information Agency in the Middle East and around the world on the subject of music.\n\nIn 1985, David Robertson was appointed resident conductor of the Jerusalem Symphony Orchestra. Five years later, in October 1990, the Ensemble Intercontemporain of Paris named him Music Director. Although his appointment was initially newsworthy because Robertson was not a protégé of Pierre Boulez, the Ensemble benefited from his decade of leadership by performing more works of 'non-Boulezian' composers, such as John Adams, and by reinvigorating the Ensemble.\n\nIn 2000, Robertson was named the Music Director of the Orchestre National de Lyon (ONL) and artistic director of Lyon's Auditorium, He was the first individual to serve simultaneously in both capacities and the first American conductor to be appointed to either position. He and the ONL toured the United States in 2003, with concerts in New York City, Seattle, Berkeley, and Los Angeles. He concluded his tenure in Lyon in 2004.\n\nSaint Louis Symphony Orchestra\nDavid Robertson's relationship with the Saint Louis Symphony Orchestra (SLSO) began in January 1999 when he made his first conducting appearance with the orchestra. Robertson's second appearance with the SLSO occurred in February 2002 at Carnegie Hall after the SLSO's then-music director Hans Vonk withdrew a few days before the concert due to health problems. Robertson agreed to substitute, and he and the orchestra had only one rehearsal before the concert, which received a favorable review from The New York Times. He later appeared with the SLSO in March 2003, and the SLSO named Robertson its next Music Director in December 2003, effective with the 2005-2006 season.\n\nIn April 2005, Robertson led the SLSO for the second time in a Carnegie Hall concert, after a labor dispute at the SLSO was resolved. Subsequent Carnegie Hall concerts with Robertson conducting the SLSO since the start of his SLSO tenure have been in November 2005, March and April 2006, and March 2007. Robertson was one of Carnegie Hall's Perspectives artists for the 2005-2006 season, and he curated concerts with the SLSO and other performances with various guest artists and ensembles.\n\nRobertson is generally regarded as having restored the SLSO's artistic prominence after the sudden resignation of the prior music director, Hans Vonk, and the labor dispute at the orchestra in the winter of 2005. New concert series begun during his tenure are a group of contemporary music concerts with The Pulitzer Foundation for the Arts and a series of \"Fusion Concerts\" at the Touhill Performing Arts Center of the University of Missouri–St. Louis. In September 2006, the SLSO announced that Robertson extended his SLSO contract through 2010, with an evergreen clause to allow for yearly renewal. As of November 2009, his SLSO contract is through the 2011-2012 season.\n\nFrom the start of his tenure in St. Louis, speculation had been intense that both the Chicago Symphony Orchestra (CSO) and the New York Philharmonic (NYP) were both trying to sign Robertson, respectively, as the next music director of each orchestra. The 2006 SLSO action momentarily ended the discussion relating to the Chicago position, at least through 2010, although there was renewed Chicago press speculation in 2007 that the CSO restored Robertson to its list of candidates as their next music director. This speculation ended with the naming of Riccardo Muti as the CSO's next music director in April 2008. In 2007, there continued to be press comments that the New York Philharmonic was still considering signing Robertson as its next music director, which effectively ended with the July 2007 naming of Alan Gilbert as the NYP's next music director.\n\nOther conducting work\nIn February 2005, Robertson was named the Principal Guest Conductor of the BBC Symphony Orchestra (BBC SO) and assumed that post later in the year, in parallel with the beginning of his St. Louis tenure. His Principal Guest Conductorship with the BBC Symphony Orchestra has since been extended through 2011. On 12 September 2009, Robertson became the second American conductor and the first standing BBC SO principal guest conductor to conduct the Last Night of the Proms.\n\nIn addition to the New York Philharmonic, Robertson continues to be a regular guest conductor with other major American orchestras, including the Boston Symphony Orchestra, the New York Philharmonic, the Los Angeles Philharmonic, the Chicago Symphony Orchestra, and the San Francisco Symphony. In particular, Anthony Tommasini of the New York Times lauded Robertson's concerts with the New York Philharmonic. He served as Festival Director for the Los Angeles Philharmonic's January 2008 Concrete Frequency Festival, as well as Music Director of the 2008 Ojai Music Festival in Ojai, California.\n\nAs well as his work in contemporary and symphonic music, Robertson is also much admired and sought-after as a conductor of opera, opening the Rossini Festival in the composer's hometown of Pesaro, Italy in the summer of 1994. In 1996, he conducted a production of Janáček's Věc Makropulos at the Metropolitan Opera (Met) which featured Jessye Norman. Robertson made his next conducting appearance at the Met in April-May 2008 with performances of Mozart's Die Entführung aus dem Serail.\n\nRobertson has recorded for the Sony Classical, harmonia mundi, Naive, EMI/Virgin Classics, Atlantic/Erato, Nuema, Ades Valois, Naxos and Nonesuch labels, featuring the music of such composers as Adams, Bartók, Boulez, Carter, Dusapin, Dvorák, Ginastera, Lalo, Manoury, Milhaud, Reich, Saint-Saëns, and Silvestrov.\n\nPersonal life\nRobertson has a loft in downtown St. Louis, and also residences in New York City, London and Paris. As of 2005, he is married to his third wife, pianist Orli Shaham, and is thus brother-in-law of violinist Gil Shaham, with whom he has often appeared - including a performance at The Proms in August 2010. Robertson and Shaham first met at a January 1999 SLSO concert, where she was the guest pianist, and which also was her own SLSO debut. They married on 3 January 2003. She is mother to their two youngest sons, twin boys Nathan Glenn and Alex Jacob, born 15 September 2007. Robertson has two sons from his second marriage, Peter and Jonathan. The family make their home in New York City.\n\nHonours and awards\nRobertson received the Seaver/National Endowment for the Arts Conductors Award in 1997. In December 1999, Musical America named David Robertson Conductor of the Year. Robertson received the 2006 Ditson Conductor's Award from Columbia University for his championing of American music. In April 2010, Robertson was elected a Fellow of the American Academy of Arts and Sciences. On May 15, 2010, Robertson received the degree Doctor of Music honoris causa from Westminster Choir College in Princeton, New Jersey. <a href=\"https://www.last.fm/music/David+Robertson\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
