{"artist":{"name":"Dead Hearts","mbid":"a8d537ac-250c-4c86-894c-f673b5a12b74","url":"https://www.last.fm/music/Dead+Hearts","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/a774dc3b0aa64033b6098f5871211f38.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/a774dc3b0aa64033b6098f5871211f38.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/a774dc3b0aa64033b6098f5871211f38.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a774dc3b0aa64033b6098f5871211f38.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a774dc3b0aa64033b6098f5871211f38.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/a774dc3b0aa64033b6098f5871211f38.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"23712","playcount":"778390"},"similar":{"artist":[{"name":"Final Fight","url":"https://www.last.fm/music/Final+Fight","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/502e595baf1848b29ab6edc40e133353.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/502e595baf1848b29ab6edc40e133353.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/502e595baf1848b29ab6edc40e133353.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/502e595baf1848b29ab6edc40e133353.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/502e595baf1848b29ab6edc40e133353.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/502e595baf1848b29ab6edc40e133353.png","size":""}]},{"name":"At Half-Mast","url":"https://www.last.fm/music/At+Half-Mast","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/6c1678c1de6a492abf9f44bff5f2d4af.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/6c1678c1de6a492abf9f44bff5f2d4af.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/6c1678c1de6a492abf9f44bff5f2d4af.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c1678c1de6a492abf9f44bff5f2d4af.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c1678c1de6a492abf9f44bff5f2d4af.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/6c1678c1de6a492abf9f44bff5f2d4af.png","size":""}]},{"name":"Set it Straight","url":"https://www.last.fm/music/Set+it+Straight","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/94493c9cdb774bc5b1798f17132e4b64.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/94493c9cdb774bc5b1798f17132e4b64.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/94493c9cdb774bc5b1798f17132e4b64.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94493c9cdb774bc5b1798f17132e4b64.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94493c9cdb774bc5b1798f17132e4b64.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/94493c9cdb774bc5b1798f17132e4b64.png","size":""}]},{"name":"Gold Kids","url":"https://www.last.fm/music/Gold+Kids","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/add7ea97a76f45eea7d554946452b062.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/add7ea97a76f45eea7d554946452b062.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/add7ea97a76f45eea7d554946452b062.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/add7ea97a76f45eea7d554946452b062.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/add7ea97a76f45eea7d554946452b062.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/add7ea97a76f45eea7d554946452b062.png","size":""}]},{"name":"Ambitions","url":"https://www.last.fm/music/Ambitions","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/65e5f11fb75140ce8794fc8a65c74670.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/65e5f11fb75140ce8794fc8a65c74670.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/65e5f11fb75140ce8794fc8a65c74670.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/65e5f11fb75140ce8794fc8a65c74670.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/65e5f11fb75140ce8794fc8a65c74670.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/65e5f11fb75140ce8794fc8a65c74670.png","size":""}]}]},"tags":{"tag":[{"name":"hardcore","url":"https://www.last.fm/tag/hardcore"},{"name":"melodic hardcore","url":"https://www.last.fm/tag/melodic+hardcore"},{"name":"hardcore punk","url":"https://www.last.fm/tag/hardcore+punk"},{"name":"punk","url":"https://www.last.fm/tag/punk"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Dead+Hearts/+wiki"}},"published":"28 Aug 2006, 18:45","summary":"REUNION SHOW INFO:\nOn Saturday, December 29th, 2012 - Dead Hearts will be playing a reunion show at The Game Room in Buffalo, NY. This is a benefit show for the Alix Rice Peace Park Foundation, a skate park being erected in Alix Rice’s name. Alexandria \"Alix\" Rice was struck and killed by a drunk driver while skateboarding home in July of 2011. Rounding out the bill will be fellow Buffalo Hardcore acts Better Times, wreckage and Area Denial. Tickets <a href=\"https://www.last.fm/music/Dead+Hearts\">Read more on Last.fm</a>","content":"REUNION SHOW INFO:\nOn Saturday, December 29th, 2012 - Dead Hearts will be playing a reunion show at The Game Room in Buffalo, NY. This is a benefit show for the Alix Rice Peace Park Foundation, a skate park being erected in Alix Rice’s name. Alexandria \"Alix\" Rice was struck and killed by a drunk driver while skateboarding home in July of 2011. Rounding out the bill will be fellow Buffalo Hardcore acts Better Times, wreckage and Area Denial. Tickets for the event will go on sale on Friday Nov 2nd at 12PM Eastern time and can be purchased at http://www.alixrice.com/ To learn more about Alix’s story please visit http://www.alixrice.com/ The most up to date information for the show and the benefit will be posted on the Dead Hearts facebook page or follow @RockinForRice on Twitter.\n\n\n\nFerret Music's newest signing Dead Hearts may be the closest in sound to the beginning roots of punk/hardcore on the label. \n\"More with Dead Hearts than any other project we've been in, we have got to live out our high school hardcore fantasy,\" says Jeremy Smith (guitar). \"We've played shows with 7 Seconds, Agnostic Front and Slapshot which were some of my favorite hardcore groups when I started playing in bands.\" \nBefore you label Dead Hearts an old school revival project you should know that the group is a modern hardcore band. A band that is raw, discordant and punk at heart but not afraid to reference metal and rock in their sound. \"Our vocalist is screaming his head off but you can understand every word he says and sing along,\" Jeremy explains. \"Kids can pick up a lyric sheet and identify immediately with what he is talking about. That's something that is not to plentiful in the scene today.\" \nThe band composed of Jeremy, Derek Dole (vocals), Tom Mayer (bass), Pauly Issue (guitar) and Josh Heatley (drums) hail from the frozen climes of Buffalo, NY. The members were gathered from such acts in the local punk and hardcore scene as The Control, Can I Say and The Pavers. Discussing the formation of the group Jeremy explains, \"I had a hard time writing in my old band because everyone wanted to get their own mark on the music. I gathered all the open minded and flexible players in these bands so we could have fun in a project rather than it seeming like work.\"\n\nAfter playing two shows a month after their start in 2004, Dead Hearts were approached by labels wanting to put the record out and people wanting to book them. \n\"As soon as we put up a MySpace page, this label from Long Island State Of Mind Music wanted to put out our demo. It was unbelievable!\"\nAfter no less than three labels asked to put out the band's first release, the band seceded to whoever could get the album done by Dec so they could tour off of it. That first tour was with Marathon and Another Breath through the east coast. The response for the band's music was shocking as they quickly sold through 40 copies of their EP at one Florida show. For a group that started for fun, Dead Hearts was attracting more work than any of the members previous projects. As of this writing, Dead Hearts have completed four national tours including a six and a half week run by themselves that was self-booked. August 2005 saw the release of a one sided 12 entitled No Love, No Hope on the Netherlands based Reflections label. This release attracted the attention of hometown hero and old friend, Andy of Every Time I Die. After witnessing the band perform he told them to send music to Ferret to check out. Ferret responded by saying that they loved the music but that they couldn't sign anyone at that time as they just signed a bunch of bands. Jeremy recollects, However Rick (Barnhart) of the label kept writing us every few weeks to see what we were doing and if we were still a band.\n\nA few months later when Dead Hearts played CBGB's with Bane and Comeback Kid to 750 kids, the label was on hand to witness the band blow the place away. Dead Hearts was signed to the label shortly after. The band recently locked themselves in a recording studio with John Naclerio (Senses Fail, My Chemical Romance) to record their upcoming Ferret debut Bitter Verses. The fourteen song calling card is a concept piece based around the theme of insomnia and what sleepless nights can bring. With lyrics handled by Jeremy he says of the theme, \"I've worked overnights most of my life since it's a flexible job that allows you to take off for tours. However staying up all night can suck the life out of you and the album deals with how sleepless nights can lead to fucking up your life and fucking up your life can lead to sleepless nights. It's a vicious cycle that it's hard to break from.\"\n\nIn July 2008 the band issued the following statement:\n\"With a heavy heart I have to announce that Dead Hearts is breaking up. Our singer Derek informed us today that he was no longer able to continue doing the band due to commitments back home. We respect that decision and think it would be pointless to carry on without him. Our August/ September tour is cancelled but we will be finishing out the rest of our current tour (Johnson City, TN, Huntington, WV, E Stroudsburg, PA and Dunkirk, NY) and playing one last show in our home town of Buffalo, NY on Friday September 12 @ Mohawk Place with our friends in Energy, Get Back Up and Face The Panic.\"\n- Jeremy/ Dead Hearts\n\nMay 2010: \n\"In September of 2008, Dead Hearts played our last show. At that show we released a portion of our last recording session as the \"A Death In The Family\" ep. This 3 song Ep was pressed only once, limited to 100 copies and sold out at that show. Earlier this year, we began working on a reissue of the ep, to be released later this year. With a one time pressing of 500, the 4 song 7\" will contain one song not on the original release, with the cd version containing the \"No Love, No Hope\" and \"All Good Things Must End- Live At CBGB's\" eps as bonus tracks, remastered. The art is being handled by Matt Warfield, who most recently did the art for \"The God Complex\" by Another Breath and what he has submitted thus far has been incredible.\n\nANYWAY, I made a Facebook pages with songs from all of our releases and will be updating it with news pertaining to the reissue and other stuff:\nhttp://www.facebook.com/pages/Dead-Hearts/122484841111759 \" <a href=\"https://www.last.fm/music/Dead+Hearts\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
