{"artist":{"name":"Death Cab for Cutie","mbid":"0039c7ae-e1a7-4a7d-9b49-0cbc716821a6","url":"https://www.last.fm/music/Death+Cab+for+Cutie","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c74bca9c50cf4b1e8c64aca6d45529a7.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c74bca9c50cf4b1e8c64aca6d45529a7.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c74bca9c50cf4b1e8c64aca6d45529a7.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c74bca9c50cf4b1e8c64aca6d45529a7.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c74bca9c50cf4b1e8c64aca6d45529a7.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c74bca9c50cf4b1e8c64aca6d45529a7.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"2768717","playcount":"163199087"},"similar":{"artist":[{"name":"Ben Gibbard","url":"https://www.last.fm/music/Ben+Gibbard","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/5a7d0d5d1ab64627a7b0592a08826900.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/5a7d0d5d1ab64627a7b0592a08826900.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/5a7d0d5d1ab64627a7b0592a08826900.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a7d0d5d1ab64627a7b0592a08826900.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a7d0d5d1ab64627a7b0592a08826900.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/5a7d0d5d1ab64627a7b0592a08826900.png","size":""}]},{"name":"The Postal Service","url":"https://www.last.fm/music/The+Postal+Service","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/04c140c3d9844b4dcb9c9a93e0f23448.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/04c140c3d9844b4dcb9c9a93e0f23448.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/04c140c3d9844b4dcb9c9a93e0f23448.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/04c140c3d9844b4dcb9c9a93e0f23448.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/04c140c3d9844b4dcb9c9a93e0f23448.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/04c140c3d9844b4dcb9c9a93e0f23448.png","size":""}]},{"name":"The Decemberists","url":"https://www.last.fm/music/The+Decemberists","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/824e8fe5aa46453499a8486d592b7a18.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/824e8fe5aa46453499a8486d592b7a18.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/824e8fe5aa46453499a8486d592b7a18.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/824e8fe5aa46453499a8486d592b7a18.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/824e8fe5aa46453499a8486d592b7a18.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/824e8fe5aa46453499a8486d592b7a18.png","size":""}]},{"name":"The Shins","url":"https://www.last.fm/music/The+Shins","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/c7866680f9dc4b59820babee13db2559.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/c7866680f9dc4b59820babee13db2559.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/c7866680f9dc4b59820babee13db2559.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c7866680f9dc4b59820babee13db2559.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c7866680f9dc4b59820babee13db2559.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/c7866680f9dc4b59820babee13db2559.png","size":""}]},{"name":"Stars","url":"https://www.last.fm/music/Stars","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/904b7bac277245e9a4f104ad517f387b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/904b7bac277245e9a4f104ad517f387b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/904b7bac277245e9a4f104ad517f387b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/904b7bac277245e9a4f104ad517f387b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/904b7bac277245e9a4f104ad517f387b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/904b7bac277245e9a4f104ad517f387b.png","size":""}]}]},"tags":{"tag":[{"name":"indie","url":"https://www.last.fm/tag/indie"},{"name":"indie rock","url":"https://www.last.fm/tag/indie+rock"},{"name":"alternative","url":"https://www.last.fm/tag/alternative"},{"name":"seen live","url":"https://www.last.fm/tag/seen+live"},{"name":"rock","url":"https://www.last.fm/tag/rock"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Death+Cab+for+Cutie/+wiki"}},"published":"02 Feb 2006, 22:54","summary":"Death Cab for Cutie is an American indie rock band formed in Bellingham, Washington in 1997. The band consists of Ben Gibbard (vocals, guitar, piano), Nicholas Harmer (bass), Jason McGerr (drums), Dave Depper (guitar) and Zac Rae (keyboards).\n\nDeath Cab began as a solo project of Ben Gibbard, now the band's vocalist and guitarist. Gibbard took the band name from the satirical song Death Cab for Cutie, performed by The Bonzo Dog Band in The Beatles' 1967 experimental film Magical Mystery Tour. <a href=\"https://www.last.fm/music/Death+Cab+for+Cutie\">Read more on Last.fm</a>","content":"Death Cab for Cutie is an American indie rock band formed in Bellingham, Washington in 1997. The band consists of Ben Gibbard (vocals, guitar, piano), Nicholas Harmer (bass), Jason McGerr (drums), Dave Depper (guitar) and Zac Rae (keyboards).\n\nDeath Cab began as a solo project of Ben Gibbard, now the band's vocalist and guitarist. Gibbard took the band name from the satirical song Death Cab for Cutie, performed by The Bonzo Dog Band in The Beatles' 1967 experimental film Magical Mystery Tour. As Death Cab for Cutie, Gibbard released a cassette titled You Can Play These Songs with Chords; the release was surprisingly successful, and Gibbard decided to expand the band into a complete project. He recruited Chris Walla (who had also worked on the cassette) as an electric guitarist, Nick Harmer as bass guitarist, and Nathan Good to play drums. \n\nThe four released the LP Something About Airplanes on August 18th 1998. The album was favorably reviewed in the independent music scene, and in 2000 the band released We Have the Facts and We're Voting Yes. Nathan Good left the band at some point during this album's production. His playing on “The Employment Pages” and “Company Calls Epilogue” were kept, but Gibbard played drums on all other songs.\n\nMichael Schorr would first appear on The Forbidden Love E.P., released on October 24, 2000. In 2001, another LP was released, entitled The Photo Album. Limited editions of this album contained three bonus tracks, which were later released separately as The Stability EP.\n\nIn 2003, there was another change of drummer, with Jason McGerr of Eureka Farm replacing Schorr. McGerr would play drums on the next release, Transatlanticism.\n\nTransatlanticism was released in October of 2003. It received critical praise and also became the band's top-selling album, with 225,000 copies sold during its first year out.\n\nIn spring of 2004, the band recorded a live E.P. titled The John Byrd E.P., named for their sound engineer. The E.P. was released on Barsuk Records in March 2004.\n\nIn November of 2004, Death Cab for Cutie signed a “long-term worldwide deal” with Atlantic Records, leaving their long-time label Barsuk Records. Gibbard stated on the official website www.deathcabforcutie.com that nothing would change except that “Next to the picture of Barsuk holding a 7\", there will be the letter \"A\" on both the spine and back of our upcoming albums.” This was a marked change from Gibbard's earlier views on major-label relations, which he said “are set up to fuck you and take all your money.”. After signing to Atlantic, the band was still nervous about corporate economics, and encouraged fans to download its songs from the Internet.\n\nThe first and second singles off the band's Atlantic Record release Plans were “Soul Meets Body” and “Crooked Teeth”, respectively. The full album was released in August of 2005. Plans was somewhat well-acclaimed by critics and fans, and received a nomination for the Grammy Award for Best Alternative Album of 2005. It achieved Gold Status in 2006 after charting on Billboard for 47 consecutive weeks.\n\nThe band released a touring DVD titled Drive Well, Sleep Carefully in 2005. Known for their contributions to animal rights, the band is supporting the activist group PETA in giving away copies of the DVD to promote animal rights.\n\nIn early 2006, the band announced the upcoming release of Directions, eleven short films inspired by songs from the Plans album, each directed by a different person. The videos were posted one at a time at the band's website and the DVD went on sale April 11, 2006.\n\nOn May 12, 2008 their album, Narrow Stairs, was released  and was well received by both critics and fans. It was their first album to reach #1 on the Billboard 200. The album contains the singles \"I Will Possess Your Heart\", \"Cath...\" and \"Grapevine Fires\".\n\nThe band's latest released The Open Door EP, which was released on March 31, 2009. Their main styles consist of slow progressive rock with dark lyrics.\n\nThe band's seventh album, Codes and Keys, was released on May 31, 2011. The album's first single was \"You Are A Tourist\".\n\nOn October 11, 2013, the band reportedly began working on their eighth studio album. This was then confirmed by the group's official Instagram profile in which an image was uploaded with the caption \"DCFC LP8 begins\". The new album will be produced by Rich Costey and is expected to be released in early 2015. In an interview with Stereogum, Gibbard said of the new album, \"I do think from start to finish it's a much better record than Codes And Keys. If that record turned anybody off, I feel pretty strongly that this one could win them back. There are threads in this one that connect back to our earliest stuff that people love.\" On October 29, 2013, the band released a remastered tenth-anniversary version of their 2003 album Transatlanticism. The new album included a vinyl LP and MP3 download, with demos for all the songs from the album.\n\nAs part of the 2014 Record Store Day, the band released its first live album, a vinyl-only double LP recorded during various 2012 tour dates with Magik*Magik Orchestra. Included within the packaging was a code for a digital download of the recording.\n\nOn August 13, 2014, after 17 years as a member of Death Cab for Cutie, guitarist and songwriter Chris Walla decided to part ways with the band, with his last performance occurring on September 13, 2014 at the Rifflandia Music Festival in Victoria, British Columbia. Walla states that he plans to \"...continue making music, producing records, and erring on the side of benevolence and beauty whenever possible.\" When asked in an interview about Walla's involvement in the eighth album, McGerr confirmed that Walla \"played on everything and has been involved all the way through, even in the mixing. Even though he's played his last show with us, he's still been involved in everything involving this record.\" <a href=\"https://www.last.fm/music/Death+Cab+for+Cutie\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
