{"artist":{"name":"Deckard","mbid":"4f4bfd84-8c67-4a27-a14c-bcec35c102fe","url":"https://www.last.fm/music/Deckard","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/b05b61b21450432c960c8993122d992d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/b05b61b21450432c960c8993122d992d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/b05b61b21450432c960c8993122d992d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b05b61b21450432c960c8993122d992d.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b05b61b21450432c960c8993122d992d.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/b05b61b21450432c960c8993122d992d.png","size":""}],"streamable":"0","ontour":"0","stats":{"listeners":"6916","playcount":"53992"},"similar":{"artist":[{"name":"J. Baracuz","url":"https://www.last.fm/music/J.+Baracuz","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/d0095619de814938b6d45d0f1fc45e6a.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/d0095619de814938b6d45d0f1fc45e6a.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/d0095619de814938b6d45d0f1fc45e6a.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d0095619de814938b6d45d0f1fc45e6a.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d0095619de814938b6d45d0f1fc45e6a.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/d0095619de814938b6d45d0f1fc45e6a.png","size":""}]},{"name":"Vangel","url":"https://www.last.fm/music/Vangel","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/57f66521766043c897e00b544a08f61b.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/57f66521766043c897e00b544a08f61b.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/57f66521766043c897e00b544a08f61b.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/57f66521766043c897e00b544a08f61b.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/57f66521766043c897e00b544a08f61b.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/57f66521766043c897e00b544a08f61b.png","size":""}]},{"name":"DJ Scientist","url":"https://www.last.fm/music/DJ+Scientist","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/e80dad238e234b92956303a49f5bbdbf.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/e80dad238e234b92956303a49f5bbdbf.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/e80dad238e234b92956303a49f5bbdbf.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e80dad238e234b92956303a49f5bbdbf.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e80dad238e234b92956303a49f5bbdbf.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/e80dad238e234b92956303a49f5bbdbf.png","size":""}]},{"name":"Arcsin","url":"https://www.last.fm/music/Arcsin","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/ae900660ee1843b6881941e4fe8c75f1.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/ae900660ee1843b6881941e4fe8c75f1.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/ae900660ee1843b6881941e4fe8c75f1.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ae900660ee1843b6881941e4fe8c75f1.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ae900660ee1843b6881941e4fe8c75f1.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/ae900660ee1843b6881941e4fe8c75f1.png","size":""}]},{"name":"DJ Sept","url":"https://www.last.fm/music/DJ+Sept","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/9e3bbce84e6f46159e6597b223d8f4c5.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/9e3bbce84e6f46159e6597b223d8f4c5.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/9e3bbce84e6f46159e6597b223d8f4c5.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9e3bbce84e6f46159e6597b223d8f4c5.png","size":"extralarge"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9e3bbce84e6f46159e6597b223d8f4c5.png","size":"mega"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/9e3bbce84e6f46159e6597b223d8f4c5.png","size":""}]}]},"tags":{"tag":[{"name":"electronic","url":"https://www.last.fm/tag/electronic"},{"name":"abstract hip-hop","url":"https://www.last.fm/tag/abstract+hip-hop"},{"name":"trip-hop","url":"https://www.last.fm/tag/trip-hop"},{"name":"instrumental hip-hop","url":"https://www.last.fm/tag/instrumental+hip-hop"},{"name":"electronica","url":"https://www.last.fm/tag/electronica"}]},"bio":{"links":{"link":{"#text":"","rel":"original","href":"https://last.fm/music/Deckard/+wiki"}},"published":"18 Aug 2006, 07:52","summary":"There are multiple artists with the name “Deckard” on Last.fm:\n\n1. Alias of Attila Makai, a German producer based in Munich\n2. Scottish/English band from Glasgow, formerly known as Baby Chaos\n3. Alias of Michael Wierzchowski, a producer from Poland\n\n1) If you were looking for exceptional producers in the Munich area in the late 90s / early 2000s you may have heard of Deckard – the artist pseudonym of Attila Makai, which is inspired by Rick Deckard out of the movie “Blade Runner”. <a href=\"https://www.last.fm/music/Deckard\">Read more on Last.fm</a>","content":"There are multiple artists with the name “Deckard” on Last.fm:\n\n1. Alias of Attila Makai, a German producer based in Munich\n2. Scottish/English band from Glasgow, formerly known as Baby Chaos\n3. Alias of Michael Wierzchowski, a producer from Poland\n\n1) If you were looking for exceptional producers in the Munich area in the late 90s / early 2000s you may have heard of Deckard – the artist pseudonym of Attila Makai, which is inspired by Rick Deckard out of the movie “Blade Runner”.  In the “early days” of the internet there also existed his own platform under the name “Foundation Crew”, a melting pot for a diverse bunch of like minded producers and sound enthusiasts.  However, Deckard is one of the few of them that continued their artist careers successfully.\n\nIt must have been around 2003 when the first demo CDs by Deckard were spreading locally.  Even his early works may have been good enough to have been released officially on a label.  However, Makai let his music ripe step by step.  First extracts from his large assortment of tracks found the way to his first vinyl release, a limited stamped white label 12” entitled “Das Abstrakt EP”.  This release opened doors for Deckard: not only DeBug Magazine praised the release and gave it the highest rating, it even stated that it is “one of the very rare EPs that can rival early releases by (DJ) Vadim”.  Although this statement may not really be fitting regarding the musical style, it still emphasizes the fact that Deckard can easily be named in line with any top producer out of the left field electronica genre.\n\nThe „Das Abstrakt EP“ also lead to the fact that Equinox founder Günter Stöppel released the „Noir Desire“ EP the following year, as part of the Equinox 10inch Series. It was the successful beginning of his collaboration with the German label, that is now residing in Berlin.  Furthermore, two additional tracks were released in 2005 on the Swiss label Ish Records and their Instrumental Hip-Hop / Electronica / Beat compilation “The Now Factor”.\n\nAfterwards, it temporarily got more quiet around Deckard – his newly started studies as a sound engineer gave him less time to work on music.  However, during that period he was able to redefine his style - in more ways than one.  Between 2006 and 2008 a couple of new tracks and remixes were released that left marks.  For example, he released the breakbeat tune “Dignity Of Men” on the “One Year & A Day” series that later even made it to a DJ Food mix.  Furthermore, on this 12” single and the album, he shared space with producers like Free The Robots, 2econd Class Citizen, Brenmar or Deadpan Darling.  For the last-mentioned artist project, that exists of Blue Sky Black Death and singer Ceschi, he was additionally invited to remix the song “Laughtrack”.  On this track, as well as for rappers like Audio88 or Bushwac, he proved his ability to work with vocals and also to remix songs.\n\nOn his “come back” release in 2009, the “Future World” EP, we could finally hear the Deckard, that we can now experience on his LP debut: complex sound layers and spheres, shifting between the rhythms of hauling impulsive machinery and spacy melodies… Yes, this EP was a fascinating outlook on “For A Better Tomorrow”.  An album that has become a strong and interweaved work that will keep listeners excited from beginning to end.  A thrilling and drifting sound experience from start to finish.\n\n2) Deckard were formed when the three remaining members of Baby Chaos - Chris Gordon, Grant McFarlane and Bobby Dunn - were joined by Gen Mathews (Jesus Jones).  The four piece recorded some brilliant demos and were quickly signed by Reprise Records in the USA.\n\nThe band spent six months recording and mixing their debut album, Stereodreamscene, in Los Angeles with producer Nick Launay (Girls Against Boys, Silverchair, Semisonic, American Hi-Fi, Nick Cave).  Then president of Reprise, Howie Klein, was crazy about the band and the album and promised it would be a priority release.\n\nSadly, the timing was poor and the frustrated band negotiated their release from the Reprise contract.\n\nAlthough after the Reprise deal ended, Chris drifted into a deal with Dreamworks Records as part of an obscure dark pop experiment, he vowed to continue to make music with his friends. Deckard continued to write a record and after sometime had completed more than enough tracks for a new album. On this occasion it was self recorded and self produced, with Chris using his recording experience to produce a fantastic sounding collection of songs.\n\nThe best of these songs were chosen for the album Dreams of Dynamite and Divinity, which was self released in early 2004 to wide critical acclaim.\n\nOriginal drummer Davy Greenwood had left after concerns over his health had forced him to reassess his lifestyle. During a seven week coast to coast tour supporting Elastica, Davy was flown home after collapsing on stage at the end of a gig in Philadelphia.\n\nAfter Davy’s departure at the end of the first week of the tour, a call was made back to the UK where the brother of the band's guitar tech, Gen Matthews , was drafted in to help them complete the tour. The band finally got together with Gen and only had time for one rehearsal before opening for Elastica at the Metro in Chicago.\n\nAfter Davy’s departure, the band were delighted that Gen Matthews agreed to become a permanent member of the band. Davy Greenwood is A1 okay and remains a valued friend.\n\nLove Your Self Abuse, the second album from Baby Chaos, was about to be released in the UK , however their A&R man picked this time to leave the company. This ultimately resulted in them attempting to drop the band. However, a few months earlier, an A&R person at Atlantic Records in New York had ordered a CD by The Fall. She listened to it and realised straight away that the music wasn’t The Fall, although the CD said it was. She loved the music, but had no idea who it was. When she was sent Love Your Self Abuse she finally discovered that the band was Baby Chaos.\n\nShe immediately contacted her bosses and arranged for the band's deal to be transferred to Atlantic. Love Your Self Abuse was re-packaged and released across the USA . Once again however, the people responsible for signing the band left the label before the album was released. So despite excellent reviews and feedback they found themselves without a strong ally at the label and the deal ended.\n\nThe band continued to tour in the UK and had several very successful tours in France before working on the demos which would led to them being signed by Reprise Records.\n\nIn addition to production work for Deckard, Chris Gordon has also completed albums for Terra Diablo, Endrick Brothers, Dead Fly Buchowski and Eva.\n\n\nOfficial site: www.deckard-online.com\n\n\n3) Deckard. Born 1979, in Warsaw, lives in Gdynia. He started producing music with Atari and Amiga modules in 1993. He made his first performance in 1996 (with CUKT). In the late 90s he was a co-founder of Au-Gen (with Qads). Growing up on Berlin's electronic music, he was gently turning on modern sounds. Nowadays, he puts his interest on general electronic. His live performances are some kind of dub-minimal and deep-tech-house mix. He also organizes Sfinks' \"Electronica Intelligente\" and \"S!te Records Nights\" in Sopot. He takes part of Neotronika collective and his own net label S!te Records. Apart from that all, he is engaged in making music for exhibitions and performances (galeria 78, City Theatre of Gdynia, Kolonia Artystów, Sfinks). In December 2003 hes made a CD with Qads - \"Delight Chill Session\". <a href=\"https://www.last.fm/music/Deckard\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}
